[
  {
    "number": 51,
    "title": "Chapter 51",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 51</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">\"These troublemakers don't know what kind of fuss they're making. Fortunately, the mansion's guards are strict; otherwise, if they had succeeded, it wouldn't have been a laughing matter,\" Fugui complained.</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Beauty can be an advantage, as it often draws more attention than others. But when beauty becomes too well-known, it can lead to problems.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huiyin, however, said, \"That's why I don't need to go out. I didn't feel like it anyway. These people are just excited for the moment. When something new happens, this will all fade away.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Fugui gave Huiyin a disapproving look. \"But what if some lechers break in—\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"They won't, and even if they do, I'm not afraid. With so many people guarding me, if someone still gets through, it means the guards aren't doing their job right. It would actually help me figure out who is serious about their duties and who is just slacking off.\" She believed Li Cheng would return, and with him here, no one would dare to cause trouble.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Without realizing it, she realized how much she trusted her husband. After all, he was exceptionally brave and meticulous. Now, she increasingly understood what her mother used to say. In a chaotic world, finding someone who can protect you is more valuable than anything else.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">As they were talking, the baby kicked inside her, and Huiyin couldn't help but laugh. \"This little one must be a mischief-maker too, or else why would he keep kicking me?\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">The maids nearby giggled softly.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">The wet nurse brought Jing'er in from outside, but since Huiyin was heavily pregnant, it was difficult for her to hold the child. She let him sit on the bed, but Jing'er, being mischievous, kicked off his shoes and started getting into mischief on the bed.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"He's almost two years old; he can't keep playing like this. Teach him to speak more often, and pay attention to his daily routine and diet,\" Huiyin said, stroking her son's head. His head was perfectly shaped, smooth and round, without any bumps. And his cute little belly—she found her son adorable in every way.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Jing'er could already speak. He rolled over on the bed, then stood up, holding onto Huiyin's shoulder. \"Mother, I want to eat mouse cake.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"What is mouse cake?\" Huiyin thought there was no such thing. Then, with a clever guess, she smiled. \"Are you talking about Su-style pastries?\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Jing'er looked at the wet nurse, and the wet nurse quickly said, \"A few days ago, some flower cakes were sent here, but we didn't dare give the heir too many. We said we'd put the Su-style cake away first, but perhaps he overheard?\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Huiyin instructed someone to go to the kitchen to make two fresh pastries. The happiest thing for a child might be eating delicious food. A little chestnut cake and taro cake were enough to make him joyful. Soon, his head was nodding like a sleepy chick, so she had the wet nurses take him back.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Before she knew it, she also felt sleepy. Once she lay down, she fell into a deep sleep. When she woke up, it was so dark she couldn't see her hand in front of her. Reaching out, she felt someone lying next to her and immediately sat up, filled with fear and countless thoughts.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">\"It's me. Don't be afraid.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">A clear male voice came, and Huiyin finally breathed a sigh of relief. \"You scared me to death. You didn't even tell me you were back.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Li Cheng's voice sounded a bit muffled. \"I rushed back because it was getting late. I haven't gone to see Uncle Wei Wang yet; I came straight back here first.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Huiyin yawned and looked a bit worried. \"What's wrong? You're not allowed to come back without an imperial decree. Aren't you afraid that the Prince of Wei will scold you?\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"Huiyin...\" He didn't say why, nor did he answer her question, just calling her name.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"What is it?\" Huiyin gently stroked his cheek, feeling the roughness—he must not have shaved yet.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">In truth, she knew exactly why her husband had come back, and it was also the effect she had intended. Why should only men be fought over, leaving women to worry? From now on, you'll have to worry about me. Furthermore, she used this situation to give herself a legitimate reason to go to Xuzhou.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Li Cheng sat up. \"I had a nightmare last night and have been feeling uneasy ever since.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"It's okay. With me here, even if the whole world betrays you, I won't.\" Huiyin leaned on him.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Li Cheng felt her words like a warm current flowing into his heart, but he couldn't help but ask, \"Why are you so good to me?\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Huiyin smiled. \"Aren't you worth it?\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"Then will you come with me this time?\" Li Cheng wished he could keep his wife by his side.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Huiyin smiled serenely. \"Yes.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">The couple shared a warm and intimate conversation, and later got up to share a meal. However, Li Cheng still felt furious when he remembered seeing that lecherous man outside upon his return.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Meanwhile, another couple had just finished their own intimate moment. Zheng Fang and Madame Ji, though they had been together for many years, were no longer young. Although fine lines could be seen at the corners of Madame Ji's eyes, her figure remained slim and her face fair. At that moment, she was asking, \"In my opinion, the Crown Prince harbors deep hatred for Lu Wei. He has exterminated Lu Wei's entire family, leaving no survivors.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"That's right. If you don't cut the grass at its roots, it will grow back with the spring wind. The Crown Prince's actions are justified. He has inherited part of the He family's army and now commands it to defend the capital, treating me with considerable respect. However, when I mentioned my desire to become Chancellor, the Crown Prince said it wasn't that he didn't want to help, but that Wei Duo wouldn't allow it,\" Zheng Fang said hesitantly.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">While he now controlled a vast territory, managing it was far from easy. There had just been a mutiny in the Northwest Army, and after dealing with that, there were issues in the Jizhou army that needed his attention. His vigor had waned with age, and he was no longer the man he once was. Fortunately, there was Zheng Wuheng, but the young man was still too inexperienced. His subordinates took advantage of him, and he would need to prove himself in several battles to establish his position.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">When it came to Wei Duo, Zheng Fang actually felt uneasy.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Madame Ji also frowned at the mention of Wei Duo. \"If it's him, it's not surprising. He has long coveted Lu Wei's power. Now that you have eliminated Lu Wei, the He family's subordinates don't follow your command. You may end up in a difficult position without gaining any advantage. Still, obtaining the land north of Jiahui Pass is already quite an achievement. We didn't have that territory before.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">She was well aware that her husband's health had declined with age and that his body had been weakened by indulgence in alcohol and women. He was no longer the man he once was.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Zheng Fang said, \"That's impossible. I worked hard to consolidate the armies of the Lu and He families. I'm not doing it to benefit someone else.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"What do you intend to do then? Don't forget, there's still a Crown Princess consort from the Lu family. Although some of the soldiers have defected to you, they are just fickle followers. If something happens to you, they will defect to someone else,\" Madame Ji couldn't help but worry.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Actually, he hadn't mentioned the Prince of Wei yet. Zheng Fang's path wouldn't be smooth at all.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Zheng Fang patted Madame Ji's hand. \"For now, we should have the Crown Prince make De Yin the Crown Princess consort. That will give me a better opportunity.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Madame Ji couldn't help but nod. Although she and De Yin didn't get along, it was inevitable that the Lu family would fall. Still, she advised, \"In my opinion, why should we make a move? The Empress He's brother was killed by Lu Wei. Do you think she can tolerate the Lu family?\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Yes, yes, I had forgotten about that,\" Zheng Fang admitted. He wasn't as reckless as before and had learned to stay out of direct confrontations. The last time he eliminated Lu Wei and He Guoguo without any repercussions, he had managed to distance himself from the situation.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Madame Ji smiled. \"It's getting late. We should rest. Our daughter-in-law is pregnant, and I need to send some tonics over tomorrow. It's wonderful that Heng'er is about to become a father. I hope he becomes more steady in the future.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Zheng Fang was quite pleased when their son was mentioned. \"I hope he takes over my position soon so I can rest. He's still too young, otherwise, I'd be lying down all day.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Madame Ji shook her head, unable to change his ways.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">After a good night's sleep, Huiyin opened her eyes to find Li Cheng staring at her. She was startled. \"What's wrong?\" She hadn't washed up yet, and her face was swollen. Being stared at like that felt strange.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">However, she could sense that Li Cheng was holding in some frustration, unable to express it. She seemed to understand his mood. \"Were you waiting for me to wake up?\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Li Cheng nodded silently. He didn't know how to explain it, but he just didn't want Huiyin to leave his side.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"Last night, we ate a lot. How about we have some porridge this morning? It's cooked with milk, almonds, peanuts, and walnuts. It's very fragrant,\" Huiyin said, gently guiding him off the bed.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Li Cheng, who was usually bold in thought and speech, had a strong sense of pride. If someone showed dislike towards him, he would feel that his efforts were in vain and stop treating them well.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">But Huiyin was always patient and considerate towards him. She obediently followed him, and after they washed up separately, their servants brought in hot porridge for breakfast.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"The porridge cooked with milk has no fishy or strange taste. It's delicious,\" Li Cheng finally said his first words after waking up.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Huiyin touched her belly. \"Since I've been pregnant, I haven't had much morning sickness, but I've been craving soups and porridge. I used to hate drinking soup the most. I would even choke on dry cakes and avoid broth when eating noodles...\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">In truth, Li Cheng had eaten all kinds of food, but having it with Huiyin made the porridge taste even better. He also ate a meat bun. \"This kind of baked bun is also delicious.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"If you like it, eat more. Do you want to have some hand-pulled noodles too?\" Huiyin asked with concern.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Deep down, there was some calculation in her actions too, but she only wanted to make Li Cheng anxious, not push him too far...</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Li Cheng shook his head. \"No need. You should start packing your things!\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"Are you serious?\" Huiyin's eyes widened in surprise.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Li Cheng smiled at this. \"Who do you think I'm joking with? The trunks are packed. We'll take a boat back. The garden at the Huaiyin Mansion in Xuzhou is very spacious, unlike here. When we get there, I can teach Jing'er how to ride a horse.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Huiyin was puzzled. \"Why are you suddenly sending me to Xuzhou? What about Prince Wei?\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Li Cheng replied irritably, \"Those scholars are really overstepping. If they want to write 'The Ode to Jianye,' they should just do so properly. Instead, they use your name to let those petty people covet you, which is really annoying to me.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">\"So, that's what's bothering you? Are you jealous?\" Huiyin chuckled softly.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Li Cheng stubbornly replied, \"I’m not jealous. I’m just worried about your well-being.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">\"Alright, you're worried about my well-being. You dared to say you liked me before, but now you're too embarrassed to admit you're jealous?\" Huiyin couldn't help but tease him. Seeing Li Cheng acting normally again was more important than anything else.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Li Cheng smiled without saying anything, loving how Huiyin could understand him so well.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">However, when Li Cheng went to see Prince Wei, before he could say anything, Prince Wei said to him, \"Your timing is perfect. I have something to discuss with you, and I've already spoken to the Huo family about it.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Li Cheng was confused. \"Uncle, what have you settled? Does this have anything to do with the Huo family?\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Prince Wei smiled. \"You're in luck. Your aunt’s younger sister is of marriageable age, unmarried, and both talented and beautiful. I intend to ask for her hand in marriage to be your Cifei, so that your princess can stay in Jianye to care for the Grand Dowager, and this new wife can accompany you to Xuzhou.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"Uncle, are you joking?\" Li Cheng was somewhat angry.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Prince Wei frowned. \"I've already spoken to the Huo family. How could this be a joke?\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">……</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Princess Wei was playing cards with Madame Huo and Yin Cifei when a palace maid entered to inform them that the young prince had gone to pay his respects to Prince Wei. Princess Wei was pleased, and Yin Lifang, observing Princess Wei's expression, congratulated Madame Huo, \"Your family is about to have another princess. Congratulations!\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">\"Lady Yin flatters me. This old body is overwhelmed,\" said Madame Huo, feeling a bit regretful. If only her granddaughter could become a princess of a commandery, their Huo family would have both a princess and a commandery princess. Alas, it was just a Cifei of a prince.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Nevertheless, the Prince of Huaiyin was young, of noble status, and held real power as a regional lord, which was more important.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Yin Lifang was genuinely happy for Li Cheng. Marrying a daughter of the Huo family would be beneficial, giving him more support and increasing his influence. However, her sister thought it was pitiful that even a prince couldn't decide who to marry.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Indeed, when Yin Liyi heard from Xie Jiuyi that Li Cheng had returned, she asked, \"Is he really going to marry the third daughter of the Huo family?\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">\"It's a done deal. Prince Wei has decided, and the Huo family is already aware. How can it be changed now?\" Xie Jiuyi said with a smile.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Yin Liyi sighed, \"You know, Princess Zheng is pregnant, and so many people are waiting outside her house day and night just to catch a glimpse of her. When I visited Grand Dowager Wu, she even called her a femme fatale. Now, the Little Prince is marrying someone else as his Cifei. Their marriage probably won't last long.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"Why would a marriage be affected just by taking a Cifei?\" Xie Jiuyi asked.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">\"You don't know. Princess Zheng is not a tolerant person. Do you know Xun Rou? When I was in Xuzhou, I found out that Xun Rou, the Little Prince's first cousin, was once favored by Princess Wu. She even copied scriptures with her blood on the orders of the late princess and managed the household so well that everyone spoke highly of her. Unfortunately, when she hinted at becoming a Cifei, Princess Zheng, while the Little Prince was training troops in Xuzhou, had refugees rape Xun Rou. Unable to bear it, Xun Rou returned to the capital.\" Whenever Yin Liyi recounted these events, she felt no fondness for Zheng Huiyin.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">She believed that while it was normal for women to have strategies in internal disputes, Zhengshi's methods were too extreme and crossed the line. Most women wouldn’t go as far as ruining someone’s reputation in a household dispute.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Xie Jiuyi was shocked, \"Does Li Cheng know about this?\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Yin Liyi shook her head. \"I'm sure he doesn't. Moreover, Zhengshi's father now controls three regions—Jizhou, Qingzhou, and Liangzhou. I suppose there's nothing he can do.\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">\"But with the Huo family’s daughter entering the household, it could lead to disaster,\" Xie Jiuyi thought.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Yin Liyi stood up. \"That's why I say the Huo family has miscalculated. Their daughter will probably be devoured without a trace.\" Thinking of the Huo family’s daughter, who was so gentle and charming, Yin Liyi felt a pang of pity.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">She had a strong sense of justice, and Xie Jiuyi quickly added, \"I won't say much about his internal household matters, but I'll make sure to remind him. At the very least, we won't let an innocent girl die because of internal disputes.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Most importantly, Xie Jiuyi knew that Prince Wei wanted the Huo family’s daughter to accompany Li Cheng to Xuzhou for the sake of their uncle-nephew relationship, which had significant implications. As Prince Wei's advisor, he couldn't allow the Huo family’s daughter to disappear soon after entering the household.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">However, he smiled, \"I heard that Prince Wei wants the Huo family’s daughter to accompany you to Xuzhou. With Princess Zheng staying in Jianye, she won’t be able to interfere from there.\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Prince of Wei echoed the same sentiment. When he heard of Li Cheng's refusal, he immediately said, \"There's no need for you to worry. Lady Huo will go to Xuzhou with you and take care of affairs there. I don't understand why you're refusing. Are you dissatisfied with my decision?\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Li Cheng had already been somewhat dissatisfied when he married Princess Zheng. Back then, he didn't like Zheng Fang's character, but he married Huiyin as per Prince of Wei's wishes. After marriage, the couple became deeply attached, and his wife, a rare gem with both talent and beauty, had captured his heart. How could there be room for anyone else?</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Moreover, Prince of Wei always made decisions for him directly, which made him even more uncomfortable.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Therefore, he said, \"I appreciate your kindness, Uncle. But to be honest, many people covet my wife. I was already worried, so I assigned people to watch over her, fearing that some scoundrels might have designs on her. Now, because Yang Zijia wrote the 'Ode to Jianye,' I am even more troubled. I'm afraid someone might take her away. How can I dare to take another wife? Besides, Princess Zheng is already pregnant. If Lady Huo enters the household and has to rank below someone else, wouldn't it be better to find a family with both literary and martial talents? Why must she enter my household? Please don't worry about me. I came back to bring her and Jing'er to Xuzhou. There are many scoundrels around our mansion, and I'm afraid something might happen.\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Was Prince of Wei really so intent on this marriage? Perhaps he also wanted to see if Li Cheng would obey him as before.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Looking at Li Cheng, who was explaining earnestly, he was somewhat displeased and said, \"What you say has its reasons, but I have already spoken with the Huo family. What will happen if you refuse and she becomes desperate?\"</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">If Prince of Wei was trying to use moral pressure, this tactic might have succeeded. But it happened that the person he was dealing with was Li Cheng, who could stir up trouble even without a reason. Hearing Prince of Wei's words, he said, \"Uncle, you just told me you wanted to take a secondary consort. How is it that Lady Huo is marrying me now? There's no matchmaker, no formal betrothal gifts, and even a secondary consort needs to be officially appointed by the court. Don't worry about the Huo family. Last time, Aunt was asking me everywhere to tell you not to marry Jianjia to Weixiao. I didn't interfere, so this time, please help me say a word.\"</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">\"You, you... I've prepared this marriage with great effort. The Huo family's betrothal gifts are generous, and their status in Jiangnan is exceptional. Although we are both royalty, we still need the support of these aristocratic families for military supplies when we go to war. Moreover, as a man, how can you be controlled by a woman?\" Although Prince of Wei was speaking with a smile, he still wasn't ready to give up so easily.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Li Cheng had originally intended to say something else, but seeing Prince of Wei's attitude, he decided to admit it directly. This would also clear up the matter of saving Li Jing last time. He bowed his head and said, \"Uncle, you are a great man, but I am not.\"</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Prince of Wei didn't expect him to admit it so frankly. What was supposed to be a three-part act of drama became seven parts of anger. He pointed at him and said, \"You, you... You are really disappointing. How can you say such things? If your subordinates knew you were a man who fears his wife, who would be willing to follow you sincerely?\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">\"Uncle, I only ever wanted to follow you, and I have no grand ambitions. Now, living in seclusion and defending Xuzhou for you is enough for me.\" Li Cheng took the opportunity to express his loyalty.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Prince of Wei was pleased to hear this. Seeing that Li Cheng really didn't want to marry, he had no choice but to give up. \"Alright, I will speak with the Huo family about this.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">\"I am grateful to you, Uncle,\" Li Cheng thanked him with a bow.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">The uncle and nephew had lunch together. Princess Wei specially asked the kitchen to prepare Li Cheng's favorite dishes and had Cifei Yin send some pastries over. Yin Lifang also made them very carefully, thinking that Li Cheng would definitely agree to take a secondary consort. For a noble family's son, taking a secondary consort or concubines was as simple as drinking water.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Being able to marry a high-born lady like Lady Huo as a secondary consort was a sure gain with no loss. Surely Li Cheng would agree; otherwise, he wouldn't have stayed for the meal.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">The meal lasted about an hour. Cifei Yin and Princess Wei were both taking care of the children. It wasn't until Li Cheng left that Princess Wei went over, intending to discuss her younger sister's wedding. Unexpectedly, Prince of Wei waved his hand.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">\"My Lord, what does this mean?\" Princess Wei was puzzled.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Prince of Wei said, \"He doesn't want to take a secondary consort now. Let your sister find another family. Anyway, it was just the beginning of the discussion, and nothing was officially decided.\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Princess Wei, who had initially felt it was unfair for her younger sister to be a secondary consort, said, \"Why doesn't he want to marry my sister? My sister is as beautiful as a flower and has both talent and looks. The threshold of my family's house is almost broken from so many proposals. Why?\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Princess Wei couldn't understand, and Prince of Wei was even more puzzled.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">The couple exchanged puzzled glances. Li Cheng, however, was quite pleased. As he rode back, seeing people surrounding his residence, he had his personal soldiers drive them away, which made him feel much better.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">When he returned, he didn't see anyone carrying things and immediately rushed into Huiyin's room. \"Why haven't you packed your things yet? Didn't I tell you to pack quickly so we can leave?\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">\"Oh, I was afraid you wouldn't be back so soon! I heard from Cifei Xu that your uncle wants you to take a secondary consort,\" Huiyin hadn't expected him to return so quickly.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Li Cheng frowned. \"You knew about this too, but you didn't tell me earlier. Uncle advised me in every possible way, but I refused.\"</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">\"Why?\" Huiyin asked anxiously.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Li Cheng smiled brightly. \"No one in this world can truly force another to do something they don't want to do. If I really don't want to, of course, I would refuse.\"</p><p id=\"paragraph-116\" data-paragraph-id=\"116\"></p>\n</div>"
  },
  {
    "number": 52,
    "title": "Chapter 52",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 52</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎First Watch◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Several large ships sailed smoothly on the river. In the early morning, a morning mist rose, seemingly blocking the rising sun. Looking out through the window, the rolling river flowed away with the waves. Huiyin had boarded the ship before dawn, and now her neck and back ached. She turned to Li Cheng and said, \"I don't know why you're in such a hurry?\"</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">\"I'll be relieved if we return early,\" Li Cheng said happily.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">\"Relieved about what? My neck is very sore,\" Huiyin sighed in frustration. In one night, he had personally overseen the packing, even waking Jing'er who was still in dreamland.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Li Cheng obediently said, \"Let me give you a massage.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Don't use too much force,\" Huiyin said, rubbing her neck.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">It was comforting to have someone give a massage. She always felt like she had been given a new life since leaving Jianye. Li Cheng couldn't resist kissing her unpowdered face, feeling blissful even when Huiyin glared at him.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Being able to be with her husband and son alone made Huiyin very happy, though the connections she had built in Jianye would likely be severed. But she didn't regret it too much. Life was about gaining and losing. If one were too greedy, even the heavens would become jealous.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"The web of my hand, I need a massage there,\" Huiyin said, extending her hand to Li Cheng.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Without a word, Li Cheng rubbed the web of her hand. Huiyin smiled as she gently touched his face.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">This time, Li Cheng also suggested that Grand Dowager Wu come along, but she preferred to stay with Wei Imperial Consort, so Li Cheng didn't insist. He didn't know what changes awaited them in Xuzhou, but for now, she was very happy.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">While she was living comfortably, Deyin wasn't faring as well. She could sense that Li Heng was becoming increasingly cold towards her, and she didn't even know why.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Elder Madame Xu had submitted her token, but without a summons from the palace, she couldn't enter freely. Madame Ji certainly wouldn't go out of her way for Deyin, the Crown Princess. In her view, the Da Ye dynasty's court was already showing signs of decline, and the throne might change hands in the future. There was no need to deal with the Empress.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Deyin was happy that her father's position had been elevated, but her own status remained unchanged.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"Lianzhi, what's wrong? Didn't I ask you to send a box of pastries to the Crown Princess?\" Deyin said, not wanting to kick a person when they're down, still maintaining a respectful facade towards Crown Princess Lu Xiao.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Lianzhi replied, \"You mean well, but the Crown Prince has forbidden anyone from sending things into the Crown Princess's palace. The servant has no way around it.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Deyin frowned in confusion. \"Are all the members of the Lu family dead? Why would the Crown Prince imprison the Crown Princess? They should have just exiled her to a cold palace. After all, the Crown Princess hasn't done anything wrong. She's just a simple person.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"If you don't understand, how could I possibly know?\" Lianzhi said with a smile.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Deyin sighed and rubbed her stomach. \"You know, when I was at my parents' home, my health was much better than my second sister's. But after getting married, my menstruation became irregular. It's been over three years since the marriage, and my belly is still empty.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"This servant doesn't understand big principles, but there's a saying that good things come to those who wait. Perhaps when you become the Crown Princess and give birth to a child, that will be real good fortune.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">These words were very comforting to Deyin, and she quickly had Lianzhi and Yunzhi distribute the pastries. She, too, perked up again.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">But just as Deyin's pastries weren't delivered, Empress He sent something over. Empress He could not tolerate the idea of the Lu family's daughter remaining in the position of Crown Princess. Since Li Heng couldn't bring himself to act decisively, she took matters into her own hands.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">The bowl of poisonous soup was delivered, but Li Heng's people disposed of it.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Li Heng thought this situation couldn't continue. His original intention was to protect Lu Xiao, but keeping her as Crown Princess only invited further danger. He decisively requested the next day to depose the Crown Princess and move Lu Xiao to a separate palace.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Lu Xiao had originally been waiting for news of her family's safety, but what she got instead was the news of her deposition. In a neglected palace where fallen nobles are confined, a tiger that has fallen to a plain is bullied by dogs. Although some guards protected her by Li Heng's orders, Empress He also sent word to Lu Xiao that all her family members were dead.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Only then did Lu Xiao realize that everything had been a lie. He hadn't spared her family; he had killed them all.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">It was so tragic. How could someone who claimed to love her still have the audacity to speak of affection after destroying her entire family?</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Lu Xiao felt as though life had lost all meaning. She had always been the type to feel uncomfortable for half a day if pricked by a needle while sewing, but now, she felt that death was the only way out. Li Heng already had a virtuous woman by his side. Zheng Deyin had never mocked her during her lowest moments and was favored by Li Heng, unlike her useless self.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">The next day, when De Yin awoke, she learned that Lu Xiao had passed away.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">\"She reportedly ingested gold and died in excruciating pain,\" Lianzhi reported. \"The Empress ordered a hasty burial, but the Crown Prince personally went to the cold palace.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"The Crown Prince?\" Indeed, the Crown Prince was a man who valued emotions deeply. Even though he had ordered the massacre of the Lu family, he did not take out his anger on a helpless woman.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">However, Li Heng appeared to be in a frenzy as he held Lu Xiao's body. He truly did not expect that she would hang herself. She was such a naive and lovely woman who seemed unbeatable by any difficulties. He had anticipated that others might harm her, but he never imagined she would take her own life.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">He had even planned to release her once he became emperor, rather than letting her remain confined in the cold palace indefinitely. With the Emperor's health declining and the He family losing influence, it was only a matter of time before he inherited the throne. Everything would be under his control then.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"Crown Prince, Zheng Taifu has arrived,\" the guards reminded him.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Li Heng returned to his senses. Ever since Lu Wei's death, Zheng Fang had been appointed as Taifu. Li Heng and Zheng Fang maintained a facade of harmony but were at odds in their hearts. Li Heng often stirred up trouble by provoking conflicts among the subordinates of the He and Lu families, deliberately keeping Zheng Fang busy. Zheng Fang underestimated him, considering him merely a puppet crown prince. However, though Li Heng despised Zheng Fang, he knew this arrogant and unpredictable man would ultimately fall into his trap.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">For the moment, Li Heng put on a smile and exchanged polite words with Zheng Fang. Zheng Fang was about to request the court to promote some of his subordinates, and Li Heng agreed to everything. After all, with the Emperor's weakened condition, it was the Crown Prince who handled all the affairs and personnel arrangements in the palace.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Zheng Fang left feeling relieved, though he was also somewhat worn out. As the saying goes, one should wear a hat that fits their head. His position was still unstable, and he needed to transfer people from Jizhou. Fortunately, his son-in-law was nearby, which gave him some peace of mind. Otherwise, if he had to transfer troops from Jizhou, the Prince of Wei from Qingzhou might advance north, as everyone knew the Prince of Wei had ambitions and had previously seized Qingzhou.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">If the Prince of Wei advanced north, Zheng Fang feared there might be a conflict even with his son-in-law.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Therefore, he had to consolidate his position first.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">**</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">On the other side, upon arriving in Xuzhou, Huiyin felt a greater sense of familiarity compared to when she was in Jianye. The place was more spacious, and there were no troublesome matters or difficult people. If not for her growing belly, she would have rolled on the bed. Without thinking, she told Li Cheng about it.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Li Cheng pointed at Jing'er and said, \"You say who your son takes after, I think he looks most like you. Look how freely he rolls around.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"Nonsense,\" Huiyin sat on the edge of the bed, fearing her son might fall off.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Sitting together as a family of three, Li Cheng felt particularly secure, without the constant worry of danger. Holding Huiyin's hand, he began discussing court matters. \"The Crown Prince ordered the extermination of the Lu family. Lu's son had planned a rebellion but was caught by your father. The Crown Prince is truly ruthless; they say he didn't even spare newborn infants.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"If the grass is not uprooted, it will grow again with the spring breeze. But with the Crown Prince's ruthlessness, what about the Crown Princess?\" Huiyin sighed. In her previous life and now, the Lu family met the same fate.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Li Cheng shook his head. \"I don't know about that, but I think with the Lu family gone, good days are ahead for your sister.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Huiyin didn't believe it. \"The Crown Prince harbors deep hatred for the Lu family. Could he not have resentment towards our Zheng family? As the Crown Prince, he desires the world, but your father's troops have been earned through years of battle and won't be easily handed over.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"You're right. I won't touch Qingzhou for now. But I can't guarantee the future,\" Li Cheng was honest. Everyone served their master, and there was nothing to be done about it.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">While most women would urge their husbands to protect their natal families, Huiyin had a different perspective. She said, \"You should do what you need to do. Mercy on the battlefield is cruelty to oneself.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">In her previous life, her brothers and younger brother followed Li Heng. This time, she had always advised the Zheng family to protect themselves and had not asked them to do anything so far. By now, her father was probably feeling very arrogant and wouldn't listen to her anyway. Moreover, Li Cheng didn't yet have the ambition or power to challenge the Prince of Wei, who still loomed over them.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Holding her hand, Li Cheng said, \"You are so wise; I don't know what to say.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"Don't think too much. For now, I need to focus on my pregnancy. Isn't it strange? When we're apart, there are so many things to talk about, but when we're together, I just feel so at ease that I want to sleep.\" Huiyin stretched lazily.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Li Cheng always found Huiyin very expressive, able to make even small things like sleeping sound interesting. He knew it sounded like imitating Dong Shi, but he still said, \"The last time I returned to Jianye and was by your side, I also felt extremely sleepy and didn't know why.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Huiyin smiled. \"I remember now; you slept so soundly. It's strange. Now that I think about it, I also slept soundly by your side. The reason must be that we are people who can entrust our lives to each other, so we can only sleep soundly next to each other without worrying about anything.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Seeing Li Cheng nod in agreement, Huiyin thought to herself, 'This man might be sold out by me and still help me count the money!'</p><p id=\"paragraph-57\" data-paragraph-id=\"57\"></p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p>\n</div>"
  },
  {
    "number": 53,
    "title": "Chapter 53",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 53</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Second Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After Huiyin and Li Cheng left Jianye, Grand Dowager Wu moved in with Wei Imperial Consort again. Prince Wei was indeed respectful toward both imperial consorts, which greatly satisfied Grand Dowager Wu. Life in the Huaiyin Mansion had not been easy. Most of the household fawned over Princess Zheng, and her grandson hardly ever listened to anyone but her. She had felt utterly powerless.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Now, Grand Dowager Wu felt like she was truly alive again. Early in the morning, Consorts Yin and Xu had personally prepared meals, and Princess Wei served her soup. This was the kind of treatment the grand dowager had longed for.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">\"Old sister, Jing'er's mother is good at making fish slices, and Zhi'er's mother excels at making pastries. They may not be as skilled as the chefs, but it's still their heartfelt effort,\" Wei Imperial Consort said tactfully.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Grand Dowager Wu felt even more self-pity. Her son wasn’t close to her, and her grandson was drifting away. She failed to notice that Wei Imperial Consort was very kind to the two secondary consorts and even quite considerate to Princess Wei.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">After Consort Yin served the two imperial consorts, she left with Princess Wei and the others. Usually, they would stay to chat, but with Grand Dowager Wu there, it seemed the two old sisters had much to discuss, so they excused themselves.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Normally, Consort Yin would sit with Princess Wei for a while, but lately, she hadn’t. The Prince of Huaiyin had refused to take the Huo family’s daughter as a concubine, which embarrassed the Huo family. Princess Wei was feeling uneasy, so it wasn’t appropriate for her to visit.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Back in her own courtyard, she picked up her needlework when she heard that her younger sister, Yin Liyi, had come to visit. She quickly had tea and snacks prepared, knowing what her sister would say.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">As expected, Yin Liyi entered and said with a smile, \"I heard the Huo girl didn’t marry into the Huaiyin Mansion. That’s wonderful.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Consort Yin was speechless. \"How can you say that? The Huo family is furious. But they are subjects, and the Little Prince has a noble status, so they can’t say anything. Behind his back, they say Princess Zheng is jealous.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"They aren’t wrong. Princess Zheng did use underhanded tactics against Xun Rou, a young lady. Sis, I know you never speak ill of others, but virtue is a woman’s most important asset. To use thugs to ruin someone’s chastity—if someone did that to my daughter, it would destroy her life. Karma will catch up with her eventually.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Consort Yin wondered if her sister was truly upset about this incident. She didn’t think so. It was more about how they had grown up and lost the bond they once had. When they were young, her sister had been the liveliest, with all the boys surrounding her. Consort Wu had been very kind to them, but those days were long gone.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Looking at her sister, she said, \"You’ve come all this way. Let’s not talk about these things.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Yin Liyi was taken aback and looked at Consort Yin in confusion. \"Sis, aren’t you jealous? The Little Prince refused to take a concubine because of her?\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"What are you talking about?\" Consort Yin had found it incredible when she first heard. In a time when taking concubines was as common as drinking water, it would have been beneficial for Li Cheng to take the talented and beautiful Huo girl. But later, she realized how naive she had been. The Huo family was Princess Wei’s natal family, and Prince Wei had been urging Li Cheng to bring the Huo girl to Xuzhou. Was there an intention to monitor him?</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">She couldn’t share these thoughts with her sister, who wasn’t good at keeping secrets.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">So, she sternly warned Yin Liyi, \"Mind your own business. Don’t always think about the Little Prince. Don’t you worry about your husband getting jealous?\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"Sis, I was just kidding. Don’t be mad. By the way, the eldest princess is marrying into the Wei family. Although the wedding is in a few years, my husband said it’s good for you.\" Yin Liyi still cared about her nephew’s status.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">According to the rules, the eldest legitimate son should be the heir. Li Jing was the rightful heir, but Prince Wei was indecisive, which was frustrating.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Consort Yin smiled. \"It’s fine. If the prince tries to bypass Jing to make Zhi the heir, there will be great resistance. The officials in Jiangnan won’t allow it, and he can’t do anything about it.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">With the patriarchal system on her side and her son-in-law and the Little Prince supporting her, seeing Xu Consort flattering Princess Zheng was pointless. It was clear the one who truly made decisions in the Huaiyin Mansion was still the Little Prince.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Yin Liyi was completely relieved. A month later, she saw Princess Wei preparing rich silk and jewelry to send to Xuzhou. The relationship between Prince Wei and Prince Huaiyin was still strong. Now that Zheng Fang had made a blunder by trying to seize Qingzhou, the Zheng family and the Little Prince were on the verge of a fallout—exactly what Prince Wei needed to get Qingzhou back.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">To be honest, Huiyin also found this situation perplexing. She had been in Jianye for so long without any issues, but as soon as she arrived in Xuzhou, Qingzhou was in urgent danger.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">She held her belly and asked Li Cheng, \"I always find this matter difficult to understand. I know my father’s character; he wouldn’t dare to use force lightly, knowing your strength. As the saying goes, military force is an inauspicious tool, only to be used when there is no other choice. He isn’t insane.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Was her father being arrogant? Huiyin didn’t think so. She needed to find out.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Li Cheng thought the same. \"When I was younger, I would have just attacked anyone. But now, I want to investigate. Your father suddenly taking control of so many troops—these people may not be loyal, and they might be deliberately causing trouble.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"Yes, as long as you have a plan,\" Huiyin agreed.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">If Huiyin had appealed to Li Cheng based on their family ties, saying, 'That’s my father, don’t attack him,' he might not have listened. But by analyzing the situation and pointing out that Zheng Fang was already overwhelmed and fighting on two fronts, which was highly impractical, Li Cheng could listen and find it reasonable.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Life was truly unpredictable. She had been in Jianye for so long without any incidents, but as soon as she arrived in Xuzhou, Qingzhou was in danger.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Li Cheng smiled and said, \"Don't worry, since you are so understanding and have my best interests at heart, I will definitely not let you down.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">\"This is our private conversation, but you should still focus on the bigger picture. I will also write to my brother to inquire about the true situation.\" Huiyin understood clearly that her status depended on Li Cheng.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Even if her father were to become emperor, at most she would be a princess, and her children would still take their father's surname. She would remain an outsider with no power. But if she were to become empress, or even Empress Dowager, she would be the highest-ranking person.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Before, she didn't know what Li Cheng was thinking, but now she was increasingly certain. Of course, she needed to stand by his side.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">After they had discussed it, Li Cheng ordered the soldiers guarding Jiahui Pass to remain restrained and only defend.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">This move greatly displeased the Prince of Wei. In his opinion, regardless of whether Zheng Fang was sincere or not about fighting, they should strike while he was vulnerable. What was Li Cheng doing?</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Xie Jiuyi lowered his eyes and said, \"Perhaps the Little Prince finds this matter very strange and wants to investigate. After all, the Zheng family is related to him by marriage.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">As a friend, this shouldn't be said, but as an adviser, it was necessary to speak up. From a man's perspective, he could understand that the Zheng family was the natal family of the young princess. However, from the Jiangnan standpoint, if he had the strength, he should aim to expand into Jizhou.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">The Prince of Wei was very satisfied with Xie Jiuyi. \"You're right. I believe Zheng Fang isn't the type, but he is too sentimental.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"How about this, you go to Xuzhou personally and persuade him to attack directly.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">However, Xie Jiuyi shook his head. \"My lord, I still need to guard Bohai. I failed there before in Qingzhou. If I go, Yunzhi might think I'm acting out of a desire for revenge.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">The Prince of Wei then suddenly thought of someone.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">**</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">The weather was starting to get hot. After dinner, Jing'er and Huiyin had a meal together. Li Cheng took his son for a long walk in the garden and came back.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"After taking your son for a walk to help him digest, he's already hungry again,\" Li Cheng said with a helpless smile.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Huiyin smiled. \"Luckily, I have a small pastry prepared for myself to eat at night. I'll give it to him instead.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Jing'er took it and started eating. While he ate politely, Huiyin noticed the rough skin around his nails and said to Li Cheng, \"Your son is very strong. I saw him playing with those small toys. I couldn't even put them together, but he just pressed them together with his hands.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">The couple often referred to Jing'er as \"your son\" when talking to each other.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Li Cheng wasn't particularly concerned about the border skirmish at Jiahui Pass. In his view, it was clear that Pei Shuo had intentions to defect to his side. Zheng Fang was easily influenced, and if he were to rise in power, perhaps he could persuade his father-in-law to defect to him. Otherwise, both Qing and Xu states were already under his personal control. Last time, Xie Jiuyi led the Prince of Wei's troops. Now, asking his men to confront his own father-in-law was not something Li Cheng was ready to do.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Moreover, if Zheng Fang were to suffer a defeat in Xiliang, he might not have the strength to fight again. If he chose to defect, that would be even more advantageous.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Rushing into war would only cause trouble for him.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">However, Li Cheng still needed to closely monitor the situation. So, he went to his study, only to find Hua Gan, a trusted confidant of the Prince of Wei, visiting. Of course, Hua Gan was there to urge Li Cheng to send his troops immediately.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Li Cheng said, \"Currently, it's just a small skirmish at Jiahui Pass and not a situation where we need to be on high alert. Please tell the prince that the situation at Jiahui Pass has already stabilized. I have sent a letter to Zheng Fang in Jizhou to ask if it was his order or if it was the subordinates acting on their own. This place was originally under the Lü family's control. Perhaps he is trying to sow discord between the two sides. Please ask the prince to wait a little longer.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Hua Gan thought to himself that, as expected, he couldn't persuade Li Cheng. Fortunately, he had brought someone else. With a clap of his hands, a person in black wearing a hood entered, and Li Cheng looked up.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">It was none other than her!</p><p id=\"paragraph-55\" data-paragraph-id=\"55\"></p><p id=\"paragraph-56\" data-paragraph-id=\"56\"></p><p id=\"paragraph-57\" data-paragraph-id=\"57\"></p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p>\n</div>"
  },
  {
    "number": 54,
    "title": "Chapter 54",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 54</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎First Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Why did you send Concubine Yin on this mission, Your Highness?\" Princess Wei was both understanding and confused.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">For her, although Yin Liyi had some past feelings for Li Cheng, Li Cheng had preferred to offend Prince Wei rather than take a concubine for the sake of Princess Zheng. It was rare for a man to be so loyal.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Prince Wei, however, said, \"You don't understand. Big events often depend on small details.\" Under normal circumstances, he would suspect whether Li Cheng had feelings for his secondary consort. If Li Cheng had designs on her, he would want to eliminate him, even though he wasn't particularly fond of Yin Liyi. But at this moment, if Yin Liyi had old feelings for Li Cheng, it would be a great advantage for him.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">In his view, Li Cheng's reluctance to take action was partly because he didn't want to engage in warfare at the moment, but also because of Princess Zheng. After all, Li Cheng used to detest Zheng Fang. But later, he learned from Xie Jiuyi that Zheng Fang had risen to a high position and taken many lands, all thanks to Li Cheng's strategies.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">If you have a beauty strategy, I too have a beauty strategy.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Princess Wei shuddered upon hearing this. She had previously been saddened that her daughter had to marry Wei Xiao, especially since Wei Xiao had demoted his first wife to marry Jianjia. If the Wei family were to fall in the future, the Weis might do the same. But now, she had glimpsed the ugliest side of human nature; her own husband was no different.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Yin Lifang, who had given birth to Prince Wei's eldest son, was the most filial to Wei Imperial Consort and respectful to her as a princess. But at the critical moment, Prince Wei was willing to push her forward to charm someone else.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">How despicable, how despicable…</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">But then she realized that without Prince Wei, Jiangnan might have fallen, and she could have ended up as a war prize, a concubine or servant for someone else, in a worse situation than now.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Seeing that Princess Wei was silent, Prince Wei also pondered whether Yin Lifang could complete the mission. The temptation he offered was significant; whether she could seize the opportunity depended on her.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Similarly, when Li Cheng saw Yin Lifang, he understood. As soon as Hua Gan saw Yin Lifang enter, he prepared to leave. Li Cheng said, \"Yin Cifei has come to my place? She should be at my princess's place.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">**</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Yin Lifang smiled slightly. \"Little Prince, I am here on behalf of Prince Wei to deliver a secret letter that cannot be known by others.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"The Princess is not an outsider. Someone, please bring the Princess here,\" Li Cheng said. Since saving Li Jing, he felt he had honored his mother and fulfilled the late Wu Princess's final wish. In his actions, he always tried not to owe others and preferred to cut things off cleanly.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Yin Lifang didn't expect Li Cheng to complicate matters. She was a patient person and didn't want to appear too eager, so she smiled and said, \"Very well, I will wait here.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">In her view, it wasn't time to reveal her cards yet. Prince Wei had sent her with the prospect of the heir's position, and she had declined several times. But if she succeeded, Prince Wei might suspect collusion between Li Cheng and her, which would be disadvantageous.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">She had grown up in the Prince of Wu's mansion, where the Prince of Wu had invited renowned teachers for the heir. She and her sister were different; she had studied diligently, but unfortunately, she was only a daughter.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Huiyin didn't expect Li Cheng to invite her over. Upon entering, she was surprised to see Yin Lifang.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Li Cheng then said to Hua Gan, \"You may leave now. Since ancient times, men and women have been distinct. Now that the Princess has arrived, we are one as a couple, and there's nothing improper. If it were a real military secret, Prince Wei wouldn't have entrusted this to Yin Lifang.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Hua Gan bowed and respectfully exited.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Huiyin smiled at Yin Lifang and said, \"Why didn't you come to me? Is there something important?\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Yin Lifang, seeing Huiyin come and stand beside Li Cheng, as if asserting their shared stance, didn't mind and simply said, \"Little Prince, young princess, I originally didn't want to come, but I couldn't persuade Prince Wei.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Seeing her forced demeanor, Huiyin sympathized, \"Yes, we women can't control men's decisions.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">In fact, Huiyin was relieved. Regardless of why Prince Wei sent Yin Lifang, Li Cheng's decision to call her over showed that he valued her opinion. However, what mission did Prince Wei send her for? Was it to convince Li Cheng to wage war? That seemed far-fetched.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Yin Lifang nodded slightly and then looked at Li Cheng. \"Prince Wei said he understands that you are hindered by family ties, making it difficult to attack the Zheng family in Ji Zhou. But the battle of Qing Zhou, where countless lives were lost, still weighs heavily. Now, while Zheng Fang is engaged in the northern front, we should break through and take Qing Zhou. This is what we should do to comfort the people of Wei.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Before Li Cheng could reply, she added, \"In truth, I don't understand such matters. But I have a Jing'er, and there's nothing I can do.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Huiyin thought Yin Lifang was several steps ahead of people like Yin Liyi and Yin Huiyi. It was clear that Yin Lifang had agreed to come, yet she appeared so sincere that no one could blame her.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Sure enough, Li Cheng relaxed his brow and said, \"Yin Cifei, I will write a letter for you to deliver to Prince Wei. Now is truly not the time to act. Because of the previous defeat, I must be cautious and not lightly initiate warfare.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\"></p><p id=\"paragraph-31\" data-paragraph-id=\"31\">\"Hmm, okay.\" Yin Lifang remained quiet without a word.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Li Cheng also breathed a sigh of relief. He hadn’t considered breaking with the Prince of Wei for now. If Zheng Fang really failed in the northern campaign and was severely beaten while retreating to Jizhou, and if he didn’t seek help from Li Cheng, then Li Cheng could wait until Zheng Fang was worn down before making his move to subdue him.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">After finishing the letter and letting the ink dry, Yin Lifang remained silent throughout and left once she had the letter in hand. Huiyin thought that Yin Lifang wasn’t foolish. If she were, Li Cheng would have confronted her directly. But by handling things the way she did—finishing her task and leaving immediately—she gave no reason for Li Cheng to make things difficult for a woman.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">On the way back, Bi Gan asked Yin Lifang, \"How did it go?\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Yin Lifang shook her head. \"It was my inability.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">She believed that Li Cheng had intentionally summoned Huiyin to show that he wouldn’t agree to the proposal. She hadn’t spoken or mentioned any past relationship because she could see that Li Cheng was truly unwilling. By not pushing the matter, she subtly distanced herself from any involvement with Li Cheng, preventing the Prince of Wei from becoming suspicious.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">When she returned to report, she bowed her head submissively and said, \"It was truly my inability.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">The Prince of Wei glanced at the letter and said indifferently, \"It's alright. You’ve done your best.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Yin Lifang stood there looking dejected, as if upset that she hadn’t persuaded Li Cheng. The Prince of Wei thought to himself that she was quite incompetent. He had hoped Yin Lifang would be different from the others, but she proved just as ineffective.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">The Prince of Wei waved his hand, dismissing her, and then went to Xu Cifei. It was said that women in the harem shouldn’t interfere in politics, but he would favor anyone who could solve problems for him. He had thought Yin Lifang was different, but apparently, she wasn’t effective either.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Half a month later, both Zheng Fang and Zheng Wuheng sent letters. They reported that the disturbance at Jiahui Pass was caused by Lü Wei’s subordinates, who had fled. They were being pursued, and all those involved would be punished. Thick condolence gifts were also sent to the soldiers under Li Cheng’s command.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">This crisis was finally resolved, but Huiyin was well aware that a rift had formed between Li Cheng and the Prince of Wei.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">The military drills at Poyang Lake had always been led by Li Cheng, but this time he assigned the task to Guo Fei, a relative of the Wei Imperial Consort. Li Cheng remained silent upon hearing this.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Huiyin looked at him and asked, \"How are you feeling?\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"Feeling? What about?\" Li Cheng replied.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"Now that Xu Cifei has clearly lost trust in you, how about we just guard Xuzhou and Qingzhou in the future?\" Huiyin suggested.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Li Cheng smiled and shook his head. \"I just feel that when you're dependent on someone else, even if you give your all, if you upset them, everything can be taken back at any time. But if it’s something only I control, no one can take it from me.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Huiyin comforted him, \"The Prince of Wei might have had intentions of nurturing you at first, but compared to his position and his family, you’re not that significant.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Li Cheng had personally conquered Xuzhou. Originally, he had been following battles as just a commandant. He wasn’t given any territory, while the Guo family, who hadn’t even been on the battlefield many times, occupied key positions.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Li Cheng hadn’t thought much about it before, but now, he nodded in agreement. \"Yes, you're right. Uncle Wei Wang did have good intentions for me at first. But life is always changing. I never know what I’ll become next.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"Actually, life is made up of different stages. Today, we’re like-minded, but tomorrow, we might become enemies.\" Huiyin had become indifferent to these matters.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Li Cheng felt fortunate to always have someone by his side.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Huiyin stood up and said, \"Yin Cifei might have considered using her past relationship with you to influence you, but when she saw that you had summoned me, she knew you had made up your mind. By staying silent and positioning herself as a victim, she displayed her intelligence. She’s really a smart person.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"Do you think she’s like that?\" Li Cheng felt that sometimes he didn’t quite understand women.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Huiyin replied, \"Great loyalty seems fake, and great kindness seems evil. When making friends, it’s better to choose someone with flaws rather than someone who appears too perfect. The true masters are those who can manipulate hearts. If I were her, I wouldn’t play the victim. Or if I really wanted to help my son, I might say something about establishing the heir. But she changed her entire approach the moment she saw me.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Xun Rou’s malicious methods were too crude, and Yun Hui was also someone who seemed loyal but wasn’t. She couldn’t keep her composure and eventually revealed her desires. Yin Lifang was indeed cunning and made decisions quickly, which could easily mislead those who weren’t steadfast.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Li Cheng smiled and said, \"Huiyin, I think you’re truly resolute. Xu Cifei tried to win you over in every way, but you weren’t swayed. Yin Cifei seems selfless, but you don’t believe in her either.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"That’s because these people have conflicts of interest with us. If they didn’t, I wouldn’t dig deeper. I’d probably think Xu Cifei is a warm person and Yin Cifei is a good person.\" Huiyin smiled.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">It was rare for the couple to have such calm and honest conversations. Li Cheng looked at her belly and then at her. \"Only your charms work on me.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Huiyin’s face turned slightly red. \"Don’t talk nonsense.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Several months passed, during which Li Cheng had been shuttling between Xuzhou and Qingzhou, spending his free time with his wife and children. When Huiyin went into labor, it was Li Cheng who once again entered the birthing room to assist her. The couple had been hoping for a daughter this time, especially since they already had a son, but to their disappointment, another son was born.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">This time, Huiyin’s labor went much more smoothly, and they had already chosen a single character for their newborn’s name: Zhan.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">However, the child had not yet reached his first month when news came that Zhao Hong, the governor of Yongzhou, had raised an army and marched south, successfully capturing Yizhou. After taking Yizhou, he immediately began contesting Jingzhou with the Prince of Wei. The former governor of Jingzhou, Li Da, who was a member of the Da Ye dynasty’s royal family, was beloved by the local people. But now he was dead, and his young heir was no match to govern. The Prince of Wei had considered Jingzhou a sure thing, but unexpectedly, Zhao Hong had intervened.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Zhao Hong rushed to Jingzhou first, while the Prince of Wei dispatched Xie Jiuyi to handle the situation. Since Li Da's death, the factions in Jingzhou had been leaderless, with some siding with Zhao Hong and others pledging loyalty to the Prince of Wei. The two sides eventually clashed in Jingzhou.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Huiyin reflected that in the past, she had only concerned herself with her family’s matters and had barely understood how some battles had started. But now, she was beginning to see things more clearly.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">\"What's Zhao Hong's strength like?\" Huiyin asked Li Cheng.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"He's quite formidable,\" Li Cheng replied. \"Otherwise, how could a mere governor of Yongzhou have swallowed up Yizhou and now set his sights on Jingzhou? He's truly a fierce opponent.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Huiyin looked at him and asked, \"If they sent you, could you defeat him?\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Li Cheng smiled and said, \"That's hard to say. Many things on the battlefield change in an instant.\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">After their conversation, Li Cheng left, while Huiyin leaned back on her pillow, feeling a growing sense of unease, as if a storm was about to break.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Yin Liyi felt the same foreboding. Xie Jiuyi had been sent into battle again. The last time he was in Qingzhou, he had nearly lost his life on the battlefield. This time, she didn’t yet know what would happen.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">To make matters worse, a famine broke out, and Zhao Hong had even burned the granaries. Zhao Hong's tactics were unorthodox, and no one really understood how he waged war. In the past, the Prince of Wei had dominated the regions south of the Yangtze River with ample grain supplies, but now the situation was different. Although Xie Jiuyi had won a battle, his grain supplies had been destroyed, and securing new provisions was now an urgent priority.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Even someone as resilient as Yin Liyi now found herself increasingly anxious and troubled. She was so distracted that during her nephew Li Jing's birthday, she barely paid attention when visiting Yin Cifei.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Yin Cifei tried to comfort her, saying, \"Don't worry. There will surely be a way.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">And indeed, there was a solution. The Prince of Wei arranged for Xie Jiuyi to marry Cao Ping’s sister, a prominent merchant from Jianye. Merchants, though often looked down upon, were essential during wartime. The Cao family had hoped to control the grain supply in Jingzhou and had now reached an understanding with Xie Jiuyi.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">When Yin Liyi learned of this, she felt such a wave of dizziness that she could barely remain standing.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Yin Cifei helped her sister sit down and asked, \"What's wrong with you?\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">\"Sister, how could my husband take a concubine? He promised my father that he would never take another woman besides me. Sister, you must have known about this all along, but you kept it from me,\" Yin Liyi said, unable to accept the situation.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">But Yin Cifei smiled and said, \"Don't worry. This marriage is purely a matter of convenience. The female official sent by the Prince of Wei to oversee the wedding is a close acquaintance of mine, and she specifically told me that your husband hasn’t even gone to see her.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Yin Liyi’s mood lifted, but a lingering sense of unease remained. Her husband had been pressured into taking a concubine, and she imagined he must be feeling even worse than she was.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\"></p>\n</div>"
  },
  {
    "number": 55,
    "title": "Chapter 55",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 55</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Second Watch◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">It was Lady Xue who brought it up, and only then did Huiyin learn of it. Presumably, Lady Xue thought that Li Cheng had a good relationship with Xie Jiuyi and that she was also close to Yin Liyi, so she spoke in front of her.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">\"Lord Xie has now taken in Miss Cao, the sister of Cao Ping. You know, I haven't met the other merchants, but I have met Miss Cao. She is truly proficient in everything from music to chess, calligraphy, and painting. She is talented, gentle, and beautiful.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Even Lady Xue, who was still part of Yin Liyi's camp, praised her. It seemed that Miss Cao was indeed remarkable. Huiyin listened for a long time, and after seeing off Lady Xue, Nanny Nan sighed, \"This old servant had previously said how good Lord Xie was to Lady Xie. Lady Xie is truly a simpleton with good fortune. I didn't expect Lord Xie to start taking concubines.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin smiled, \"It's effortless for him to obtain grain supplies. I'm actually puzzled as to why people are saying he's neglecting her now. This is truly biting the hand that feeds them. Forget it, let's not discuss other people's matters. I'm increasingly realizing the importance of grain supplies. Although Xuzhou has fertile fields, if there are constant battles, even the prince won't be able to sustain it.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">In fact, through this matter, what Huiyin truly considered was the issue of grain supplies. While having a meal, she asked Li Cheng, \"Although I shouldn't pry into the military's grain supplies, it's crucial. I think we have more estate lands than ordinary people and nobles. In the future, we should be more frugal with our household expenses. I'll set aside a place specifically for storing grain as a precaution.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"Is that what you're thinking about?\" Li Cheng almost laughed out loud.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">He thought his wife might mock Yin Liyi, especially since they had quarreled before. He knew Yin Liyi's temperament well. To put it bluntly, wasn't it Xie Jiuyi who spoiled her, making her arrogant? Surprisingly, Huiyin's first priority was to stockpile grain for the household. She truly didn't complain about her environment but instead took action.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Huiyin explained, \"When we see others' misfortunes, we shouldn't gloat, or it will come back to haunt us. I'm fortunate, and you, my husband, are steadfast. But other men seek power and position, which is also understandable. As the saying goes, even a hero can be brought down by a single coin. Although I have disagreements with Yin Liyi, truthfully, I've forgotten those unpleasant moments because I'm so happy living in Xuzhou. It's not that I'm particularly magnanimous, but we have more important things to do.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">After saying this, she begged Li Cheng to explain more about what constitutes grain supplies.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">It turned out that grain supplies included not only food and fodder but also cooking utensils, tents, clothes, armor, weapons, medicine, and all other heavy materials. As for the staple crops, the central plains mainly used sorghum and wheat, while the south primarily used rice with sorghum and wheat as supplements.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Li Cheng was very knowledgeable about these matters, having started from the bottom in the battlefield. \"The food carried by one of our logistics camps is enough to supply 10,000 troops for three days. Each soldier consumes about two to three jin of rice per day. To put it this way, an army of 12,500 needs 90,000 shi of rice annually.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"From what you say, your troops must be well-fed,\" Huiyin calculated.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">90,000 shi of rice, or about 9 million jin. That's quite a lot.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Li Cheng smiled, \"If soldiers aren't well-fed, how can they fight? Now that I'm in charge of Qingzhou, with low taxes and convenient commerce, I'm relieved.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">\"Last time, everyone said the melons and fruits of Qingzhou were excellent, and they gave me a lot,\" Huiyin had a goal in mind. She had to store at least that much grain for Li Cheng. If there wasn't enough grain, she'd make up for it with fruits. In short, she had to try to reach 90,000 shi no matter what.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Just like the fruits she kept in the ice cellar, which were only served when guests came.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">To achieve this, Huiyin consulted agricultural books. The books said that among the staple crops, only sorghum could withstand aging. Upon hearing that sorghum was cheap, she bought a lot, some directly from tenants, which she personally inspected.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Millet, on the other hand, was not easy to store. It was drought-resistant and could withstand extremely cold places, but Xuzhou was still relatively humid.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">In any case, during the period when Huiyin was stockpiling grain, Li Cheng was almost afraid of her questions and would run away when he saw her.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">However, he didn't stop his wife. It was better for her to have something to do than to be bored.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">During this time, Huiyin also got to know the large and small grain merchants within Xuzhou. Of course, she wasn't foolish enough to deal with these people directly. This was when Manager Qiao's role became evident.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Actually, with Li Cheng's rank, there was an annual supply of two million shi of grain. Originally, he would give half to the Prince of Wei, but now he kept almost all of it for himself, using it not only for household expenses but also for the army and the taxes in Xuzhou. This year, he was unwilling to hand it over.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">The couple each had their own plans, and De Yin in the Eastern Palace was also scheming. She had longed for the position of Crown Princess for a long time, and now that Lu Xiao had passed away, it should be her turn.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">However, her father had just been defeated in the West Region and had retreated to the capital, so she couldn't rush to ask her family for help.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">In her past life, her father and the crown prince were allies, and the crown prince trusted him deeply. Her sister's favor was largely due to the Zheng family's influence. But now, it seemed that Empress He had opinions about her, let alone the princess. Originally, they had been on good terms, but now they looked at her with disdain, as if she had caused Lu Xiao's death. How could she have been disrespectful to Lu Xiao when she was most favored before? Let alone now?</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Thinking of this, she felt a slight pain in her lower abdomen. If only she could bear a child.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\"></p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">But she wasn’t pregnant, yet she saw the Crown Prince return with a woman who was heavily pregnant. De Yin was taken aback, \"Who is this woman?\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Lianzhi finally came back after a while and said, \"This woman is said to be from Princess Xinning's mansion.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"That servant girl, no wonder she turned her back on me, she was secretly harboring someone.\" De Yin knew that Princess Xinning had a good relationship with Lu Xiao, and she also had a good rapport with Princess Xinning. I didn’t expect her to betray me like this.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Princess Xinning was Empress He’s adopted daughter and usually appeared righteous. However, it now seemed she was nothing more than a matchmaker. Li Heng had been devastated by Lu Xiao’s death a few months earlier. Later, he was taken by his sister, Princess Xinning, to relax, where he became enamored with a dancer who then became pregnant. He didn’t look down on her because of her lowly status, and at his age having no heir raised suspicions among the court officials.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Similarly, Yin Liyi also received Cao Ping’s sister. Although Cao Ping’s sister was not heavily pregnant and was rather coldly treated, she still put on a smile and called Yin Liyi \"sister\" repeatedly.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Yin Liyi, usually lively and straightforward, thought she was different from someone like Princess Zheng. She even believed Xie Jiuyi had his reasons for marrying Cao Ping’s sister as a temporary solution. However, seeing how quickly Cao Ping’s sister made herself at home, she realized she couldn’t get rid of her so easily.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\"></p>\n</div>"
  },
  {
    "number": 56,
    "title": "Chapter 56",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 56</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Merged Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Zhan'er, your brother is so generous; he's willing to give you his favorite toy.\" Huiyin shook a rattle and spoke to her young son in the cradle.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Next to her, Jing'er stood on his tippy-toes and said, \"Mother, why is my brother so small? All he does is sleep.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Huiyin smiled and said, \"You were once this small too. Come to think of it, you're already three years old. I’ve talked to your father about getting you a tutor. In the future, you won’t need to stay by my side all day; just focus on your studies.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Despite his young age, Jing'er was quite eloquent and replied, \"I'm not three years old yet.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Alright, then stay by my side and play. Later, I'll take you to the garden for a walk, but you're not allowed to catch bees and insects anymore. If you get bitten, your father will blame me.\" Huiyin gently tapped her son's little nose.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Needless to say, Jing'er ran around picking flowers in the garden, and by the end of it, Huiyin was exhausted, and the child was finally tired. The nanny quickly took Jing'er away, and Huiyin rubbed her waist, saying, \"I'm not as energetic as I used to be. I used to ride horses and run laps without any problem, but I really can't do it anymore.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">After saying this, she looked at Nanny Nan and said, \"Nanny, you don't have to follow me out so often now that you're older.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Nanny Nan smiled and replied, \"Don't worry about me. I'm a person who can't sit still. If you make me sit all day, I'll be miserable.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin thoughtfully said, \"I used to move around a lot, but now I've settled in Huaiyin. The prince treats me very well, and the heir has been born, along with the second young master. However, some of the maids who have been with me haven’t found their own futures yet. Mama, if I ask them, they'll all say they want to stay by my side, but girls eventually need to marry. Please ask them what kind of person they want to marry. Then I'll call the matchmaker, or maybe you can help too.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">In any case, their happiness shouldn't be delayed. Of course, if there are those who really don't want to marry, they can stay by her side, and the mansion will take care of them for life and even their final rites. It all depends on their personal wishes.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Nanny Nan praised Huiyin for her kind-heartedness, but Huiyin replied, \"It's not about being kind-hearted; I just want to treat them the way I’d want to be treated.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Regarding marriage, the four senior maids had completely different thoughts. They had all followed Huiyin from Jizhou and usually performed their respective duties well, maintaining a good relationship. When Nanny Nan asked them, they gathered together to discuss this matter.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Fugui spoke first, \"I've been by the young miss's side since I was young. Now, I manage the household for her. Honestly, it's not that I'm better than others; it's just that the young miss trusts me. So, I don't want to leave or get married. Marriage isn't that great.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"Fugui, this is your lifelong decision.\" Even Le Yun, who rarely spoke, chimed in. She was the oldest among the four senior maids and seldom interfered in others' personal matters.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Fugui said earnestly, \"Sister Le Yun, I'm speaking from the heart. We've never suffered from the hardships of war, and life has been good by following the princess. In the winter, we wear fur coats and cotton skirts, and in the summer, we wear light gauze and have ice. This kind of life can't be found outside. Besides, if we all leave, the new maids will come in. I'm not boasting, but I truly wish the best for the princess and am loyal to her.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">She didn't want to leave because, being a non-hereditary servant, she had experienced poverty as a child and really didn't want to experience it again.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Le Yun sighed, \"It's good that you've thought it through. Ever since Nanny Nan and I discussed this, my mother has found a match for me.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Le Yun was in her early twenties and, being a family servant, followed her master's orders. She had a gentle appearance and a calm personality, and as a senior maid by the princess's side, once the news was out, everyone was eager to meet her.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Everyone asked who it was, and Le Yun shyly said it was a certain Doctor Huang from the prince's mansion. He was young but had excellent medical skills. Most importantly, when her mother had been sick before, Doctor Huang had been very attentive and considerate.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Qiū Fēng laughed and said, \"So it's him. I've heard he has quite some assets, and Sister, if you marry him, you'll be a proper young mistress.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">The group teased her for a while, and Qiū Fēng said, \"Like Fugui, I also want to stay in the mansion and marry within.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Dong Shun helped suggest, \"Actually, marrying someone in the mansion is a good idea. Honestly, working by the princess's side, we've never been mistreated.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Qiū Fēng naturally had her own shrewdness. With Fugui above her, even if she became a housekeeper, she wouldn't be able to rise to prominence for a while. It was better to marry and become a stewardess. If she could end up with the heir, that would be ideal, but if not, going to the second young master's side would also be fine.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Staying in the mansion seemed like the safer choice. As Fugui said, merchants were profit-driven and lacked propriety, and soldiers were likely to die in battle. It was better to stay in the mansion.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Dong Shun was the youngest and the least in a hurry.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">After hearing from Nanny Nan, Huiyin first called Le Yun's mother and rewarded her with two hundred taels of silver, eight bolts of colorful silk, a set of jewelry, a folding screen, and a red sandalwood treasure screen. Le Yun was extremely grateful, especially for the red sandalwood eight-treasure folding screen. It was something that could add luster when guests came over, and it was something money couldn't easily buy.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">After Le Yun married off in grandeur, she became pregnant after just over a month. Huiyin rewarded her with a set of bathing tub, cradle, and walker that Jing'er had used before. Le Yun specially came to thank her again.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"The princess has been too kind to me.\" Le Yun knew the princess’s gifts were a way to show the Huang family that she supports Le Yun.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Huiyin smiled and said, \"This is your family's home; you can come back whenever you want in the future, just let Nanny Nan know.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Now that Le Yun had become Madam Huang, it was difficult for her to enter the second gate. Especially since Huiyin managed the household strictly, without a token, no one was allowed to enter, and those caught were severely punished. Therefore, upon hearing Huiyin's words, she quickly knelt down and thanked her.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">But she also thought of Huiyin, \"Now that I'm married, are you still satisfied with the people serving you?\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Huiyin shook her head and said, \"They can't compare to your thoughtfulness. You've been with me since childhood, and even a cough from me would let you know what I needed. Those young maids are far from that. However, I can't always delay your futures. Although Prince Li Cheng and I may not be deeply in love, we respect each other as a couple. You are all young girls with emotions and desires, and you can't always be confined here.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Le Yun was deeply moved.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Huiyin wasn't particularly good at emotionally moving others. Honestly, she did this just to show kindness to those working for her. Le Yun had served her since childhood, and she cared for her, but more importantly, she wished for her to have a good future. She wouldn't overly involve herself in other people's family matters.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Now, being too good to her might lead to future resentment if Le Yun asked for something unreasonable or against her principles. It would be better not to be too intimate and just let the Huang family know the connection.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">As the mistress and servant were talking, they heard that Madame Miao had arrived, and Le Yun took her leave.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Madame Miao came to tell Huiyin the good news, \"Last time you asked me to find someone for the pastries, I've found a cook who can prepare seasonal pastries and banquets, and even summer refreshments and drinks are done very authentically.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"Since you recommend her, I won't test her cooking skills, but do you know her background?\" Huiyin asked.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Madame Miao then explained everything in detail.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">These were all household matters, and after Huiyin finished handling them, she yawned. Just then, Li Cheng walked in, and she quickly covered her mouth, pointing at him, \"Forget everything you just saw, alright?\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Li Cheng shook his head with a smile, \"I heard you married off a maid, are you short of people now?\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"What? Do you have someone to recommend to me?\" Huiyin asked.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Li Cheng put his hand on her shoulder and let her sit down, \"I think that although you usually go out with guards, there's still a difference between men and women. If you're resting in your room and someone sneaks in to kidnap you, the guards outside can't enter the second gate, and it might be hard to notice. So, I want to send two skilled maids to your side. They can serve you daily and protect you if necessary.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"That sounds good. You've thought it through. But are they coming voluntarily?\" Huiyin asked.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Li Cheng whispered, \"They were originally my spies, but they got injured and had to step back. Still, they have martial skills, even if they can't perform higher tasks.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">With that, Huiyin agreed to accept them, and Li Cheng mentioned they would come to the mansion in a couple of days.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">The couple typically discussed business matters first before getting personal. Just like now, Li Cheng said, \"I heard the Crown Prince is planning to take Weiduo's illegitimate daughter as a Liangdi, and whichever of Weiliangdi or your sister gives birth to the royal heir first will be made Crown Princess.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">The Crown Prince had always wanted Zheng Fang to help him eliminate Lü Wei. Zheng Fang managed to escape unharmed, and now he was dominant on his own. Although he suffered a defeat in Xizhou, the Ji Prefecture headquarters and the capital were still firmly controlled.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">It was difficult for Weiduo to enter the capital, and now he also wanted to take Jingzhou. Now, Prince of Wei, Weiduo, and Zhao Hong—in the previous life, it was after Li Heng ascended the throne that he deliberately sent Zheng Fang south and even planned to marry Weiduo's daughter as Crown Princess. In this life, Zheng Fang eliminated Lü Wei and distanced himself, secretly benefiting without letting Lü Wei's and He Guoguo's old troops seek revenge, thus retaining some strength.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"The Crown Prince is using his old tricks again,\" Huiyin understood clearly.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Li Cheng frowned, \"What do you mean?\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Recalling the events of the past, she felt that military and state affairs were just tools for manipulation, \"Actually, back then, the Crown Prince also went to great lengths to marry our Zheng family's daughter. He first saved my elder sister, then me, hoping to win our hearts. That way, no matter which daughter married him, he would form an alliance with the Zheng family. He deliberately said my sister would be Crown Princess, then pursued the Lü family's daughter, playing them off against each other, eliminating whoever was stronger through trickery.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"Do you mean he pursued you too?\" Li Cheng couldn't believe Li Heng could be so shameless.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">The marriage to the Zheng family's daughter was somewhat forced, and the Crown Prince really was...</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Huiyin nodded, \"Yes, do you think I'm joking? This time, it could spark another conflict.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">It was unclear what kind of person Weiduo's daughter was. If she was intelligent, Zheng Deyin might face a strong rival. Li Heng was very good at creating imbalance among women, making them fight each other.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Li Cheng didn't quite understand, \"What can women decide? Your father might not listen to your sister unless he acts according to circumstances. Weiduo is a brilliant military strategist; even my royal uncle wants to form a marriage alliance with him. Your father might not be his match. The Crown Prince's thinking seems too simplistic.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">\"This woman is just a trigger. Like how the Prince of Wei specially sent Yin Cifei, if you intended to fight, then her coming was just timely. If you didn't want to fight, her coming would be in vain.\" The story of \"playing with fire beacons to amuse his concubine\" might not even be real, let alone men's actions.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Li Heng looked disdainful. \"I still find this tactic too beneath us.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">**</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Eastern Palace</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">De Yin's life had become increasingly difficult lately. She had been married for three years, but the favor she once enjoyed had faded. A pregnant concubine ranked above her, and soon another woman of similar status, Wei Liangdi, would join the household. Looking at herself in the mirror, she was twenty-two years old. It wasn't a particularly advanced age, but there was a nail-sized blemish on her cheekbone. Others might not see it, but she was very self-conscious about it.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">\"Bring me the powder that the Princess of Huaiyin sent from Jiangnan to cover it up.\" All of a sudden, nothing seemed to be following the script of her previous life anymore.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">She had not conceived, and Li Heng's affection for her had gradually waned, unlike her sister, who was well taken care of by Li Heng until his last moments.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">For a moment, she felt utterly lost.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Yunzhi brought in a cup of Pu'er tea. \"Liangdi, you gave that powder to the newly arrived Qian Liangdi last time.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">\"I forgot. I shouldn't have given it to her. Now that I have, she probably thinks the things I give her are poisoned.\" De Yin had good reason to say that. This newly arrived woman in the Eastern Palace was excessively cautious. Just a slight approach, and Qian Liangdi would shiver all over. It was said that she even threw out the pastries De Yin had sent over.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Lianzhi was also very angry. \"Who says otherwise? She thinks everyone harbors malicious intent. You are of higher birth than her, more favored. If you give birth to a son in the future, who would care about her child?\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Lianzhi had spoken out in a fit of frustration, not realizing that Li Heng had just appeared at the door. De Yin was startled and quickly composed herself, saying, \"Your Highness, why did you come without a word?\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">De Yin had learned to be tactful and manage the household after these years in the palace. Of course, she knew it was wrong to gossip about the master behind his back, but she relied on Li Heng's favor and believed he wouldn't mind for the sake of the Zheng family.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Unbeknownst to her, Li Heng was about to react differently this time. He said coldly, \"Just now, who was gossiping about Zhao Liangdi behind her back? Step forward. According to the palace rules, servants cannot gossip about their masters.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Lianzhi felt a chill and a rush of blood. She had spoken out because she was De Yin's dowry attendant, standing united, but now that she was caught by the Crown Prince himself, she did not have the courage to admit it and remained silent with her head down.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Unexpectedly, Li Heng looked at De Yin. \"Princess Zheng, you are well-versed in palace rules. You tell me, what should be done.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">De Yin was frightened. She had never seen the Crown Prince with such an expression—imposing without anger, a natural sense of pressure. She stammered for a moment before saying, \"Servants who gossip about their masters should be caned twenty times.\"</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">\"Hmm, it seems you understand this rule well. You know what to do.\" Li Heng glanced at Lianzhi.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Before De Yin could plead for mercy, the attendant behind Li Heng silently covered Lianzhi's mouth and dragged her out. It all happened in the blink of an eye, leaving De Yin stunned.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">When she managed the Eastern Palace, she would have disobedient servants punished, but those people were outsiders. Lianzhi, however, was her dowry attendant. She had always cared for her deeply, but now she was being dragged out like a dead dog.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Li Heng seemed to anticipate De Yin's plea and said with a smile, \"Soon, Lady Wei will come into the household. She cannot compare to you and me in terms of affection and seniority. You are an old servant of my Eastern Palace, with deep seniority. If this kind of loose-lipped girl doesn't receive a lesson, she will cause trouble for you in the future. It's fortunate that I heard it this time. If someone else had heard it, it wouldn't have been good.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">De Yin had just been complaining about Zhao Liangdi and was afraid that Li Heng would bring it up. Now that he only punished Lianzhi, she breathed a sigh of relief, planning to send the best wound-healing ointment to her after the caning.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Before she could send the ointment, Yunzhi came in with a tearful face. \"Liangdi, Lianzhi has been beaten to death.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">\"What?\" De Yin could not believe it.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Yunzhi said, \"Lianzhi had been staying up several nights to make that hundred-flower skirt for you and caught a cold yesterday. But those damned people beat her too hard.\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">The usually lively Lianzhi was dead, and De Yin felt a chill. She even wondered if Li Heng had deliberately ordered such a severe beating; otherwise, it didn't make sense. When she had people beaten, no one had died.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">De Yin’s voice was hoarse as she said, \"Yunzhi, open my chest and use the money to arrange for her burial.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">The death of a servant was a minor issue and wouldn’t reach the Zheng family. The Zheng family could do nothing about Wei Liangdi marrying Li Heng either. At this stage, Zheng Fang couldn't stand up to Wei Duo.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">\"Jizhou is a place that Wei Duo has been eyeing for a long time. He might attack it in the future.\" Zheng Fang was still somewhat worried. Jizhou was an area he had managed for ten years, and he would not give it up easily.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">These important matters, he could only discuss with Madame Ji. Upon hearing this, Madame Ji looked at him and said, \"Last time, at Jiahui Pass in Qingzhou, were you really unaware of what happened? Fortunately, it was your son-in-law who calmed it down, turning a big issue into a small one. If it had escalated, how would Huiyin have handled the situation?\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\"></p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Zheng Fang felt a bit guilty. \"It was a momentary lapse in judgment, and it's all because that place used to be under Lü Wei's command.\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">\"Our daughter has written to us, saying that her husband is strict in military discipline and exceptional in leadership. If a real conflict breaks out, we may not be a match for them,\" Madame Ji said. Of course, she hoped Zheng Fang could unify the world, but they had to be realistic about their capabilities. Zheng Fang, though seemingly fierce, was all bark and no bite. If a formidable opponent were to attack, he might not be able to hold his ground.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">The last time Zheng Fang managed to extricate himself and redirect the blame, it was thanks to Li Cheng's strategy. Countless times, Zheng Fang had wished that if his son-in-law weren't a member of the royal family, but instead his subordinate, he would have made an excellent strategist.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">For now, all he could say was, \"He's still a good man.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Madame Ji shot her husband a disapproving glance, concerned that with the Weis' daughter entering the Eastern Palace, De Yin's days might become harder. Previously, when De Yin was favored, the old lady could enter the Eastern Palace quickly after submitting her name. But now, no one had summoned her for months, and she was sulking in her room every day.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Li Cheng, who had been praised by Zheng Fang for being a good man, had gone off to battle. The Yuzhou region next to Xuzhou thought that the Prince of Wei was attacking Jingzhou and tried to send someone over to test the waters, so Li Cheng personally led his troops to battle.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Before leaving, he sent over two skilled maidservants. Huiyin noticed that they were dressed neatly, with slender but strong waists, and they responded with proper manners, not the type to be too loud or rude, which she silently approved of. Upon hearing their names, Lingju and Linglu, she found them pleasant and saw no need to change them. Both were assigned to Qiufeng for training.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Qiufeng was already betrothed. She still wanted to serve in the Huaiyin Mansion, so Nanny Nan had found her a good match. The son of Lady Liu, Huiyin's dowry companion, was of suitable age. That young master Liu managed Huiyin's daily outings and some of her business affairs, and after marrying Qiufeng, the couple would continue to serve in the Huaiyin Mansion.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">For now, Qiufeng needed to train the new girls well before she could let them go to their new homes.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Unlike Le Yun, who had married the mansion's physician and appeared to be a respectable lady, but whose future might fall short compared to hers. In troubled times, even a well-off family like the Huangs could only afford some meat occasionally; their life wasn't truly comfortable.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">But she kept these thoughts to herself, as everyone had their own pursuits, but the work still needed to be done properly.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Relying solely on loyalty wasn't enough; one also needed capability.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Lingju and Linglu were smart and alert, and within ten days, they had learned most of what they needed. Huiyin was pleased when they served her sparrow tongue tea. \"This is my favorite tea,\" she said with a smile.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Lingju and Linglu thus became her personal maidservants.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">On this day, it was the Mu family's wedding, and since Huiyin had a good relationship with Lady Mu, she had to give her face and attend the wedding. Unexpectedly, she encountered Xue Huanhuan at the event. Huiyin remembered her as Yin Liyi's close friend. Seeing Huiyin, Xue Huanhuan immediately came over to pay her respects and asked to speak privately, leaving Huiyin puzzled.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">\"Is there something on your mind?\" Huiyin asked.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Xue Huanhuan said, \"Young Princess, I heard that the Little Prince is currently at war with Yuzhou. You might not be aware that Yin Liyi, or rather, Lady Xie, went to Yuzhou with her mother, Lady Yin, to visit relatives. Lady Yin's family is in Yuzhou, and now with the war, I'm worried something might happen to them.\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Ever since Xie Jiuyi took Cao Ping’s sister as a concubine, Huiyin had only been concerned with whether Xie Jiuyi or Zhao Hong won or lost battles and had not paid attention to Yin Liyi anymore, so she was unaware of these events. Xue Huanhuan was genuinely worried about Yin Liyi, showing how close they were.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Huiyin comforted her, \"Don't worry, I'll write a letter and send it with the Little Prince's personal soldiers when they arrive.\"</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">In reality, she wouldn't casually send a letter. With a war going on, no one would care about the Yin family. They were taking a big risk. Even Huiyin herself, when returning to her parents' home, had to be escorted by several thousand troops led by Li Cheng. For these two to travel back to their family's home in a region not controlled by the Prince of Wei, they were really quite bold.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Xue Huanhuan was extremely grateful when Huiyin agreed.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">However, Huiyin wondered about Xie Jiuyi, who had been poisoned during his last campaign. Regardless of the situation, Yin Liyi had been genuinely worried and had begged people to bring him back. Now that she was in trouble, where was Xie Jiuyi now? Moreover, if someone were to use the Yin family members to threaten Li Cheng, since they were related to the Prince of Wei and had known Li Cheng since childhood, how would he respond?</p><p id=\"paragraph-113\" data-paragraph-id=\"113\"></p>\n</div>"
  },
  {
    "number": 57,
    "title": "Chapter 57",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 57</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">In Jianye, Yin Lifang was also deeply worried about her mother and younger sister. Her cousin, Yin Lijun, was about to get married, and with her marriage approaching, Yin Lifang’s mother remembered that they had a talented and handsome cousin from her maternal family in Yuzhou. Taking the opportunity of her uncle’s grandson’s first birthday, she decided to return to Yuzhou. Little did they know that Yuzhou and Xuzhou would soon be at war. The situation was unexpected and dangerous.</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">As the saying goes, \"In times of war, a letter from home is priceless.\" As a Cifei, Yin Lifang understood that even the Princess Wei would find it challenging to visit her parents' home, let alone sending a letter to the frontlines.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">The Princess Wei tried to comfort her, saying, \"I believe the Yin family has a deep connection with the Little Prince. Your younger sister married Xie Jiuyi, who is sworn brothers with the Little Prince. He wouldn't ignore them in times of danger.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">In the Princess Wei's view, there was no need to worry. The Prince of Huaiyin was a subordinate of the Prince of Wei, and the Yin family was related to the Prince of Wei by marriage. Even if the Prince of Huaiyin had no personal connection with Yin Cifei, he should still do his utmost for the sake of the Prince of Wei. Especially considering that Yin Cifei's son might become the heir in the future, a person even Li Cheng couldn't afford to offend.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">There seemed to be a rift between Li Cheng and the Prince of Wei, which the Princess Wei had subtly noticed, leading to a slight change in her attitude towards Li Cheng.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Yin Cifei, lost in her worries, had no time to consider the Princess Wei’s attitude.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">When she was young, her mother had been particularly good to her. Unlike her younger sister, she lacked beauty and a pleasing personality. In the Prince of Wu’s Mansion, everyone praised her for being honest and thoughtful, but only her mother understood that her maturity was a result of difficult circumstances.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">It was her mother's kindness that led her to adopt her cousin and raise her as her own daughter, treating her as if she were born of her own flesh.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Of course, this trip to Yuzhou was also meant to help Yin Liyi relax. Her brother-in-law had taken a concubine of merchant background, which had caused Yin Liyi great distress. Even though her brother-in-law wrote to say he had never touched Cao Shi, she didn't believe him and became upset instead. Initially, Madame Xie had been indifferent to Cao Shi, but she was good at handling people. Despite her rich dowry, Cao Shi often sent delicate and elegant gifts, which didn't cause any aversion. Sometimes, she even sent handmade needlework.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Madame Xie refused Cao Shi's gifts at first, citing her status as a concubine, but Cao Shi continued to send them. She even copied Buddhist scriptures and made shoes for Madame Xie. Then, when Yin Liyi's eldest daughter fell into the water, Cao Shi jumped in and saved her, after which Madame Xie could no longer maintain her cold attitude towards her.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Yin Liyi observed these changes with anxiety, feeling helpless to alter the situation. Honestly speaking, Cao Shi didn't engage in any overt acts of favor-seeking. She called Yin Liyi \"sister\" respectfully, was filial to Madame Xie, and treated Yin Liyi with proper etiquette. She even took good care of Yin Liyi's children.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Perhaps it was because she was too good.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">In Yin Liyi's eyes, a concubine seeking favor should do so with the man, which Cao Shi didn't. She hadn't consummated her marriage and didn't run around trying to attract Xie Jiuyi's attention. Even if she had, Xie Jiuyi was in the army and wouldn't have noticed.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">However, the change in Madame Xie's attitude made Yin Liyi fear that Xie Jiuyi would eventually be swayed away from her. She became unhappy, and her mother’s trip to Yuzhou was intended to help her daughter relax.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Unexpectedly, they had terrible luck. They hadn't anticipated that both sides would be at war when they arrived in Yuzhou.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Compared to Yin Cifei's worries, Madame Xie had also been fretting for a long time. After years of being her daughter-in-law, Yin Liyi, who was straightforward and warm-hearted, was well-liked by Madame Xie's relatives. So, although Madame Xie had initially given Cao Shi a hard time, she slowly realized that Cao Shi wasn't trying to cause trouble. However, she didn't change her attitude towards Yin Liyi. They didn't expect Yin Liyi to face such difficulties during this trip.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Despite Madame Xie's complaints about Yin Liyi, Cao Shi showed no dissatisfaction. Instead, she said, \"Madame, there's no need to worry. I believe my sister is blessed and will be safe.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Madame Xie, still dissatisfied, replied, \"You make it sound so easy.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Even when Madame Xie spoke like this, Cao Shi remained calm and said, \"Your servant has connections through my brother's business in Yuzhou and can help gather some information.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"Are you truly willing to help?\" asked Madame Xie.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Cao Shi smiled and replied, \"Why wouldn't I help? I am of humble origins from a merchant family. Frankly speaking, it's because of my sister's kind heart that I dared to marry into this family. If it were someone else less agreeable, I wouldn't even have a place to call home.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Madame Xie thought about it and realized that Yin Liyi was as pure as white paper, without any scheming heart. After all these years of managing the household, Yin Liyi hadn't even entertained thoughts of seizing power. If it had been someone like the Princess of Huaiyin, known for her beauty and cunning, she would have charmed the Little Prince from the start, even abandoning her own cousin and expelling the old servants of the Grand Dowager Wu, including Li Cheng's wet nurse.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">If it had been the Princess of Huaiyin, Cao Shi might not have even been able to enter the door, and if she had, she would have been tormented until she ran away with her tail between her legs.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Thus, Madame Xie's impression of Cao Shi improved further, though she didn't show it outwardly.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Meanwhile, Li Cheng was busy deploying troops. He always ate and lived with his soldiers, never seeking special treatment. While Yuzhou had initiated the conflict, Li Cheng had thoroughly studied the region.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Yuzhou bordered Xuzhou, unlike Qingzhou, which was above Xuzhou and had Jizhou beside it. Yuzhou was located between Xuzhou and Jingzhou. If they could take Yuzhou, they could advance south to Jingzhou and form a pincer attack with Xie Jiuyi.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"Commander, our scouts report that the Yuzhou army might have set up an ambush at East Gorge.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Li Cheng paused for a moment, then said confidently, \"Don't panic. Prepare our artillery and siege weapons. I'll personally lead the fight against them.\" He wasn't afraid of them.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Even before this, after Li Cheng had trained the navy, he searched everywhere for skilled craftsmen to forge weapons. He understood the principle that a craftsman must first sharpen his tools to do good work. However, these were expensive, and the costs all came out of his private funds. After his wife joined the household, she saved a considerable amount of silver each year, which he almost entirely invested into this endeavor.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">If Yuzhou were to be conquered by him, he would possess Xuzhou, Yuzhou, and half of Qing Prefecture. Yuzhou was also a grain-producing region, so his territory would expand greatly. In the future, he might not need to rely on others, as these lands were fought for by his own men, every step of the way without relying on anyone else.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">After speaking, Li Cheng donned his armor, mounted his horse, and touched the chest guard his wife had given him. She doted on him, worrying about him as if he were still a child.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Injuries in battle were inevitable, but Huiyin worried about him, and there was little he could do to reassure her. He could only wear the chest guard.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">In fact, he originally had another chest guard, but it was considered too flashy and impractical, so he switched to a bronze one. This was also a gesture from his wife, a sweet burden, so to speak.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Zhang Song of Yuzhou was originally an officer under Lü Wei and served as the Yuzhou Governor. After Lü Wei's death, he started his own faction, and his first target was Li Cheng. To him, Li Cheng was of his grandson's generation and probably relied on the officers of his father, the Prince of Wu. He viewed Li Cheng as a mere youth.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Moreover, taking Xuzhou meant occupying a crucial stronghold. If the Prince of Wei and Zhao Hong weakened each other, he could move south and seize Jiangnan. Jiangnan was an excellent region, a first-class wealthy area.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">However, Zhang Song had underestimated Li Cheng, who proved to be both shrewd and skilled in military tactics. After a couple of engagements, Zhang Song was defeated.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Li Cheng didn't just want to beat him; he aimed for Yuzhou's territory. So, when Zhang Song fled, thinking Li Cheng would stop, he actually continued to pursue.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"This fellow wants my Yuzhou,\" Zhang Song realized.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">His advisor interrupted, \"Inspector, Li Cheng may be young, but he is quite scheming in his actions. Our ambush was seen through.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Zhang Song stopped him, saying, \"Fortunately, I was prepared. I didn't plan to use women as threats, but since I didn't expect to lose, bring the Yin family women here.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Previously, knowing that the Yin family women were in Yuzhou, Zhang Song had invited them to the Governor's mansion as a precaution.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">The advisor, clapping his hands in approval, said, \"Inspector, your foresight is impressive.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Zhang Song also thought he had been wise.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Meanwhile, Lady Yin, along with her daughters Yin Liyi and Yin Lijun, was under house arrest. Lady Yin cried daily, saying, \"I have brought you harm.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"Mother, don't say that. Who could have known this brute would pull such a stunt?\" Yin Liyi, being more composed than her mother, was, after all, the sister-in-law of the Prince of Wei and the wife of Xie Jiuyi. If Zhang Song had truly intended to do something, he would have done it already instead of keeping them well-fed.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">The youngest, Yin Lijun, had grown up under the guidance of her uncle and father. Despite encountering such a situation for the first time, she remained more composed than her aunt and older sister.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"Aunt, Second Elder Sister is correct. This brute is fighting Young Prince Wei. No matter what, Young Prince Wei won't ignore us,\" Yin Lijun thought more deeply.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Hearing this, Yin Liyi felt it made sense.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Lady Yin sighed heavily, hearing her daughters, \"If I hadn't come to Yuzhou, everything would be fine.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"Aunt, if you hadn't come, they would have used our maternal family to threaten us. How could we have known someone intended to do evil?\" Yin Lijun remained calm.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Seeing her younger cousin like this, Yin Liyi couldn't help but remark, \"You always seem so quiet and reserved, delicate and refined, yet here you are showing such wisdom.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Yin Liyi remembered how, as children, Yin Lijun loved to play with her older sister, Lifang. They became more alike as they grew. Lijun, who as a child liked to dress in bright reds and greens, grew up to be like her sister, eschewing makeup and adornment. In her youthful prime, she wore a plain, dark blue vest, with only a single pearl on the clasp hinting at her noble status.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">As they thought this, someone announced the return of the Governor to the mansion, and they looked at each other in surprise.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Meanwhile, Li Cheng aimed to take Yuzhou. His supplies were well-prepared and not just for show.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">At that moment, a vanguard reported that Zhang Song had shot an arrow toward the gate, with a message that Lady Yin and Yin Liyi were in Zhang Song's hands. If Li Cheng knew what was good for him, he would retreat; otherwise, Zhang Song would not be polite.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Li Cheng, gripping the note, slammed his fist on the table in frustration. \"Why did they go to Yuzhou when they were safe in Jianye?\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">He had repeatedly advised Huiyin not to move around freely. Even in Xuzhou, she rarely ventured out, only visiting a few trusted locations. Even so, he had sent guards to protect his wife, fearing she might be taken hostage. He hadn’t anticipated that his own family ties would lead to this setback.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Yuwendang said, \"Little Prince, Yu Prefecture is within easy reach. If we leave now, we might not get such a good opportunity again.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Every action needs a justifiable reason. Now that Zhang Song has made a foolish move, how can we pass up the chance to take over? Honestly, we’re all under Li Cheng’s command. Now that Li Cheng and the Prince of Wei are no longer as close, it might not be a bad idea to establish our own faction.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Li Cheng was clear in his mind, but there were things he couldn’t say directly. If he openly refused to help the Yin family, his men might see him as cold-hearted. Who would sincerely follow him then?</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Hearing this, Li Cheng feigned anger. \"This is indeed a good opportunity, but Lady Yin is related to the Prince of Wei by marriage. Besides, Lady Xie is General Xie’s wife. I can’t just ignore them.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Then, strategist Jian Tan stroked his goatee and said with a smile, \"Little Prince, we need to save the Yin family, and we must fight this battle. Why don’t we demand he release the hostages first? If he refuses, we’ll attack.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">\"Good, the military advisor makes sense.\" Li Cheng’s eyes brightened.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">If Zhang Song thought he could use the hostages to his advantage and refused to release them, Li Cheng could use that as an excuse to attack. But if Zhang Song released them, Li Cheng could still find a reason to attack. Either way, they were going to fight.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Soon, Zhang Song received a message from Li Cheng’s side, asking him to release the hostages first. Zhang Song huffed coldly, \"Does he think I’m a fool? Of course, I won’t release them. Tell Li Cheng that if he attacks, I’ll kill the entire Yin family.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">The Yin family women were beside themselves with worry. Zhang Song was still treating them well, fearing that any trouble would make the hostages useless, leaving him with no bargaining chips against Li Cheng.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"Mother, what should we do? This old rascal Zhang refuses to let us go.\" Yin Liyi was pacing anxiously.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Lady Yin was also at a loss. \"Yes, even when the Little Prince asked him to release us, he didn’t.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">The mother and daughter were secretly worried.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Huiyin saw Xue Huanhuan visit again and said, \"The Little Prince hasn’t sent anyone back, and there’s nothing I can do.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">In fact, this had nothing to do with her, but she couldn’t act like it didn’t concern her. If she refused to meet, it would be like directly breaking ties with the Xie family, which wasn’t the right time yet.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Xue Huanhuan suspected that Huiyin wasn’t trying her best and said, \"If we had informed the Little Prince earlier, we could have made arrangements. General Xie also said so.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">\"In fact, it would be better if General Xie requested an urgent 800-li dispatch. In these times of war, how could my letters get through? Just think about it.\" Huiyin didn’t try to stop her from seeking other ways.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Xue Huanhuan said, \"You’re right, I think the same.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">In reality, Xie Jiuyi was currently fighting on the battlefield, and even the Prince of Wei had personally entered the fray. How could he have thought that Yin Liyi had gone to Yu Prefecture and would ask Li Cheng for help? Li Cheng was already fighting for Yu Prefecture, which was once a territory the Prince of Wei wanted. Xie Jiuyi wouldn’t give up the territory for a woman, but Li Cheng might, given his familial relationship with the Prince of Wei, unlike Xie Jiuyi, who was an outsider.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">But since Li Cheng and Xie Jiuyi had a good relationship, he would definitely help.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Seeing that Xue Huanhuan didn’t say more, Huiyin said she was tired, and Xue Huanhuan took her leave. After she left, Nanny Nan and Fugui came in to speak. The two scolded the Yin family women, calling them troublemakers.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">\"Forget it, let’s not talk about him. I heard that the battle in Jing Prefecture is deadlocked, and even the Prince of Wei has entered the field.\" Huiyin thought about when she was the Empress Dowager in her previous life. The Prince of Wei seemed to have passed away, but she wasn’t sure exactly when.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Nanny Nan nodded. \"Yes, wasn’t it what Jiang girl mentioned a few days ago? She’d rather adopt a child than remarry.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Huiyin understood. \"Can you really find a man with backbone when looking for a husband? Jiang girl is a capable woman and naturally hopes to find a man who is both talented and good-looking. But if such a man exists, how could he be a son-in-law who marries into the family?\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">In that case, it’s better not to marry.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">But to be honest, adopting a child from someone else isn’t a long-term solution. An adopted child would grow up in ten years, and Jiang girl is only in her twenties. Once the child takes control of the family, there won’t be anything left for her. This is one of the greatest injustices in the world. Some men are stupid and dull, but as long as they are men, people think they are better than women.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Fugui said, \"Princess, let’s put Jiang girl’s matter aside. Jiang girl sent salt to the front lines last time and said that the Little Prince had defeated Zhang Song soundly. If the Little Prince can take Yu Prefecture, I say, who cares about the Yin family’s life or death? It’s not like we told them to go.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">\"If you understand this, do you think the Little Prince doesn’t? Whether he saves them or not, he has his reasons.\" In Huiyin’s view, Xue Huanhuan was still asking about the whereabouts of the Yin family women, which meant they were likely in Zhang Song’s hands. Li Cheng’s rescue attempt was probably for the sake of the Prince of Wei. It wasn’t time to break ties yet; the timing wasn’t right. If he didn’t save them, he was preparing to establish his own faction.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">But no matter which path Li Cheng chose, Huiyin didn’t think it was wrong.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">However, she didn’t expect that while Li Cheng was demanding Zhang Song to hand over the hostages, he was also advancing step by step. The Yin family women had hope before, but now the three of them were tied up like rice dumplings, gagged, unable to even talk to each other.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Outside, Zhang Song was heard cursing, \"Damn it, Li Cheng is impossible to deal with. He’s chasing me relentlessly and doesn’t even care about those Yin family women.\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Lady Yin and Yin Lijun trembled with fear, but Yin Liyi was stunned. She remembered that Li Cheng had once gone to great lengths to save Li Jing, even risking his life. This time, although he demanded Zhang Song release the hostages, he seemed indifferent to the threat of killing them. She began to doubt whether Li Cheng even wanted to save them.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">However, she still couldn’t believe that Li Cheng would abandon them. When they were children, although he called her “mud that couldn’t stick to the wall,” he never allowed the Princess of Wu to drive them out. Instead, he often sent them fine delicacies.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Finally, the Little Prince cornered Zhang Song at the edge of Yuzhou. Once he crossed this point, he would control all of Yuzhou.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">On the battlefield, Zhang Song paraded the three of them in front of him. He had already realized that Li Cheng didn’t care about the Yin family at all. If he did, why would he push him so hard? Li Cheng wasn’t afraid of him killing the hostages.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">“Don’t come any closer, or I’ll kill them,” Zhang Song warned.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Li Cheng laughed softly. “I don’t even know who these three people you’ve brought are. Do you think you can fool me, Zhang Song? Your time is up.”</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Yin Liyi’s eyes widened, and just as she was about to speak, she realized her mouth was stuffed. She was Yin Liyi! Zhang Song had made her look so disheveled that no one could recognize her.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Zhang Song then said, “You scoundrel, you have the heart of a jackal. You don’t even recognize your own relatives, even though your uncle treated you with great kindness.” He signaled for the gag in Yin Liyi’s mouth to be removed, hoping to create distrust between Yin Liyi and Li Cheng, even if Li Cheng took Yuzhou, he would still face suspicion from the Prince of Wei.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Once the gag was removed, Yin Liyi immediately shouted, “Little Prince, I am Yin Liyi, the wife of Xie Jiuyi. We grew up together. It was Zhang Song who captured me!”</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">She looked at Li Cheng with hope, but he only sneered. “So, Zhang Song, at the end of your rope, you try to deceive me with this trick.”</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">“Is it really me?” Yin Liyi stomped her foot in anxiety.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Li Cheng remained unmoved. It was Yuwendang who spoke from the side. “Little Prince, she does seem to bear a passing resemblance to Lady Xie.”</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">“He probably found someone on purpose. People can’t be recognized clearly in situations like this. Don’t listen to this old fool’s nonsense. No more delays,” Li Cheng said, seemingly unconvinced, and prepared to attack.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Seeing that Li Cheng was serious, Zhang Song panicked. Li Cheng truly didn’t care about these people. After all, he might not have even seen his own female relatives in the inner quarters more than a few times.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">“Wait, I’ll bring them closer so you can see clearly,” Zhang Song said, and ordered two strong soldiers to hold knives to the heads of the three women, forcing them forward.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">At that moment, two arrows shot forward and struck the soldiers holding the Yin family hostage in the forehead. Zhang Song realized too late that he had fallen into Li Cheng’s trap. It was already too late, and he could only attempt a desperate escape.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Li Cheng sent a few men to escort the three women back to the nearest Xuzhou, while he pursued Zhang Song.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">On the journey, Lady Yin, Yin Liyi, and Yin Lijun traveled together. Yin Liyi finally realized, “The Little Prince must have had this planned all along. I was terrified.”</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">“Second sister, didn’t you see it? If Zhang Song had killed us, the Little Prince wouldn’t have cared. Even though he pretended to save us in the end, he didn’t truly value us,” Yin Lijun saw the situation clearly. Zhang Song had intended to kill one of them to intimidate Li Cheng.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Yin Liyi refused to believe the worst of people. “Lijun, why do you have so many thoughts?”</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Yin Lijun, seeing Yin Liyi like this, thought to herself, she really is oblivious, always happy and carefree. Even a concubine from a merchant family could upset her.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Meanwhile, Huiyin had Nanny Nan escort the three women to the guest rooms. She prepared a feast to welcome them and informed them of the arrangements to send them to Jianye by boat in the coming days, with everything scheduled clearly.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Yin Liyi had some grievances with Huiyin, but since Li Cheng had saved her, she decided to let it go for his sake. However, she wondered if the Prince of Wei would let Li Cheng grow stronger now that he had taken control of Yuzhou. Judging by Li Cheng’s haughty demeanor, not allowing the Prince of Wei’s people to touch Xuzhou, Qingzhou, or Yuzhou, he might have his own ambitions.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Just as she was thinking this, she saw Princess Zheng raise her cup to drink, and Yin Liyi quickly raised her own cup.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">At that moment, a soldier rushed in and said, “Young Princess, something terrible has happened. The Prince of Wei has been killed on his way to attack Jingzhou.”</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Huiyin was shocked. “What did you say?”</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">Yin Liyi was also stunned. The Prince of Wei had passed away. Would her nephew inherit the title?</p><p id=\"paragraph-117\" data-paragraph-id=\"117\"></p>\n</div>"
  },
  {
    "number": 58,
    "title": "Chapter 58",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 58</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combination of Two Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The Prince of Wei, in his prime years, died under less-than-honorable circumstances, killed by assassins. His death left the entire Wei territory leaderless. After hearing the news, Li Cheng, who had just occupied Yuzhou, left General Guo Zhao in charge of Yuzhou and prepared to head to Jianye. Before departing, he instructed his trusted aide, \"Take two teams of men and fetch the princess. I'll wait for her at the ferry.\"</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huiyin had just seen off the three Yin family members who were in a hurry to return for the funeral. Originally, the official ship wouldn’t have been so fast, but they were provided with a merchant ship, and the three left in haste without any fuss.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Huiyin had just settled down, intending to write to Li Cheng for guidance on how to proceed. Normally, she would have gone to him, but times had changed, and she needed to wait for his instructions. However, funeral arrangements still needed to be made.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">With the Prince of Wei gone, would Xie Jiuyi, who was still fighting on the frontlines, retreat? These concerns weighed heavily on her mind.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Unexpectedly, Li Cheng sent messengers to fetch her. Huiyin hastily had the two sons gathered, with barely any time to pack. She left in simple, plain attire and hurried off.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">The eldest son, Jing'er, was fine, as he had always been healthy. The younger son was only a few months old, still in swaddling clothes, requiring extra care.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">After just two hours by carriage, she reached Li Cheng. The couple had no time to reminisce about their time apart before Li Cheng led her into the house to talk.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"Uncle Wei Wang has passed away. Did you know?\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin nodded, \"Early this morning, the three Yin family members left in a hurry for the funeral, without even having a hot meal. How could I not know?\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Li Cheng had advisors to consult with, but they had their own agendas, mostly afraid of taking responsibility or inciting internal power struggles. He and Huiyin were of one heart, and his wife was no ignorant woman. She had always been insightful, so he wanted to discuss this with her first.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Without beating around the bush, he said directly, \"Over the years, you know that Uncle Wei Wang treated me well, and I can't ignore this favor.\" When he had joined with his troops, he was too young to have any proper methods. But when he attacked Xuzhou, it was Prince Wei who provided the funds and grain.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Huiyin nodded, \"I agree. Now that he's gone, the court is too preoccupied to rely on. Wei Wang's two sons are still young and need your support.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">\"That's not what I'm concerned about. It's easy to manage the funeral; I've done this several times when my parents passed away. What I'm worried about is that while Uncle Wei Wang didn't mistreat me, he didn't show me exceptional favor either. The fertile lands were given to the Dowager's family members, and even the Huo, Yin, and Xu families received high official positions and generous salaries. I understand Xie Jiuyi; he's the most loyal. I'm afraid that after his uncle's passing, he will pledge loyalty to Li Jing, but I don't want to.\" Li Cheng was conflicted.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Huiyin immediately understood. In situations like this, someone like Zheng Fang would seize power without considering the consequences. But because Li Cheng had ambitions, he didn't want to act rashly.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">However, it was a good thing. Huiyin smiled, \"If you don't want to submit to Li Jing, that's fine. Right now, confronting them head-on will only unite them against us. If Xie Jiuyi wants to pledge loyalty to Li Jing, you should establish your own faction. Without Wei Wang, you now have Yuzhou, Xuzhou, and the southern part of Qingzhou. You're well-equipped and strong, and people will naturally flock to you.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">She understood Li Cheng's intentions. He didn't want to directly take over because, for the old faction of Wei Wang, that would be seen as ingratitude, and the world would ridicule him. Moreover, he had just taken Yuzhou, and his soldiers had just finished fighting. Another conflict with the old faction of Wei Wang might result in losing more than gaining.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">It was better not to get involved at all.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">However, Li Cheng wasn't entirely noble, \"When my father passed away, I was only thirteen and too young to manage the lands. Wei Wang's uncle said he would help me manage them. Now that he's dead, I should reclaim my father's fiefdom.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Huiyin praised, \"Good.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">After discussing with Huiyin, he went out to consult with his advisors, repeatedly stating that this trip was only for the funeral and warning against any agitation or instigation among his subordinates. His men praised him for his righteousness.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Li Cheng didn't want such a reputation for righteousness. All he wanted was to gradually build his strength and secure his territory.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">They traveled by fast boat and arrived in Jianye in two days. Huiyin first had Jing'er and Zhan'er taken back to the prince's mansion. Li Cheng, being meticulous and fearing that his sons might be taken hostage, sent a team of elite soldiers, one in the open and one in secret, to escort them back quietly.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">At the once magnificent Prince of Wei's mansion, there were still many carriages outside, but the once bright red doors were adorned with white banners of mourning. While people outside appeared composed, the air inside was filled with the sounds of mourning.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">The stewardess by Princess Wei's side came to receive Li Cheng and Huiyin. The old stewardess wiped her tears and said, \"With the prince gone, we are left with a house of widows and orphans. We are all counting on the Little Prince now.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Huiyin thought, you are quick to shift responsibility, but Li Cheng wouldn't take on the difficult tasks and offend people. Li Cheng listened and agreed politely but asked in detail, \"Has Uncle Wei Wang's body been brought back? What does the princess intend to do?\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">The stewardess replied, \"Princess Wei is utterly lost. The prince's death was sudden and in his prime. Even the coffin was provided by the Huo family. Old Uncle Guo is helping with the arrangements, but you are the backbone. We need to follow your lead.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Li Cheng sighed softly.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">At the funeral hall, Li Cheng wept so intensely that he collapsed to the ground, pounding the floor with his fists. Huiyin hadn't expected him to be so emotional. She considered herself quite capable of crying, her eyes turning red and large tears rolling down whenever she thought of something heartbreaking. But today, she encountered her husband, who was truly skilled in expressing his emotions.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Li Cheng wasn't like Huiyin, who shed a few tears and kept wiping them with a handkerchief. He was truly crying as he said, \"My dear Uncle Wang, you left so suddenly, without letting your nephew see you one last time. When you were alive, you were so good to me. Now you've left Auntie and your children behind. Don't rush too quickly over the bridge to the afterlife...\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Huiyin's face turned slightly red as she secretly glanced at Princess Wei and the two secondary consorts. Princess Wei was constantly burning incense at the funeral altar, as the incense must not be interrupted during a funeral. Yin Cifei tightly gripped Li Jing, while Xu Cifei was genuinely heartbroken, crying desperately, her white flower falling into the ash basin, not caring for her usual cleanliness.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Wei Wang had a son who was only one or two years old, still too young to understand. When a gust of wind blew, the wet nurse hurriedly carried the child away.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Huiyin thought to herself that in her previous life, Li Cheng had also passed away. If her husband, who was so kind to her, had died, how heartbroken would she have been? Even though she wasn't smart or capable, on the first day Li Cheng was injured, he still respected her and insisted on being intimate. Recalling this, her heart ached, and she began to cry.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Her crying confused Li Cheng. After all, she had only met Wei Wang a few times, and seeing her cry so sadly made it seem as if Wei Wang had died.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Before Li Cheng and Huiyin entered, the funeral hall had calmed down a bit. Wei Wang's wives and concubines were sad, but mostly worried about their future. Those with sons, like Yin Lifang, had hope, but the other concubines were merely going through the motions.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Now, with Li Cheng and his wife wailing, they were forced to cry miserably in the cold wind again.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">After Li Cheng finished crying, he spoke to Princess Wei for a long time, \"Auntie, now that Uncle has passed away, have you reported to the court? Where is the Chief Historian?\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">He was the only one who could ask this. Although Wei Wang was closer to the Guo and Huo families, Li Cheng was the only royal family member present, a prince, and thus held the highest status.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Princess Wei, coming from a noble family, understood these matters. Hearing Li Cheng's question, she replied, \"The Chief Historian has already drafted a memorial, but with fires blazing everywhere, how can we send it to the capital?\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">In truth, she didn't think it mattered whether it was sent or not. Would the Ministry of Rites send someone to inquire? So, she only went through the motions.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Li Cheng said, \"Your nephew rushed here from Yuzhou. I originally hoped to assist you, Auntie, but seeing everything is in order, I am relieved. However, since we are here, let your nephew and his wife stand vigil today. Auntie, you and the others should rest.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">His words were very appropriate. Seeing how disheveled and exhausted he looked, Princess Wei tearfully said, \"With your Uncle Wang gone, we are like a carriage without horses, feeling uneasy.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">At this point, Li Cheng didn't respond. Huiyin, listening, had to step in and comfort her, \"Uncle Wang has left a successor. Auntie, what do you have to worry about? In the past, King Wuling of Zhao inherited the throne at a young age and still achieved great things.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Li Cheng couldn't help but want to laugh at the mention of King Wuling of Zhao. He knew that Li Jing, though well-read and reasonable, lacked the resolve for such achievements.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">If he had no son, he would have to proceed cautiously, supporting Li Jing. This was part of his original plan, including giving generous gifts to Yin Cifei to act on Li Jing's behalf and gradually take over.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">But now, having already secured Qingzhou and Yuzhou, Jianye was within his grasp. Why would he need to rely on others to obtain it?</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Comforted by Huiyin's words and seeing the couple standing together, Princess Wei thought of Wei Wang's bravery and their marital bond, and tears fell again.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">With Li Cheng there, Princess Wei felt a great deal of relief. Because of him, the people of Wei Wang's mansion naturally looked to him for decisions. Huiyin felt a pang of sorrow, realizing that despite Princess Wei being the rightful leader, her gender caused the people of Wei Wang's mansion to side with Li Cheng.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Lunch consisted of three cold dishes, four hot dishes, and two soups—one savory and one sweet. Huiyin served her husband some old duck soup, saying, \"You've been busy since you arrived. Eat something first.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">They ate in the guest room. Li Cheng held a spoon but had no mood to drink the soup, as Xie Jiuyi had not returned yet.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Before Xie Jiuyi returned, Yin Liyi came back, completely unharmed. She went directly to Yin Lifang's residence without going home first. It was only after Yin Lifang mentioned her mother-in-law's worries that she went back. When asked by the old lady, Yin Liyi said she had survived a great disaster and would have good fortune, which reassured her mother-in-law.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Yin Liyi then visited her children and found her daughter addressing Cao Yi as 'Aunt' and enjoying osmanthus cheese and golden-threaded silver shoes with upturned toes, both gifts from Cao Yi.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"When did you become so close to her?\" For the first time, Yin Liyi realized that not all daughters showed unconditional love for their mothers.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Her daughter, Fangjie, who was older than Jing'er, spoke early. At three years old, she said, \"Aunt Cao has always been good to me.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Yin Liyi called the wet nurse and questioned her. The wet nurse, having been bought by Cao, had her chest full of silks and money. Now, when Yin Liyi asked, the wet nurse pretended to scold Cao, \"I don't know why, but since Miss Cao saved our girl last time, our girl cried and couldn't be comforted by us. Only Miss Cao could calm her.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">\"Fangjie hadn't been like this before.\" Yin Liyi felt an inexplicable annoyance but couldn't deal with her at the moment.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">For now, her nephew's matters were more important. With Wei Wang gone and no heir named, the situation was uncertain. According to tradition, if there was a legitimate heir, the legitimate heir would inherit; otherwise, the eldest would.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Thinking of this, she instructed the wet nurse to watch Fangjie closely and headed straight to Wei Wang's mansion.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">As soon as she left, the older women began gossiping about her.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">\"This madam doesn’t even care for her own children and yet blames others for going out of their way.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">\"Yes, she's never home. I really don’t know what she’s up to.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">The wet nurse who spoke had once been very loyal to Yin Liyi. She was a refugee whom Yin Liyi had saved. Even she couldn’t help but say something now.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Someone next to her egged her on, saying, \"Nanny Wang, why are you speaking that way about her too?\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Nanny Wang said, \"How dare I speak about her? I’m just standing up for the young miss.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">The other wet nurses looked down on Nanny Wang, thinking she had probably been bought off by Cao Ping's sister with money. They only secretly accepted money and didn’t dare to actually work for Cao Ping's sister. After all, Yin Liyi was the younger sister of Yin Cifei, and with the Prince of Wei gone, things were about to change in Wei. Who would dare to offend her?</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">When Yin Liyi arrived, it was already late in the evening. Yin Lifang was drinking hot soup. She feared that Xu Cifei might harm her son, so she had him sleep in her inner room. Seeing her sister arrive, she wasn’t surprised at all.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"Is Fangjie and Poyang doing well?\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">\"Sister, don’t worry, everything is fine.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Yin Lifang held her sister’s hand and said, \"We don’t know when your husband will return. Once he and the Little Prince are back, Jing'er will definitely be officially enfeoffed.\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">The two sisters exchanged many private words.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">That night, the cold wind blew through the funeral hall. The Princess Wei had two leather curtains hung to block the wind, and Li Cheng and Huiyin sat on stools beside the hall to keep vigil.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">In the evening, Huiyin ate some hot pot (a type of Chinese dish) and complained to Li Cheng, \"I love eating hot pot, but it always makes me break out. Look, a pimple popped up on my forehead right away.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">\"It’s mostly because you don’t get enough exercise and tend to lie around. I used to get pimples too, but it’s much better now,\" Li Cheng indulged in some childish banter with her.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Huiyin gave him a side-eye, \"You always say I’m lazy and like to lie around, but I really do get sore easily! And when you’re not home, I always feel like someone is sitting by my bedside. But with you here, even in the funeral hall, I’m not afraid at all.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Even though Huiyin was somewhat blaming him, Li Cheng wasn’t upset. Having someone accompany him while keeping vigil was more important than anything.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">That night, the couple kept each other company and only bid farewell to the Princess Wei the next morning before returning to the prince’s mansion in Jianye. However, Grand Dowager Wu wasn’t as sad as Huiyin had imagined. She even said to Li Cheng, \"Now that your Uncle Wei is gone, leaving behind widows and young children who can’t manage things, wouldn’t it be better if you took over?\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Li Cheng shook his head, \"Grandmother, the brothers from the Guo family are guarding key passages with their troops, and Uncle Wei’s former subordinates are all local gentry. It seems these people have started to guard against me.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Grand Dowager Wu sneered, \"What does that have to do with anything? The Prince of Wei is already dead, and his son is still so young. Can he manage the fief? No matter what, the world still belongs to the Li family.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"But I can’t take advantage of someone else’s misfortune,\" Li Cheng repeated himself a few times and even started to believe it.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Grand Dowager Wu sighed, \"You’re just too righteous.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">She spoke candidly to Li Cheng but wasn’t so polite to Huiyin, \"I heard your son cried all night. Aren’t you going to check on him?\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">As soon as Huiyin heard that Zhan'er had cried, she rushed to check on him. Fortunately, it was because the wet nurse had caught a cold, and the baby had become a little uncomfortable after drinking her milk. She sent the wet nurse for treatment and only allowed her to return once she was well. Huiyin also had the other wet nurses examined, having a doctor check their pulses one by one. Only after confirming they were all healthy did she feel relieved.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">She gently tapped her son’s little nose, relieved that he was safe.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">For a while, she rested in the side room next to Zhan'er, only returning to her own room after confirming that Zhan'er’s forehead wasn’t warm and that he was nursing properly.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">If you don’t have kids, it’s one thing, but if you do, you have to take responsibility for them.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">When Huiyin returned, Li Cheng had already gone to bed and was sound asleep, holding her personal sweat towel tightly in his hand. She pulled the blanket up around him and lay down beside him.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">From that day on, they only needed to go early and return late, without having to stay the whole day. Li Cheng planned to bury the Prince of Wei after the seventh-day memorial service. After the first seven days, Huiyin wouldn’t need to go to the Prince of Wei’s mansion every day. Grand Dowager Wu had only gone once. Being an elderly person, she was superstitious about death.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Surprisingly, the elders remained calm despite the circumstances. Wei Imperial Consort, although sad, was strong and healthy. On the other hand, Jianjia fell ill. Huiyin sent someone to check on her and gave her some desserts she usually liked.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">When Nanny Nan returned to report, she said, \"The eldest princess is devastated. I wonder if the Weis will send someone over?\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Huiyin smiled and said, \"They are probably still watching and waiting. The significance of marriage alliances is to join forces for mutual benefit, but with the Prince of Wei gone, the situation is now unclear.\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">\"It's only because our prince is righteous,\" Nanny Nan clucked. \"This time, during the funeral arrangements at the Prince of Wei’s Mansion, the quality of the alcohol was so poor that even a servant like me could tell the banquet was lacking.\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Li Heng wasn’t being generous; his forces are still spread thin in Yuzhou. The people in Xuzhou and Qingzhou have already been recruited once, and their strength is limited. What Li Heng is doing is practical. Occupying land rashly would immediately lead to war and attract attacks from all sides—that’s what happens when greed is excessive. Just like when his father rashly annexed the forces in the capital of Xizhou, it caused a mutiny. He had to retreat to Jizhou, but not without losses.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Nevertheless, the banquet at the Prince of Wei’s Mansion was indeed subpar. As the saying goes, only an expert can truly see the quality. Huiyin had been a mistress for several years, and those large-looking plates were filled with inferior dishes.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">The abalone was too small, the turtle was not fresh, and the steamed pork was tough and not smooth at all. Just as she was speaking, Li Heng came in and said, \"Xie Jiuyi has taken over Nanjun and rushed back for the funeral.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">\"The first seven-day period is almost over, and it’s perfect timing that he returns now,\" Huiyin said.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Xie Jiuyi really had some skills. He had been poisoned by Li Heng with a poisoned arrow before, and later, Li Heng himself was poisoned by one. It’s unclear whether Li Heng was behind it.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Xie Jiuyi was grieving as he fought against Zhao Hong and others. At this time, Li Heng brought Huiyin along. The brother of Consort Xu, who was a deputy general, was speaking passionately. \"The Prince of Wei once mentioned that he intended to make Second Brother’s son the heir. Here is the Prince of Wei’s own writing. Take a look.\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Consort Xu had been crying her heart out earlier, and everyone thought she was grieving because her support was gone. Some servants even came to watch the spectacle. Unexpectedly, the Prince of Wei had left this arrangement behind.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Women rarely had a say in such occasions. Even the Princess Wei, who personally preferred Yin Cifei’s son, Li Jing, had to let things take their course. At most, she would say a few words when Xie Jiuyi asked.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Huiyin watched as Consort Yin’s face turned slightly pale, and she sipped her tea.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Yin Lifang was afraid of losing her composure and tried to steady herself. She heard Xie Jiuyi outside say, \"Since ancient times, the legitimate heir inherits if there is one; if not, the eldest son does. The eldest prince should inherit the title.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">After saying this, Xie Jiuyi expected Li Heng to help and even proactively asked, \"Little Prince, what do you think?\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Yin Lifang breathed a sigh of relief when she heard it was Li Heng’s turn to speak.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Li Heng, however, replied, \"All my younger brothers are my cousins. Whether it’s the eldest son inheriting the title or whom Uncle Prince of Wei prefers, I have no objections. As General Xie said, it is in line with succession laws to establish the eldest. However, since I am currently managing the entire territory of the Prince of Wei, I believe we should choose someone virtuous.\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">As soon as he finished speaking, Consort Xu’s eyes lit up.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">This round of discussion yielded no results, and Yin Lifang took the opportunity to seek out Li Heng. This was also arranged by Princess Wei, who certainly hoped that Li Jing would become the next Prince of Wei. Consort Xu had always been close to Princess Wei, and the Yin family lacked powerful allies, relying on the Hos and Xies.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Li Heng thought Princess Wei wanted to discuss the burial of the Prince of Wei after the first seven-day period. Recently, he had selected a prime feng shui location for the Prince of Wei’s burial and had to relocate the surrounding people, which cost money. He would have to ask Princess Wei for the funds. Unexpectedly, Yin Lifang walked in.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">When Yin Lifang saw him, tears welled up in her eyes. \"Little Prince, I offer my respects here.\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">\"No need, no need. According to seniority, you are my aunt. I came to see the princess. Since she’s not here, I’ll leave.\" Li Heng wanted to avoid being alone with the newly widowed woman. Princess Wei was the main wife, and they had official business. He had nothing to discuss with Yin Lifang.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Yin Lifang wouldn’t let him leave. She knew he was avoiding suspicion but still said, \"I’ll just say one thing, then you can go.\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Li Heng looked at her, raised two fingers, and said, \"You’ve already spoken two sentences. I’m leaving.\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">It wasn’t that he was heartless, but the cause and effect were already settled. Why hold on to it?</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">As Li Heng was about to leave, Yin Lifang hurriedly moved forward to close the door and speak.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">……</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Consort Xu was leading Huiyin there, hoping she would witness the secret rendezvous between Li Heng and Yin Lifang. She was pretending to be a saint, but actually, she was a little vixen.</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">Unexpectedly, as they approached, they heard a man and a woman arguing fiercely. Consort Xu was stunned.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">Huiyin recognized the man’s voice and realized, \"Oh no, Li Heng’s old habits are resurfacing. I need to get over there quickly.\"</p><p id=\"paragraph-118\" data-paragraph-id=\"118\"></p>\n</div>"
  },
  {
    "number": 59,
    "title": "Chapter 59",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 59</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Double Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Make this clear, what do you mean by saying you owe me an apology? It sounds as if you and I have some kind of relationship. I've been very clear—I saved Li Jing because, before my mother passed away, she casually mentioned that I should marry you. But you married Uncle Wei Wang, and I felt guilty for letting you become a secondary consort. So, I saved your son to repay that debt, and now we're even. And yet, you actually thought I had feelings for you?\" Li Cheng was furious.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Yin Lifang clutched her chest, incredulous. \"You're saying you didn't save Jing'er for my sake?\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Li Cheng matter-of-factly replied, \"That's right. It was out of guilt. After repaying that favor, I felt completely relieved. Also, don't keep implying that I have feelings for you. The only woman I care about is my wife.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"Fine, since you're so determined to clear up any misunderstanding between us, I won't bring it up again. But let's talk about Jing'er here—\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Wait, what do you mean by 'clear up'? There's nothing between us. Are you all self-deluded? The three of you sisters together aren't even as beautiful as I am. Do you really think you're some kind of peerless beauties?\" Li Cheng felt like he was about to explode, feeling extremely wronged.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Just then, a soft voice called out \"husband,\" and Li Cheng darted like an arrow towards Huiyin. Huiyin, aware that Yin Lifang was most concerned about her son's future, noticed that Xu Cifei had already disappeared. She knew this had been a setup to bring her here.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Standing in front of Yin Lifang, Huiyin said, \"It was Xu Cifei who brought me here just now. I know you're all currently embroiled in this ongoing inheritance dispute, but this is not something we can interfere with. So, please don't make things difficult for us.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Seeing that Li Cheng was still about to argue, she quickly pulled him aside. \"Today, you're here to discuss the burial arrangements with Princess Wei's younger brother. What are you doing standing here?\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">With that, the couple left. Yin Lifang could still hear Li Cheng complaining, \"They switched things around like in the old tale of 'The Cat Switching the Prince.' I'm just here to talk about the burial.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Hearing this, Yin Lifang finally understood. All her assumptions had been self-indulgent, and Li Cheng's behavior towards her had been so harsh.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">After leaving, she went to see Princess Wei and shook her head. \"The Little Prince won't get involved.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Princess Wei stood up and looked at Yin Lifang. \"I didn't expect the problem to lie with him. He actually betrayed us.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Yin Lifang could sense that Princess Wei's gaze held a sense of her being useless, realizing that in the end, all the talk of morality and righteousness meant nothing. What mattered was self-interest.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">No matter how Princess Wei and Yin Lifang schemed, or how Cifei and her brother tried to manipulate things, Huiyin and Li Cheng had no intention of getting involved.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">However, that night, Xie Jiuyi came with Yin Liuyi. Xie Jiuyi and his wife were both quite familiar with Li Cheng, but their relationship with Huiyin was rather distant. They thought only Li Cheng would be there, so seeing Huiyin made them both feel uneasy.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Huiyin noticed this as well. It was as if they found Li Cheng easy to talk to but felt awkward with her presence.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"Little Prince, I have some private matters to discuss with you alone,\" Xie Jiuyi said, feeling that there were too many people around.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Li Cheng graciously gestured for him to proceed. The men left, and Huiyin, who had never been able to have a proper conversation with Yin Liuyi, sat facing her in awkward silence.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">However, Yin Liuyi gave a bitter smile. \"I didn't expect the Little Prince to not take our side.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Hearing this, Huiyin disagreed. \"Prince Wei has three sons. Although your brother's son is the eldest, Prince Wei left a personal letter stating that the second son should inherit the title. To the Little Prince, all of Prince Wei's sons are his younger cousins, and any of them could take the position.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"If that's the case, Jianye will be thrown into chaos…\" Yin Liuyi said, on the verge of tears.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Huiyin really couldn't understand how she could still hope that Li Cheng would remain loyal. It was absurd. All the royal offspring, and Prince Wei wasn't even the emperor. His sons weren't even crown princes. Why would Li Cheng pledge loyalty to them?</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Moreover, even the crown prince had many who didn't accept him. Prince Wei himself had set up his own kingdom in the south.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">So, looking at Yin Liuyi, she said, \"In this vast world, power belongs to those who can seize it.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">If Li Cheng wasn't up to the task, he would just end up as someone's pawn in the future.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">……</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Leaving the Huaiyin Mansion, Xie Jiuyi and Yin Liuyi boarded their carriage. Yin Liuyi said, \"I fear the Little Prince might have designs on ruling independently.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"I've always feared he might rise against us, but I'm relieved to see that he doesn't have that intention yet.\" Xie Jiuyi was actually quite relieved.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Yin Liyi looked at her husband and said, \"How could that happen? But this time, he’s demanding Wu Commandery. How come the Guo brothers didn’t put up any resistance? Wu Commandery is a major tax revenue region after all.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Recovering from illness was very costly, and Yin Liyi was well aware of that.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Xie Jiuyi said, \"He just took Yuzhou and has maintained a neutral stance on the Prince of Wei’s issue, so the Guo brothers are naturally pleased. The Xu Imperial Consort has only one brother. If not for Prince Wei’s support, I wouldn’t have let him take this credit on a silver platter. If her son inherits the title, they will be able to manipulate everything. However, Prince Wei would never send any private letter to inform them.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">He died too suddenly. If only I had more time, I could have asked him myself.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Seeing that her husband already had a plan, Yin Liyi felt much relieved, though thinking of Cao’s sister left her feeling disheartened.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Sure enough, no matter how much the Xu family stirred up trouble, Xie Jiuyi always had a counterplan. He first found the person who forged letters for the Xu siblings and then sought the support of the civil and military officials of Wei. After Prince Wei’s burial, he quickly had the senior secretary send a letter to the capital to report the news. A month later, news came back from the capital, conferring Yin Lifang’s son as the Prince of Yuzhang.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">This time, when Prince of Huaiyin came, he reclaimed the three commanderies of Wu, Piling, and Guangling, thus severing all ties between the Prince of Huaiyin and Prince of Wei’s lineage. Grand Dowager Wu also went to Xuzhou with Prince of Huaiyin and Huiyin. After returning, Huiyin enjoyed a peaceful life for a while, leaving the Yin sisters behind and putting an end to the so-called \"white moonlight\" chapter.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">In the past, Prince of Huaiyin had to report everything regarding Xuzhou’s governance to Prince Wei, but now he had full authority, bringing a new atmosphere.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Without the support of Grand Dowager Wu and Prince Wei’s family, Grand Dowager Wu didn’t have the confidence to cause trouble.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">While Huiyin enjoyed peace, although Yin Lifang had finally succeeded in making her son the Prince of Yuzhang, she didn’t experience the expected relief. The Huo family didn’t contribute much this time, while Princess Wei always wanted to keep the Prince of Yuzhang by her side. Xu Imperial Consort and her son didn’t get their wish but kept making small moves. Not to mention, Yin Lifang’s own family wasn’t peaceful either.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">What hurt her most was that Prince of Huaiyin completely ignored her, showing no affection whatsoever.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Another spring came, and everything revived. Butterflies and bees filled the jasmine flowers. Jing’er had started studying, and Zhan’er had learned to walk.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Ling Lu and Lingju brought lychee drinks over and smiled, saying, \"Princess, the prince has sent a letter. Manager Qiao delivered it.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">After Prince Wei’s passing, the title of prince in front of Prince of Huaiyin’s name no longer had the \"young\" prefix. Recently, he had inspected Qingzhou and Yuzhou. It was spring, a time to encourage farming, yet he still had the leisure to write a letter.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Huiyin read the letter, which mentioned many experiences. It said that people in Yuzhou ate more wheat products, and the flour there was better than in the south, so he had sent a lot back for her to enjoy whenever she wanted. He also mentioned that he had eaten his favorite fresh pork mooncakes in Wu Commandery and had sent several boxes back. The candied fruits and preserves of Wu Commandery were also sent back, and if there was too much, they could be shared with others.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">She put down the letter and saw the servants carrying boxes and chests inside. She couldn’t help but tease, \"He’s really something. Now that we can buy almost anything from the local market, he still went through the trouble of sending these.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Fugui and the others laughed, \"This shows the prince's deep affection for you.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Huiyin then had them open the boxes and chests. The flour was sent to the small kitchen, and the fresh pork mooncakes were baked and brought to her. They were indeed delicious, so she gave a box to Fugui to share with others. The candied fruits and preserves were used to make various pastries.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">In the afternoon, Jing’er returned from his studies and, finding the pastries delicious, ate a few more pieces.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"These are candied fruits that your father brought back. They are very fresh and not the sugary kind that makes you sick of them. I specially had them used for the pastries,\" Huiyin said with a smile.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Jing’er was remarkably composed for his age, able to sit still for long periods. Prince of Huaiyin said that when he grew older, he would teach him horse riding and hire a master to teach him martial arts, so there was little need for her to worry about their son.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Compared to her past life, where she lived in constant fear of being poisoned during her pregnancy, this life was far more peaceful.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Jing’er asked Huiyin, \"Mother, when will Father return? I miss him.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"Probably in another month or two. Spring is the time for planting seeds, and only then will we have food for the whole year,\" Huiyin replied. She didn’t mention that the food was needed to supply the soldiers.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">After mother and son finished their meal, Huiyin returned to her room and slept soundly. However, just before waking up in the morning, she had a dream that left her feeling upset for half the day, though she couldn’t remember what it was about.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Originally, she didn’t believe in ghosts and gods, but since she had been reborn, it was probably better to have some reverence for certain things.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">She decided to go to a temple to offer incense. Grand Dowager Wu, who rarely spoke to her, surprisingly expressed interest in joining her for the temple visit. Huiyin had no choice but to arrange it.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">To avoid unnecessary complications, Huiyin rarely ventured out. This time, she specifically chose a nearby temple, but Grand Dowager Wu, though she didn’t say much outside, started complaining in the meditation room.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"What a dilapidated temple! Look at this meditation room—it’s in such poor condition, yet they brought us here. You really don’t put much thought into things,\" Grand Dowager Wu said, shaking her head.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Huiyin could only admit her mistake. \"I don’t often leave the mansion, so I chose this place because the prince advised against traveling too far.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Grand Dowager Wu disagreed, saying, \"If we have to be this cautious even in Xuzhou, wouldn't that embarrass your prince?\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Huiyin, aware that the Grand Dowager was muddle-headed, kept her head down and didn’t engage much. She knew that Grand Dowager Wu often looked down on Xuzhou, considering it less prosperous than Jianye, but now she was like a toothless tiger. Since it was just idle talk, Huiyin couldn’t be bothered to argue.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Sure enough, after a few remarks, the Grand Dowager, fearing she might actually anger Huiyin, dismissed her.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">After leaving the dowager, Huiyin went to donate a hundred taels for incense money and paid her respects to all the bodhisattvas. Grand Dowager Wu, feeling exhausted, wanted to stay overnight at the temple. Since it was getting late and the journey back would be difficult, Huiyin decided to rest there as well.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">What was supposed to be a trip to spend money to avoid misfortune turned into a strange event. That night, sisters Lingju and Linglu were laying out floor mats in the room, while outside, Fugui and Dongshun were resting. Dongshun, having endured cold winters as a child and relying on her own resilience, always felt hot. That night, she carefully went to the restroom with the help of an old woman, being cautious the whole way.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">However, Huiyin, who always had trouble sleeping in unfamiliar places, planned to sleep after Dongshun closed the door. Unexpectedly, she fell asleep while waiting and only woke up the next morning to the sound of someone crying.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">\"What's going on?\" Huiyin rubbed her temples.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Fugui, who was folding clothes at the foot of the bed, explained, \"My lady, Dongshun went out to relieve herself last night and came back saying she saw a ghost. I was afraid she would disturb you, as she seemed frightened out of her wits.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Though Huiyin was usually afraid of ghosts, when something actually happened, she faced it head-on. \"I've heard that this temple is an ancient one. Due to the continuous wars in Xuzhou, whenever there's a battle, the common people take refuge in the temple. As a result, many have died here, and the place has become dilapidated.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">After saying that, she asked Nanny Nan to boil a bowl of calming soup for Dongshun and personally went to inform Grand Dowager Wu that they would leave today.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">While they were talking, Nanny Nan came in and said, \"My lady, we've caught the people who caused the disturbance yesterday. They are northern refugees who had been hiding in the temple. The current abbot doesn't allow outsiders in, so they were hiding here secretly. Yesterday, they didn't want Dongshun to expose them, so they pretended to be ghosts to scare everyone.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Northern refugees?</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Having never lacked food or clothing, Huiyin was largely unfamiliar with life outside the prosperous regions of Xuzhou and Jianye. She didn’t hold it against them for scaring everyone and was curious to learn more about the situation in the north. After hearing this, she had them brought in and asked questions behind a screen.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">\"You said you're from the north, where exactly are you from?\" Huiyin asked.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Among the group of men and women, Nanny Nan specially selected a clever girl of twelve or thirteen to respond. The girl's face was sallow, her hair fine and soft, and she had large white patches on her face, all signs of severe malnourishment.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">The girl quickly polished off the snacks and replied, \"I am from Jizhou. Last year, there was heavy rain and drought in Jizhou. We had about twenty acres of land, all of which were flooded. We managed to survive on our remaining grain until autumn, but then the drought came, and we had no harvest. Jizhou is also conscripting soldiers, so we had to flee south. We didn't expect...\"</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">With her father being conscripted and Jizhou suffering from both floods and droughts, countless families were in the same dire situation. Huiyin had Nanny Nan reward the girl with clothes, food, and twenty taels of silver, but she could only sigh in sorrow.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Life in Jizhou was tough, especially compared to the diligent governance of her father, Li Cheng. He personally inspected various regions during the spring planting and trained soldiers afterward. The time he spent with her was squeezed from his busy schedule. No wonder his territories, though not extensive, always fielded well-trained and battle-ready troops. It wasn’t a fluke but the result of his diligent governance.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Jizhou was indeed not peaceful. Originally, both Madame Ji and Madame Xu ate porridge made from the rice from their estates. Now, although they ate high-quality rice, it was much worse than in previous years.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">When Zheng Fang returned from the capital, he sighed again. Madame Ji couldn't help but ask, \"What's going on? You finally got to go to the capital, but you returned like this.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">\"The Crown Prince is increasingly favoring that Shi fellow. The emperor has appointed Shi Chong as the commander of the Imperial Guards. Today, he competed with me and actually won.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Madame Ji was greatly shocked. \"My lord, how could you compete with him?\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Zheng Fang held his forehead. \"I underestimated the young man and intended to show off my skills, but I ended up being taught a lesson.\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Madame Ji knew her husband's temperament well. With his martial skills, he looked down on everyone. It was likely that someone had provoked him into competing, so she asked further.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Sure enough, Zheng Fang said that someone had provoked him, and now that he had lost, he had no face.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">As the couple was thinking of a solution, someone reported that Zheng Fang's favorite concubine was sick. Madame Ji snapped, \"At a time like this, she’s still worrying about competing for attention? Send her away.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Madame Ji usually didn’t pay much attention to the concubines vying for attention. At her age, if she needed anything, she simply called for Zheng Fang. He treated her considerately. When she was unwell, she just wanted to rest. Their squabbles over jewelry and clothes were petty and harmless.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">At this time, to bother her was simply insensitive.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Zheng Fang seemed not to hear her, only saying, \"I lost face, but I'm afraid that Shi Chong has his eyes on my territory. He is from the Xizhou army. Last time I was defeated in Xizhou. Although he has fewer soldiers, they are all strong and robust.\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Though Zheng Fang looked tall and imposing, Madame Ji knew he was all bark and no bite, hiding many fears beneath his tough exterior.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Madame Ji said, \"There's no need for you to be afraid. Besides, you're getting older, so let the younger ones step up.\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">\"If they were like our son-in-law, I wouldn't worry. Our son-in-law has now taken Yuzhou, but it's a shame he didn't seize the Prince of Wei's territory while he was at it. If he had consolidated all of it, I would have considered defecting to him.\" Zheng Fang became despondent again.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Madame Ji smiled and said, \"What you said is quite amusing. Why would someone just give their large fief to you? Do you think Xie Jiuyi is easy to deal with? Last time, General Xie captured Qingzhou with little resistance. If it weren't for Lü Wei and He Guoguo joining forces to strike him, he might have continued his advance. How could our son-in-law risk offending him?\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Zheng Fang, who once harbored ambitions to conquer the world, was severely disillusioned by reality. Hearing Madame Ji mention the poor harvest, he became even more irritated. Madame Ji then said, \"Since you're afraid of Shi Chong making a move, we need to manage the lands of Jizhou carefully. I can see now that Crown Prince Li Heng is quite capable.\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Look, after the daughter of Wei Duo married into the family, it was said that she fell in love with the Crown Prince as well. Moreover, the daughter of the Wei family was pregnant, so it was likely that the position of Crown Princess would belong to that daughter of the Wei family.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Because of the Wei family daughter's pregnancy, the Crown Prince went to Donghua Temple to pray, where he was nearly attacked by bandits but was saved by Shi Chong. Thus, Shi Chong was appointed to the Imperial Guard. However, Madame Ji always felt that the whole incident was staged.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">The Crown Prince was versatile. When the Lü family fell, He Guoguo stepped in. Zheng Fang thought he could rally their old troops, but he exhausted his forces without gaining what he deserved, while the Crown Prince secretly gathered his own men.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Jizhou's proximity to the capital made it a vulnerable target. It was likely that her husband's true intentions would be exposed. If Jizhou fell, the Crown Prince's territories would increase, giving him a base for future campaigns.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Seeing that Madame Ji agreed with his thoughts, Zheng Fang felt even more that after Lü Wei's death, the Crown Prince revealed his true nature and was not as attentive to him as before.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">\"No wonder Huiyin once told me that it's wiser to stay out of such matters.\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Madame Ji didn't say much more seeing his discouragement.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">However, the couple didn't mention the poor harvest in Jizhou. To people of their age, such issues were temporary and not a long-term concern.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Unbeknownst to them, Shi Chong was discussing with Crown Prince Li Heng, \"There is a bandit in Jizhou named Guan Qing. Recently, the displaced people in Jizhou have been flocking to the mountains, where the strong ones have gone. In my opinion, Zheng Fang is extremely rude. He has repeatedly ignored your calls for mobilization, neither going to reclaim Qingzhou nor helping Zhang Song drive away Li Cheng. Now, the Prince of Huaiyin is gaining power. With the Prince of Wei gone, the Prince of Yuzhang's lands will likely fall into the hands of the Prince of Huaiyin. If we don't eliminate Zheng Fang now, he will control half the country in the future. Therefore, we must not be careless with Zheng Fang. Let these bandits stir up trouble and weaken Jizhou's forces. Then we will be ordered to suppress the bandits and take Jizhou.\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Li Heng clapped his hands and said, \"You are truly like Zhuge Liang. With you by my side, I have divine assistance.\"</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">The two of them continued their secret discussions.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Meanwhile, Huiyin had informed Li Cheng about the situation in Jizhou. Her main concern was the displaced people. She worried that they might sneak into Xuzhou through Jiahui Pass. If too many people came, it could lead to chaos.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Even the influential clans in Xuzhou frequently engaged in violent feuds. Li Cheng maintained order in Xuzhou by strictly prohibiting feuds, increasing patrols, and making examples of those who disobeyed. However, if too many displaced people came, trouble could arise.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">After receiving the letter, Li Cheng admired Huiyin's ability to foresee potential issues. Even he hadn't thought that Li Heng would want Jizhou at this time. After recently taking over Yuzhou and Wujun, he had to focus on governance and troop deployment and hadn't paid attention to other matters.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">For him, after the death of the Prince of Wei, even with Xie Jiuyi's assistance, Xie Jiuyi was just a subordinate. The Hos, Guos, and even the Xus wouldn't allow Xie Jiuyi to gain too much power. It was said that Xie Jiuyi had returned the daughter of the merchant Cao family to her family. Li Cheng guessed that Xie Jiuyi's actions were probably for Yin Liyi, but it was indeed a slap in the face to the Cao family.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">The Cao family, while technically merchants, were no ordinary traders and might seek revenge in the future.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Li Cheng thought it would have been better not to take her in the first place. Taking her and then sending her back was a humiliation.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Previously, Li Cheng would have advised Xie Jiuyi, but now he has no interest in doing so. He even hoped to create some chaos to his advantage.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\"></p>\n</div>"
  },
  {
    "number": 60,
    "title": "Chapter 60",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 60</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎First Watch◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">During the Dragon Boat Festival season, the humidity was oppressive, and after being outside for a short while, a fine sweat formed on the skin. Huiyin, who was naturally fuller figured, was particularly sensitive to the heat. Even though it wasn’t the peak of summer yet, she had two basins of ice brought in and had someone fan her before she finally felt cool.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">When Li Cheng entered and saw her drenched in sweat, he took out his own handkerchief to help her wipe it, even pushing the maid aside. The servants, understanding the situation, discreetly left the room. Li Cheng said, \"It's because you worry and think too much, which makes you prone to headaches and sleeplessness. You're deficient in both qi and blood, which is why you're always overheated and irritable.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">\"Whose fault is that? If you were by my side, I wouldn't have to worry so much,\" Huiyin complained, feeling that women shouldn't be too sensible, keeping everything bottled up.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Li Cheng thought about it and replied, \"It's my fault, really. I'm sorry for always leaving you alone at home.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Huiyin knew when to stop and said, \"You're doing it for me and the children. Never mind, let's have our meal.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Soon, the maids filed in, and the table was quickly laden with dishes: vinegar-steamed eel, braised yellow fish, roast duck, rich salted duck eggs, boiled and cold-tossed amaranth, and several kinds of soups, zongzi, and glutinous rice cakes.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Huiyin pointed to the small dish by her side and said, \"These are the appetizers I made. They're not greasy at all.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng, who often dined out, laughed and said, \"Nothing beats a home-cooked meal. When you eat out, the food is fine for the first day, but after that, it's hard to swallow.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"That's natural. When people invite you out, they always go for the most expensive dishes. You end up eating the same things over and over, and even the most exotic delicacies would become boring. The dishes at home might not be as fancy, but they're made to suit your taste, so they're different.\" Huiyin then handed him a cup of iced drink in a painted high-footed cup.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">What Li Cheng loved most about having meals with Huiyin was that they were both young and wouldn't be constantly told what not to eat or drink. He would joke, \"Since I'm drinking that, do you think I'm planning to live a long life? We both love drinking iced honey water, especially when eating in the summer. A cup helps to open up the appetite.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">The two clinked their cups before indulging in the feast.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">After the meal, as usual, Li Cheng had his sons come over. Seeing that Jing'er had started learning to write large characters, he was very pleased. He advised against being too precocious, as it could harm the brain. Seeing his younger son's snow-white and adorable appearance, he felt that all his hard work outside was worth it.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">He then looked at his wife and saw Huiyin yawn, as if tears were coming out. He felt proud, thinking, \"As long as I'm by her side, she's always sleepy.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"Huiyin, take a rest,\" he advised.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Huiyin waved him off, saying, \"I need to take a bath first to wash off the sweat. I can't sleep too much during the day, or I won't be able to sleep at night.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Li Cheng wanted to spend more time with her, but seeing she always had things to do, he came up with a plan: \"Wait for me; I have something to tell you.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"What is it?\" Huiyin, who was fond of cleanliness and felt uncomfortable with even a little sweat, urged him to speak quickly.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Li Cheng said, \"It's about Jianye. Xie Jiuyi is now in charge of all affairs in Wei territory. But before he went to Nanjun, he returned the Cao family woman that the previous Prince of Wei had given him. My spies reported that Yin Liyi simply couldn't compete with this woman.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"Speaking of which, General Xie is a good man. Actually, as long as a man treats a woman well, a woman doesn't need to play games.\" Huiyin sighed, who wouldn't want to be innocent and straightforward, saying whatever comes to mind? But women aren't allowed to be like that.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Li Cheng held his wife's hand and said, \"I think it would have been better not to agree in the first place. A person without trust cannot stand. The Cao family might not dare to be angry now, but who knows about the future? Xie Jiuyi, who is married to the Prince of Yuzhang's sister, holds a lot of power, which has upset many people in Wei.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">This was what made Li Cheng different from others. If he accepted something, he would try his best to make it happen, just like what he did with Yin Lifang back then. If it didn't work out, he would feel guilty and make up for it.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Huiyin said, \"Actually, a loving couple should not have room for anyone else. I wonder if the Cao family woman was helped to find a good match after being returned. Was she?\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Li Cheng shook his head, \"That's the problem; it's not easy to handle. How do you find a good match for her? What is considered good? A high-status family might not be interested in a merchant's daughter, and if we just arrange any marriage, we could risk upsetting the Cao family.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"In the end, this is the Xie family's private matter and none of our concern.\" Huiyin didn't want to talk about these matters of concubine rivalry.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Li Cheng said, \"But the Cao family wants to side with me...\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"Ah?\" She looked at her husband, \"I heard the Cao family is as rich as Deng Tong, even wealthier than the Jiang family. Are they siding with you so quickly? That's quite a surprise.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\"></p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Although Xie Jiuyi had returned the daughter of the Cao family, she feared it was a trap and wouldn't be resolved quickly.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Li Cheng had been feeling rather pleased with himself. It wasn't that he wasn’t observant, but after capturing Qingzhou and then Yuzhou, his power had greatly increased, making it seem normal for others to ally with him. However, seeing Huiyin's expression, he asked, \"What's the matter?\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Huiyin looked at him and said, \"I know you're now a regional power and it's normal for people to ally with you, but I tend to think carefully and consider all possibilities. You've reclaimed Wujun, and the taxes from Wei have decreased by at least half. I imagine everyone thinks you're waiting for Wei to fall into internal disorder before taking it over in one fell swoop. If you're thinking this way, wouldn't Xie Jiuyi be thinking the same? You can't sleep peacefully when someone is right next to you. You've never been good at proactively scheming against others, but what if someone schemes against you? Who knows if the Cao family's alliance is genuine?\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Huiyin's words resonated with Li Cheng, who felt enlightened. \"A wise wife's advice is worth its weight in gold,\" he said.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Seeing that Li Cheng had listened, Huiyin smiled. \"I know that with the Cao family allying with us, our resources would be even more plentiful, but this is just icing on the cake. Our Xuzhou, Yuzhou, and Wujun are already sufficient. Why do we need them flattering us? If they're sincere, wait until you retake Jianye to accept them.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Li Cheng nodded. \"You're right.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Normally, Li Cheng would find this suspicious, but now, after successfully taking several territories, he was confident. Huiyin didn't want to give him a wake-up call, but seeing that he had listened, she smiled and said, \"As long as you don't mind my meddling.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"How could I mind? Few people dare to tell me the truth nowadays, but you always do,\" Li Cheng said, a little embarrassed.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">In fact, when Huiyin spoke to him, she wasn't completely dismissive, because empathizing with each other, Li Cheng wouldn't casually meddle in her affairs either.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">With Huiyin's advice, Li Cheng went out to consult with his advisors. Seeing that Li Cheng remained steadfast under such huge potential benefits, they all felt they had chosen the right leader.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">However, Li Cheng did not reprimand the Cao family but said, \"You, the Cao family, wish to ally with me, and I am pleased. You may conduct business on my land. I have always advocated for free trade. However, if you rebel against the Prince of Yuzhang and hold a grudge against the Xie family, I advise you not to go too far. I trust General Xie's character; he wouldn't take advantage of you for nothing.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">The head of the Cao family had long heard of Li Cheng's righteousness, and seeing it for himself today, he found it to be true. Li Cheng was a man of integrity, which secretly impressed him, though he remained expressionless. \"General Xie used and discarded my sister. She almost took her own life at home. I really don't want to ally with him. I ask that you, Prince, accept me.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Seeing the Cao family head's urgency, Li Cheng smiled slightly. \"I welcome anyone who chooses to leave the dark side and join us. But I advise you for your own good: your sister is still young, and your family is wealthy. There are plenty of other options. I advise her not to despair. If you wish to find a young talented man for her, I am willing to be the matchmaker.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">The Cao family thought Li Cheng would jump at the chance, but he didn't take the bait.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Soon, tea was served, signaling the end of the meeting, and the Cao family head didn't dare to stay longer, leaving promptly.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">After he left, Li Cheng said to Yuwendang, \"Send someone to secretly follow him and see where he goes.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">After leaving Xuzhou, the Cao family head immediately went to Jianye and, three days later, disguised himself to meet Xie Jiuyi. The spy immediately reported back, and Li Cheng was surprised that Huiyin's guess had been correct. It seemed Xie Jiuyi understood him well and knew that when a person is in high spirits, they are most likely to lose composure.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">He immediately returned to Huiyin and said, \"I didn't expect you to be right. They are indeed putting on a show together.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"How I wish this weren't true. It would be nice to have an extra source of funds, and I always thought of General Xie as a truly devoted man. However, things often go against our wishes,\" Huiyin said.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Li Cheng was glad he hadn't been fooled. The Cao family certainly couldn't be fully trusted, but if they were used to transport grain and something went wrong, there would be trouble. Often, big plans are ruined by small characters.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Seeing Huiyin's kind heart and her refusal to take credit, Li Cheng felt even more that his wife was unparalleled and that his father-in-law, despite being tough, had produced a fine daughter.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Meanwhile, as Huiyin was deep in thought, she felt Li Cheng pinching her earlobe. Her face flushed slightly, and she turned away. \"In broad daylight, what are you doing?\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"You know what I'm doing. You were too tired yesterday, and there were things to do. Today, shouldn't we spend some quality time together? It's better than you always saying I lack variety,\" Li Cheng said, his eyes fixed on his wife.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Huiyin covered her mouth. \"You are really something. If someone hears this, what will they think of us? Those are private bedroom talks. Don't always say them out loud, or else, I won't be with you anymore.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">If before Li Cheng was someone who couldn't say nice things, now he said all sorts of sweet nothings, just to make Huiyin's heart flutter, before carrying his feather-light wife to bed.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\"></p><p id=\"paragraph-56\" data-paragraph-id=\"56\"></p><p id=\"paragraph-57\" data-paragraph-id=\"57\"></p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p>\n</div>"
  }
]