[
  {
    "number": 61,
    "title": "Chapter 61",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 61</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Second Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Not to mention how affectionate Huiyin and Li Cheng were, Xie Jiuyi and Yin Liyi also got along very well. The couple often had late-night conversations. Xie Jiuyi said, \"You should visit your sister more often these days. As the mother of the Prince of Yuzhang, they say that with a new ruler comes a new court. The Prince of Yuzhang is still young, so I ask her to take extra care.\"</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">\"There's no need for you to say that; I would definitely go,\" Yin Liyi replied happily, as her husband had sent Cao Ping’s sister away. Whether Cao Ping’s sister was sincere or not, she had always made her uneasy.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Xie Jiuyi noticed that his wife had become more cheerful and considered this a double success. He had never liked Cao Ping’s sister, who posed a threat to his wife. He had handed over the businesses in Nanjun, Yuzhang, and half of Jianye to the Cao family, returned Cao Ping’s sister’s dowry, and even arranged a new marriage proposal for her. The Cao family had agreed to this arrangement.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">However, he did not tell Yin Liyi much about these secret matters, only saying that he did not like Cao Ping’s sister and did not want to waste her youth. Nevertheless, Yin Liyi felt guilty and sent Cao Ping’s sister a generous gift of silks and jewelry.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Well, although the Prince of Wei is gone now, the people below are restless, and the biggest threat is the Crown Prince,\" Xie Jiuyi remarked worriedly.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Yin Liyi, of course, understood but felt helpless. \"People really do change. The Crown Prince wasn't like this before. He didn't have much desire.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Xie Jiuyi said, \"He didn't have any before because his wings weren't fully grown. But now that he has married the daughter of Zheng Fang, occupied several territories, and commands the navy in Poyang and Huai-Si, how could he not have ambitions now? These people have all defected to him, and we've been left out.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"What about Dongting Lake?\" Yin Liyi asked anxiously.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Xie Jiuyi patted her hand. \"Though I’ve placed people there, it’s not nearly as effective as when the Crown Prince was in charge. You don’t know how capable he is, especially in training naval forces. You must understand that Prince Wei had genuinely valued the Crown Prince and taught him everything he knew, only to find out that he had other intentions.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Yin Liyi was also anxious, but Xie Jiuyi didn't want to worry his wife. \"Don't worry, I'll take care of these things. As for the Cao family, I'll handle them too. You don't need to worry.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Although her husband said this, Yin Liyi still felt uneasy. The next day, when she went to see her elder sister Yin Lifang, she expressed her concerns.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"Sister, I always feel that everything is changing too quickly. Please don't laugh at me, but I still don’t believe the Crown Prince is driven by greed,\" Yin Liyi said, reminiscing about their childhood.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Seeing her sister like this, Yin Lifang, who had always been gentle, now had a hint of disdain in her expression. \"Why do you always remember your childhood? I wonder if you still have feelings for the Crown Prince. He secretly took over the late prince's territories, all while bullying us, a widow and orphans.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Yin Lifang usually spoke very appropriately, but ever since Li Cheng humiliated her, she had only felt hatred towards him. She had told her sister about this, but it was as if Yin Liyi didn't understand at all, always bringing up childhood memories.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Yin Liyi wasn't angry but just frustrated. \"Sister, what are you saying? I'm just sighing.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">\"Alright, alright, it's my fault,\" Yin Lifang said, realizing that she shouldn't have spoken to her sister like that. Changing the subject, she asked, \"How are you doing now? After Cao Ping’s sister left, is your mother-in-law still the same?\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Yin Liyi smiled. \"Yes, after sending Cao Ping’s sister away, my mother-in-law hasn't nagged anymore.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"Your husband is really good to you,\" Yin Lifang said enviously. She admired her younger sister; although she wasn't very clever, their parents and elder sister doted on her, and after marriage, her husband was highly positioned and remained devoted.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Yin Liyi, not wanting to upset her sister, only said, \"Every family has its own problems. By the way, sister, how is Huo Ping treating you? Does she dare to boss you around?\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"It's just for show,\" Yin Lifang said indifferently. Besides, Princess Wei didn't dare to go too far. Although she was once the official princess, and Yin Lifang was only a secondary consort, she was now the mother of the Prince of Yuzhang, and her brother-in-law was in power.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Moreover, in another year, Jianjia would marry Wei Duo's son, Wei Xiao. After their alliance with the Wei family, their influence would grow.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Yin Liyi, concerned for her sister, told her another piece of news. \"I heard that the Crown Princess's consort, Wei Liangdi, gave birth to a son and might be named Crown Princess. The Zheng Liangdi who was by the Crown Prince's side has no chance now.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">With Zheng Liangdi out of the picture, it meant that the Zheng family's backing had collapsed.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Yin Lifang smiled. \"This is good news.\" With the Zheng family failing, Li Cheng, who thought he could dominate the world with the Zheng family's support, would now be caught between enemies.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">As for the Eastern Palace, ever since Wei Liangdi gave birth to a son, fewer people were now flattering De Yin. When De Yin was in charge of the Eastern Palace and was favored, people would automatically send her favorite foods and items without her needing to say anything. But now, it was completely different.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">The standard meals from the main kitchen were placed on the table. Knowing that she didn't like fish, they still sent many fish dishes.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Yunzhi wanted to say something but didn't dare to complain, remembering what happened to Lianzhi. The masters would be fine, but the servants would likely suffer.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Moreover, a few days ago, while she was serving him, the Crown Prince had remarked that she smelled nice, his words carrying a hint of ambiguity. Yunzhi's heart raced.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Noticing the servant was silent, De Yin said, \"The Crown Prince often comes to see me, but I have not conceived. It seems I’m not destined to have children. Yunzhi, I have an idea. What do you think?\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">\"What idea?\" Yunzhi asked.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">De Yin smiled and said, \"When I entered the palace, four palace maids followed me. You and Lianzhi were my personal attendants. The other two were given to me by my grandmother to help secure my position. Especially Pan'er, she has grown into a beautiful young woman. I plan to have her serve the Crown Prince the next time he comes.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Yunzhi’s heart sank, but she forced a smile and said, \"Pan'er is indeed beautiful, but she has a frivolous nature. I fear she might anger the Crown Prince.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"No, she has become much more well-behaved since entering the palace,\" De Yin replied. Pan'er was born into servitude, and her family’s indenture papers are in De Yin’s possession. It was because she was not clever that De Yin found her easy to control.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Yunzhi secretly glanced at De Yin. She needed to plan her own future as well. Lianzhi had died a tragic death, and De Yin could no longer protect her people. Despite Yunzhi's dedicated service, De Yin was only promoting Pan'er. Would she, Yunzhi, have to bow to Pan'er, someone who had always been beneath her?</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Why should I accept that?</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Huiyin didn’t want to dwell on it and casually brought up, \"I heard that the General of the Established Might and Governor of Yuzhou, Guo Zhao, has lost his wife.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"Yes, his wife left him with a young son, a clever boy of seven or eight years old,\" Li Cheng was quite familiar with the Guo family's situation.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Huiyin then said, \"Jiang girl has moved from Jianye to Xuzhou recently. Although she has adopted a child, she still wishes to find a good husband. Guo Zhao comes from a humble background but has great abilities. He is currently in need of a wife, and Jiang girl was originally looking for an unmarried talented man. Guo Zhao's official position can compensate for his lack of unmarried status. What do you think?\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Li Cheng was very honest, \"From our perspective, it would be better if she didn't marry, so she could rely only on us and be fully devoted. Marrying her to Guo Zhao might embolden him.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">\"In that case, forget it. I was just spur of the moment,\" Huiyin replied, still able to distinguish what was important.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Li Cheng, upon hearing this, said, \"Well, if both Jiang and Guo agree, I, as their lord, will gladly give my approval. As they say, one should help others find happiness.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Don't force it if it feels wrong. What you said does make some sense,\" Huiyin responded.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">With Li Cheng's approval, the couple decided to act separately. Huiyin first called Jiang Bipbo and spoke directly, \"For someone of lesser standing, I wouldn’t consider them a worthy match for you. General Guo, now Governor of Yuzhou, is thirty-three years old and has a son who is seven or eight years old. I plan to bring the boy into the mansion to study with the heir. If you marry him, you will be the Governor's wife, and your clansmen will not dare to bully you. I usually don't like playing matchmaker, as it can cause resentment, but seeing that Guo Zhao is willing to remarry and this is indeed a good match, I feel compelled to arrange it.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">If it were Yuwendang who had lost his wife, it would be a different matter. Yuwendang, coming from a noble family, had very high standards even for a remarriage.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Of course, if Jiang Bipbo disagreed, Huiyin would choose another suitable lady for Guo Zhao. This was something the wife of a lord should do. Managing the household affairs of the generals would allow them to focus on their duties without worries.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Jiang Bipbo had actually met Guo Zhao before. When her clansmen caused trouble, Li Cheng had dealt with it together with Guo Zhao. He was indeed a strong and capable man. Although he didn't have Yuwendang's good looks, he gave a sense of security. Moreover, Guo Zhao held a high official position. A truly talented young man might not have such a high position and might not be able to protect her.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Jiang Bipbo made her decision quickly and without hesitation, \"I will leave it to the Princess to decide.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Seeing Jiang Bipbo agree so readily, Li Cheng was a bit uncertain, \"I heard Jiang girl is very picky. Why did she agree to remarry so quickly?\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">\"That's because I plan to have Guo Zhao's son join our mansion. Firstly, it will save her from dealing with a stepson. Secondly, in a more strategic sense, we will have a hostage. Moreover, when it comes to remarriage, it depends on who it is. He is the Governor of Yuzhou and the General of the Established Might, and your trusted confidant. Just as men admire strength, women do too,\" Huiyin explained.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Additionally, she added, \"If Jiang girl truly didn't want to marry, that would be another matter. But she does want to marry and hopes to find a good family. If we keep ignoring her needs, as the saying goes, an older unmarried woman can become a source of resentment if not properly settled. If she were to be lured away by someone else under such conditions, it would be worse. Moreover, I heard that Jiang girl and Cao Ping’s sister were close friends. If Cao Ping’s sister were to marry someone inferior to Jiang Bipbo, even if the Cao family doesn’t rebel, it would be difficult for them.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Li Cheng nodded in agreement, clearly impressed. \"With Huiyin by my side, I am truly like a tiger with wings.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"Let's wait and see,\" Huiyin smiled.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\"></p><p id=\"paragraph-55\" data-paragraph-id=\"55\"></p><p id=\"paragraph-56\" data-paragraph-id=\"56\"></p><p id=\"paragraph-57\" data-paragraph-id=\"57\"></p>\n</div>"
  },
  {
    "number": 62,
    "title": "Chapter 62",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 62</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Double Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After receiving Jiang Bipbo's consent, Li Cheng wrote to Guo Zhao, who also agreed.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Guo Zhao agreed quickly. Although Jiang Bipbo was a merchant's daughter, she was no ordinary one. As the head of a prominent salt merchant family, she was young and beautiful, with the backing of the Prince of Huaiyin and as the foster sister of the princess.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Although Huiyin had never organized a wedding before, she had been married herself and even intended to raise the grandeur of this wedding. Therefore, she persuaded Jiang Bipbo, \"This is your first marriage. A person's wedding day is the most attention they will ever receive in their lifetime. Since you are my foster sister, it's perfectly fine to have a grand ceremony.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Jiang Bipbo smiled and said, \"I leave everything in the princess’s hands.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Huiyin also had several boxes of dowry sent to Jiang Bipbo. Seeing that the boxes were painted with gold powder depicting dragons and phoenixes, it was clear that the contents inside were extremely valuable. Jiang Bipbo knelt down to express her gratitude, feeling immensely thankful.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">As they left Huaiyin Mansion, Steward Lin remarked, \"The princess is as good as her word. She’s found you an excellent match. Once you marry into Yuzhou, you’ll be the prefect’s wife, and the elders in your family have already been visiting more often.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">\"I moved my family's business to Xuzhou, originally intending to rely on the Prince of Huaiyin, but relying on others always felt unreliable. Look at what happened to Lady Cao when Prince Wei passed away; she was rejected. Now, the princess has told me that Guo Zhao is a capable man, so my future is secured. No one will dare to challenge me when managing the business.\" Jiang Bipbo was very satisfied.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Steward Lin smiled and said, \"Now, it seems your luck has finally turned for the better. Since the princess wants to hold a grand ceremony, we should invite everyone extensively.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Jiang Bipbo said, \"We should definitely invite Lady Cao. She’s been through so much with the Xie family, and it might do her some good to get out and enjoy herself.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"I'm afraid she might not come,\" Steward Lin thought. Lady Cao had suffered such humiliation that she might not want to attend.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Jiang Bipbo didn't explain but just smiled, \"If she refuses to come, just send the invitation to her family. Our families have business dealings, and if I don't send an invitation, people might think I'm looking down on them.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Steward Lin thought about it and agreed.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Both women had once been spinsters. Jiang Bipbo had initially hoped to become Li Cheng’s concubine but failed. Now, as the princess’s foster sister and soon-to-be wife of the prefect, this marriage could help her settle old scores. Steward Lin realized that Jiang Bipbo might be using this opportunity to assert herself, especially since Lady Cao had once sent her an invitation when she married into the Xie family, only to be rejected and face criticism now.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">When the Jiang family's wedding invitation arrived at Lady Cao's family, Lady Cao and her daughter were taking a walk in the garden. Although Lady Cao came from a merchant family, she had been cultivated by her family and was proficient in music, chess, calligraphy, and painting. Seeing the fallen flowers, she felt a kinship with them.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Lady Cao saw someone delivering a wedding invitation and immediately told her maid, \"Take it away.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">\"Mother, what is it?\" Lady Cao's daughter asked.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Lady Cao didn't want her daughter to know and lied, \"It's nothing, just an ordinary invitation.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Lady Cao's daughter was very intelligent and guessed immediately, \"How many wedding invitations have you hidden from me these days, Mother? The more you do this, the more it seems like I care.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">In fact, Lady Cao already knew that Xie Jiuyi had used benefits to silence her father and brothers. Sacrificing her was nothing. Yin Ping’s appearance and talents were actually inferior to hers, but General Xie loved her. This was something she couldn’t achieve no matter what tricks she tried.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Lady Cao's mother saw her daughter's reaction and had to tell the truth, \"It’s Miss Jiang’s wedding invitation.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Her? Is she getting married too? I thought she had adopted a child.\" Lady Cao reacted strongly.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Both were ambitious young women from merchant families. Knowing that Jiang Bipbo had been rejected by Li Cheng, she had felt a sense of relief, but now, seeing Jiang Bipbo getting married, she felt a pang of envy.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"Who is it? Is he adopting her?\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Lady Cao's mother shook her head, \"It's the newly appointed prefect of Yuzhou, Guo Zhao, the General of Jianwei.\" Seeing her daughter's complexion darken, she quickly added, \"It’s a secondary wife, meaning she’ll be raising someone else’s children.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Lady Cao's hand holding the handkerchief turned white.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"Would you like some fruit puree?\" Huiyin cut up fresh fruit and handed it to Zhan'er, but he shook his head.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\"></p><p id=\"paragraph-29\" data-paragraph-id=\"29\">**</p><p id=\"paragraph-30\" data-paragraph-id=\"30\"></p><p id=\"paragraph-31\" data-paragraph-id=\"31\">The wet nurse of Zhan'er said, \"Second Master came here after eating some fruit.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">So that's how it is, Huiyin smiled. \"Then I'll spend some time playing with him. These days, I've been preoccupied with other matters and have neglected my little one.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">This is how it is after marriage; one always has to think about the family, husband, and children, but there's less time for oneself. Actually, she was much more relaxed compared to ordinary people. Li Cheng only had her as his wife and had no concubines. She had also successfully given birth to two sons. Her in-laws had passed away, and even her great-grandmother-in-law had to avoid clashing with her. But still, it wasn't as leisurely as when she was in her maiden days.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">But then she thought, when she was in her maiden days, there were many things she couldn't decide for herself. Now, she could make decisions for everything and didn't have to be on edge like in her previous life.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Playing with children usually involves playing with toys, telling stories, or taking them out to play. Only by accompanying the child would they feel secure.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"Mother, I want to play with the big grasshopper,\" Zhan'er said, handing a grass-woven insect to Huiyin.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Huiyin held the grass, and when Zhan'er tried to grab it, she lifted it up. Zhan'er loved this game and jumped up to grab it. Huiyin played along with him until Li Cheng returned.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">When Li Cheng came back, he lifted his son high, which was always the children's favorite part.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Zhan'er was cheering now, calling \"Father\" with every word.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Huiyin tried to talk to him, but he couldn't hear her anymore.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Fortunately, after such energetic play, the child got tired and started fussing to go out. Huiyin let the wet nurse take him out to play while she got up to wring a cloth and handed it to Li Cheng.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Li Cheng took the cloth, wiped the sweat from his forehead, and sat down. \"The weather is getting hotter. This year's weather is unusual. The other day, I mentioned that even if I went out by myself, I was drenched in sweat.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Isn't that so? The weather is always stuffy, and the body feels sticky. Now, the plum rain season is coming again. I'm preparing to rest for a month,\" Huiyin felt that sleeping during rainy days was the best.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Hearing about the plum rain season, Li Cheng felt a pang of emotion. \"Don't you think the plum rain season makes it easy to dream, making everything feel unreal, like a series of dreams?\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Actually, the couple had a somewhat childlike innocence. They didn't discuss governmental matters together every day. Sometimes, Li Cheng would say some very childish words, and only Huiyin would discuss them with him.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">But about what he said, Huiyin felt quite emotional. \"I wonder if it's like Zhuang Zhou dreaming of being a butterfly, where reality and illusion blur. Husband, do you think people could have another life? What if you had married someone else?\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">\"If I didn't marry you, who would I marry? I can't even imagine not being your husband,\" Li Cheng always felt this statement was strange and that he shouldn't have brought up such a topic.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Seeing her husband like this, Huiyin thought that in her previous life, she wasn't actually his wife, but she couldn't say that out loud. She touched his cheek. \"If there's a war in the future, don't act rashly or let your guard down. Your survival is our hope.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Li Cheng rarely saw Huiyin like this. His wife was usually very open-minded. Even in the most difficult times, she remained optimistic. But at this moment, her sparkling eyes were filled with sadness, and his heart ached. He cupped his wife's face and asked, \"What's wrong?\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">In that moment, their love for each other deepened, and they thought more of each other than themselves.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Huiyin leaned on his broad shoulders, feeling very reassured.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">But before she could react, it became too mushy. Just then, it was announced that Lady Mu had come over. Huiyin tidied her clothes before going out. Lady Mu coming at this time meant she had something on her mind; otherwise, she would have sent a visiting card in advance.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"Your Highness, I have come to ask for your help,\" Lady Mu said, crying as she spoke.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Huiyin looked at her. \"Speak slowly. Over the years, you've always been respectful to me. If you have any difficulties, feel free to tell me.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Lady Mu then stopped crying. \"It's not about me. It's about your maid, Dong Shun.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Dong Shun? Ever since she returned from the temple, Dong Shun had been restless. Huiyin noticed she was no longer young. Just then, Lady Mu was there, and upon hearing that her maid was getting married, she helped arrange a match. It was with a scholar from her son-in-law's family. He was from a poor background but was talented and wanted to marry a capable wife who could manage household affairs. As they say, it's better to marry a well-bred servant than a poorly raised daughter. Dong Shun was quite beautiful and in the prime of her life, and Huiyin had prepared a nice dowry for her.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">But she had been busy with the Jiang and Guo families' matters and hadn't had time to follow up.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Now, hearing what Lady Mu said, Huiyin's heart tightened. \"Is she dead?\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">\"No, no. She's pregnant but was bitten by a dog and miscarried.\" Lady Mu had heard that Huiyin was particularly good to her maids. While this maid was insignificant, she didn't want to cause any hard feelings with the princess.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Huiyin felt relieved. Except for life and death, everything else was minor. She asked for the details, and although Lady Mu was hesitant, she mentioned it was due to her sister-in-law. The dog raised by her sister-in-law had accidentally bitten Dong Shun.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">A restless household can easily lead to chaos. Fugui, ask Physician Hu to go and check on Dong Shun. Use whatever medicine is necessary and see if there's anything else she needs help with. Huiyin could only do so much.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">……</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">After a while, Fugui went to see Huiyin. By this time, it was late in the evening. Huiyin looked at her and said, \"You’ve worked hard today. Take tomorrow off and don’t worry about coming in.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">\"Don't worry about me, my lady. Today, when Dong Shun learned that you were concerned about her, she was moved to tears and very grateful,\" Fugui spoke on Dong Shun's behalf while sitting on the footstool.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">\"You’re making too much of it. There’s no need to be so grateful,\" Huiyin didn't think it was a big deal.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">However, Fugui smiled and said, \"She’s already married, yet you still sent someone to check on her health. To be honest, even her own family wouldn’t have done so much for her.\" Seeing that Fugui seemed reluctant to mention Dong Shun's family issues, she only added, \"Dong Shun regrets it and has been saying that she still wants to come back to serve you.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"She needs to be strong. This is not a safe haven. Since she's married, she should focus on building her own life. By the way, was it a rabid dog that bit her?\" People always romanticize paths not taken. Dong Shun had previously complained that serving in the mansion was exhausting and that even if she stayed, she might not have been happy. It's better to focus on the path she's currently on.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Fugui shook her head. \"No, it was just an ordinary dog. You know Dong Shun loves eating ham. Since she was pregnant, she made a bone broth with ham. It smelled so good that it attracted the dog. But I don't think it was an accident.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"A lesson learned is a lesson earned. She should focus on her health, build her life, and learn from this experience,\" Huiyin said, having helped her stand up to her in-laws this time, but she couldn't do it every time. Even when her own daughter gets married, she couldn't be so meticulous, let alone for Dong Shun.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Fugui said, \"Yes, I've been advising her the same.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Li Cheng was also aware of Dong Shun's situation. He said to Huiyin, \"I told you to just marry her off within the household. You indulged her wishes, and now she wants to come back to serve. How can that be?\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">\"Even if she had stayed in the mansion, she would have eventually been married off, and who knows if she would have been any happier. There's no Shangri-la in life,\" Huiyin replied.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">For a moment, Li Cheng was reminded that his wife had also married into a distant family and probably had a hard time back then.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Since Fugui had duties and couldn't visit Dong Shun, it was Le Yun who went. She brought tonics with her and, upon seeing Dong Shun lying in bed, said, \"My husband told me that the dog wasn't rabid. You've had a miscarriage, but it didn't damage your foundation. Rest well, and you'll recover.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Even with Le Yun's comfort, Dong Shun wasn't happy. Her husband was a scholar who loved to save face and pretended to be noble. He wasn't a bad person, but even though they were attached to the mansion, the subtle sense that he looked down on her as a former servant was something she could feel, even if it was never spoken.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">She told Le Yun that she wanted to go back. After being frightened by a ghost, she always felt that there were too many troubles in the mansion. As a servant, even when scared, she couldn't cry freely. From that day on, she longed for freedom. The princess consort quickly agreed and didn't make things difficult, even bestowing a dowry. She married a scholar, but after the marriage, she felt it was far worse than the mansion.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">This family was a distant branch of a wealthy clan. They only ate two meals a day, had an egg once every ten days, and meat once a month. Her sister-in-law, the daughter of a scholar, wore patched clothes and was quite frugal in her ways. This was why Fugui and Qiu Feng didn't want to leave.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">She confided her sorrows to Le Yun, who could only advise her to live her life well. The princess consort had given her twelve trunks of dowry, one hundred taels of silver for the bottom of the chest, and some private savings Huiyin had accumulated over the years. The gifts from the sisters were also quite substantial. Even Le Yun's dowry for Dong Shun included two bolts of silk, two gold hairpins, two gold combs, a box of tonics, not to mention what Fugui and Qiu Feng gave. With all this money, Dong Shun should have lived well, but she just wanted to go back to serving.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">However, compared to Dong Shun's regret of marrying out of the mansion, Yunzhi was determined to climb up to the Crown Prince. When Li Heng came to De Yin's place, she deliberately adorned a flower in her hair.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">But she still held a tray in her hands and said, \"Liangdi, I just asked Pan'er to serve, but she couldn't even deliver tea properly and spilled the cup. Luckily, I saw it in advance.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">De Yin, seeing that the Crown Prince had already entered the inner room, signaled her to be quiet. \"Just take the tea over.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">In De Yin's mind, she had never thought of giving Yunzhi to Li Heng as a concubine. Firstly, Yunzhi was her trusted confidante and very capable. Secondly, Yunzhi's appearance was not suitable to be a concubine.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">But she didn't expect that after Li Heng and De Yin were intimate, he would still entangle with Yunzhi. Seeing that Li Heng was interested in her, Yunzhi became even more delighted. She often eavesdropped, mostly to know when to deliver water, but because of this, she had a general idea of Li Heng's preferences in bed. As a servant, she was more open-minded.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">At first, Li Heng was just playing along, wanting to use De Yin's people for his own purposes and to stabilize the Zheng family. But after a few times, he found the girl had her merits, and the secretive nature of their affair was quite stimulating.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Yunzhi couldn't wait for De Yin to discover them. At least then it would be legitimate, but unfortunately, De Yin never found out. When Yunzhi realized she was pregnant, she pleaded with Li Heng, \"Your Highness, it's my honor to serve you. Now that I'm pregnant, I know my status is low, and I dare not carry the royal heir. Please send me out of the palace. If Liangdi finds out, I have no face to see her again.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">This strategy of retreating to advance worked, and Li Heng immediately said, \"Since you're carrying my child, do you think you can leave? I'll just inform your mistress.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">For Li Heng, unifying the world was a daunting task, but he wasn’t hesitant to take in a servant. After all, children born to these low-status servants posed little threat.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Yunzhi got what she wanted and became one of the Crown Prince’s women, although she was only given the title of Chenghui and shared a residence with another Baolin. But she didn't mind.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">This incident was a huge blow to De Yin. Though Yunzhi claimed she needed to rest during her pregnancy and avoided seeing De Yin, she couldn’t help but speak honestly when her former mistress came to visit. \"Liangdi, this isn't a betrayal of you. After all, aren’t we both just servants who are pregnant?\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\"></p><p id=\"paragraph-91\" data-paragraph-id=\"91\">\"If you really wanted to, why didn’t you tell me earlier? Instead, you conspired to deceive me.\" De Yin truly felt deeply betrayed.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">\"But, Liangdi, you are a noble lady. No matter what mistake you make, the Crown Prince won’t do anything to you. However, for us servants, we can be beaten or scolded at will. When Lianzhi died, even you were unable to do anything. I’m only fighting for my own life. We servants were not born to be servants. Even though we have lowly lives, we still want to live properly.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">These words sounded harsh to De Yin’s ears. She believed they were only after wealth and status, willing to betray their mistress to become concubines, hoping to secure a better future by bearing children. She couldn’t understand why Yunzhi had distanced herself because of this, especially since she had also been deeply saddened by Lianzhi’s death.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Seeing De Yin in a daze, Yunzhi said reluctantly, \"Liangdi, don’t worry. After I give birth to the child, I will bring them to you in the future.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">\"I don’t want the sympathy of a servant.\" De Yin walked out with her back straight.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">---</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">As for the matters of the servants, Huiyin didn’t take it too much to heart. In previous years, the Mid-Autumn and New Year gifts from the Zheng family had been extremely generous. This year, however, the gifts were not as abundant and didn’t seem as fresh.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">It was probably due to the severe drought in Jizhou last year, Huiyin thought.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">The most pressing matter was Jiang Bipbo’s wedding. They hoped it would pressure the Cao family. Guo Zhao needed to remarry soon, and Jiang Bipbo was no longer young. While the wedding ceremonies were simplified, the betrothal gifts and dowry were still given in great abundance.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Jiang Bipbo’s parents had passed away, so Huiyin brought her into the mansion the day before the wedding, preparing for her to marry from the mansion. She even set aside a delicate courtyard for her.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">\"Tomorrow morning, you will prepare for the wedding ceremonies. I’ve already spoken to the Prince. A team of soldiers will escort you to Yuzhou. By now, our forces have cleared out most of the bandits and robbers in this area. You can rest assured,\" Huiyin said, holding her hand.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Jiang Bipbo looked at the new wedding dress hanging on the rack, the hem woven with golden threads into a phoenix. It was as if her life could be reborn from the ashes like the mythical bird. She shifted her gaze and thanked the person in front of her, \"Madam, you have taken me in as a sworn sister and shown me such care. I don’t know how I can repay you in the future.\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Huiyin waved her hand, \"I’m afraid you’ll blame me for arranging your marriage if you don’t live well in the future. You’re a smart person and know how to make a good life. Treat the past as clouds and focus on your future.\"</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">She didn’t like to say too many empty words, especially to those in difficult situations. If she could help, she would. If she couldn’t, she would step aside. Asking for repayment after helping someone was not something she valued.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">However, Jiang Bipbo took out two contract-like documents from her sleeve and handed them to Huiyin, \"My family owns eleven salt estates and eight large grain estates. Some shops and houses were given to my adopted brother, but the rest are in my hands. Without saying too much, I offer you two salt estates and one grain estate as private savings.\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">\"I cannot accept this.\" Huiyin quickly refused.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Jiang Bipbo smiled, \"If you don’t accept, you really don’t see me as a sister. If it weren’t for you, not only would I have been forcibly taken as a concubine by the Huo family, but I might have also lost the family wealth. I know you don’t need the money, but I have nothing else to offer. Please accept these, and in the future, they can be for the two young princes. As merchants, we often say that money is like a silent partner—having it brings peace of mind.\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Seeing her sincerity, Huiyin accepted. Jiang Bipbo was clearly pleased. Huiyin then briefed her on Guo Zhao’s situation and instructed her to develop agriculture and commerce in Yuzhou after she moved there. Finally, she handed her an exquisite book of fire-avoidance paintings and hurried out of the bridal chamber, almost as if she were fleeing.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">To her surprise, Li Cheng was waiting outside. She quickly ran over. \"I thought you had guests?\"</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Li Cheng smiled, \"I do have guests, the Cao family. This time, they are much more sincere and have even told me Xie Jiuyi’s grain storage locations.\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">\"Is that so? That’s wonderful.\" Huiyin hadn’t expected the Cao family to turn so quickly.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\"></p>\n</div>"
  },
  {
    "number": 63,
    "title": "Chapter 63",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 63</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Are they serious?◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After the death of the Prince of Wei, the young Prince of Yuzhang inherited a vast and prosperous territory. To the surrounding lords, it was as if a child were walking through a bustling market with a golden ingot in hand. Many expected that after the Prince of Wei's death, Li Cheng would create chaos, allowing them to gradually seize his territory. Now, seeing that Li Cheng had no intention of stirring up chaos, some couldn't help but make their moves.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Especially Zhao Hong, who had previously attempted to annex Jingzhou. But things didn't go as planned, so he regrouped and began to seize Nanjun. At that time, Xie Jiuyi, who was based in Jianye, dispatched General Huang Kuan to launch an attack. Huang Kuan was a veteran of Wei and had been fighting alongside the Prince of Wei since the prince's enfeoffment.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">\"We can hold out for a while longer,\" Li Cheng told Huiyin.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin smiled. \"Don't worry about them. The Cao family is hedging their bets, so don’t let your guard down.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Li Cheng nodded. \"I have my own judgments.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"Although Xie Jiuyi is managing the affairs of the Prince of Yuzhang, his position is not legitimate. Therefore, he has to stay in Jianye and cannot move around freely. If he leaves, something might happen to the Prince of Yuzhang,\" Huiyin analyzed.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Li Cheng was aware of this. He asked Huiyin, \"How are Ling Lu and Ling Jiu serving you?\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Huiyin thought for a moment. \"They are doing very well. Although they haven't been serving me since childhood, they have adapted well to my habits now.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"Hmm, don't give out their sale contracts casually in the future. These people serving closely to us know too much about our family. If this information falls into the wrong hands, it won't be good,\" Li Cheng said.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Huiyin understood. \"Alright, I've been focusing too much on their freedom. In the future, I’ll choose reliable servants from among our household slaves. Those hired temporarily shouldn't serve closely.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">This was a critical moment. As a mistress, after Li Cheng's reminder, she realized her approach had issues.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Li Cheng appreciated Huiyin's rationality and her willingness to correct her mistakes, rather than pretending she was right or paying lip service while secretly going against her words.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Why was Huiyin so good—not in the sense of being a people-pleaser, but in her ability to communicate effectively and truly understand others?</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"I want to send the New Year gifts to Jizhou earlier. Sigh, I wonder how Jizhou is doing now?\" Huiyin sighed, it was her natal family after all, and she couldn't neglect her father and brother.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">After saying that, she glanced at Li Cheng. Seeing that he didn't say anything, she knew in her heart that during the previous incident in Qingzhou, her father might have wanted to seize her husband's territory. Li Cheng wasn't foolish either. Although he had resolved the matter quietly for her sake, it didn't mean he didn't have his own calculations.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">He treated her well because she was his wife, but her natal family wasn’t his concern.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Just like how Huiyin never considered Grand Dowager Wu as part of Li Cheng's family. She only regarded Li Cheng and their children as her family. With this empathy, she couldn't ask Li Cheng to abandon his principles and stance for her sake.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Li Cheng stood up and finally said, \"The situation in Jizhou is beyond our reach for now. We can only focus on the present.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">As for Jiang Bipbo, a month after she married into Yuzhou, she wrote to Huiyin, saying that Guo Zhao had entrusted the management of the household to her and that they treated each other with mutual respect. She also sent local products of Yuzhou to Huiyin, who was very satisfied and shared some with Guo Zhao's son.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Nanny Nan was also pleased. \"Jiang girl has achieved her desire. This marriage was well done by you, and I'm also happy for her. Since she is your sworn sister, you've gained another relative.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Huiyin raised her hand to stop her. \"You can't completely trust the Jiang family. Right now, she’s close to me because I think of her when good things happen, but that might not be the case in the future.\" She couldn’t delve too deeply into this. In fact, Jiang Bipbo marrying Guo Zhao was better than a daughter from a powerful family marrying him.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">But if Guo Zhao's name was brought up, it might not be good if someone overheard.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"You always think further ahead than I do, but overthinking can lead to headaches. I think you should rest more when you're free,\" Nanny Nan genuinely cared about Huiyin.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Huiyin smiled. \"Don't worry, I understand.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">After saying that, she wondered how the Cao family's daughter would react seeing Jiang Bipbo marrying so well. What would Xie Jiuyi and Yin Liyi, the couple, think?</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Actually, Xie Jiuyi and Yin Liyi hadn't thought about this at all. Although Xie Jiuyi had replaced many of his trusted aides in Wei with his own people, he still couldn't fully control the situation. Families like the Guo and Huo families didn't necessarily listen to him, and even the Prince of Yuzhang, being young, was easily deceived.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Now with Zhao Hong's arrival, Xie Jiuyi feared the old general again and couldn't leave. He was somewhat exhausted.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Yin Liyi brought her daughter to visit her sister and mentioned that her sister treated Fangjie very well. The child was originally named Zhenfang, inspired by Yin Liyi’s own name.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"Sister, let your daughter stay with me for a few days this time so that you can take care of the younger ones at home,\" Yin Lifen said.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Yin Liyi smiled and replied, \"If you like her, I couldn’t be more grateful. It’s just that my daughter has a bit of an unusual personality, and I’m afraid she might disturb you.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Yin Lifen shook her head. \"What are you saying? I find your daughter to be very sensible. To be honest, Jing’er and I owe our current positions to your support and your husband’s help. I see that Jing’er gets along well with your daughter, so why not strengthen our bond through marriage?\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Strengthen the bond through marriage? Yin Liyi readily agreed. Li Jing had a compassionate and gentle nature, while her daughter was always domineering. They would actually make a good match.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Moreover, the Prince of Yuzhang was royalty, after all. If he were to rise to power, their daughter’s status would rise with him. Of course, she didn’t dwell too much on these matters, as it was still too early to talk about them. However, since she had always had a good relationship with her sister, she was also willing to strengthen their bond through marriage.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">The two sisters chatted for a while, and when the topic turned to Yin Lijun’s marriage, Yin Liyi said, \"Mother has been looking into potential families lately, but we don’t know which family to choose.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Now that the Yin family’s status had risen significantly, their previous prospects were long left behind. Who wouldn’t want to secure a good match for their daughter?</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">However, Yin Lifen had other plans. \"Don’t worry, in a few days, all the noble ladies here will come to pay their respects to me. If I find a good match, I’ll recommend her to you.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"What you say makes sense, even my husband agrees. Our nephew is still young, and we can’t rely solely on the Xie family,\" Yin Liyi said, feeling a pang of sympathy for her husband.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Yin Lifen, who was once a cifei, had hidden her abilities from others. Now, as Empress Dowager Yin Cifei, she no longer needed to hide her actions. She decided to find an extremely prestigious match for Yin Lijun, and within three days, she had made her choice.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">The match she selected for Yin Lijun was the second son of General Gao Ningzhi, Gao Hua. While Gao Hua wasn’t the eldest son, his mother was Gao Ningzhi’s legitimate wife, and his maternal family was a prominent clan in Jianye. His uncle was currently taking over Li Cheng’s naval command in Poyang.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">The Yin family also met Gao Hua, and seeing his proper appearance and prestigious background, they were very satisfied.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">The betrothal gifts from the Gao family arrived promptly, causing a traffic jam in the entire street. At that moment, Cao Shi happened to witness it. She was still unmarried, and although her family had the means to marry her off, being a woman who had been returned to her family meant she could only marry into a lower-status merchant family.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">The passersby were discussing, \"This marriage is between the younger sister of Empress Dowager Yin Cifei and the son of General Gao. No wonder it’s such a grand affair.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Cao Shi looked even more displeased and said to Lady Cao, \"The Xie family promised to compensate us, but is this how they compensate? My family has contributed more than the Jiang family and is wealthier, yet we are treated like this.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Even Lady Cao was angered. Although they were merchants, Xie Jiuyi had entrusted the business of the entire Nanjun to the Cao family, but these were benefits they rightfully deserved. When the Cao family helped Xie Jiuyi attack Nanjun, the Prince of Wei had already agreed to these terms.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">However, to be humiliated by Xie Jiuyi like this, would the Cao family continue to receive these benefits? Such sudden changes in policy were truly unbelievable.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">\"His aunt’s daughter can marry into the Gao family. But what is the Yin family? They were never a high-ranking family to begin with. Yin Cifei was just the daughter of a clerk in the Prince of Wu’s mansion. They weren’t even considered a poor family. It was just luck that she bore a son, and now they act all high and mighty. It’s only because the Prince of Huaiyin is benevolent and righteous, unwilling to bully them as widows and orphans,\" Lady Cao ranted indiscreetly.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Cao Shi hurriedly tried to stop her, \"Mother, please say less. What if someone hears?\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Lady Cao patted her daughter’s hand, \"At this point, what is there to fear? That Yin Liyi, what is she? A woman who has traveled extensively and was once captured by rebels in Yuzhou. Who knows if her virtue is still intact?\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">\"Mother, you’re letting your anger cloud your judgment,\" Cao Shi advised, though she didn’t entirely disagree in her heart.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Neither Yin Liyi nor Xie Jiuyi had anticipated that the Cao family, which had been hedging its bets, would fully align with Li Cheng because of Yin Lijun’s marriage.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">As Li Cheng had said, major events in the world often fall apart due to minor issues.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">……</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Huiyin was doing embroidery, which she hadn’t done in a long time and felt rusty. Today, she was embroidering a pine-green pouch with black ink thread, and she adjusted the design she had drawn. Just then, Li Cheng entered, and from the sound of his footsteps, she could tell he was in a good mood.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"Why are you so happy? Look, I was just about to make you a pouch. Do you like this design?\" Huiyin held it up for him to see.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Li Cheng expressed his liking and laughed as he sat down to help her thread the needles, \"You haven’t picked up embroidery in a long time, and you’re doing this just for me. Of course, I’m delighted. By the way, I have another piece of good news to share with you. The Cao family has agreed to sponsor two thousand stones of grain for me. The supplies have already arrived, and I plan to use this to seize Yanzhou as soon as possible.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Huiyin was surprised, \"The Cao family? Are they serious?\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\"></p>\n</div>"
  },
  {
    "number": 64,
    "title": "Chapter 64",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 64</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Second Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Yanzhou had always been the most favorable passage northbound, and Li Cheng had long set his sights on it. Being young, he was eager to try. Huiyin knew nothing about the wars outside, but she said, \"I won’t say much, but since the Cao family has sent grain, you should properly organize your troops for the war. But don’t forget, I’ve hidden a thousand bushels of grain in Hongruo Temple in Xuzhou. If you find yourself in dire straits, just take it. Here, this is the jade token.\"</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Li Cheng had heard her mention preparing a thousand bushels of grain before and thought she was just talking, but he didn’t expect her to actually do it. Although it might not be needed, it was a pleasant surprise. \"Thank you,\" he said.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">\"Between a couple, there’s no need to be so polite. As for the grain sent by the Cao family, let me remind you again, check if there’s any poison in it. And if this battle lasts until winter, have you prepared winter coats for the soldiers?\" Huiyin modified her drawing with a stroke and felt it looked much better.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Seeing that Huiyin didn’t take any credit and spoke casually, Li Cheng was actually quite curious. \"I always feel you’re someone who doesn’t seek rewards for your kindness. Why are you so magnanimous?\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Huiyin smiled at his words and said, \"I’m not a saint, how could I be magnanimous? It’s just that I don’t help those I don’t want to. If it’s too troublesome, I won’t bother. To put it this way, if Jiang Bipbo wasn’t related to you and came to ask me for help on her own, I probably wouldn’t have helped. I’m not the kind of saint you think I am. Honestly, the truth isn’t always pleasant.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">In the end, she just felt that this was her way of being. She would never help others when she herself was in trouble. But if she did help, she didn’t expect anything in return, as high expectations often led to greater disappointment.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Li Cheng suddenly ran over and hugged Huiyin. \"I promise I won’t let you down. If I ever fail you, feel free to hold me accountable.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"Why would I hit you with your thick skin? You’re only good-looking because of your face.\" Moved by her husband’s words, Huiyin couldn’t help but caress his handsome face.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">But Li Cheng wanted to express his determination. Seeing Huiyin’s gentleness made him even happier, and he lifted her up and spun her around until Huiyin felt dizzy and tapped his arm for him to stop.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">What has come over him? He used to be a valiant and formidable young general, but now he seems to have lost his composure.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Li Cheng had always been overly eager to execute his plans. After marriage, he had become more steady. He had long intended to take Yanzhou, and now with a strong army, he was itching to make a move.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Of course, Li Cheng still needed to make preparations, during which Huiyin couldn’t help much, so she simply rested more. As Nanny Nan said, it wasn’t good to worry too much.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Her life was quite leisurely, while Yin Liyi was anxious like an ant on a hot pan. She was confiding in Xie Jiuyi, \"I didn’t expect the Cao family to pull the ladder after climbing up, so despicable.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"This person was probably bought by the Prince of Huaiyin a long time ago to deceive me and make their move. Now, because of this, we almost lost Nanjun, which was a sure thing. If I hadn’t had a backup plan, I would have really been tricked by the Cao family.\" Xie Jiuyi was also angry. He had given many military business deals to the Cao family, but they had gone so far, thinking he was a fool. Fortunately, he discovered it in time.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Yin Liyi sighed, \"Now the Cao family has fled to Xuzhou, and there’s nothing we can do. I keep wondering if it’s because of the Cao family woman—\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Xie Jiuyi interrupted, \"No, the Cao family wouldn’t betray us because of a woman. A woman means nothing to them.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">With such an exchange of interests, it was clear that the Cao family wouldn’t be so angry over a woman, especially since Li Cheng hadn’t taken a Cao family woman as a side consort.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"I’m afraid it’s because the Cao family saw that the young Prince of Yuzhang was too young and decided to switch allegiances.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">His reasoning made sense to Yin Liyi, and she also thought that if only Li Cheng hadn’t tried to stand on his own, by now, the Wei territory could have rivaled Wei Duo’s. But there were no \"ifs.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">After being convinced by her husband, one day, Yin Liyi accidentally overheard Lady Xie complaining, \"Actually, what’s wrong with taking a concubine? I find Cao Ping’s sister to be gentle and considerate, not someone who seeks favor. Why can’t she be tolerated?\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Madam, please don’t let the mistress hear this,\" the servants advised.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Lady Xie lowered her voice, probably still complaining about Yin Liyi, which hurt her deeply. She thought, \"That Zheng Huiyin, who is still a consort, doesn’t allow the young prince to take concubines. Why isn’t anyone saying anything now?\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Unfortunately, she couldn’t show her feelings. If she wasn’t careful, people outside would say she was jealous. Even her younger cousin, Yin Lijun, was so virtuous. After marrying in, when her monthly period came, she offered her maid to her husband. Even her sister didn’t care about these things, as if only she found it problematic.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">In fact, Huiyin encountered a similar issue because the Yanzhou governor wanted to offer his daughter to avoid war. The daughter of the Yanzhou governor was renowned in Xuzhou for her beauty and exceptional embroidery skills, even creating paintings with her needlework, and was called a goddess by the people of Yanzhou.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Nanny Nan and others were frightened when they heard this and advised, \"That Lady Huo was once associated with the Prince of Wei. If the young prince doesn’t take her, it’s fine. But the daughter of the Yanzhou Duke, who is like a goddess, if the young prince falls for her, what will happen to you? There’s a saying, when the benefits are significant enough, people will be tempted.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">The Yanzhou governor said that if Li Cheng took her as his primary wife, they would offer Yanzhou without a fight.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">\"Nanny Nan, the Yanzhou governor must know that the prince treats me well and is deliberately setting a trap.\" Huiyin thought for a moment and found it interesting.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Even Empress He wouldn’t dare promise to marry a daughter of the Zheng family in exchange for Ji Province. Such situations were likely a classic 'beauty trap,' where a beautiful woman was used to manipulate or deceive someone into making a poor decision. If he didn’t take the Yanzhou lady, when soldiers died in battle, they might think he valued beauty over power, which would be detrimental to his rule. But if he did take the lady, there would be another problem. Zheng Fang might attack from Qing Province, and the beauty trap in Yanzhou could succeed, allowing them to not only repel Li Cheng but even take Qing Province to the south.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">But if the seduction plan of Song's daughter from Yanzhou fails, and Yanzhou continues to fight.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">No matter the choice, Yanzhou remains in an unassailable position, which is why it still holds a place among the contending lords. They are truly not to be underestimated.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Nanny Nan asked, her voice trembling, \"What if the Prince falls for the trap?\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"Then what he'll be waiting for is my retribution,\" Huiyin wouldn't let him off.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Even though she had been serving Huiyin for years, Nanny Nan still shivered. Just moments ago, the couple was affectionate, but now they could turn on each other in an instant.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Yuwendang, who was following Li Cheng, couldn't help but say, \"In my humble opinion, my lord, even if you marry the Song's daughter and then attack Yanzhou, it wouldn't be a problem. If you marry the Song's daughter and Yanzhou truly surrenders, we get the land for free. But if Yanzhou doesn't surrender, we'll just fight as planned.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">To him, adding another wife wouldn't be a big deal for his lord.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Li Cheng turned to look at him, \"Nonsense, we're taking Yanzhou not for a woman. The people of Yanzhou broke their word and aided the enemies during the Qingzhou rebellion. There's no need to mention this anymore.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Now that he had finally become independent, being independent meant making his own decisions. Did Yanzhou think he was a three-year-old child?</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Yuwendang had always been loyal to Li Cheng, and as they continued their march, Governor Song, growing increasingly desperate, said, \"How come he's completely unmoved by what I said?\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Governor Song had only one daughter late in life, who was exceptionally beautiful and had a unique fragrance, so he cherished her as his most prized possession. The areas around Yanzhou, like Yuzhou, had all been taken by Li Cheng. Seeing Li Cheng's fierce advance, Governor Song prepared for battle on one hand and tried to set Wei Duo and Li Cheng at odds with each other by offering his daughter's hand in marriage on the other.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Of course, if Li Cheng were willing to marry his daughter as his primary wife, being a descendant of the Wu King, he might have a chance to become the ruler of the world in the future, and Song would become the father-in-law of the emperor.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Unexpectedly, Li Cheng wasn't falling for it and didn't mention the marriage alliance at all, only continuing his relentless campaign to seize cities and territories. He wouldn't slow down.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Seeing this, Governor Song immediately sent another envoy. Seeing that Li Cheng was young and handsome, the envoy couldn't help but say, \"Young Prince, out of respect for your prestige, I wish to offer my daughter to you. If you become my son-in-law, I'll give you Yanzhou. What harm is there in that?\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"Song old man, stop babbling. I welcome your surrender, but your troops must lay down their arms and vacate the area. As for you, thinking that little Yanzhou could make me abandon my wife and children, you're really courting death.\" Li Cheng snorted coldly.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Seeing that this young man was unmoved by any attempts to sway him, Governor Song immediately sent his son to fight Yuwendang for a few rounds. Li Cheng's army was mostly very young soldiers who had just conquered Yuzhou a few months ago and were eager to take Yanzhou and gain Li Cheng's favor.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">In Li Cheng's eyes, it didn't matter whether you were from a noble family or not; he only cared about your abilities. Just look at Guo Zhao, who came from a humble background but became the governor of Yuzhou and even married the wealthy Jiang family's daughter, essentially getting land and money.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">This time, Governor Song lost again, but he still hadn't given up. He used a large sum of money to bribe a persuader to come again, bringing a portrait of his daughter, the Song's daughter. Li Cheng looked at it and pointed to himself, saying to everyone, \"I, Li Cheng, don't even have a concubine. Why don't I understand? Everyone wants to send me beautiful women? Do I look like someone obsessed with lust?\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">In his own perception, he was incredibly wise and heroic. If they were going to try to bribe his advisors and generals, that would show some skill, but all they did was send beautiful women. What kind of terrible reputation did he have that made everyone think this way?</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Advisor Jian Tan accidentally discovered this quirk of Li Cheng's, that he could be overly argumentative. He usually didn't show it, but he could get very serious about certain things. Right now, he wished he could drag Old Man Song out to argue until he’s blue in the face. It was clear that his fighting spirit was through the roof.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Jian Tan hurriedly stepped forward to comfort him, \"My good lord, Governor Song is just being vulgar himself and thinks you are also a vulgar person. Please, my lord, don't bother with him.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"What you say makes sense, we'll continue advancing tomorrow,\" Li Cheng slammed the table, completely unwilling to waste any more time with Governor Song.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Huiyin's daughter: Our Lord has embarrassed himself in front of everyone.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\"></p><p id=\"paragraph-54\" data-paragraph-id=\"54\"></p>\n</div>"
  },
  {
    "number": 65,
    "title": "Chapter 65",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 65</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎First Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">In Li Cheng's view, Yanzhou was a barrier. If this barrier remained, he would not be able to expand. However, if he fully captured it, he would be directly facing various warlords. It would no longer be the time when the Wei King was around, when he was just sent out to fight, which didn’t directly concern him.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Yet, he had to proceed. To him, the Prince of Yuzhang was too young, and although Xie Jiuyi had the capability, he lacked the prestige to lead the overall situation. His abilities were there, but not strong enough to be exceptional. This could easily lead to problems.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">It was like when the emperor was sick and unable to attend to affairs, causing unrest below. Who would listen to whom? Everyone saw the torn opening, and they all rushed to spill blood, vying for position. He and his wife often talked, and although she frequently showed anxiety in front of him, she rarely displayed weakness in front of the servants. If the master was at a loss, the servants' minds would become restless.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin received Li Cheng's letter in late autumn. The large tree in front of the courtyard had its golden leaves piled up like a small tower, and the maids quickly cleaned them all up. After reading the letter, she seemed much more at ease.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">This was not an era where reason prevailed; it was a time of survival of the fittest. If you were strong and had a mighty army, your voice would carry weight. Li Cheng did not disappoint her. Amidst the cold political calculations, there was a touch of warmth.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"Today we'll have 'Dialyssus,' and send a portion to the Guo family's young master,\" Huiyin arranged with a smile.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Nanny Nan immediately started assigning tasks. Seeing that the princess was in a good mood, she guessed it must be good news from the frontline and felt happy too.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Jing'er had grown a year older this year. He was tall but very naughty. During dinner, he was still playing with a grass-woven grasshopper. He only shrank his neck and started eating after Huiyin gave him a glare.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">There was no choice. She would rather be disliked by her son than have him be unruly and unfocused.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">In this world, people respected the powerful. Even if you had many flaws, as long as you were strong enough, people would follow you. Conversely, if you were a good person but lacked ability, people would look down on you.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin understood that this belief was deeply flawed, but she couldn’t really teach her child according to the sage books. A child taught that way would not fit in.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">After the meal, Jing'er was alone in the small study writing his homework. Huiyin did not allow anyone to bring tea or water to disturb him, as this also cultivated his concentration.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Once he finished, her son brought the homework over. After Huiyin checked it, the mother and son went outside for a walk to digest the food.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">At this time, no matter if he wanted to climb trees or run and jump, Huiyin would not stop him. Sometimes, when in the mood, she would even play shuttlecock. Jing'er sometimes missed his father, but it was rare. Most of the time, he was happy and content.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">The next morning, Huiyin had a visitor. It was none other than Xue Huanhuan, whose husband had gone to Nanjun to participate in the war as a trusted aide of Xie Jiuyi but unfortunately passed away last month.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">She was in mourning, a common taboo, but after her husband's death, she returned to her natal family. With her mother, Lady Xue, they came to visit, and Huiyin gave the Xue family some face.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"Please accept my condolences.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Huiyin could only say this. The pain of losing a husband was not something an outsider could truly empathize with.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Xue Huanhuan's eyes were slightly red. \"Thank you, Princess, for your comfort. I was originally from the Wei region, and after my late husband's passing, I returned from Jianye. I also thank you for accepting me.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">If the Huaiyin Mansion did not accept her, she would have had to stay in Jianye. Otherwise, since they were no longer under the same fiefdom, it wouldn’t be possible to come and go freely.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Don't be like this. I was worried that you were still in mourning, but now that you've come over, just live a good life at home.\" Huiyin was just saying polite words.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">The old lady of the Xue family was originally a princess and had a good relationship with Grand Dowager Wu, so they gave the Xue family some face.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Lady Xue knew her daughter was in mourning and it wasn’t appropriate to stay long in the Huaiyin Mansion. Seeing that Huiyin didn’t say much, she took her daughter out. Once Xue Huanhuan got on the carriage, she said, \"Mother, the fighting on the frontline is fierce, but I saw the princess was quite calm.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">She and Yin Liyi were very close, and Yin Liyi had actually been anxious.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">However, Lady Xue said, \"She might not be as calm as she appears, but if she panicked before anything even happened, how would the people in the fiefdom view her?\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"You're right. By the way, I heard the Cao family has moved here. Has the Cao sister been betrothed to anyone?\" Xue Huanhuan, close to Yin Liyi, knew that Yin Liyi had been troubled by the Cao sister before, but fortunately, General Xie was wise.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Lady Xue shook her head. \"I haven't heard about that.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">After all, Lady Xue wouldn’t know about a merchant's daughter.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Xue Huanhuan became a widow at a young age. Lady Xue knew that she and her husband had a deep bond, but after a year of mourning, she would need to find another marriage for her daughter so that she could have support for the rest of her life.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">However, she could not find another military man for her daughter's next marriage. Soldiers tend to die young, and if her son-in-law were to pass away, it would leave a large family of orphans and widows—what would become of them?</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">This time, the defeat in Nanjun—who knows how many lives were lost.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">The Cao family thought the same. They remarked, \"I've been saying that General Xie is incompetent. Look, now there's a problem. Fortunately, we've moved to Xuzhou, and the prince has also entrusted the business south of Jiahui Pass in Qingzhou to us. He hasn't mistreated us.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Madame Cao smiled and said, \"Yes, during the Mid-Autumn Festival, I brought my daughter to pay respects to the princess. With our status, we wouldn't normally have the chance to see the princess, but she praised the Cao family for their righteous deeds and said that my daughter was a fortunate person. Her words almost brought me to tears.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"I think that the Prince of Huaiyin is young and formidable. If we manage to take Yanzhou, it will show that the lord we follow is the right one. Now that we've just joined his side, we shouldn't be too eager for success. Once the prince understands our intentions, our status will be similar to the Jiang family's,\" the head of the Cao family said.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Madame Cao, being a woman, couldn't involve herself in business matters, but her daughter's marriage was of utmost importance to her. Seeing the men full of ambition, she didn't want to dampen their spirits, so she waited until everyone dispersed before going to her daughter's room.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Currently, Miss Cao lived a leisurely life in her boudoir, but she felt a lingering anxiety in her heart, unsure if she would be married at her age.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">When Madame Cao arrived, Miss Cao stood up and greeted her, \"Mother.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Madame Cao smiled and said, \"Are you working on embroidery again? There are so many people working on it; there's no need to put in so much effort.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"I have nothing else to do, and embroidery helps pass the time,\" Miss Cao replied, lowering her head.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Madame Cao said, \"Don't lose hope. In a few days, I'll get some invitations, and we'll go out more. How will we know who's good or not if we don't socialize?\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Miss Cao understood that her mother was worried about her, so she complied. It's truly the case that a parent's heart is filled with concern for their child.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Similarly, Madame Ji felt the same way. Both Pei Shuo and Zheng Wuheng were her sons, and while her eldest son's talents and abilities were no less than her youngest's, everything had to prioritize the youngest. She understood the reasoning but still felt a little hurt. Therefore, whenever Xin Shi came with her grandson, she would give generously.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">This time, when Jizhou suffered from a famine, she also let Xin Shi take some meat and grain. This was seen by Cui Shi, the wife of Zheng Wuheng, who felt a bit displeased.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Cui Shi spoke to Zheng Wuheng, \"Currently, we don't have enough grain at home. Big brother and his wife have already moved out on their own. Big brother's wife is such a shrewd person; I heard she has a lot hidden in her cellar. Mother doesn't know the details and gave away so much.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"Don't say such things. Big brother is also my elder brother. Every time we go to battle, he works hard for me, taking on the hardships while I take the credit. He's also our mother's son, so giving him some grain is only right,\" Zheng Wuheng didn't think much of it.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">In Jizhou, there weren't many capable people available. His father had been living off past achievements for years, and recently, there had been frequent bandit raids. He had to arrange for his elder brother to suppress them. How could they let minor issues damage their brotherly relationship?</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Cui Shi and Zheng Wuheng, a young couple, had never argued before. Seeing Zheng Wuheng's reaction, Cui Shi had to stop, \"I was just mentioning it.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"Even if you mention it casually, it's not right. You don't know the situation in Jizhou right now. With the poor harvests, the bandits are rampant and very difficult to deal with,\" Zheng Wuheng explained to Cui Shi.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Cui Shi quickly admitted her mistake, \"I was wrong; I shouldn't have said that. Please don't be mad at me.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Seeing his wife sincerely apologize, how could Zheng Wuheng be angry? He helped her sit down and said, \"It's good that you understand these things. My elder brother is also my mother's treasure.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">But in Cui Shi's heart, Pei Shuo was just a stepson brought in by Madame Ji. How could he be compared to Zheng Wuheng?</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">For Zheng Fang to treat a stepson this way was already fortunate. How could he dare to compete with the real master? But she could never say these things; she could only think about them in her heart.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Similarly, Xin Shi was also dissatisfied. \"It's already late autumn, and we're short on supplies. Those bandits and thieves are incredibly fierce. Last time, you went deep into the mountains and only managed to raid one of their hideouts. Now they're sending you again. Why isn't the second brother going? If you split up, you can quickly eliminate the bandit threat. If we don't, how will everyone get through the harvest season?\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"A wise man doesn't take unnecessary risks. You wouldn't understand,\" Pei Shuo knew that his younger brother would be the future lord of Jizhou. He couldn't let his younger brother go every time; what if something happened?</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">But in his heart, he still felt a sense of resentment. They were brothers, after all, and yet in the future, he would have to serve his younger brother. He couldn't help but feel a little unwilling to accept it.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Thinking of this, an incomplete thought formed in his mind, but before that, he had to help his brother clear the obstacles so that he could leave with peace of mind.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">In the cold late autumn wind, Zheng Wuheng personally came to see his brother off. Pei Shuo patted his younger brother on the shoulder and said with a smile, \"Second brother, go back. Don't see me off. Don't worry; I'll get rid of these bandits as soon as possible. Even if they hide in the mountains or bury themselves underground, I'll dig them out.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Zheng Wuheng whispered to Pei Shuo, \"Brother, after you come back this time, you won't have to go again. Next time, I'll lead the troops.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">\"That’s not an option; you can't leave. You need to guard Jizhou properly.\" Pei Shuo's eyes turned red. The brothers had always been close, but he couldn’t shake his pride and hated being second to his younger brother.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Zheng Wuheng smiled and said, \"We'll talk about it again when you come back.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">The two bid farewell. This time, Pei Shuo went to deal with the bandits before the New Year. The bandits appeared to have some kind of expert advising them; they were extremely cunning and used weapons that were very difficult to handle. For example, when arrows were shot, they were blocked by superior shields. These bandits were unlike any he’d faced before. Not only did the mission fail, but it also drained their resources and manpower. When he got back, Zheng Fang gave him a harsh lecture.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Pei Shuo had been fighting battles all year without a break, and even now, as he prepared to leave, he wanted to help his brother eliminate the threats. But he knew his limits. So, he decided to put the half-formed plan into action without wasting any more time.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">The author has something to say:</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">There will be another double update tomorrow at 9:00 AM.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\"></p>\n</div>"
  },
  {
    "number": 66,
    "title": "Chapter 66",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 66</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Second Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The end of the year was always the busiest time, with the estate's rents, various social obligations, and preparations for the festivities at the Huaiyin Mansion. Huiyin wished she could clone herself.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Before, she could still spend time playing with Jing'er, but now she couldn't. With the snowfall, Huiyin couldn't go to see her sons and had to tell Fugui, \"I need to go over the accounts today. Please send some easily digestible yam beef soup to the eldest young master and the second young master. Tell their wet nurses to put the children to bed early.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Fugui went down to carry out the order.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin also remembered the child from the Guo family and had someone send a bowl of walnut mutton soup to them as well. She then continued to bury herself in the accounts. These tasks were familiar, but this year, the merchant family added to the gifts with their generous offering of jewelry. Among them was a crystal string with a jade fish in the center, which she particularly liked.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"I really didn't expect Cao Ping’s sister to be so clever and skillful,\" Huiyin praised.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Nanny Nan brought ginseng soup and couldn't help but say, \"In your eyes, everyone has their virtues.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Huiyin took the ginseng soup, blew on it, and then said, \"Nanny, if we only focus on people's weaknesses instead of their strengths, we won't be able to get along with anyone.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"Enough, enough, I can never argue with you,\" Nanny Nan said, not wanting to engage further as Huiyin drank the soup.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">After finishing the ginseng soup, feeling warm, Huiyin yawned and had someone light the lamps to continue reviewing the accounts. She disliked leaving things unfinished overnight. As she worked, the servants didn't dare sleep either. Fugui helped by registering the ledgers, while Linglu and Lingjiu worked on embroidery.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"You all should rest first. I'll be a while longer,\" she urged the maids.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">The maids refused, so Huiyin had them open the snack box to pick and eat what they liked while she continued with the accounts.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Outside, it seemed to be snowing heavily, the flakes as large as goose feathers. She wondered how cold it would be in the morning. Huiyin considered letting Jing'er skip school the next day so the child wouldn't catch a cold.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Even Xuzhou was blanketed in snow, and the capital was hit even harder. De Yin had gradually become less talkative. At this time last year, Lianzhi and Yunzhi would have accompanied her, drinking tea and enjoying the snow. Lianzhi, always the liveliest, had even made a little snowman in front of the door, and everyone had gathered around it, laughing and chatting.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Those days were gone, and everything was lost. Her loneliness seemed unknown to anyone.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Wei Liangdi was no longer as favored. Recently, the Crown Prince was said to be observing a fast and performing rituals for good fortune, and the Emperor's health was deteriorating, making it even harder to see him. A servant in her palace was pregnant and about to give birth. She couldn't afford to openly clash with Yunzhi, or people would say she was unable to control her household.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Thinking of this, De Yin felt sad again.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Yunzhi, however, was happy. In the past, she had to serve others, always standing or kneeling, and even when resting, the room would be heated with harsh black coal. Even as a personal maid, life had been hard. Now, she could comfortably lie on a daybed with a soft pillow behind her and a fine goose-down quilt covering her, feeling warm all over. Even if she were to die immediately, she wouldn't have any regrets.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">This was truly a good life. Her life had always been precarious, so losing it now wouldn't be such a big deal. Thinking of poor Lianzhi, Yunzhi felt a pang of sympathy for her.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Touching her belly, she thought that if she could give birth to a son, her life would be better than anything else.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Compared to Huiyin's busyness and De Yin's melancholy, the Zheng family was at a loss.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">When Madame Ji read the letter, she couldn't help but want to cry but held back. \"It's alright. It's alright. Fortunately, he didn't run off to someone else. The Prince of Huaiyin is our son-in-law, so he's not an outsider.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Zheng Wuheng stood up and said, \"Why, brother?\" He sat back down, knowing that even as the second-in-command here, there was little chance for great success. If things weren't handled well, he would be scolded.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Life was all about pride. Recently, the Prince of Huaiyin, Li Cheng, had been showing more ambition. He'd already taken Yuzhou and was now setting his sights on Yanzhou.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">This is all my fault. I got so frustrated when he couldn't even handle a bunch of bandits that I ended up pushing him away. Zheng Fang protested his innocence, \"I can certainly tell what's important. How could I possibly suspect Pei Shuo because of others?\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">After all, he was worried that Pei Shuo's growing influence might overshadow his own son. Wasn't it only natural to feel that way?</p><p id=\"paragraph-27\" data-paragraph-id=\"27\"></p><p id=\"paragraph-28\" data-paragraph-id=\"28\"></p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">He didn’t give Pei Shuo any hard time or scold him.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Pei Shuo really wanted to throw in the towel, but in this chaotic world, doing so would only lead to others bullying him. Only with a large territory would there be more money and grain, and only then could he sustain his troops, allowing him to grow stronger.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">The Zheng family was left speechless for a moment.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">That night, the silence at Huaiyin Mansion was broken by a knock on the door. Li Cheng had imposed a curfew, fearing that without it, the city would be overrun with suspicious characters at night.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">At that time, only a special pass signed by him could allow the guards at the city gates to open the doors at night.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">That night, the mansion came alive with the sudden glow of lamps. Huiyin was taken aback when she saw Pei Shuo. \"Brother, I can't believe it's really you!\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Pei Shuo flashed a wide grin. \"Sis, I've come to seek refuge with you.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">He thought his sister would ask for reasons, but Huiyin didn’t mention it at all, only saying, \"Brother, you’re not here to seek refuge with me; you’re here to make the Prince even stronger. The Prince has been thirsting for talents for years, and since you’re family, he will surely value you greatly in the future.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">These words made Pei Shuo feel a wave of relief, rendering the hardships of his journey insignificant.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Huiyin gently patted her nephew's head. \"It's late, and everyone's exhausted. Let’s catch up in the morning. You and the kids must be tired from the journey. I’ll settle you in first. Look at your chapped and bleeding lips, brother.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">They had endured countless dangers traveling from Jizhou, finally managing to contact Li Cheng on the frontlines, who then arranged for Pei Shuo to settle in Xuzhou first, promising to catch up later when he returned.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Soon, Huiyin had a large courtyard cleaned up and arranged for charcoal braziers and hot water to be delivered, ensuring everyone was well taken care of.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Xin Shi and the others were already exhausted and fell asleep as soon as their heads hit the pillows.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Once they were settled, Huiyin had already pieced together most of what had happened, but she gave Li Cheng the benefit of the doubt. In the past, Empress Dowager Mi had flourished with the help of her brothers. Now, on Li Cheng's territory, apart from bearing an heir, Huiyin was virtually alone and had to rely on emotional bonds with Li Cheng.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">In the future, if her brother and she could support each other, she wouldn’t have to live so dependent on her husband’s moods.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">However, it was still too early to say these things.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Besides, Li Cheng treated her well, with no issues.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">\"Tomorrow, have the kitchen prepare two stuffed pig stomachs filled with glutinous rice and lotus seeds, cooked until tender. My brother loves that dish, and it must be done,\" Huiyin instructed.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">After giving her orders, thinking she still had to get up early the next morning, Huiyin lit an incense stick and dozed off.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">She slept soundly through the night, and before dawn, Huiyin began checking the ornaments in the storeroom, preparing to send them to her brother. She also had the kitchen prepare breakfast, keeping herself busy.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">When Pei Shuo's family of four woke up, Xin Shi received some fur clothes. Nanny Nan said, \"This fox fur coat has never been worn by our princess. It’s lined with Zhangzhou velvet. The princess said the south is damp and cold, a cold that seeps into the bones, so she was worried you might not be accustomed to it. This cloak was bought from a Sassanid, and the princess said to let you wear it for novelty. Let’s go to the hall for a meal later.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">If Nanny Nan was polite to Xin Shi, she was more familiar with Pei Shuo. \"The princess had the pig stomachs stewed overnight, tender and ready for you.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Hearing such warm words, Pei Shuo couldn’t help but be moved and hurriedly brought his wife and children over.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">During the meal, Huiyin only urged them to eat and drink and asked how Madame Ji’s health was.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"Since returning from visiting her family, she hasn’t seen her parents for years. I wonder how they’re doing now?\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Thinking of his mother, Pei Shuo felt a pang of regret but also a sense of resolve, thinking a man should take responsibility for his actions and not engage in petty schemes. Thus, he replied calmly, \"Our parents are in good health, and your sister-in-law has given birth to a boy. Rest assured.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">\"Well, that’s good,\" Huiyin said, not asking further.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Pei Shuo, with an empty stomach, ate two pig stomachs in one go and wiped his mouth with a handkerchief. \"This pig stomach is really well-cooked.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"Of course, it was stewed overnight,\" Huiyin said with a smile, offering a goose fat spring roll to her nephew.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Seeing that the siblings wanted to talk, Xin Shi, understanding the situation, took the children away first. Once Xin Shi left, Huiyin said, \"Brother, your coming to seek refuge with the Prince makes me, as your sister, very happy. It feels like I suddenly have someone to rely on now that you’re close. However...\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Pei Shuo, full of enthusiasm, felt his heart lift when his sister hesitated. \"Sister, did the Prince not want my allegiance?\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">\"No, how could he not want it? He wants it very much. You’re family and will become a trusted confidant, closer than others. What I’m saying is, brother, you need to show your real skills. The troops under the Prince are all strong, proficient in both land and water. In the days before the Prince returns, you should think about how to gain his trust. Even with family ties, you need real skills to earn respect and avoid being underestimated.\" Huiyin said with a smile.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Pei Shuo understood. His sister was comforting him, afraid he might be anxious while waiting in the mansion, so she was giving him something to focus on.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\"></p><p id=\"paragraph-64\" data-paragraph-id=\"64\"></p>\n</div>"
  },
  {
    "number": 67,
    "title": "Chapter 67",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 67</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Chapter◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After Pei Shuo's family settled down, he got up early every morning to practice boxing and swordplay, and also taught Heng'er and Jing'er. Meanwhile, Xin Shi would come over to chat with Huiyin, and they felt much more at ease.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huiyin also wrote letters to inform Li Cheng about her arrangements for her brother's family, and they waited for a reply.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Meanwhile, the spies from the Crown Prince's side were delighted upon discovering this. Pei Shuo, son of Pei Ye, was a renowned cavalry soldier and had been taught by Zheng Fang for many years. He was a valiant warrior and considered a formidable general of Jizhou. Now, due to his failure in suppressing bandits, he had gone missing, which was a relief.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Perhaps due to his good mood, the Crown Prince greeted De Yin with a smile, which surprised her greatly. \"I pay my respects to the Crown Prince,\" said De Yin.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Li Heng helped De Yin to her feet. He had his own measure of judgment when it came to people. As for Madame Ji in front of him, like all the women in the harem, a smile from him would make the palace ladies happy for days.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">But did they truly like him? No, what they liked was the Crown Prince. If someone else were sitting in the Crown Prince's seat, they would love that person just the same.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">\"I've been busy lately and haven't visited the palace. How is your health? I heard you caught a cold a few days ago,\" Li Heng casually asked.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">De Yin smiled and replied, \"I was slightly unwell, but I’m feeling much better now. Thank you for coming to see me, Crown Prince.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">When De Yin first married into the family, Li Heng had been so affectionate and attentive, always knowing exactly what to say. But now, they struggled to find words for each other.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">De Yin had become increasingly numb, and many things no longer resonated with her. She couldn’t be as natural as when she first entered the palace. Now, whenever Li Heng came to her quarters, she was anxious, afraid that a single wrong word would bring trouble to the servants.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">In truth, she suspected that Yunzhi’s betrayal was somehow connected to Lianzhi, who had always been close to her.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Li Heng, of course, found it boring as well. Moreover, De Yin was getting older and seemed to have become numb, which made him feel disinterested.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Even when they ate together, the food tasted like nothing to her.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Fortunately, when she cautiously requested to have elder Madame Xu come to visit, Li Heng surprisingly agreed. This was the only comforting thing for her.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Upon seeing De Yin, elder Madame Xu first scolded Madame Ji and her children thoroughly. \"Let me tell you, it’s clear they’re not your own flesh and blood—Pei Shuo ran off, and now your father and brother’s relationship isn’t what it used to be.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">\"He left? Could it be that he went to join the Prince of Huaiyin?\" De Yin guessed immediately.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">In her previous life, Pei Shuo had helped the Crown Prince conquer territories because of Huiyin's marriage, and he eventually died for it.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Madame Xu thought to herself that this was an internal family matter. Even Madame Ji and Zheng Fang had only discussed it privately with her, telling her not to spread it as it might shake the morale of the troops. How did De Yin know?</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">But seeing De Yin's expression, Madame Xu couldn’t hide it anymore. \"Yes, he went to the state of Xuzhou. Not to mention, although Li Cheng took advantage of Prince Wei's death to occupy his land, what can he possibly achieve? He used to rely on Prince Wei and actually thought these achievements were his own.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"Grandmother, do you mean that Li Cheng didn’t support Prince Wei's son?\" De Yin remembered that in her previous life, Li Cheng had been very loyal to Prince Wei and had died for him.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Why was this life so different?</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Madame Xu understood this point as well. \"Prince Wei was only his uncle, not his lord. Now, with Prince Wei’s son being young, would anyone be willing to assist their younger brother? Even Pei Shuo wouldn’t want to assist Henger, and he had been raised by your father. The Prince of Huaiyin and Prince Wei are even more distant.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">What could De Yin say? In her previous life, she had thought the same, but she couldn’t speak in front of Li Cheng. Moreover, Li Cheng doted on Yin Lijun, whose father was just a low-ranking recorder. Her sister, Yin Lifang, had the luck to give birth to Prince Wei's son but still remained submissive to Li Cheng.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"Grandmother, does the Prince of Huaiyin have any concubines?\" De Yin suddenly asked.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Madame Xu didn’t want her granddaughter to be upset and simply said, \"It's common for men to have multiple wives. How could the Prince of Huaiyin not have any? I heard from your father not long ago that he was arranging for the daughter of the Recorder of Yanzhou to marry Li Cheng. She might even become an equal wife.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Hearing this, De Yin felt slightly relieved, thinking to herself that all men are the same.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">But Madame Xu added, \"How is Yunzhi doing?\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"The expected delivery date is early spring next year, but the prince is indifferent toward her, even more so than he was with the previous songstress.\" De Yin also found it strange—why was the prince favoring those from the lower classes, yet only doting on Wei Liangdi and me for a short time before losing interest?</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Elder Madame Xu said, \"In my opinion, Yunzhi is just a servant of our family. Even though she has climbed up, she can never become a phoenix. Now that she's given birth to a child, she is in no position to take care of it. You shouldn't be angry with her. When the prince is around, just let her make a fool of herself. The prince will take care of the child.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">In Elder Madame Xu's view, if they didn't punish the servant who betrayed her mistress, how could De Yin manage the servants in the future? If Liangdi can't control her own household, won't everyone start rebelling?</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">While the grandmother and granddaughter were discussing this, on the other side of the story, Li Cheng returned less than three days after Huiyin's letter had been sent. With the help of Guo Zhao's forces from Yuzhou, they mounted a formidable show of strength. Meanwhile, the old man Song fled to Wei Duo's place with his daughter, allowing Li Cheng to occupy Yanzhou.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Upon returning, he said to Huiyin, \"I anticipated Wei Duo would come to this old man's aid. There may be a fierce battle in the future.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Seeing that Li Cheng had returned dusty and tired, Huiyin first helped him bathe. The couple spoke privately in the bathhouse. For instance, when Huiyin heard that Pei Shuo had come to join them and brought a message, she wiped the water for him before saying, \"What kind of bandits possess such things?\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Li Cheng closed his eyes to rest, enjoying his wife's service. After she finished speaking, he said, \"There does seem to be something strange about this. Now that your brother has come to join me, I've long heard of his heroic reputation. Rest assured, I will put him to good use.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"Although he is my brother, this territory is yours, and it's up to you to decide how to use people. However, my husband is the best at recognizing talent. Don't show favoritism and disrupt the military's morale,\" Huiyin said.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">This was a reasonable point. When Pei Shuo came to Xuzhou this time, he brought 300 personal soldiers from the Pei family. Huiyin had the clerk arrange for them to be properly settled outside the city. After Li Cheng finished bathing, he was about to handle these matters when Huiyin stopped him.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"Look at you, acting on a whim again. I've already prepared food and drinks; you should eat something first before attending to other matters,\" Huiyin said.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Li Cheng was pleased that even though Huiyin's brother had come to join them, she still prioritized him. Some women, influenced by their natal families, only favored their own relatives.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Pleased, he readily agreed.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Huiyin had prepared dishes that Li Cheng loved. She also accompanied him while he ate.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"These shrimp balls are crispy on the outside and tender on the inside. Paired with coriander soup, it's light yet flavorful. Try it,\" Huiyin said, placing a small bowl in front of him.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Li Cheng took a bite and, for some reason, laughed.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Huiyin was puzzled. \"What are you laughing at?\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"I was just thinking, why do so many people think they can win me over with their beauty? They all seem to think that wine and women have no effect on me,\" Li Cheng said, glancing at Huiyin.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Huiyin understood that he was indirectly confessing to her. She didn't say anything sour and just smiled. \"You are a hero, of course, you wouldn't be swayed by these things.\" Then she took his hand. \"But I know you do this for me.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">If not for her, why would he come up with such an excuse? Men generally wouldn't refuse such opportunities.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Whether it was her father or her previous husband, it was the same. Li Heng loved Lu Xiao, but after Lu Xiao died, there were still many women. She didn't want that kind of love.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">After saying that, she looked at Li Cheng, who felt embarrassed and buried his head in his meal. However, the tips of his ears turned pink, betraying his emotions.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">After finishing his meal, Li Cheng handed her a list. Huiyin took people to open the storeroom and checked the gold, silver, jewels, antiques, paintings, and boxes that Li Cheng had brought. There were large and small pearls, as well as jewelry, all of which she needed to catalog for making new jewelry during the New Year.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">While she was busy, Li Cheng had already met with Pei Shuo. \"Brother-in-law, please sit,\" Li Cheng said.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Pei Shuo said to Li Cheng, \"I wish to join my brother-in-law, but I'm afraid there are too many talented generals under you, and I—\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"Brother-in-law, why say this? I've heard of your talents. Most of my men are good at naval forces, but I lack cavalry. Your arrival is like timely rain for me,\" Li Cheng said happily.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Pei Shuo was very pleased and immediately knelt down. \"From now on, I will follow my lord's commands.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Li Cheng had gained a capable general, but he was also concerned that his brother-in-law might become arrogant and disobedient in the future. Seeing Pei Shuo kneel and sincerely pledge his loyalty, they exchanged many heartfelt words. As a general from Jizhou, Pei Shuo knew a lot about Yanzhou and had many connections in the capital, which were precisely the information Li Cheng needed.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Immediately, Li Cheng granted a mansion to Pei Shuo and his wife. He also mentioned that he lacked a central commander and appointed Pei Shuo to the position, planning to introduce him to the other generals soon.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">For someone like Pei Shuo, who had finally joined, the biggest concern was being sidelined. With Li Cheng's words, he felt reassured and believed he was valued, sharing many more heartfelt words with Li Cheng.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Now, the Prince of Huaiyin was no longer limited to just Xuzhou; he also had Yuzhou, Yanzhou, and half of Qingzhou. A capable minister must serve a worthy lord.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Xie Jiuyi was on the verge of losing Nanjun, which filled him with anxiety, when news arrived from Xuzhou that Li Cheng had taken Pei Shuo under his command.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Yin Liyi was confused. \"Wasn't Pei Shuo doing well in Jizhou? Has his luck taken a turn for the worse?\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">\"It’s not hard to understand why,\" Xie Jiuyi replied. \"He is the adopted son of Zheng Fang, and though he is highly regarded, he has always been overshadowed by his younger brother. Moreover, the Zheng family already has a daughter serving in the Eastern Palace. Now he has pledged his allegiance to the Prince of Huaiyin, likely seeing this as a valuable opportunity.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Yin Liyi asked, \"What about Pei Shuo's abilities? Do you know?\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Xie Jiuyi said, \"It is said that he is a brave and decisive man, loyal and reliable, as well as a formidable warrior.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">\"I never expected such a capable general to fall under his command,\" Yin Liyi said, feeling uneasy.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Xie Jiuyi laughed. \"Do not be deceived by Li Cheng's recent conquest of Yanzhou. Trouble is coming for him. Wei Duo will not let him off.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"That I don't understand. He took Yuzhou without facing any significant opposition,\" Yin Liyi said.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Xie Jiuyi shook his head. \"Wei Duo has ambitions to dominate the Central Plains. He already controls Bingzhou, Sili, Nanyang Commandery, Nanjun Commandery, and Xiangyang Commandery. He views Yanzhou as a piece of meat on the chopping block. Whether it's conquering Qingzhou, Jizhou, Xuzhou, or Yuzhou, Yanzhou is the key. But now, except for Jizhou, all the others have been taken by Li Cheng. And Jizhou is essentially his in-laws' territory. If Wei Duo loses Yanzhou, he loses his shield.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">In truth, Yin Liyi wasn't very clear on the geographical maps, so when Xie Jiuyi said this, she simply responded, \"If he cannot defend them, we will reclaim the lands he seized.\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">In their view, these lands were taken by Li Cheng when the King of Wei was still alive, so they considered them to belong to the King of Wei. Li Cheng had occupied them for too long and, seeing that the Prince of Yuzhang was still young, had simply held onto them.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Xie Jiuyi laughed. \"It’s not skill to conquer; it’s skill to defend.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Once Pei Shuo received his title, the Crown Prince in the capital soon found out. He looked at De Yin, who was preparing tea, and said pointedly, \"Why has your brother gone to serve the Prince of Huaiyin?\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">De Yin had initially intended to mediate but, given her precarious position in the palace, she chose to distance herself. \"This brother of mine was from my stepmother's side from a remarriage. I was never close to him since childhood. I truly don't know about this, Your Highness. But he is the full brother of my sister, who is the Princess of Huaiyin. Their bond is naturally stronger than with others. I often heard my grandmother say that he was frustrated and unfulfilled.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">\"By doing this, is he seeking a more worthy master and showing disdain for me?\" Li Heng glanced at De Yin.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">De Yin quickly knelt and began to kowtow repeatedly.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">After she had kowtowed enough, Li Heng said, \"This matter has nothing to do with you, Concubine Liangdi. You may rise. I am aware of your father's loyalty.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">However, De Yin found palace life increasingly unbearable. She resented that her family never helped her but instead left her trembling in fear in the palace, unlike Wei Liangdi's father, who served his lord faithfully.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">As soon as she thought this, she was immediately contradicted. Just before the New Year festivities, Li Heng, following tradition, participated in ice games. He was an expert at ice games and saw this as an opportunity to find talented individuals.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">However, Wei Duo intervened. \"Your Highness, the Crown Prince, must not be distracted by trivial amusements.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">\"Chancellor, I only find these people interesting and keep them by my side,\" Li Heng said.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Wei Duo was very stubborn. \"The Emperor has been ill for a long time. If the Crown Prince engages in too much frivolity, others might think you are being disrespectful to your father.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Li Heng returned, seething with anger, but he didn't dare to act against Wei Liangdi. De Yin wanted to speak her mind, but looking around, she saw that the palace maids were all sent by the palace and dared not say anything.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">De Yin felt resentful. Why did Wei Duo treat Li Heng with such dominance, and why did Li Heng not dare to act against Wei Liangdi? She had been respectful and obedient to the Crown Prince, and her father was a loyal governor of Jizhou, yet she still fell out of favor with Li Heng.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Now, Li Heng treated her more like a servant. As she listened to congratulations being offered because Zhou Chenghui had given birth to a daughter, and the Crown Prince was very pleased, Empress He already intended to raise the child in her care.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Yunzhi, after giving birth to her daughter with great difficulty, recalled how not long ago, De Yin had deliberately asked her about a literary reference while reciting poetry with the Crown Prince. She didn't know the answer and made a fool of herself. She had feared that her daughter would be sent to De Yin, who was her former mistress. Having betrayed her, Yunzhi didn't know how De Yin would treat her child. Fortunately, the Empress was raising the child.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">In ordinary families, when a grandmother raises her granddaughter, the granddaughter's status is elevated, or like Elder Madame Xu, who raised Zheng Deyin with such care that all the family assets were given to the granddaughter.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">As a lowly person, having her daughter raised by the Empress meant that her daughter's future was limitless. As her mother, Yunzhi would also rise with her daughter.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">While De Yin was frustrated and blaming everyone around her, Huiyin was extremely happy.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">This year, she would celebrate the New Year with her brother. Her sister-in-law, Xin Shi, had a good relationship with her since they were close friends. Moreover, she wasn't the kind of petty sister-in-law who competed with her sister-in-law for her brother's affection. They all got along well.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">\"Sister-in-law, look, this is a pair of bronze flower vases that can hold famous paintings and calligraphy scrolls, perfect for my brother's study. And this display shelf, I find it extremely elegant—have someone take it away as well. This large fish-shaped bell can be placed in your room for decoration.\" Huiyin said with a smile, pointing out several items for Xin Shi to see.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">After the new year, they would be moving into a new residence. The house had three courtyards and a small, elegant garden, but even close relatives could grow tired of each other if they stayed too long.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Xin Shi had initially thought that coming south was too rash. She was a meticulous and clever person, but her husband always had the final say at home, and she didn’t dare to contradict him. Now, seeing how kindly Li Cheng and his wife treated them, she was looking forward to moving into the new home.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Outside, Guguo'er and Xianjie'er were playing with Jing'er, Zhan'er, and Guo Zhao's son, Guo Xing. Guo Xing was intelligent and sensible, leading the younger ones in play with great control.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">The sisters-in-law watched through the window as everyone was playing a traditional archery game in the hall, not running around wildly.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">\"Sister-in-law, I see that young master Guo from the Guo family is truly exceptional. He's only a few years older than Guguo'er but already so sensible,\" Xin Shi remarked.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Huiyin nodded. \"Yes, this child is very steady. It's hard to believe he's only seven or eight years old. Sister-in-law, I have something important to discuss with you.\"</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Xin Shi immediately became serious. \"Please, Sister-in-law, do tell.\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">\"There's no need to be so formal. What I mean is, since you've just arrived, people don’t know your character yet. Xuzhou is a key military region, and after recently parting ways with the Prince of Wei, there are many spies gathering intelligence. You need to keep the household in check. If there’s nothing else, bring the children over to play.\" Huiyin advised.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">As for other social niceties, Huiyin didn’t need to instruct Xin Shi on those. Xin Shi’s entire life was tied to Pei Shuo. If Pei Shuo succeeded, she would benefit from his success, but Pei Shuo also needed to prove himself to Li Cheng with real talent.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Now that Li Cheng had given him an opportunity, it was up to Pei Shuo to establish himself.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Xin Shi pondered Huiyin's words and later relayed them to her husband. Pei Shuo responded, \"When we move to the new house, we shouldn’t have too many servants, but none of them should be problematic. In the past, my father only managed Jizhou, which was already difficult for me. Now that the prince is waging campaigns, with such vast territories, how could I not give my all? I must go to Yanzhou. If we correspond, let’s not mention any military matters.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">The couple discussed the matter, and Xin Shi added enviously, \"The gifts my sister-in-law sent for the festivals were so abundant that you couldn’t even fit a hand in between them. She doesn’t seem to care about them at all, and everyone watches her closely. She seems more dignified than Empress He.\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Pei Shuo liked hearing this. If his sister were to become empress one day, his future would be even brighter.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Aside from the lively New Year celebrations, after the new year, the Pei family moved into their new residence. Pei Shuo, following Li Cheng, trained soldiers outside. As a cavalryman from a martial family with years of experience, he was a formidable general under Li Cheng.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">In early spring, Li Cheng prepared for a martial competition. Pei Shuo fought to a draw with Yuwendang, who was also exceptionally strategic, impressing Pei Shuo.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">The men had their own world, and the women got along harmoniously. Xin Shi had seen Huiyin as someone who didn’t meddle in affairs at her natal home, being kind only to relatives and indifferent to others.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">However, now, whether it was a wedding in the east or a childbirth in the west, if someone asked for her help, she would assist.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">The noble ladies here seemed to revolve around her. Huiyin's status was even higher than Madame Ji's in Jizhou. It was known that her mother-in-law, Madame Ji, could make everyone watch their step when she got angry in Jizhou, but here, everyone trusted and relied on Huiyin, waiting for her decisions, which always left them convinced and satisfied.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Unexpectedly, by March, Wei Duo returned from the capital with an imperial decree to launch a military campaign against Li Cheng, and Li Cheng had to set out again.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">\"It's not even spring yet, and the seeds haven’t been sown. Last year's harvest was poor. When you leave, will the provisions be sufficient?\" Huiyin asked.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Li Cheng shook his head. \"It's not about that. Wei Duo is older than my father and rose from humble beginnings, rich in experience. This will be a tough battle. If we win, my prestige will greatly increase. If we lose, those around us might attack.\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Huiyin smiled. \"You have extraordinary talent. Once you were under others, but now you’re in charge. I trust you.\"</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">\"Yes, I was a bit nervous at first. Even my father found him difficult to deal with. Now it’s my turn, and I must give it my all,\" Li Cheng said, his voice filled with both apprehension and joy.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">Huiyin adjusted his armor for him. \"I appreciate your decisiveness, unlike others who hesitate and miss opportunities. But sometimes, things work out better when handled slowly. Here, wear the chest protector properly.\"</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">\"I'm off then,\" Li Cheng said, striding out; otherwise, a glance back would make him reluctant to leave his wife.</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">Pei Shuo was also going, full of ambition, while Xin Shi was nervous. Li Cheng breathed a sigh of relief, appearing confident, boosting the morale of the soldiers under him.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">Meanwhile, in the Wei region, the Guo family had been dissatisfied since Xie Jiuyi took charge. Especially in Wu Prefecture, where the brothers used to collect taxes, they resented returning it to Li Cheng. Even before Xie Jiuyi issued orders, their scouts learned that Li Cheng was heading to Yanzhou for a major battle with Wei Duo and seized the opportunity to try and retake Wu Prefecture.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">When the troops were dispatched, Xie Jiuyi panicked, and Yin Liyi, seeing his anxiety, asked, \"What's wrong? Even if the Guo brothers take Wu Prefecture and become arrogant, isn’t it a good thing that they can really fight?\"</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">Xie Jiuyi frowned. \"You underestimate Li Cheng. I fear the brothers will suffer a significant loss.\"</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">\"He's in Yanzhou now; how can he manage it?\" Yin Liyi didn’t believe him.</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">Still in Yanzhou, Li Cheng smiled, thinking they were courting death. Wu Prefecture bordered Xuzhou, and for Huiyin's safety, he couldn’t allow them to attack easily.</p><p id=\"paragraph-122\" data-paragraph-id=\"122\"></p>\n</div>"
  },
  {
    "number": 68,
    "title": "Chapter 68",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 68</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Double Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Li Cheng had always been a man of his word. Unlike Zheng Fang, who clung to the old cavalry tactics—focusing on battle formations and troop movements, and using new weapons sparingly—Li Cheng had, during several major wars, secretly summoned many craftsmen to manufacture various kinds of weapons.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Especially after taking Yuzhou, where Yuzhou and Qingzhou were tasked with supplying grain, the taxes from Xuzhou’s Wujun were specifically allocated to support the troops and produce weapons.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Therefore, he had already laid a clever and intricate trap between Wujun and the Wei territory. Some of these weapons were likely unfamiliar to the Guo brothers.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Xin Shi had heard about this and hurriedly came to ask Huiyin for her thoughts. Huiyin said, \"Sister-in-law, don't worry. The Guo brothers are the cousins of the former Prince of Wei and are highly trusted by him. But when it comes to battles, it's our Prince and General Xie who take charge, which shows these two aren't up to the task. Rest assured, there will be no problem.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">In truth, how could Huiyin not be worried? Few things in this world were certain, but if she panicked, those under her would be even more rattled. Moreover, Li Cheng might already know about the situation. If she ran off without a plan and was caught, it would be counterproductive.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Seeing Huiyin so calm, Xin Shi felt relieved and didn’t mention it again, but Huiyin discussed the matter with Grand Dowager Wu.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Grand Dowager Wu cursed, \"Those damned turtles, they actually want to take our territory. The Guo family wasn't even worthy of pouring water for us to wash our feet before they rose to prominence because of their connection to the Prince of Wei's mother.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Huiyin said, \"I just wanted to inform you, Dowager. Don't be afraid. The prince has his own countermeasures.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"I'm not afraid. Cheng has been in the military since he was a teenager, facing all kinds of dangers to get where he is today,\" Grand Dowager Wu sighed.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">It was also said that the Guo brothers were not reckless men. They first arrived in Wujun and learned that the current gatekeeper was the former subordinate Xie Qian.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Guo Zhao said to his younger brother, \"Xie Qian was originally a small clerk under the Prince of Wei. Later, when the Prince of Huaiyin attacked Xuzhou, he specifically requested this person. I have a personal connection with him and know of a particular obsession of his.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"What kind of obsession?\" Guo Er asked curiously.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Guo Zhao smiled, \"He doesn't fancy young girls but is infatuated with mature women. He's obsessed with them, just like the old thief Wei Duo.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">When men discussed these things, they understood each other well. Guo Er couldn't help but ask, \"So where can we find such a person now?\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">\"As the saying goes, money can make the ghosts turn millstones. When I was in charge of Wujun, before Li Cheng took the land back, I planted an informant. We won't get much out of it now that even the young Prince of Yuzhang, despite growing up, is aligned with the Huo and Xie families,\" Guo Zhao had long known. Wujun was a big prize. With Wujun, even without fighting battles, one could live as a rich man.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Guo Er had always trusted his elder brother, knowing he had many ideas. They secretly sent people through the river at night, entering through tunnels.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">After the Prince of Huaiyin handed over Wujun, the Guo brothers were in control, thanks to Guo Zhao’s ingenious plan.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">What they didn't know was that Li Cheng had strict military discipline and absolutely forbade women from entering the camp, executing it particularly rigorously. A deputy general once thought he had hidden his actions well, only to be beheaded on the spot by Li Cheng.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Moreover, once news of an impending attack on Wujun was received, almost the entire region entered a wartime state, with personnel controlled everywhere.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Not to mention the beauty trap, even those delivering supplies had to have their identities verified three times.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Xie Qian had already been ordered by Li Cheng to send scouts to keep an eye on things. The Guo brothers, thinking they had deeply cultivated Wujun, didn't know that this was once the fiefdom of the Prince of Wu and had been reclaimed. Last March, Li Cheng came here specifically.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">He had always been highly valued by Li Cheng, who had shown him great kindness, but compared to Guo Zhao, he was far behind. Now, Guo Zhao was the governor of Yuzhou. Even Pei Shuo, a tiger general from Jizhou, had joined the prince. If he didn’t succeed, his position would surely be taken by someone else.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"Let's use these two to test our new caltrops. These caltrops nearly decimated Song old man's forces when we attacked Yanzhou.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">When Guo Zhao and Guo Er discovered that the scouts they sent had not yet sent back a message, they began to panic. Xie Qian deliberately left a gap when he left the city. The Guo brothers, eager to achieve merit and with tight rations, couldn't afford to delay.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">The Guo brothers deployed a trebuchet, which was suggested by Li Cheng when he advised the Prince of Wei to gather craftsmen to make it. This trebuchet could throw stones to destroy walls and gates, but Xie Qian first used a battering ram to hit the cloud ladders, and even used forked poles and grappling hooks, all to defend against the enemy troops.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Finally, using night forks and caltrops, they caused heavy losses to the Guo brothers' troops. Xie Qian then called in the archers, deliberately luring the two brothers forward before shooting them into sieves.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">The arrows were dipped in a strange poison, causing the deaths of the Guo brothers on the spot.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">The news reached Jianye, and Xie Jiuyi told Yin Liyi, \"First, inform your sister to keep this matter hidden. If the Wei Imperial Consort hears about it, she might not be able to handle it emotionally.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Yin Liyi was stunned for a moment before saying, \"They actually stabbed the Guo brothers until they were covered in blood. We've worked together with them before. Isn't this a bit too cruel? The army led by the Guo brothers might have fought alongside Li Cheng in the past.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"Once it's war, they are the enemy. To be merciful to the enemy is to be harsh to ourselves,\" Xie Jiuyi replied, sensing that his wife was still clinging to past sentiments, unaware that power and desire weighed more heavily on people.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Yin Liyi looked at her husband and asked, \"So what do we do? Will you continue to fight?\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Xie Jiuyi shook his head. \"We suffered heavy losses attacking Nanjun, and our supplies are almost exhausted. It's only spring sowing season; we can't afford to fight now.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">War wasn't just a matter of words; it required substantial resources and funds.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Yin Liyi comforted him, \"At least for now, they only killed the Guo brothers and didn't push forward with an attack.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"The fear is that it's only a matter of time,\" Xie Jiuyi said, withdrawing his gaze.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Yin Liyi then went to see Yin Lifang and relayed Xie Jiuyi's instructions. Yin Lifang was quite surprised. \"How did this happen? Don't worry. The Wei Imperial Consort lives with Lady Huo now, and no one usually comes over.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Yin Liyi nodded. \"That's good.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"Since Li Cheng took back Wu County, he's gained half of the additional tax revenue. No wonder he dares to fight in Yanzhou and against Wei Duo now,\" Yin Lifang added, thinking of her own son, who was still too young, which was why the Guo brothers hadn't taken others seriously.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Compared to the mourning in Wei, Huiyin felt relieved. The elite families of Xuzhou were increasingly convinced by Li Cheng's leadership. Ever since Li Cheng took charge of Xuzhou, the region had enjoyed political stability, thriving trade, and the people were spared from the horrors of war.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">It was Jing'er's birthday, and gifts had already started arriving from various places.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Madam Miao and Lady Xue, who were local to Xuzhou, visited frequently. Even Jiang Biluo from Yuzhou, despite the distance, and the Cao family, who had recently pledged allegiance, sent generous gifts.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Huiyin had Fugui record everything and then said, \"Store these in the warehouse.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"Yes,\" Fugui said with a smile while writing the gift list. \"You consistently allocate a significant portion of the wealth to support the prince's military needs. That shows true foresight.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">If it were someone else, they would definitely be tempted by the wealth.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Huiyin smiled. \"Should I take money from my own coffers instead of overburdening the people? If we overburden them, they may resort to selling their children, leading to a humanitarian crisis.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">In reality, Huiyin had more to say. If the people had no means of livelihood, they would cause trouble, leading to even greater suffering.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">To rule the world, one must have the people's welfare at heart.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Though Huiyin appeared extravagant in her daily life, this was actually a strategy to prevent others from underestimating her or Li Cheng.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Fugui didn't fully grasp these considerations but replied, \"My lady, you are always compassionate.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Huiyin smiled and then mentioned that Le Yun and Dong Shun had also sent gifts for the heir. \"They are quite thoughtful. Let them know I'm aware,\" she said.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Le Yun's husband was a doctor, so she sent handmade medicated pillows, two hats, two pairs of shoes, and a box of incense. Dong Shun sent two packages, one with clothes and the other with homemade snacks.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">However, in these uncertain times, Huiyin wouldn't eat snacks sent by outsiders.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">In her previous life in the palace, someone had sent clothes infected with smallpox and plague to her son, but fortunately, they hadn't been stored in the warehouse. Le Yun, knowing that Jing'er was often honored and that the mansion had its own needleworkers, sent her gifts as tokens of goodwill. But Dong Shun hoped that Huiyin would notice her sincerity, as before, and invite her over for a chat.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">She sat with Le Yun for a while and looked at her expectantly. \"Why hasn't the princess summoned us yet?\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">\"The princess is busy today with so many gift-givers. She doesn't have time to meet anyone,\" Le Yun comforted her.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Dong Shun lived a comfortable life among the common folk. Her family could solve almost any issue through connections from the former prince's mansion, but meeting the princess as frequently as before was no longer feasible.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">\"I know the princess can't receive us. I only wished to pay my respects and greet the royal family,\" Dong Shun said, still feeling regretful.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">But Le Yun knew that she couldn't let go. Even as a maid in the residence, she was dressed in silk, covered with goose-down quilts in the winter, and the princess was generous, giving them fine skirts and jackets that she had only worn once. But it was different outside. Not everyone would find it hard to settle for less after experiencing such luxury.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Therefore, Le Yun advised, \"There will always be opportunities. Nowadays, there is war everywhere. Our princess is always careful. You shouldn't take it to heart. Even I can't visit often without being summoned.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Dong Shun smiled, \"Speaking of which, it's still Qiu Feng who has it good. She married a bondservant from the residence, and the couple is harmonious. She still follows the princess to attend to her needs.\" She didn’t envy Fu Gui because Fu Gui didn’t marry, and she felt the price was too high.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">After she left, Le Yun's husband, the physician Huang, emerged from behind the screen.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">\"The princess lets her live a good life and definitely refuses to see her, afraid that if she sees wealth again, she will become restless.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Le Yun nodded, \"Yes, it's easy to become accustomed to luxury from frugality, but difficult to return to frugality from luxury. I believe the princess has the same thought. She wants her to live a peaceful life, and there may be opportunities for advancement in the future. That man of hers is a scholar with considerable talent. Besides, the princess doesn't prevent those below from helping her. She probably doesn't understand this.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Huang the physician smiled, \"The future is long. People get frustrated when things don’t go their way for a while. The princess understands this principle too well, which is why she doesn’t want to see her.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Regarding Jing'er's birthday, Huiyin only invited Xin Shi, and she also sent a table of wine and dishes to Grand Dowager Wu.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Since Jing'er had the afternoon off, the child was very happy. Xin Shi smiled, \"The prince is so lively and tall for his age. He'll grow up to be a fine young man, just like his father.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Huiyin laughed, \"I think Jing'er resembles his uncle. They say nephews take after their uncles, and it’s true in this case. My brother was tall from a young age, and Jing'er is also tall.\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">As Xin Shi observed this peaceful scene, she couldn't help but ask, \"I wonder how your brother and the others are doing in Yanzhou?\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">In Yanzhou, after Li Cheng drove out Song Cishi last year, although he returned to celebrate the New Year, he hadn’t neglected the arrangements in Yanzhou. However, he had only recently taken over the area when Wei Duo attacked again.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">While it was somewhat expected, it still caught everyone off guard.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Although Li Cheng usually acted swiftly, he deliberated for a long time when it came to fighting Wei Duo.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">In fact, Zheng Fang and Li Heng were also observing Li Cheng's capabilities. Zheng Fang personally went to suppress bandits. With more experience than Pei Shuo, he was stronger, but even he found these bandits unusual.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">It seemed as though someone was supporting them behind the scenes. Otherwise, how could those bandits have such new weapons?</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Therefore, he was closely watching whether Li Cheng could win this battle. If he could, it would demonstrate Li Cheng's considerable strength.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">The situation on the battlefield was ever-changing. Wei Duo, being the sly old fox that he is, was different from the Guo brothers. Just as Li Cheng was discussing with Pei Shuo and Yuwendang at the frontline, a servant reported that the grain supply had been burned.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">\"What?\" Li Cheng couldn’t believe it.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Yuwendang and the others said, \"We all thought that Wei Duo was a hero of his time. How could he do this?\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Li Cheng raised his hand to stop them, \"War is full of tricks; you can’t be too careful. It’s my fault for being careless. General Pei, take this token and personally arrange for one thousand stones of grain to be brought over.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Fortunately, there was Huiyin's grain supply. He wrote a letter to Huiyin to express his gratitude.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Pei Shuo didn’t expect Li Cheng to have a backup plan and immediately accepted the mission. As a cavalry, his horse was fast. This was the first task Li Cheng had given him, and he couldn’t afford to be negligent.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">As for Huiyin, upon receiving the letter, she realized that one thousand stones of grain might not be enough, which would make Li Cheng rush to finish the battle quickly. However, rushing could lead to mistakes.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Suddenly, she thought of something and quickly replied, sending the letter back via express courier.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Wei Duo, on the other hand, was very pleased, \"The boy Li Cheng has fallen for the trick so quickly.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">\"Prime Minister, you're a master at this game. We can’t even compare to you.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">The subordinates cheered, but Wei Duo wasn’t arrogant. Instead, he had everyone keep an eye on Wei Duo.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">When news of Li Cheng's burned grain supply reached Jianye, the happiest wasn’t Xie Jiuyi, but the former Princess Wei of the Wei family, Huo Shi. Her daughter will finish her mourning period next year and would marry into the Wei family. If they could rely on the Wei family to reclaim the territory of the former Wei King, the Huo family would replace Xie Jiuyi.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">\"Go and tell the Second Imperial Concubine Yin to bring the Prince of Yu Zhang over. His sister and I haven’t seen him for a long time.\" Huo Shi was filled with determination.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Now that the King of Wei is dead, she no longer needs to maintain the facade of a virtuous wife.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Li Cheng was unaware of this. He was satisfied when Pei Shuo managed to deliver the grain in less than three days. He believed that one could assess a person by starting with small matters. Pei Shuo truly gave his all and did not care about his own safety.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">However, Pei Shuo also said, \"These one thousand stones will not last more than a few days, my lord.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">\"I was thinking the same. I have already sent people to expedite the tax collection from the people of Yanzhou. These people deliberately allowed the Wei family's army to come in and burn my grain. I don't need to be polite to them,\" Li Cheng said angrily. He was furious with himself for falling into Wei Duo's trap and now needed to reassess and devise a new strategy.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">While they were discussing, a fast messenger arrived, saying, \"My lord, the princess has sent a letter through my subordinate. It is an urgent document.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Li Cheng was puzzled and wondered what Huiyin wanted. He took the letter, which read, \"Your Highness, before I married into this family, I had a deep friendship with the young mistress of a rice merchant. She once gave me a token, saying that this jade pendant could be used to withdraw one hundred taels at each shop...\"</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">The letter also mentioned that when he had previously taken control of Wu Commandery, Lady Hu had already managed her husband's family business. Huiyin suggested that Li Cheng use the token to withdraw grain first. Afterward, she would use one million taels of silver to buy grain from the Cao family, the Jiang family, and the Hu family.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">\"The princess is a true genius,\" Li Cheng said joyfully.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">The Cao family had already donated grain last year, and they might not have much stock this year. The Jiang family, who were salt merchants, could only mobilize a limited amount. However, the Hu family were famous grain merchants in Wu, with grain distributed all over the country.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Pei Shuo was puzzled, \"I wonder how the princess is doing?\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">The princess was his own sister, and he cared the most about her.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Li Cheng said, \"We no longer need to worry about our grain supply, but we must use it sparingly. Our focus should still be on how to deal with Wei Duo.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">After Huiyin allocated one million taels of silver, she first invited Lady Cao over. She explained the plan to purchase grain and ensured that the Cao family would not suffer a loss. The Cao family was very cooperative, but as they mentioned, they had already contributed most of their granary to Li Cheng last year. At present, they could only provide 200,000 stones of grain.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">However, they couldn't give all 200,000 stones; otherwise, the Cao family would not be able to continue their business, so they gave only 100,000 stones.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">The Jiang family, although in the salt business, also had grain and provided 200,000 stones.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Soon, Huiyin's letter reached Hu Jiaojiao. When she married into the family from Shangjing, her husband had a beloved woman. She had to walk on eggshells and relied on the gifts from the Princess of Huaiyin to establish herself in her husband's family by claiming a close friendship with the princess.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Last year, when Wu Commandery came under the control of the Prince of Huaiyin, she came to pay her respects to the princess. The princess bestowed many gifts upon her and was very kind. Upon hearing that she was managing the household, the princess was pleased and even asked the prince to support her business.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">As a result, she received an exclusive license to conduct business in all the prefectures under the Prince of Huaiyin's jurisdiction without taxes.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">An army of 100,000 required about 1,700 stones of daily rations. Li Cheng brought 80,000 elite soldiers, needing at least over 1,000 stones. The grain provided by the Cao and Jiang families could sustain them for about 200 days, which was more than enough. However, Hu Jiaojiao saw this as an excellent opportunity and directly sent 300,000 stones.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">\"With this, I’m sure the Prince of Huaiyin will trust me even more,\" Hu Jiaojiao said with a smile.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">In times of chaos, having a backer was essential for doing business.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">When this grain was delivered, Li Cheng secretly stored it and only told people that the soldiers were vigilant, even resorting to eating bark and leaves. Wei Duo's spies reported, \"It is said that many in Li Cheng's army have starved to death. He probably can only afford a quick battle.\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">\"Still, we cannot be careless. Send Wei Lei to provoke them into battle. This is called striking when the iron is hot,\" Wei Duo said with a smile.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Wei Lei, Wei Duo's eldest son, was usually very strategic. He understood that his father wanted him to test the waters.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">In the first battle, Wei Lei discovered that many soldiers fainted during the fight. Even Li Cheng, after a few rounds, wanted to charge forward but was pulled back by his brother-in-law, Pei Shuo, and they retreated.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Wei Duo stroked his beard, saying, \"Li Cheng is indeed young and impulsive. Now that he has little grain, he still wants a quick victory, but I won't let him have his way. Let's endure for three more days and catch him off guard.\"</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">After three days, people would be even hungrier...</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">When people are hungry, they lose strength, and then he wouldn't feel guilty about taking advantage of their weakness.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">Unbeknownst to Wei Duo, after three days, he saw Li Cheng looking weak and thought he had the upper hand. But Li Cheng, sensing danger, fled, with Wei Duo hot on his heels.</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">In the chaos, a sudden volley of arrows flew past, startling Wei Duo, but those around him burst into laughter.</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">Li Cheng was clearly standing on his horse, looking strong and robust. He pointed at Wei Duo and said, \"Old man, what game are you playing? Now you're the one who's been tricked!\"</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">Wei Duo finally realized that Li Cheng had deliberately played along to lure the enemy in deeper.</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">He had misjudged Li Cheng. Just as he was about to flee, he saw Li Cheng smiling and saying, \"I will not let this man escape.\"</p><p id=\"paragraph-123\" data-paragraph-id=\"123\">……</p><p id=\"paragraph-124\" data-paragraph-id=\"124\">Huiyin was very pleased after receiving the news of the great victory in Yanzhou. It was worth spending almost all the treasury money. For her, if this money could help secure victory, Li Cheng's reputation would no longer be limited to Huaiyin.</p><p id=\"paragraph-125\" data-paragraph-id=\"125\">Xin Shi and Madame Miao came to congratulate Huiyin. Huiyin also planned to help arrange a good marriage for the daughter of the Cao family when Li Cheng returned for the victory celebration. And since Hu Jiaojiao had just given birth to a son, she planned to secure a noble title for him.</p><p id=\"paragraph-126\" data-paragraph-id=\"126\">This was how you earned their loyalty.</p><p id=\"paragraph-127\" data-paragraph-id=\"127\">\"Sister-in-law, I heard my brother performed exceptionally well this time. I'm really happy for you,\" Huiyin remembered to congratulate Xin Shi despite her busy schedule.</p><p id=\"paragraph-128\" data-paragraph-id=\"128\">Although they had won the battle, Li Cheng could not return immediately. He still needed time to recruit soldiers and collect taxes in Yanzhou, and arrange for someone to guard the area.</p><p id=\"paragraph-129\" data-paragraph-id=\"129\">While waiting for him to return, Huiyin received a letter from him. Expecting it to be about new arrangements, she was surprised to find the letter saying, \"With you as my wife, it feels like I have divine guidance. If I, Cheng, am ever unfaithful in this life, may I be struck by lightning.\"</p><p id=\"paragraph-130\" data-paragraph-id=\"130\">Huiyin pretended to be angry but blushed slightly. This fool, why is he saying such silly things?</p><p id=\"paragraph-131\" data-paragraph-id=\"131\"></p>\n</div>"
  },
  {
    "number": 69,
    "title": "Chapter 69",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 69</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Double Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">When Li Cheng returned again, it was near the end of the year. Since we got married, we’ve spent more time apart than together. Huiyin found it uncomfortable to have someone else sleeping next to her.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">In the middle of the night, she suddenly sat up, startled, and only lay back down when she realized it was Li Cheng beside her.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Li Cheng, thinking she had a nightmare, immediately asked with concern, “What’s wrong? Did you have a bad dream? Dreams are usually the opposite of reality, you know~”</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">“No, I wasn’t dreaming. I’m just not used to it. I’m usually alone when I sleep. You know I’m afraid of ghosts,” Huiyin said, leaning into her husband’s arms, sharing her worries.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Li Cheng affectionately replied, “I’m back now. You don’t need to be afraid.”</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">It must have been incredibly difficult for his wife to manage the mansion and handle social obligations all by herself. She was human, not a god, and those seemingly easy tasks required countless hours of careful planning behind the scenes.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">“But you’ll have to leave again,” Huiyin stated the obvious.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng said with a troubled expression, “If I could, I’d naturally want to keep you by my side, but women aren’t allowed in the military camps.”</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">She was just venting, but you actually started thinking of ways to bring me along. Huiyin quickly stopped him, “I don’t want to go to the military camp. That’s not a place for me. I can’t charge into battle or wield weapons; I’d only be a burden. I just meant that I’m not used to not having you around, but a few days of getting used to each other will be fine.”</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Every time, she had to spell things out so clearly.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Li Cheng, feeling a bit embarrassed, quickly changed the subject, “I didn’t expect the Guo brothers to try exploiting our situation. They’re asking for trouble.”</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">“Even so, we’ve spent a lot of money to defeat Wei Duo and completely take over Yanzhou. Now, it’s time to rest and recover,” Huiyin had fully realized the importance of money and grain during this war.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">We couldn’t rely on merchants forever.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Having everything controlled by others wasn’t a good thing.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Li Cheng nodded, “Of course. We’ve reclaimed a lot of land. As you can see, the areas we’ve taken control of are major grain-producing regions. I’ll also establish several granaries for better allocation in the future.”</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">“You’re more knowledgeable about external matters. Even with the Cao family and the Jiang family, I’ve thought of a reward method. What do you think? The Cao family is most concerned about their daughter right now. Actually, I’ve met Miss Cao once. She’s lively and lovely, though she was once jilted. Finding a good match for her will be quite challenging to fully satisfy the Cao family.” Huiyin, being astute about human nature, knew that if you gave someone a choice, they might still find fault, even if there were minor issues, and blame the matchmaker. But if they made the choice themselves, they couldn’t blame anyone else.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Li Cheng disagreed, “I’ve already given enough profit to the Cao family. Why go to such lengths?”</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Huiyin shook her head, “I’ve always helped whenever I can. If I find something troublesome, I naturally wouldn’t bother. This time, the Cao family readily provided 100,000 stones of grain. When Madam Cao heard I’d help find a match for her daughter, she was overjoyed. If I went back on my word now, they would be even more upset. As leaders, we don’t always need to worry about others' feelings, but as the saying goes, water can both carry a boat and overturn it.”</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">“Alright, alright. I said one thing, and you’ve countered with so many. Tell me, who are the three you’re considering?” Li Cheng quickly said.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Huiyin smiled, “I have a maid who once thought she wanted to marry into an ordinary family and live a simple life of teaching children. But when she actually married, she regretted it. Since ancient times, maidens have favored youth. When a woman marries, the man shouldn’t be too old or ugly, and the conditions at her in-laws’ home should be no worse than her own family’s. Only then will she be content.”</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Li Cheng’s eyes sparkled with interest, “Is that so?” He randomly compared himself, thinking his appearance and age were just right. In terms of rank, he was higher than the Zheng family. Clearly, he was an excellent match.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">“So, I feel the Cao family will want a marriage that brings them honor. I’ve actually found a few suitable candidates. The first is from a prominent family, the Liu family. This young master’s ancestors were of the royal family in the previous dynasty, and the current dynasty’s Empress Dowager also came from his family. However, his branch of the family has fallen on hard times and is now struggling to maintain their ancestral glory, though they’re on the decline.”</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Li Cheng thought to himself that this was a family that had seen better days but was still clinging to past glories.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Huiyin continued, “The second candidate is the younger brother of Xie Qian, the governor of Wu Commandery. Although he comes from the Xie family of Chen Commandery, he is an illegitimate son. As you know, an illegitimate son, when dividing the family inheritance, doesn’t receive much despite the law stating equal division among sons. Marrying a wealthy bride would secure his future.”</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">An illegitimate son and a merchant's daughter—neither can afford to look down on the other. The bride would gain status by marrying into a prestigious family, and the groom would benefit financially. It was a mutually beneficial arrangement.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">“The third candidate is a widower. His status isn’t as high as Guo Zhao’s. He’s a judicial officer in this prefecture. I get along well with his mother. However, Madam Miao told me that he has already lost two wives.”</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Li Cheng nodded, “If I’m not mistaken, of these three, the person you truly intend to introduce is the second one.”</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Seeing that Li Cheng had figured it out, Huiyin silently agreed, “It all depends on what the Cao family decides.”</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Lady Xue was invited by Huiyin to come over, and while Huiyin didn’t go into exhaustive detail, she did mention the strengths and weaknesses of the three individuals. After returning home, Lady Xue naturally discussed the matter with her family.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Though the merchant family was wealthy and more adept than Huiyin at investigating people, it didn’t take long for information about the three to be presented.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">The head of the merchant family said to Lady Xue, \"These three matches aren’t bad at all. The first, Master Liu, is a descendant of the royal family of the previous dynasty. He’s handsome and highly talented, having excelled at the Imperial Academy. His paternal uncle serves as the Military Supply Officer of Xuzhou. However, his family only has two small shops and a few acres of thin land.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"If Master Liu is as impressive as they say, we can afford to give a bigger dowry,\" Lady Xue thought, recalling that her daughter had been rejected in a previous engagement. Finding a first marriage match would be a good outcome.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">The head of the merchant family continued, \"The second is the younger brother of General Xie, who became famous for his role in the recent battle in Wu County. He is eighteen years old, from the prestigious Chen County Xie family. This young master Xie is said to be very handsome and is called the 'Handsome Man of Wu County.'\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Lady Xue’s smile deepened, finding this young master Xie to have even better conditions than Master Liu.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Finally, the head of the merchant family said, \"The last one is the Judicial Officer of this prefecture, also from a prominent local family, but he has already lost two wives, which is not ideal.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Lady Xue counted on her fingers and said, \"The princess consort also told me that these candidates are not the best, but this is the range of choices she could find.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Marriage is about uniting two families. At least the princess consort’s choices are mostly from noble families, unlike Jiang Bipbo, who married into a humble background and became a second wife.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">The head of the merchant family said, \"I think we can rule out the Judicial Officer. I’ve had drinks with him, and while he is quite articulate and seems like a decent person, he has a history of losing wives.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Lady Xue briefly considered looking for another match herself, as Huiyin had reminded her that they didn’t have to accept the match just because it was offered by the princess consort. Since the Judicial Officer was no longer under consideration, Lady Xue immediately said, \"I think young master Xie is a great match,\" without a second thought.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">\"I was thinking the same. By marrying into the Xie family, we’ll have better business opportunities in Wu County. Moreover, given our daughter’s current reputation, being able to marry into the prestigious Chen County Xie family would be a slap in the face to that Xie Jiuyi,\" said the head of the merchant family, still somewhat angry when mentioning Xie Jiuyi.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Lady Xue mused that although her daughter was still a virgin, this young master Xie was handsome, a noble family member, and a first marriage prospect. It would be her daughter who gained the advantage. This match was likely arranged by the princess consort. Otherwise, they might have ended up marrying into a declining family like Master Liu’s, who might not even be as talented.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">After Lady Xue made her choice, Huiyin sent a message to the wife of Xie Qian, Madam Zhao, and also selected a pair of jade Ruyi and an official icebox as additional dowry gifts for Miss Cao.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Both sides were delighted with the outcome. Meanwhile, Lady Xue, at home, spoke to Xue Huanhuan, saying, \"The princess consort is truly clever. I heard that Madam Zhao often feels that her brother-in-law Xie Qian spends too much, but Xie Qian, out of brotherly affection, says nothing. Madam Zhao, however, is quite resentful. Now that the second young master Xie is getting married to a wealthy bride, she won’t have to spend any of their money. As for Miss Cao, although her previous engagement was broken off through no fault of her own, her reputation was somewhat tarnished. Being able to marry the younger brother of General Xie, who is both talented and handsome, is indeed a good match.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Xue Huanhuan couldn’t help but say, \"It does sound nice, but if Miss Cao was previously a concubine, and now she’s becoming a first wife, isn’t that quite a twist of fate?\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"Who told the merchant family to be so wealthy? When the Prince of Huaiyin attacked Yanzhou last time, the merchant family contributed significantly several times. This princess consort is simply repaying the favor. Besides, if she were to take Miss Cao as a concubine for the prince or marry her to her own brother, that would be considered a mismatched status. But this marriage is with young master Xie, who is an illegitimate son, so no one will find any fault.\" Lady Xue analyzed.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Jealousy among people is to be avoided. Often, the person involved doesn’t feel anything is wrong, but those around them sense an issue.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">The princess consort also had her own group of people. If they saw her being too affectionate with a merchant’s daughter, they might feel resentful.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Xue Huanhuan said, \"In that case, I’m thankful for our Xue family for bringing me here.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">If the Xue family weren’t a prominent local clan, how could she have come from Jianye?</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">As for Miss Cao, after seeing young master Xie through a screen, she was satisfied to see that he truly deserved the title of 'Handsome Man.' With the demeanor of a noble family member, she was very pleased, knowing she would become a proper wife. The humiliation of being rejected as a concubine still pained her deeply.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Initially, young master Xie was somewhat reluctant. No matter how wealthy the merchant family was, and despite them now being officially recognized merchant officials by the Prince of Huaiyin, there were still flaws. But when he saw Miss Cao holding a white silk fan from afar, he was captivated. Seeing the grandeur of the merchant family, he agreed.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">As both families celebrated the joyous union, Huiyin, after the new year and the arrival of spring, went horseback riding with Li Cheng for a leisurely outing. Unexpectedly, after not riding for a while, she twisted her waist.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"Gently, gently, I can’t move!\" Huiyin lay flat on the bed, feeling pain with any movement.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Li Cheng had originally planned for them to enjoy a ride together, recalling how well Huiyin used to ride. But after this unexpected accident, as he warmed the plaster, he realized how fragile his wife actually was. Though she rarely showed weakness around him, people often say that 'a long-sick patient doesn’t have a filial child by their side,' so he should perform well in this situation.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Wait, he wasn’t a filial son; he was a good husband.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">After applying the plaster, Huiyin pinched her nose and wrinkled her face. \"Ugh, it smells awful!\" she exclaimed.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"But we have to apply it, don’t we? I suggested calling a doctor to set your bones, but you refused,\" Li Cheng said, pressing the already applied plaster down again.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Huiyin swatted his hand away, saying, \"Too much force.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Li Cheng, who was in a rare good mood, was about to speak when it was reported that Pei Shuo had arrived. He gave Huiyin's hand a reassuring pat before heading out to meet his brother-in-law.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Pei Shuo had been there for about a year, and he always completed the tasks Li Cheng assigned to him to the best of his ability. He never cared about his own reputation, didn't put on airs, and got along well with Yuwen Dang and others who were once Li Cheng's subordinates.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">\"Sit, why have you come over?\" Li Cheng said.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Pei Shuo took out a letter and said, \"This is a letter from my father. Jizhou is in urgent need.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Li Cheng raised his eyebrows.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Zheng Fang didn't expect that the mastermind behind these bandits was Shi Chong. The bandits were causing chaos everywhere, and no matter what, they couldn't be eliminated. He suspected Shi Chong's involvement, but the Crown Prince was biased toward Shi Chong. Zheng Fang was now feeling exhausted.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">\"I always suspected it was Shi Chong, but I can't figure out how he managed to incite the bandits,\" Zheng Fang said.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Zheng Wuheng, being young and daring, said, \"Father, since you are overseeing matters in Jizhou, I will go to suppress the bandits myself. I don't believe I can't deal with them.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Zheng Fang didn't want his son to take the risk. \"Your brother has already achieved great success with your second sister's husband, and your second sister's husband has also taken Yanzhou. He has his future, and I only have you as my son. I will go instead.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"Father, how can I let you, an elder, go? I am not a porcelain doll. If you always do this, people will look down on me in the future,\" Zheng Wuheng had matured significantly since Pei Shuo left. He excelled in both mundane tasks and martial arts.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Zheng Fang had a lingering thought. \"Son, maybe we should go and join your brother-in-law.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">He had ambitions, especially after killing Lü Wei, and it seemed he had the determination to rule the world. But now he felt powerless.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">So, he said impulsively, \"Maybe we should join someone else, since Li Cheng is indeed capable. He even drove Wei Duo away. Moreover, Li Cheng is of royal lineage. The emperor is not long for this world, and even if the Crown Prince ascends the throne, it's uncertain whether he can maintain his power. We should act first.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Zheng Wuheng felt ashamed. \"Father, how can we, possessing such a good land as Jizhou, abandon its people and become subjects elsewhere? If we stay in Jizhou, we can support our sister. If we all go, your son-in-law might look down on us.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Zheng Fang wasn't angry at his son's remark. \"Your brother-in-law, the son of the King of Wu, holds real power. The emperor is already on his deathbed. Even if the Crown Prince ascends the throne, it's uncertain whether he can hold his position. It's better to join someone else.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Zheng Wuheng always felt his father's words were inappropriate. As the saying goes, it's better to be the head of a chicken than the tail of a phoenix. If my brother-in-law needed assistance, I would be willing to help, but it seems pointless to submit to someone when everything is going well.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Ignoring his father's advice, Zheng Wuheng decided to lead the troops to suppress the bandits. He deliberately lured the enemy deeper and captured a few of them alive for interrogation, only to find out they were Shi Chong's men.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Thinking of this, Zheng Fang took the captured men to confront Shi Chong. Shi Chong dared not admit it and accused Zheng Fang of framing him out of spite for taking his position. Zheng Fang and Zheng Wuheng then went to see Crown Prince Li Heng. Li Heng feigned ignorance. He had already learned that the Zheng family was being troubled by bandits and had suffered losses. He had long wanted to seize Jizhou and, while offering verbal reassurances, was already planning his next move.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">At that moment, Zheng Wuheng was unexpectedly placed under house arrest. Zheng Fang, relying on sheer will, broke through the encirclement, wrote a letter, and sent a personal guard to deliver it to Xuzhou.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">He then signaled, and the Jizhou army came to rescue Zheng Wuheng. War was imminent. Li Heng ordered Shi Chong to take Jizhou. Shi Chong was eager to try, but Zheng Wuheng considered it a great humiliation and fought valiantly against Shi Chong's forces.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">…</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">On the other hand, concerning De Yin, Yunzhi, who had once been a servant of the Zheng family and owed them a debt of gratitude, was now pregnant. She had also learned about the external situation and quietly came to inform De Yin.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">When De Yin saw Yunzhi approaching, she was in a bad mood. \"Now that you're pregnant, what if something happens to you while you're here? I can't afford to take that responsibility.\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Yunzhi wasn't angry when she heard this and simply said, \"I came to tell you, Liangdi, that the Crown Prince has sent people to attack Jizhou. You should be vigilant these days.\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">\"What? Are you joking?\" De Yin couldn't believe it. In her previous life, her father and brothers helped the Crown Prince fight Li Cheng. How had things completely reversed now?</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Seeing the palace maids entering, Yunzhi smiled and said, \"Then I thank Liangdi for your concern. I will take good care of the child in my womb.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">De Yin actually believed Yunzhi's words. By the afternoon, Liangdi from Wei again found an excuse to reprimand two of her servants. The sarcastic remarks left De Yin feeling numb, and she could only pretend not to notice.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Now, her life seemed even more difficult compared to Yunzhi's. Yunzhi had a daughter in Empress He's care and was pregnant again, while she had no offspring and had lost her family's support. Even her favor had disappeared.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">She suddenly recalled from her past life that when her father and brothers fought against Li Cheng, he never humiliated her. He just didn't favor her, but he didn't target her either.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">She thought that if she had a blood-related brother, it would be good. If not, she shouldn’t have married the Crown Prince at all. She would have been better off marrying someone from a well-matched noble family. But now, it’s too late for such thoughts.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">……</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Huiyin was recovering from her injuries, and during this time, Jing'er showed great filial piety by frequently visiting her. Her younger son, Zhan'er, also came to play.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Jing'er was almost six years old and had started learning to ride a horse. He was excited as he said, “Mother, Father taught me to ride a horse, and Uncle was guarding beside me. I thought I would fall, but I sat steadily.”</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">“Were you afraid?” Huiyin peeled a section of an orange for Jing'er.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Jing'er immediately shook his head. “I’m not afraid. I need to learn to ride well so that I can join Father in battle in the future.”</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">“Good son, you have ambition.” Li Cheng entered, patted his son’s head, and said to the wet nurse beside him, “Take the young heir down. I have something to discuss with the princess.”</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">She had sprained her waist and had been lying down for three days. During this period, Li Cheng had been attending to her meticulously, more thoughtful than the attendants, even serving her meals and assisting her with personal needs. She felt embarrassed, but he took great pleasure in caring for her.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">At this moment, Li Cheng’s expression became more solemn, and Huiyin couldn’t help but ask, “What’s wrong?”</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Li Cheng explained, “The Crown Prince said that because your father failed to suppress the bandits, the people suffered. The Crown Prince asked your father to surrender his power, but he refused, so the Crown Prince ordered General Shi Chong to attack Jizhou.”</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">“What?” Huiyin was worried and looked at Li Cheng. “How did you find out?”</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Li Cheng explained that it was through the personal soldiers sent by Zheng Fang to Pei Shuo. He said seriously, “We are bound by the knot of marriage, and when your family is attacked, I should help. But if I go without informing your father and brother, others might think I am greedy for the land and using the pretext of rescue to invade.”</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">“Then should I write a letter? If they need assistance, we can send people over later?” Huiyin understood his implication.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">At this time, Li Cheng had no idea that Zheng Fang had already considered submitting to him. He had enough supplies, with plenty of grain purchased from three wealthy families the previous year.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">However, providing assistance once would be considered a favor. In the future, he could not afford to continually fight for others' lands.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Li Cheng nodded, regaining his composure. “Alright, write the letter, and I’ll send it immediately.”</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Jiahui Pass was open to trade with Xuzhou at this time. After all, the two families were related by marriage and different from others. Huiyin had her personal soldiers deliver her letter to either Zheng Fang or Zheng Wuheng.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Zheng Fang soon received Huiyin’s letter. Seeing that his son-in-law was righteous and even mentioned bringing his own supplies if any support was needed, he immediately showed the letter to Zheng Wuheng.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Zheng Wuheng looked at the letter and said, “Father, does Sister mean that Brother-in-law is willing to help us?”</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">“Yes, the Prince of Huaiyin is truly a man of righteousness and honor. I really didn’t misjudge this son-in-law.” Zheng Fang said.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Li Heng had been eyeing Jizhou for a long time. Now, he sent Shi Chong, who colluded with bandits for an internal rebellion. Zheng Fang and Zheng Wuheng felt the fierceness of the attack. While it was possible for the father and son to fight bravely, civilian and military casualties were unavoidable. Zheng Fang didn’t care much about this, but when he heard that Wei Duo was also coming to help the Crown Prince, the father and son briefly discussed and decided to lead their troops to join Li Cheng directly.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Li Cheng had been moving very quickly from Xuzhou to Qingzhou and had even sent Pei Shuo as the vanguard to help. He did not expect to encounter Zheng Fang and his son, along with many of Madame Ji and elder Madame Xu’s family members, as well as a large contingent of soldiers.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Before Li Cheng could speak, Zheng Fang dismounted and knelt, saying, “My lord, I, Zheng Fang, am willing to offer Jizhou to you. I wish for you to achieve great success soon.”</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">This father-in-law seemed overly eager to submit, as if he had rehearsed this moment many times. Li Cheng was taken aback by the suddenness of it all.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\"></p>\n</div>"
  },
  {
    "number": 70,
    "title": "Chapter 70",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 70</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎First Watch◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">It is said that since Li Cheng went on his expedition, there had been no news from the front. However, they did receive word about Cao Ping’s sister, who had just married and should now be called the Second Young Madam Xie. When she returned home to visit her parents, she had prepared lavish gifts to formally pay her respects to Princess Huiyin.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huiyin had only met her a few times before. Now, seeing her rosy cheeks, which seemed to glow with health and youth, Huiyin knew she was doing well in her new marriage. Huiyin bestowed upon her two boxes of palace-made silk flowers and a white jade crown.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">The Second Young Madam Xie rose and curtseyed, saying, \"Your Highness has shown me great kindness, which I can never repay.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">The Second Young Master Xie Jiuyi, whom she married, was a bit of a womanizer but knew his limits and showed great respect to his legitimate wife. The Xie family was well-known among the elite of Wu Prefecture. His sister-in-law, Madam Qian, was greedy and would casually give her gold-inlaid skirts and embroidered handkerchiefs, which pleased Madam Qian. Everything was harmonious in this Xie family. Unlike in her previous household, where she had to offer warmth to their coldness every day, this was much better. That Yin Shi couldn’t even speak properly, was petty, yet somehow managed to be a respected main wife and was praised by others.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Truly undeserving of her position.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Looking at the current Princess of Huaiyin in front of her, regardless of her appearance, her speech and conduct were of the highest caliber, and her gifts were exquisite and grand. She was a woman of her word.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Huiyin smiled and said, \"As long as you and your husband are harmonious, that’s more important than anything.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">She didn’t pry into the relationship between the Second Young Master Xie and his wife. After all, every couple has their own way of living. Even the most loving couples can start to doubt each other if outsiders say something. Huiyin had met Madam Qian, the sister-in-law of the Second Young Madam Xie. She was straightforward and honest, wearing her heart on her sleeve, like her dissatisfaction with her husband’s spending in brothels and entertaining friends.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Yet, she genuinely hoped her brother-in-law would be more ambitious and even wanted to request an official position for him.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Other sisters-in-law wouldn’t help a concubine’s son, but Madam Qian was a good person.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">When a woman marries, her husband is one part, but most of her life is spent dealing with her mother-in-law and sisters-in-law. For example, Huiyin lived comfortably because she didn’t have a mother-in-law above her, though Grand Dowager Wu had given her a hard time before. If one encountered a wicked mother-in-law and cunning sisters-in-law, life would be difficult. It was hard to separate from the family, so one had to endure, and the virtue of filial piety could be suffocating.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">After drinking a cup of tea, the Second Young Madam Xie bid farewell and left to return to her husband. Naturally, the Cao family slaughtered chickens and oxen to entertain their daughter and son-in-law. Inside the house, Mrs. Cao asked her daughter, \"How is the Xie family? Is your sister-in-law and mother-in-law doing well?\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">The Second Young Madam Xie smiled and said, \"Mother, rest assured, my mother-in-law doesn’t manage things anymore. It’s my elder sister-in-law who is in charge. She is not a bad person and hasn’t tried to undermine me. It’s much better than in my previous family, where I had to smile at their indifference every day. That Yin Shi didn’t even know how to speak properly, was petty, yet managed to be a main wife and was praised everywhere. Forget about them. Now, in this family, my husband is a soft and gentle person. Before I entered the household, the concubine who served in his room was sent away by his elder sister-in-law.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Mrs. Cao clasped her hands together and said, \"Amen, this is good news.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">\"Yes, I was worried there would be someone in his room, so I prepared some gifts, but unexpectedly, the person in his room was sent away. Even the one who served in his study wasn’t kept. I think since I’ve endured such difficult days before, it’s much better now. Mother, let’s not talk about these things anymore. Whatever the future holds, it’s already better than before.\" Although there were some dissatisfactions with the Second Young Master Xie, one couldn’t expect everything to go smoothly in life. Thinking this way made things easier.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Not to mention the Cao family entertaining their son-in-law, it was said that Xin Shi was pregnant. Huiyin saw that her niece needed to study and was worried that Xin Shi might not be able to take care of her. So, she took the initiative to bring her niece, Huanjie, to the Huaiyin Mansion to play.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Nanny Nan looked at Huanjie’s appearance and couldn’t help but say to Huiyin, \"Look how much the young miss resembles our Madam.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">The Madam referred to was Madame Ji. Huiyin looked and also thought they looked alike, but she worried and said, \"I wonder how my father and brother are doing on the battlefield? My mother must be worried at home.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Nanny Nan said, \"Since the Prince (of Huaiyin) has personally led the troops, everything will be fine.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Not only was there no problem, but when Li Cheng (Prince of Huaiyin) saw his father-in-law and brother-in-law come to pledge allegiance, with maps, troops, and supplies presented, Li Cheng still pretended to decline, saying, \"As your son-in-law, I should be helping you, Father-in-law, and Brother-in-law. How can I take these from you? If I do, won’t people think of me as a petty person?\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Zheng Fang had a fleeting thought that if his son-in-law truly came to help him, wouldn’t he be able to regain control of this region in the future? But when he looked at his stepson Pei Shuo and saw him give a signal, he bowed and said, \"Since ancient times, a son-in-law is considered half a son. Now, with Shi Chong, under the Crown Prince’s orders, leading 100,000 elite troops into Jizhou, my son and I are at a loss. If my lord does not accept us, we will have no choice but to surrender.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Thus, Li Cheng personally dismounted and helped up the Zheng father and son, and they discussed matters together.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">In fact, after last year’s famine in Jizhou, the Zheng family’s grain was running low. Zheng Fang’s resolve was not firm, and although Zheng Wuheng had ambitions, he was unable to help.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">The news that the Zheng father and son were offering Jizhou to Li Cheng quickly spread. Needless to say how furious Li Heng was when he heard this, Xie Jiuyi was also shocked.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">\"Zheng Fang actually surrendered to Li Cheng? Did you hear that correctly?\" Xie Jiuyi slapped the table, finding it unbelievable.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">The spy said, \"It’s already spread. Shi Chong from Xizhou, under the Crown Prince’s orders, led 100,000 elite troops into Jizhou. The Zheng father and son directly sought help from the Prince of Huaiyin. The Prince of Huaiyin sent troops, and Zheng Fang pledged allegiance to him.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">……</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">After discussing with his advisors for a long time, Xie Jiuyi returned, exhausted. Yin Liyi was reading a storybook and immediately asked upon seeing him, \"So, it seems the Prince of Huaiyin has reclaimed Jizhou?\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"Shi Chong is coming on strong, but it's not certain that he can really take over. However, Zheng Fang has been managing Jizhou for many years. If he switches sides, the two families fighting against Shi Chong might just have a chance to win,\" Xie Jiuyi remarked.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Yin Liyi thought, \"Li Cheng's luck is really good. The Zheng family even gave him their land. Who would dare to fight him now? I have to hand it to him.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Initially, Yin Liyi wasn't optimistic about Li Cheng. She thought he had mostly relied on Prince Wei to rise to power, and after Prince Wei's death, he had been eager to divide the family property. But now, it seems he had been preparing for this for a long time.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"Do you think he's preying on a family with no male heirs?\" Yin Liyi asked.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Xie Jiuyi frowned. \"What do you mean by that?\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"Since marrying Princess Zheng, Li Cheng has clearly been targeting Jizhou. When you attacked Qingzhou, Prince Wei was still around, and Zheng Fang was his father-in-law. The two families had marital ties, yet the Zheng family stood by and did nothing. Now, Li Cheng and the Zheng family have divided Qingzhou between them. When we attacked Yanzhou, Zheng Fang's stepson came over, and now they've secured the land of Jizhou,\" Yin Liyi speculated.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Xie Jiuyi didn't think Li Cheng had that much charm. \"Princess Zheng has brothers. How can you say Li Cheng is preying on a family with no male heirs? I think Zheng Fang is most known for betraying others. Now, Li Cheng thinks he's gained an advantage, but as the saying goes, 'Xiao He brings success and Xiao He brings failure.'\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">While Xie Jiuyi calmly judged others, he didn't know that Wei Duo, coveting the vast territories of Jingzhou and Yuzhang, saw them as ripe for the taking.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Suddenly, Wei Duo's army headed south, and Xie Jiuyi had no time to worry about Li Cheng. He felt as if a dark cloud had settled over the place. In the past, Prince Wei's forces had many talented people. He and Li Cheng could discuss matters together, but now he was fighting alone.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Once Xie Jiuyi left, Yin Liyi was called to Huaiyin Mansion by her sister. The two sisters often talked, and their days were peaceful.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Just as Yin Liyi was about to go to the back hall upon hearing someone crying, her sister quickly pulled her back. \"What are you doing? There's no need to go. It's just Miss Huo crying over there.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">\"Why is she crying?\" Yin Liyi had much less contact with Miss Huo recently.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Yin Lifang, who had once held great respect for Miss Huo, had grown impatient with her constant meddling. She tried not to say anything unkind, but even she couldn't bear it anymore. Looking at her younger sister, she said, \"Wei Duo's army is almost here, and Miss Huo is still thinking about marrying her daughter to Wei Duo's son. I've tried everything to explain it to her. A princess, being of royal blood, can marry anyone. Why does it have to be the Wei family?\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">These were matters she could only confide in her sister. Miss Huo was unyieldingly stubborn.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Not to mention Miss Huo, but wasn't Elder Madame Xu the same?</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">She had followed Madame Ji and Miss Cui, placing Xu Shi in a cramped carriage at the back. Xu Shi wept throughout the journey, but with the pursuers closing in, no one dared to turn back.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Upon hearing that her son had surrendered the land to Li Cheng, Xu Shi was even more distraught and scolded Madame Ji, \"By doing this, you're pushing De Yin into a fire pit!\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">\"We have no other choice, Elder Madame,\" Madame Ji replied. She was used to being in charge and was now forced to seek refuge with her son-in-law. She didn't know what the future held and had to watch her daughter and son-in-law's faces. What about De Yin?</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Xu Shi said, \"If you really don't know, would you have let your husband lose all the land? How can I face the Zheng family ancestors in the afterlife...\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Miss Cui rolled her eyes inwardly. If they hadn't fled when Shi Chong attacked, they might have been captured and forced into servitude. Besides, Li Cheng was her cousin. She wasn't afraid after reaching Xuzhou. She believed that the rise of bandits in Jizhou was due to Shi Chong's machinations. That's why her father-in-law had fled. He had been deeply infiltrated.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">But as a junior, she really couldn't say much.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">In the past, Madame Ji wouldn't have been afraid of her, but now she was worried that arguing with the old lady might be overheard and cause trouble. She felt that traveling in the same carriage with her was the worst decision.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Fortunately, after passing Jiahui Pass, the inn had staff specially assigned to serve them. When Madame Ji and the others entered, the innkeeper's wife flattered them, \"The prince ordered us to ensure the Marquis's wife and her companions were well cared for.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Only then was Madame Ji free from her mother-in-law. When Xu Shi and her niece reunited, they embraced and wept together.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Xu Shi had actually been quite resourceful in the past, but Madame Ji had been fortunate in bearing children first. Now that she had left the nunnery, she wasn't going back.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"Elder Madame Xu, going to Xuzhou might be good for us. My family is there, and with them, I have a support. You and I won't have to be bullied by Madame Ji anymore. Besides, Madame Ji's daughter is the prince's wife. She's afraid we'll expose her past, so she'll help us,\" Xu Shi said, feeling full of fight after bathing and changing clothes.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Elder Madame Xu sighed. \"Since we are now relying on others, let's avoid causing unnecessary trouble. When the time comes, I'll beg Huiyin. I cannot abandon my sister in the Eastern Palace. After all, we're still family.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\"></p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p>\n</div>"
  }
]