[
  {
    "number": 91,
    "title": "Chapter 91",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 91</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Avoiding Marriage◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The little princess's formal name had not yet been decided. She was the first daughter born after the emperor ascended the throne, and everyone doted on her greatly. The more this was the case, the more careful one had to be. She was affectionately called Tonger, a name that conveyed closeness and endearment.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huìyīn had been reading for too long in the early morning, which caused her neck to become sore. Zhān'er immediately began to massage her and used a small mallet to tap her back. As he grew older, Zhān'er seemed to have a gentle and filial personality—very sensible and obedient.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">\"Are you tired from all the tapping, sweetie? How about I get you your favorite walnut tea?\" Huìyīn said, holding her son's hand.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Zhān'er, being truly sensible, shook his head. \"There's no need, Mother. I just came because I thought you might have a sore shoulder. Yesterday, after I went horse riding, I felt sore all over, but the wet nurse helped me massage, and I felt better.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"I see, where were you sore yesterday? Let me take a look,\" Huìyīn knew that Lǐ Chéng's expectations for their sons were to be well-versed in both literature and martial arts. Luckily, both her sons were healthy, but she knew better than to interfere with their martial arts training.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Now that Lǐ Chéng had only recently ascended the throne, if there were to be another war, they couldn't let the court officials and generals lead them by the nose. If the emperor were proficient in both civil and military strategies, the court would be stable for at least three generations. This was also why Huìyīn was still willing to have children—because their family truly had a throne to inherit.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Zhān'er pointed to his thighs and back, and Huìyīn put down her book to personally massage her son. She asked, \"These days, your father often inquires about your studies, and with your younger sister's birth, I've inevitably neglected you. If there's anything you don't understand, just tell me.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"There's nothing I don't understand, Mother. If I don't understand something, my elder brother teaches me. Yesterday, my elder brother even specially gave me some medicine,\" Zhān'er said with a smile.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huìyīn nodded. \"I'm glad to see that you and your brother are still so harmonious, but you are also my son. You don't have to be so sensible all the time. If something happens, you must tell me.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">As the children grew older, they could no longer live in the side halls and had to move to the Prince's Quarters. This was ancestral tradition, and even Lǐ Chéng couldn't keep his sons by his side all the time. In ordinary official families, boys who grew older would move to the outer courtyards, let alone princes who needed to set an example for the nation.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Zhān'er was delighted to hear this. \"Mother, you can visit my palace when you have time. I have many things to tell you.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"Alright, I'll wait until you're done with school tomorrow and come to see you, alright?\" Now that there were three children, fairness was essential.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Zhān'er was sweeter than if he had eaten honey. Huìyīn then accompanied him to play touhu (a traditional game), and soon after, Jǐng'er arrived. Huìyīn smiled. \"Your brother knew I had a sore neck and remembered how he felt better after a massage from horse riding yesterday, so he came to help me. I was just wondering when you would arrive.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"I went to find my second brother, intending to come together, but he arrived first. Mother, I heard from Father that you're going to perform the sericulture ceremony?\" Jǐng'er asked.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Huìyīn nodded. \"The sericulture ceremony involves honoring the Silkworm Goddess, harvesting mulberries, and presenting cocoons for silk production. Officials from the Ministry of Rites will handle it, and I'll just go to perform the ritual.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Jǐng'er clearly wasn't there to talk about that and seemed hesitant. Huìyīn dismissed the servants and asked, \"What is it? Do you have something to tell me?\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"It's not a big deal, but the other day, Guō Xìng (Earl Guo's son) entered the palace, and I spoke with him for a while. He seems quite resistant to the marriage with the Yǔwén family. During our conversation, I couldn't tell if he wanted me to convey to you his wish to stop this marriage.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Huìyīn looked at her son with great satisfaction. \"You've grown up. It's good that you didn't rush to take sides but instead understood the underlying intentions.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Jǐng'er hurriedly said, \"It's all thanks to your teachings, Mother.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Children in the palace tend to mature early, and this was indeed true. Her younger son knew to come early to please her, and her elder son confided in her, showcasing his abilities. It was not a bad thing for them to be so shrewd at their age.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"There's no need to meddle in the affairs of subjects. If you take sides, it won't be good no matter which side you choose. You should always be the one who makes the final decision and doesn't intervene in trivial matters. Moreover, breaking up a marriage is not acceptable. I know you're a straightforward child, but his parents have their reasons for arranging this marriage. As royals, we must not interfere in the family matters of non-royal officials.\" Huìyīn certainly understood young love, but people change over time, and if they really couldn't live together, there would be ways to resolve it.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Jǐng'er worriedly said, \"Mother, what if Guō Xìng runs away? With his current resistance and inability to defy his father, he might do something drastic if he's unhappy.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Huìyīn stroked her son's head. \"Maybe that could be beneficial.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Jǐng'er was startled.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Huìyīn explained in detail, \"An emperor's primary role is to maintain balance and prevent internal strife. If they become too united, they might turn against the emperor. So, some minor friction between them could be beneficial to us, don't you think?\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"But Guō Xìng grew up with me,\" Jǐng'er said, noting that his mother usually took good care of Guō Xìng.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Huìyīn smiled. \"If I were an ordinary aunt, I would do my best to help him, but we are different; we are royalty. He stayed with us back then due to imperial strategy, and it remains true today. What I'm telling you now is for your ears only; don't tell anyone.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Family ties often take a backseat in the struggle for power. The Cuī family's hesitation—wasn't it an attempt to rebel? And they are even direct uncles. The marriage between the Guō family and Yǔwén may have been meant to strengthen alliances.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Jing'er nodded secretly, then stood up and said, \"Thank you for your guidance, Mother.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">\"However, this matter is ultimately just a strategy. As the crown prince, you should focus more on the livelihood of the people. If you can control those people while still ensuring their well-being, your policies will be executed smoothly in the future. That is the true way to be a ruler.\" Huiyin said.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">The mother and son exchanged a few more words. Seeing that Zhan'er had fallen asleep on the bed, Huiyin said to Jing'er, \"Your father has summoned you. You should go ahead. Let your brother rest here a bit longer. He went riding horses yesterday and felt uncomfortable. He specifically wanted some comfort from me.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Originally, Jing'er thought his brother was being unfair, coming to curry favor so early by himself, but what his mother said made sense. His brother was still a child. Sometimes, when he was wronged, he just wanted his mother's comfort.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Jing'er then said, \"I will go then.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"Go ahead,\" Huiyin waved her hand and went to her younger son. She tucked the thin quilt around him. It was still the end of February, and although the palace had heated floors, Zhan'er was sweating on his forehead. She helped wipe it and, unable to resist, she kissed her little son on the forehead, sitting beside him, waiting for him to wake up.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Her little daughter, Tonger, was only a month old and was still at the age where she would sleep after feeding. When Zhan'er woke up, it felt as though he was very young again, with his mother taking care of him.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"Erlang, let's go see your sister. Come on,\" Huiyin, who had a somewhat peculiar personality when she was young, was fortunate that her children were all sensible. Therefore, she was very patient with them.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Tonger had just finished feeding and was sleeping soundly. Zhan'er whispered to Huiyin, \"Mother, was I this small when I was young?\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"You were just like that. When you were little, you loved blowing bubbles. I often called your brother to come and see,\" Huiyin mentioned the past, seeing Zhan'er's face turn red, and decided not to continue.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">At dinner time, Li Cheng came over and saw them talking. He looked at his younger son affectionately, \"It's true that you are close to your mother. I couldn't find you anywhere.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Zhan'er quickly bowed again, and Li Cheng gestured for him to sit down.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"I didn't expect Your Majesty to come. Since you are here, I'll have the small kitchen add a few more dishes. How about that?\" Huiyin quickly stood up.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Li Cheng smiled faintly, \"I'll just have some rice porridge. I had Yunnan's tribute dishes at noon, and after eating so much meat, I can't eat anything else now.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"In that case, I'll have them make some small dishes for the porridge. Just wait a moment, Zhan'er, accompany your father,\" Huiyin sent someone to the kitchen.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"Prepare some dried bamboo shoots, dried fish, and stir-fried mixed nuts, and remember not to peel the hazelnuts. Also, we have received many fresh and sweet cabbages from our Jizhou estate. I find them good, so have them make some steamed buns.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">After giving the instructions, she returned. The three of them played a drinking game and waited until the dishes were all served before they started eating. Indeed, when one is tired of rich food, light and sweet dishes feel very good. Normally finding some vegetable dishes fishy, Li Cheng actually ate two. The porridge was quite thin, almost like drinking water, and Li Cheng had two more bowls before stopping.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">While they were eating happily, the Guo family had their own thoughts. Guo Xing had been raised by Huiyin for several years and behaved differently from others. Because back in Huaiyin Mansion, when Huiyin was still a princess, the empress treated her two children with great respect. Whether it was major matters like what to study or minor ones like what food to eat, she always listened to the children's opinions.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">In their own family, it was completely the father's word that counted. He often scolded them, and the stepmother was very polite and always deferred to the father.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"Young Master, please eat a few more bites. You haven't touched the food,\" the servant who had been attending Guo Xing since he was young felt distressed.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Despite his handsome appearance, the young master was to be married to an unattractive woman. It was truly Lord Guo who was causing trouble.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Guo Xing put down his chopsticks, \"I'm going to ride horses. Have someone bring my horse over.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">The horse was a gift from the empress. He hoped that if the crown prince could speak favorably on his behalf in front of the empress, this marriage might be called off. Although the hope was slim, if it were agreed, it would be wonderful.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">While he was thinking this, Jiang Bipbo was speaking with Lady Yuwen. Their horoscopes matched, and they were considered a perfect match. The two ladies were having a meal together and were very cordial with each other.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Lady Yuwen smiled, \"I'm not as close to the empress as you are. We don't live in Xuzhou, and even when I met the empress before, I didn't know how to flatter her. In the future, please teach me more.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"You're too kind. The empress is the most amiable person. Our families have been close for generations, and now we are in-laws. If you have any questions, I will certainly share everything I know,\" Jiang Bipbo thought to herself that she didn't even know what kind of person the empress was.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">She used to think the empress was a virtuous helper to the emperor or a warm-hearted person, but it seemed not. The empress was impossible to define, completely unpredictable.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Other women needed to vent, complain, or even be jealous or greedy for power. The empress lacked nothing. In terms of appearance, she was top-notch, and her husband only wanted to marry her, not even having a concubine. She also successfully gave birth to a son. She was not greedy, and the emperor was delivered to her.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">What could possibly move someone who has everything?</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Madame Yu saw that despite her status, Jiang Bipbo remained humble and considerate, which pleased her even more. As a daughter-in-law, the husband is secondary; the most important thing is to find a good mother-in-law. If the mother-in-law is good, life will be comfortable. Seeing that Guo Xing's stepmother was young and kind, and since she rarely interfered, Huiyin believed her daughter’s life would be easier.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">As the saying goes, 'When brothers are united, they can conquer anything.' The same applies to families. If there are disagreements, big troubles will arise sooner or later.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">It was also said that on the third day of the third month, after dressing properly, Huiyin went to perform the sericulture ceremony. Almost all the nobles and titled ladies came to witness the event. She had moved in two days earlier to personally reel the silk and planned to take it home to spin into thread and weave a garment herself.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Li Cheng even commissioned a painter to create a special illustration of the sericulture ceremony, turning it into a grand affair. From then on, when he was working in the Duanning Hall, he would occasionally call Huiyin over to personally teach her how to handle official duties.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">However, in the process, Huiyin also discovered her own shortcomings. She said to Li Cheng, \"I realized that I don’t truly enjoy organizing others. If you assign me a task, I can certainly do it well, but if you ask me to socialize all day, I find it troublesome.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Understanding people’s intentions is exhausting, and the constant negotiations and compromises only add to the fatigue.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Li Cheng smiled and said, \"Now you understand my dilemma. I'm the same as you. Sometimes, during military campaigns, one person would swear by one principle, and another by a different one. They all say a person must be decisive, but how can anyone know everything? So, you have to talk repeatedly, afraid that people will see through your ignorance. It's really annoying.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"It seems we both have the soul of a carefree hermit, but we don’t have the luxury of stepping away from our responsibilities,\" Huiyin covered her mouth and laughed.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Li Cheng put his hands on her shoulders and said, \"You don’t need to be overly formal when you come here, or worry about overhearing something. In the future, learn from how I handle things. As the saying goes, learning by observation is the best way. You don’t have to learn so much right away. Just listen for now.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"Yes,\" Huiyin replied. She had mostly handled internal affairs before, and at most, she would prepare in advance and offer some advice on external matters. But actually managing a country was an entirely different matter, like taking one step but needing to plan a hundred steps ahead.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Seeing Huiyin so obedient, like a female student, he playfully lifted her chin, \"Since you're so well-behaved, how will you thank me?\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">\"I've been out of confinement for three months now, and my body has fully recovered. You can come over tonight.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Skipping the details of their intimate moments, by day, Huiyin’s eyes sparkled like spring water, and her cheeks naturally flushed pink, which reignited Li Cheng’s desire, though he restrained himself.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Li Cheng got up and said, \"Recently, I'm planning to establish a secret intelligence bureau that belongs to me personally. They will be responsible for spying on everything exclusively for me. What do you think?\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">\"That’s a good thing. If it’s exclusively for Your Majesty, no one below will dare to hide anything from you,\" Huiyin replied.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Li Cheng nodded and said, \"That’s exactly what I thought. I won’t unnecessarily doubt my court officials. After all, people have desires and emotions. How many officials truly serve the people rather than themselves? As long as the person is capable, their flaws are irrelevant. But they can’t just boast without doing any work, or go too far.\"</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">In the officialdom, officials protect each other, and over time, policies get blocked. The emperor has to come up with his own solutions.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">It took almost a year of effort before Li Cheng began to establish his personal intelligence unit. By then, Tonger had just turned one and was beginning to speak.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Sitting on the carpet, Huiyin watched her daughter stumble towards her and quickly reached out. Her soft daughter crashed into her arms.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"Mother...\" Tonger called in a baby voice.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Huiyin pinched her daughter's lotus-like arms and said, \"Hearing you call me ‘Mother’ just melts my heart.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">\"Where's Father?\" Tonger looked around.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Huiyin sighed, \"I take care of you every day, and your father only comes to see you once every few days. You really miss him, don't you?\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">She was just expressing her feelings, but the wet nurse next to Tonger quickly said, \"Your Highness, the princess is still very young and doesn't understand these things.\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">\"Don’t take it to heart. I was just expressing my feelings,\" Huiyin said, not angry with her daughter. Blood relations were magical that way.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">The stewards and wet nurses all smiled. It was very important for them that their master was liked by the Empress. Although the Emperor seemed to treat the princes and princesses well, he listened to the Empress very much.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">That’s how it was in the palace. Even a casual remark could lead to many assumptions. So Huiyin remained as usual and didn’t say anything more.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">At lunch, both Jing'er and Zhan'er came to eat. Jing'er was talking about Guo Xing's wedding, \"He's getting married this month. Mother, please allow me to leave the palace for a while.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">\"You’re such a lover of excitement. Why don’t you ask your father?\" Huiyin shook her head.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Jing'er laughed, \"I wouldn’t dare ask Father. He listens to you the most.\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">\"Stop talking nonsense,\" Huiyin said, but she still interceded with Li Cheng on his behalf.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">However, less than an hour after leaving the palace, Jing'er returned with explosive news, \"Guo Xing has run away from his wedding.\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\"></p>\n</div>"
  },
  {
    "number": 92,
    "title": "Chapter 92",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 92</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Guo Zhao had risen through the ranks in a perilous environment; he was no ordinary man. He held almost complete control within his household, but never had he imagined that just before going to receive his bride, his son would disappear.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Jiang Bipbo handed him a letter and said, \"This is from the heir.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">As she spoke, tears welled up in her eyes, and she couldn't help but cover her face and weep. The failed marriage with the Yuwen family would disgrace both households, and she had been the one responsible for arranging the wedding.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Upon reading the letter, Guo Zhao was so furious that he nearly fainted. Jiang Bipbo quickly stepped forward to support him, saying, \"My lord, are you alright? Please take care of yourself!\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"This wretch is driving me to madness. I don't know how to resolve this mess now,\" Guo Zhao felt so dizzy he could barely stand.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Jiang Bipbo then said, \"My lord, please allow me to speak frankly. Since things have already reached this point, we should send people to find the heir slowly. We only have this one son. We can't let this push him to his death. If we find him, we should let him stay away for a while, and we, your wife and you, can personally go to the Yuwen family to apologize.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Though Guo Zhao had spoken harshly and threatened to beat Guo Xing to death, Jiang Bipbo's words hit home. To be fair, Guo Xing was quite outstanding, had a good relationship with the crown prince, and was well-versed in both literary and martial arts.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Seeing that Guo Zhao's attitude had softened, Jiang Bipbo continued, \"But before that, I need to visit the palace. The crown prince personally attended the ceremony, and now that such a situation has occurred, many matters have reached the palace. If the emperor and empress formed a bad impression of the heir, it would be problematic.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">In reality, Jiang Bipbo's relationship with the empress was not as close as outsiders believed. However, she skillfully used this connection to her advantage, always publicly respecting the empress to let others know that her patron was the empress.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">With this series of actions, Guo Zhao also considered this to be the best solution.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">The next morning, Huiyin heard of Jiang Bipbo's visit to the palace and immediately summoned her. As Jiang Bipbo entered the hall, she knelt down and begged for forgiveness, saying, \"It is all my fault. Yesterday, when the crown prince attended the ceremony, such a thing happened in our household.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Huiyin quickly responded, \"This is not your fault. Guo Xing just... ran away, leaving you to clean up the mess. How is the Yuwen family?\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">\"By late yesterday afternoon, he had disappeared. We had to calm the guests and send people to search for him. I have come to the palace to both admit fault and to ask you to send people to search for the heir,\" Jiang Bipbo said, looking utterly exhausted.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Huiyin, who had also raised Guo Xing, couldn't help but say, \"Even though Guo Xing has disappointed you, he’s still young and acted impulsively. Rest assured, after the crown prince returned yesterday, the emperor ordered everyone to keep an eye out.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Jiang Bipbo knelt down again to express her gratitude, saying, \"Thank you, Your Highness. We can never repay the great kindness you have shown our family.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Huiyin replied, \"Your husband has served the country loyally, and you are like a sister to me. Whether it's for official or personal reasons, we will help wherever we can. As the old saying goes, cultivate oneself, manage the family, and govern the country. It is best for your family matters to be resolved quickly to avoid further gossip.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Jiang Bipbo, hearing that the empress's tone held no blame but only earnest advice, felt relieved. After leaving the palace, she and Guo Zhao went to the Yuwen family to apologize.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Regardless of how humiliated the Yuwen family felt or how they feared that the Yuwen girl might harm herself and thus kept watch over her day and night, the Guo couple apologized sincerely.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Although the two families appeared harmonious on the surface, they could never return to how they were before. Huiyin couldn't help but sigh, \"Since there were already dissatisfactions from the start and the marriage was forced, it's no wonder Guo Xing has now joined the army. In a couple of years, when things have settled, we can arrange another marriage.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"Has Fugui sent the items to the Yuwen family?\" Huiyin asked.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Fugui replied, \"In response to Your Highness, this servant has delivered the pair of fine jade bracelets as instructed and offered some words of comfort.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">\"Yes, the Yuwen girl has been through a lot,\" Huiyin said.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Fugui thought to herself that both the Guo and Yuwen families were now vying to curry favor with the empress, which was indeed clever. At her level, some might wonder why she hadn't stopped the marriage from the beginning. But she knew very well that interfering without reason would have made both families resent the empress, which would not have been worth it.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">This was the perfect timing.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">\"Your Highness has a bodhisattva heart,\" Fugui praised.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Huiyin shook her head, \"If I were truly a bodhisattva, I wouldn't be standing here. Anyway, Guo Xing has been sent to the army by Guo Zhao. It will be a life's trial for him.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">As they were speaking, they heard a soft clapping sound outside. Huiyin knew it was Li Cheng's arrival and hurriedly stood up to receive him. Fugui and the others prepared to bow as well.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">When Li Cheng entered, he led Huiyin back to her seat, saying, \"Guo Xing's actions were truly outrageous, but fortunately, he has the resolve to go to the harshest places. This way, the Yuwen family can't say much, and the marriage has been called off.\" \"Actually, it was Guo Furen who handled everything skillfully,\" Huiyin praised Jiang Bipbo as well.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Li Cheng said, \"This shows that forcing things never turns out well. As parents, we should listen more to what our children want.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Huiyin nodded. \"That's only natural.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">However, Li Cheng soon added, \"I heard that Xie Jiuyi and Yin Liyi have come to the capital. It was previously thought that they were missing, but now they have turned up in ragged clothes, seeking refuge with Yin Cifei.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"Do you think they're planning to back the Yuzhang Prince again?\" Huiyin asked.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Li Cheng dismissed the concern, \"They're already down and out. What do they have to support him with? If they don't even have the confidence to survive, why bother keeping them alive? Besides, it was Yin Cifei who proactively reported the situation to the court, so I can't say much about it.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">In truth, Li Cheng was now the ruler of the realm, and he had to be wary of those who still held some power. Xie Jiuyi was no longer a threat, just barely surviving. Li Cheng didn't feel the need to kick him while he was down.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"Well, since the Emperor’s made up his mind, I won’t say anything else. A few days from now, it’ll be my birthday. Have you thought about what gift you’re giving me?\" Huiyin coquettishly tried to lighten the mood.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Li Cheng patted his forehead. \"I actually forgot about it.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Huiyin poked his forehead. \"If you don't give me a gift, I won't talk to you anymore.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"Don't worry, everything is prepared,\" Li Cheng said with a smile.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">At the Yuzhang Prince's mansion, a lively gathering was taking place. Everyone was laughing. Yin Lifang was holding her younger sister's hand and said, \"You two should stay at my place for now. After a while, I’ll help you get a proper house, and we’ll all live our lives well.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">The two sisters hadn't expected to see each other again. Yin Liyi said, \"It’s only been seven or eight years, but it feels like forever since we last saw each other.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Looking at her carefree younger sister, Yin Lifang noticed that her temples had started to gray, even though she wasn't that old. Compared to the Queen, who was of similar age but had jet-black, lustrous hair and a youthful appearance from living in luxury, her sister looked completely different.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"You’ve had a rough few years. It will be better from now on, living by my side,\" Yin Lifang said with concern.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Yin Liyi thought about the treatment she had endured in the Xie family and couldn't bring herself to tell her sister. Xie Jiuyi's relationship with her had deteriorated to the point of no return, but now that he knew her sister was the Yuzhang Princess, he treated her as before.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">It seemed that no relationship could withstand the test of time. She had once thought Xie Jiuyi would always treat her well, but over time, he had grown cold.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"Sister, I don't ask for anything else. I only have one wish, that you help Fangjie find a good marriage. If you can do that, I'll be grateful,\" Yin Liyi said, having lost interest in everything else.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Seeing her sister's downcast expression, Yin Lifang knew she must have gone through a lot and decided not to pry further.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">That night, Yin Liyi returned to the courtyard of the prince's mansion. She hadn't lived in such a luxurious place for a long time, and it felt like a dream. Her husband sat in a reclining chair, still resembling the aristocratic young man he once was. Seeing him, her resentment just melted away.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">She used to look down on people who loved wealth and thought she could live in poverty with contentment. But after living in the countryside for so many years, being in such a place now gave her a sense of belonging. She seemed to understand something and then looked at Xie Jiuyi. \"In the past, I wrongly blamed you. I always expected a lot from others and thought I didn’t care about fame and fortune. But now, when my sister offered to prepare a house for us and suggested we stay in touch, I didn’t hesitate at all.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Xie Jiuyi had also noticed the change in Yin Liyi. He too couldn't truly accept a life of seclusion. Even without power, living in a bustling area felt more alive.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"Who says otherwise?\" After all these years, he was still grateful for his wife's sincerity. Any other woman might have tried to scheme against him.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Yin Liyi looked at him and said, \"When we were very young, thanks to the favor of the Wu Prince's wife, we lived in that mansion. Our daily necessities were of the best quality. Later, we learned to read and write, and studied proper etiquette all within the mansion. When we grew up, we went to the Prince of Wei’s mansion. Both my sister and I married into wealthy and prestigious families. In fact, we were always part of the elite, and now we realize that we can't bear any hardship. Isn't that absurd?\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">For Xie Jiuyi, it wasn't about whether he could endure hardship. A man without power was like a walking corpse.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Unfortunately, he knew very well that although Li Cheng might have allowed him to seek refuge with the Yuzhang Prince, he would never be given an official position again.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">So, he deeply resonated with his wife's words. \"It was my incompetence that lost the Wei territory. Once it was taken by others, I fell to this state.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">\"Let’s leave the past behind and open a few shops to live comfortably,\" Yin Liyi said with a smile.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Xie Jiuyi nodded heavily.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">The author has something to say:</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">First, let me clarify that some readers have been discussing the female lead. This book was always meant to be a strong female lead story. The female lead, both in her previous life and this one, is more of a dark lotus. She is not the type to be overly kind or empathetic. So, if you find this off-putting, I apologize, but the character's personality was set this way from the beginning.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">The reason for not having double updates is that I didn't make any charts this time, and my back has been aching a bit. Consider it a few days of rest. Once I'm on the charts again, I'll try to update more frequently. Please rest assured.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\"></p>\n</div>"
  },
  {
    "number": 93,
    "title": "Chapter 93",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 93</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Birthday◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Huiyin’s birthday was approaching, and of course, now that she was the empress, the birthday was to be called the \"Qianqiu Festival.\" In addition to the customary rewards, Li Cheng privately gave her a hairpin that he had carved himself, saying proudly, “This jade is of excellent quality, and I thought the engraved magnolia flowers would suit you. Don’t dislike it.”</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huiyin immediately put it in her hair, saying, “How could I possibly dislike it? This is your heartfelt gift.”</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">As the emperor, Li Cheng didn’t have much time to rest. He woke up early to wish his wife a happy birthday and knew that the various titled ladies would soon arrive. He said, “Have fun today. I’ll head to the Duanning Hall first.”</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin wanted to get up to see him off but was stopped. She then had her attendants help her dress, as on such days, formal attire was necessary. If she were to dress shabbily on such an occasion, others might gossip. Even when she was in Xuzhou, no matter how poor the year was, she always dressed elegantly.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">This also had to do with each person’s character. Some people were good at overcoming strength with weakness, relying on simplicity, pity, and feigned weakness to make others devoted. But Huiyin believed that human nature was inherently flawed. She was willing to move people with benefits, especially since everyone had a flawed nature. In the short term, people might help out of sympathy, but in the long run, it required an exchange of benefits.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Even with her natal family, she operated the same way. Although she had deep feelings for them, relying solely on emotions to make someone sacrifice everything for her was not feasible. Even if the person agreed, those beneath them might not be willing.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Therefore, she always appeared elegantly in front of others, showing that the position of empress was stable and the position of the crown prince was even more so.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">The first to arrive was Huiyin’s family from the Zheng family. Elder Madame Xu, as usual, didn’t come. Huiyin always said she understood that Elder Madame Xu was old and didn’t need to enter the palace, but in reality, it was because they couldn’t stand each other. If Elder Madame Xu were to attend grand occasions and constantly demand things as Huiyin’s grandmother, it would be troublesome. Madame Ji, Xin Shi, and Cui Yuehuan arrived together. They first performed the national ceremony, and Huiyin invited them to sit.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Everyone had changed a lot over the years. Cui Yuehuan had given birth to a son and a daughter, and her figure had become more rounded. Xin Shi had also given birth to another son, and even Madame Ji had added a few more fine lines on her forehead.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Madame Ji inevitably asked about the child, “How come we don’t see the princess?”</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">“She just got up and is still a little girl who hasn’t had her hair styled yet. But she insists on wearing hairpins like me. So, I asked the imperial clothing bureau to make her a hat with beautiful silk and velvet flowers on it. She was delighted.” Huiyin was puzzled as she wasn’t someone who particularly loved dressing up, but her daughter was completely different and loved beauty at such a young age.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Everyone laughed, and Madame Ji took it quite seriously, “Your Highness, I have some headscarves. How about I offer them to the princess?”</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Huiyin quickly waved her hands, “No, no. Please keep those scarves for yourself. The princess is still too young to use them.”</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">After a few jokes, Huiyin had someone take Xianjie to the imperial garden to play. She couldn’t help but remark to Xin Shi, “The children grow up so fast. Xianjie has blossomed into a graceful young lady and bears a striking resemblance to her mother.”</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">This was Xin Shi’s proudest achievement, and she tried to suppress her smile, “Thank you for the compliment, Your Majesty. She’s just playful at home. In the future, I’ll need you to guide her more.”</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Huiyin smiled, “Of course. Xianjie is my own niece.”</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">In truth, Huiyin had once considered whether to bring her niece to live with her but ultimately decided against it. Doing so might give others the wrong impression that she intended for Xianjie to be the future empress. There was no such thing as a lasting powerful in-law family. Pei Shuo and the Zheng family had already been rewarded with titles. As long as she was around, the Zheng family would naturally remain at the top, but once she was gone, it would depend on whether the Zheng family could produce capable descendants. If not, that would be their issue, not hers.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Moreover, she later had her own child, Tonger. She could barely give enough love to her own children, let alone share it with someone else’s. If things weren’t handled perfectly, it could breed resentment.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Previously, Xianjie was young, but now that she was older and more understanding, how could she not notice the difference in treatment?</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Even with her own children, Huiyin couldn’t ensure they felt completely equal, let alone a niece. So, she decided to give more rewards but not bring anyone into the palace.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Xin Shi felt a little disappointed, but soon news came that both the Cui family and the Jiang family were arriving together. She had no time to dwell on her feelings. It was well known that Lady Jiang and Jiang Bipbo were inseparable, often accompanying each other. However, due to their children’s marriage arrangements, they arrived separately.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Everyone knew the reason but wouldn’t say it out loud.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Soon, everyone had arrived, and Huiyin said the usual pleasantries. Then Madame Ji spoke to Huiyin, “The Cui family has some joyous news, which is why Madam Cui and the eldest granddaughter-in-law are glowing.”</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">“Oh? What kind of joyous news? Aunt, why is the Cui family so happy?” Huiyin asked.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Madam Cui glanced at Lady Jiang before replying, “Our young master is going to marry Miss Jiang from the Jiang family.”</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">It turned out that the Cui family’s grandson was preparing to marry the Jiang family’s daughter. No wonder Lady Jiang’s face had cleared of any lingering gloom. The Cui family was a prestigious family among prestigious families and was related to the emperor’s maternal family, with a rank even above the Guo family.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Huiyin immediately responded, congratulating them, “What a perfect match made in heaven. Indeed, it’s a wonderful marriage.”</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Everyone thought, ‘No wonder she’s the empress.’ Upon hearing the news, she remained composed, a demeanor not everyone could possess. Jiang Bipbo felt quite upset. The Jiang family’s daughter was now marrying into a higher position, and others might mock the Guo family for failing to recognize true value.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">The Yuwen family had kept it tightly under wraps, and now only Madame Ji knew about it.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Congratulatory voices echoed through the hall, and Lady Yuwen finally felt a surge of pride. Blessed with good fortune, her daughter, although a few years older, would not have to serve her in-laws after marrying Cui Xiaolang, the younger son of the Cui family, who was even more handsome than Guo Xing. It was truly a blessing in disguise.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Originally, it was Huiyin's birthday celebration, but now there was an additional joyous event. Even Li Cheng asked Huiyin at night, \"I heard that Miss Yuwen is marrying my cousin?\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"Yes, the Cui family is quite good at seizing opportunities. The person you trust the most is Yuwen, and now they are marrying into the Yuwen family. Fortunately, the Yuwen family understands its boundaries. I heard that the Yuzhang Prince might also be interested,\" Huiyin said. She had learned many things from her usual conversations with these titled ladies.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Li Cheng frowned. \"Yuzhang Prince?\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Huiyin quickly added, \"Yes, but I only heard that there is interest and it hasn't been made public, which shows that the mother of the Yuzhang Prince is quite sensible. Don't worry, Your Majesty, come, I've been waiting for us to share this birthday noodle together.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">A very simple bowl of birthday noodles, just a few green vegetables and an egg, but she had been waiting for him to share this rare moment of warmth together.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"Delicious,\" Li Cheng praised.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">As he ate, his brows remained furrowed, and Huiyin, aware of his many troubles, did not disturb him. She simply had the table cleared after he finished.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">After Jiang Bipbo finished dining with Madame Ji, she prepared to leave. Madame Ji said to her, \"Don't overthink it. People might gossip for a while, but everyone has their own life, and it will fade with time.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Jiang Bipbo had come specifically to seek Madame Ji's sympathy over her stepson's elopement. She was trying to find a way to truly connect with Madame Ji and the others, and this incident had brought her closer to Madame Ji.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">\"You are right. I am young and have never experienced such things. I always worry about how everyone views us, but with your guidance, I feel much better,\" Jiang Bipbo spoke skillfully.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Madame Ji thought to herself that her eloquence was quite good and felt rather proud.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">After Jiang Bippo left, Madame Ji entered and told Zheng Fang, \"As a stepmother, she is endlessly worried. I told her it doesn't concern her.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"It concerns her a lot. Actually, what relation does her stepson have to her?\" Zheng Fang, who had been inept in his own governance, now saw things clearly from outside the situation.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Madame Ji didn't understand. \"Then why does it matter?\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"Are you silly? The matter of the Crown Prince's marriage is of utmost importance. Although the Crown Prince is not yet of age to select a wife, families always look ahead a few years. As the mother of the Empress, who else would the Empress ask for advice on selecting a wife for her son?\" Zheng Fang had previously helped in the selection of a Crown Princess for his daughters, and he knew the intricacies well. He had sent a lot of money to the mother and sister-in-law of the late Madame Ji.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Madame Ji suddenly realized. \"I have always thought well of everyone. I used to be cautious, but now that my children are doing well, I have let my guard down. However, the Empress is very independent, and I can't influence her decisions.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"Outsiders don't know these things. They think the Empress is very filial and that you have a say,\" Zheng Fang said, yawning as his craving for alcohol returned. He sniffed.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Madame Ji thought that she had always been a simple person. If not for her many trials, she would not have developed any scheming nature. Now that life was good, she had relaxed.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">While she had relaxed, the Yuzhang Prince's Mansion had not. Yin Lifang had heard that Miss Yuwen had not been married off and, although she had doubts, saw an opportunity. After all, the power behind Miss Yuwen was too tempting.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">The residents of the Yuzhang Prince's Mansion appeared as wealthy idlers but held no real power. Noble families in the capital actually looked down on them. The next generation would only be ordinary members of the royal family, as the current dynasty practiced graded inheritance, and after a few generations, they would become commoners.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Unexpectedly, Xie Jiuyi had stopped her, and now that the Yuwen and Cui families were marrying, there was a lot of buzz outside.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Yin Liyi could now discern her sister's thoughts, and she added, \"Sister, not marrying into the Yuwen family is actually a good thing. High-ranking families marry in, and low-ranking families marry out. You have never been on good terms with the Princess Wei, and because of the dowry, the princess almost emptied the mansion. If you find someone from a slightly lower family who is clever, they will be loyal to you in the future. If they have too much backing and are overly compliant, how can they truly respect you?\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\"></p>\n</div>"
  },
  {
    "number": 94,
    "title": "Chapter 94",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 94</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Means◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After the celebrations, it was time for envoys from various countries to come and pay tribute. For such an occasion, Li Cheng asked Huiyin to accompany him. It wasn't because he doted on her endlessly, but because he trusted that Huiyin wouldn't try to seize power as others speculated.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">For her, seizing power would be too easy. If she brought him a bowl of soup, he would drink it without hesitation, even without anyone testing it for poison.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">\"This is the first time foreign envoys are visiting. We should show off the grandeur of our great empire,\" Li Cheng said with a smile.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin knew that Li Cheng's heart was clear and straightforward. Otherwise, why would he, at his age, still talk so naively and compete with others? She looked at him and said, \"In these tributary events, we usually give more than we receive. We need to be careful. Our people’s lives aren’t exactly easy right now.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">If he weren't someone so close to her, Huiyin might not have spoken so honestly. Still, she was careful not to hurt his confidence and only added, \"This time, thanks to you, we get to see so many people. I wonder if the Shengping Bureau's dance is ready.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"Don’t worry, everything is ready, and I’ve personally reviewed the music,\" Li Cheng said meticulously.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Seeing him still sitting in the Duanning Hall, Huiyin couldn't help but say, \"You've been sitting all day. Why don't we take a walk? I used to sit for long periods, and it made me uncomfortable. After I tried horse riding, I almost hurt my back. You used to train outside so often, and now, sitting all day, you should at least walk a few steps.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">With Huiyin's suggestion, Li Cheng obediently let her lead him out. Outside, in the imperial garden, flowers bloomed, and butterflies and bees lingered. Somehow, he was reminded of his time in Xuzhou.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"Huiyin, do you remember our mansion?\" Li Cheng suddenly asked.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"How could I forget? When I first arrived, I loved the garden at Huaiyin Mansion the most. Without it, how would I have gotten through those days alone?\" Huiyin felt dazed recalling the past—too much happiness made time fly. She wished it could slow down, even more.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Granny Chao and Yun Hui felt like they belonged to another lifetime.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Those once fearful and anxious days now seemed to have a different meaning when looked back on.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">However, before the couple could reminisce much longer, they heard that the Empress Dowager had suddenly fainted. Huiyin and Li Cheng exchanged glances and rushed over.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Although the Empress Dowager occasionally had minor ailments, they weren't severe. This time, since she fainted, the couple immediately summoned the imperial doctor.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">The doctor spoke tactfully, but Huiyin understood the meaning. Because of her age and strict vegetarian diet, her energy and blood flow were weak, leading to her fainting. After the doctor prescribed medicine, Li Cheng called for Qin An and instructed, \"The Empress Dowager's diet needs to be proper. She's old, and you can't let her have her way.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Qin An, being the chief steward, knew what to do upon Li Cheng's instruction.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">However, why was the Empress Dowager on a vegetarian diet? It was said to be for Li Cheng's sake. She knew her grandson had been fighting for many years, with much killing, and she used this method to atone for it.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Huiyin's first reaction was to think, isn't this just a way to gain favor? Like pretending to hang yourself to get attention or fainting to pray for the emperor's well-being. These tricks were suitable for concubines seeking favor, but for an Empress Dowager, even if she noticed something, it wasn't appropriate to say anything.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">She understood the principle of not interfering in family matters. Previously, the Empress Dowager, thinking of her grandson, didn't hide anything. Now that she did, Huiyin could see that Li Cheng wouldn't suspect these things.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Sure enough, Li Cheng sighed, \"Grandmother, why did you do this?\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Huiyin also showed concern, \"Yes, I believe grandmother's sincerity is a good thing, but it's not right to harm her body like this. I remember she liked a girl from the Xun family. Having that girl accompany her would give us peace of mind.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Better to bring it up ourselves rather than let others do it, making any pretense of fainting useless.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Li Cheng smiled, \"This is a good idea. You have Tonger to take care of you now, so you can't accompany her for long.\" He didn’t want his wife to be there. In-laws often clash, and spending too much time together would only make things worse. He loved Huiyin, but his grandmother was still his grandmother, inseparable.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Both sides gave each other a step down, quite satisfied.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">At that time, the Xun family was having a meal together. Princess Jianjia had just married into the family. Due to her special status, she usually didn't dine with everyone. But she didn't dare to put on airs either. When she married, Princess Wei advised her that although she was of royal lineage, the Xun family was also related to the emperor, and there was still the Empress Dowager in the palace, so she needed to respect Madam Xun on the surface.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Of course, the current title holder was Madam Xun's eldest son, while her husband was Madam Xun's youngest son.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Madam Xun, who once schemed to drive away Xun Rou, could hardly be considered a benevolent woman, but now appeared kind-faced. \"Tomorrow, we'll go to the temple to burn incense together.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Jianjia, being astute, quickly said, \"I'll come with you.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"Very well,\" Lady Xun said, then turned to her granddaughter, Xun Jiying: \"Child, you need not go with us. A woman should prioritize chastity and tranquility.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Xun Jiying was quite different from Xun Rou. Xun Rou was truly ruthless, doing anything without any limits, but Xun Jiying, born into wealth and raised in a noble household, often read books and wrote, making her exceptionally dignified. She was eight when she left the palace that year, and now she is ten. She naturally understood why her grandmother spoke to her this way—not to make her chaste and tranquil, but to prevent her from getting into trouble.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">The Xun family used to be just a minor official's family, rising to their current status only through the support of the Grand Empress Dowager. However, the Grand Empress Dowager is very old, and if she passes away, the Xun family will lose their standing in the capital. The Emperor has his own maternal relatives, the Cui family, and the Empress's mother's family, the Zheng family, holds two titles. The Cui and Zheng families have long been connected by marriage.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">If Jiying can enter the palace and become the Crown Princess in the future, it could secure the Xun family's prosperity for generations.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">As the saying goes, those closest to the water get the moon first. With the Grand Empress Dowager in the palace, there is always an opportunity.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"Yes,\" Xun Jiying replied respectfully.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Lady Xun's mother-in-law, seeing her daughter unable to go out for a long time, felt sorry for her and said to Lady Xun: \"I heard the Yuwen family is hosting a poetry gathering. Why don't we let Jiying go and play? They have already sent an invitation.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Lady Xun smiled and said, \"The Yuwen family's daughter is about to marry into the Cui family, so they are quite pleased. If she wants to go, let her go.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Unfortunately, before she could go, someone from the palace arrived, saying they wanted to bring Xun Jiying to the palace to accompany the Grand Empress Dowager. The Xun family was overjoyed, while Xun Jiying felt both delighted and apprehensive.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">She first went to meet the Empress in the Linded Hall, the most splendid place in the entire palace. The glazed tiles, the arched eaves adorned with numerous flowers, and the animal-shaped incense burners emitting wisps of blue smoke all added to its grandeur. After passing through the crystal curtains, she knelt down to pay her respects.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"Rise,\" Empress Huizheng said with a smile.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Xun Jiying stood up: \"Thank you, Your Majesty, for summoning me to accompany the Grand Empress Dowager.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Empress Huizheng looked at her: \"You are still a child. In a few days, envoys from various countries will be coming to the palace, so you can come out and play. The Grand Empress Dowager is quite old, so you don't really need to take care of her; there are servants for that. Just keep her company and chat with her. I have already arranged your allowance, and if you need anything, just ask Qin An.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">At her age, a young girl might feel some embarrassment, not wanting to flatter others or do things against her will. But girls mature early and understand the expectations of adults, so they try to meet those expectations.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Empress Huizheng didn't really have any ill intentions toward her. People should strive when they can, but there's no need to humiliate others. The marriages of the Crown Prince and the Second Prince are ultimately decided by the adults. As long as the parents are not foolish, what can others do?</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"Thank you for your consideration, Empress Dowager.\" Xun Jiying could understand the meaning behind the Empress Dowager's words.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Huiyin smiled and said, \"Go ahead.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">The palace maid Baochan, who was in service at the Empress Dowager's quarters, came to fetch Xun Jiying. Along the way, neither of them dared to speak much, as palace rules were strict, and even casual conversations could attract unwanted attention and be considered improper.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">At the palace entrance, Baochan said, \"Miss Xun, the Empress Dowager is still asleep. Recently, she has often been eating vegetarian meals, which has made her feel weak. The Emperor has asked us to encourage her to eat more meat. So, we will trouble you, Miss Xun.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Xun Jiying felt somewhat uneasy. At home, she was the young mistress and, being a child, everyone doted on her. But here in the palace, although she was only ten years old, everyone treated her like an adult.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">After they entered, Nanny Fan waved them over. \"Go and rest in the side hall for now. The Empress Dowager has not woken up yet.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Xun Jiying went to rest in the side hall, but as soon as she left, the Empress Dowager woke up.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Nanny Fan, surprised and delighted, said, \"Ancestor, you've finally woken up. The Emperor and Empress Dowager both came to visit you. How are you feeling now?\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">At her age, even small ailments could cause discomfort. Upon hearing that Li Cheng had visited, the Empress Dowager felt some relief. She had lost all standing in the imperial harem. Even the things she received were far inferior to those of the Empress Dowager in Linde Hall. So this time, she hadn't told anyone and had set up this whole situation.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Even Nanny Fan had been kept in the dark. The Empress Dowager held her forehead, \"I'm still feeling a little unwell.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Nanny Fan quickly said, \"There's medicine just brewed in the tea room. I'll have someone bring it for you, Ancestor.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">\"That medicine tastes awful,\" the Empress Dowager said, leaning back on the cushion, looking rather unhappy.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Nanny Fan said, \"You can't skip your medicine, Ancestor. The Emperor would surely blame us. He's coming over for dinner again tonight.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Hearing this, the Empress Dowager brightened up. Last time, the Emperor had sent her great-grandnephew's daughter away, which had been quite embarrassing. If this time, she could bring her family back into the palace through this situation, it would be perfect. That Princess Zheng was slippery; when she had suggested that her niece Xianjie come into the palace, she could have brought her family in too. But Princess Zheng had said it was against propriety, leaving no opportunity. This time, however, there was a chance.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Seeing the Empress Dowager's mood lift, Nanny Fan quickly added, \"And, the Empress Dowager has summoned Miss Xun to keep you company. She's resting in the side hall now. We, the older servants, can't come up with anything new to entertain you, so Miss Xun is here to accompany you.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">She had expected the Empress Dowager to be pleased, but instead, her face flushed with a mix of emotions.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\"></p>\n</div>"
  },
  {
    "number": 95,
    "title": "Chapter 95",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 95</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎The Emperor's Brothers◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">In the center of the True Appraisal Hall, a group of dancers from the Shengping Bureau were dancing. They spun gracefully on their toes, their movements elegant and fluid, while the music of string and wind instruments filled the air. Li Cheng was hosting a reception for envoys from various countries. It was also the first time Huiyin had seen so many people of different ethnicities. The envoys from Goryeo and the Southern Barbarians performed the same courtesies as the Han people, and they looked similar. However, people from Zhenla and Sanfoqi had slightly darker skin but striking big eyes and eyebrows.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">At this grand occasion, Empress Dowager Huiyin, Xun Jiying, and some noble ladies were in attendance. Some attendees couldn’t help but whisper among themselves that the emperor’s harem only had the Empress, making it seem cold and desolate. But of course, they didn’t dare voice these thoughts aloud.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Even if they had, Huiyin wouldn’t have minded too much.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">The most exhausting thing in life is living up to others' expectations. She whispered to Li Cheng, “This dance is beautifully choreographed.”</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Li Cheng smiled faintly, “It’s good as long as it looks good.”</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Though Li Cheng appeared carefree now, he had secretly learned some Goryeo and Zhenla. Huiyin was quite proud when she heard him casually speak a few words.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">“My emperor is extremely wise.”</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng shook his head, “These are just minor skills. The key is to govern our country well. Only then will foreign states truly respect us.”</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin nodded in agreement. The couple appeared radiant during the banquet, but when they returned to Linde Hall, they both collapsed on the bed, not wanting to get up.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">“You have no idea how much my back hurts; I can’t even straighten up. I sat for too long,” Huiyin complained, leaning on a cushion. She disliked the medicinal patches, finding their smell overpowering.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Li Cheng was in a similar state. Having been involved in wars from a young age, he now had to work hard to govern the country. Often sitting for an entire day, his old wounds would flare up, making him uncomfortable. But he only let his guard down and showed his discomfort when alone with Huiyin.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Seeing Huiyin wincing in pain, he couldn’t help but say, “Should I get some medicinal oil and massage it for you?”</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">“No need. The more you massage, the worse it gets. A couple of days' rest will be fine. But I can rest. What about you?” Huiyin said worriedly, looking at her husband.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Li Cheng grinned, “Don’t worry. With you caring so much about me, I’m already feeling better.”</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">“Silly,” Huiyin said, calling for someone to bring a hot towel for him. Thinking about how hard Li Cheng had worked as emperor, sacrificing enjoyment for duty, her heart ached.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">But if they said they were tired, people outside would surely accuse them of complaining without reason. Li Cheng understood this, so he worked even harder to govern the country well, to leave a foundation for their sons and to ensure the people of this generation would no longer suffer from the horrors of war.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">When these delegations arrived, Shangjing became extremely lively. Even the young ladies who usually stayed secluded in their homes came out. Xianjie and Shi Jie from the Guo family went out together. Their relationship had always been good. Xianjie was two or three years older than Shi Jie and frequently visited the Zheng family with Jiang Bipbo. The two were almost like best friends.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">“Sister Pei, look over there—someone’s breathing fire!” Shi Jie, though not young, spoke logically.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Being a young girl herself, Xianjie immediately agreed and asked the coachman to head to Kaiguo Temple.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">However, their financial situations were different. Jiang Bipbo had grown up in wealth, with money to spare, and after marrying Guo Zhao, she managed to balance the education of a noble lady and a merchant’s daughter for her daughter. To make friends, one had to be generous, especially with Shi Jie, who was a young lady of a thousand gold. She always carried promissory notes worth a thousand taels and had gold beans and pearls in her purse.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">In contrast, Xianjie relied solely on her modest monthly allowance of two taels, rarely buying anything on her own, usually depending on her mother, Xin Shi, to get her jewelry.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Seeing Shi Jie spend two hundred taels on jade in an instant, Xianjie couldn’t match that and said she wouldn’t buy anything for now.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">When she returned home and saw Xin Shi, Xianjie remained visibly upset.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Xin Shi couldn’t help but ask, “What’s wrong? You went out to have fun; why are you upset?”</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">“It’s nothing. There were just too many people today, and I felt a bit suffocated in crowded places,” Xianjie said, not wanting to explain too much to her mother.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">But it was easy for Xin Shi to find out what had happened. Back in her room, Xin Shi discreetly questioned the servants who had accompanied Xianjie. Upon learning the reason, she couldn’t help but complain, “You all should have come to me for some money. How could you let our daughter lose face in public?”</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Xianjie’s steward said, “Our family is a noble family, and our rules are like this. It wouldn’t be proper for a young lady of a noble family to appear like a nouveau riche. It’s not our girl’s fault.”</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Xin Shi lowered her eyes. \"In my opinion, the Guo family is currently troubled by the Yuwen family's affairs. I see that Lady Guo is the Empress Dowager's sworn sister. We may allow them to spend time together for now, but in the future, let's not encourage it. Later, I'll send two famous paintings to her. At her age, she should focus more on reading and appreciating art.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Managing money as a head of household is a concern for the future. A young lady is most carefree during her years in the boudoir. Once she becomes a mistress, she'll worry about the household every day. So, while she can play for now, she should enjoy it.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">The steward said, \"But our young lady and Miss Guo have planned to play polo together in the future.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"We can always decline later. Attending one out of every three invitations should suffice,\" Xin Shi replied.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Hearing this, the steward felt relieved and left.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Unaware of this, Shi Jie was sharing with Jiang Biqbo, \"Those jade pieces were beautiful. It seemed like Xianjie wasn’t very interested, so I bought a few pieces to have carved and given to my parents.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Hearing this, Jiang Biqbo felt uneasy. She thought, as the Empress Dowager's niece, Xianjie's prospects of becoming Crown Princess or a royal consort were likely ruined due to their elopement situation. Originally, she had no desire for such status, being content as a countess with her background. However, since Guo Zhao often mentioned it, she also felt it was a pity.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Shi Jie, as a young lady from a marquis' family, had both looks and talent. With a steward attending to her and being taught household management, she was more than capable of being a royal consort. Marrying someone ordinary would actually be a waste of her talents.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Therefore, Jiang Biqbo thought that compared to the Pei family’s wealth, her daughter's extravagant purchases might come across as flaunting.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"Shi Jie, in the future, you can spend as much as you like, but try not to show off in front of your friends,\" Jiang Biqbo said.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Shi Jie didn't understand. \"Mother, why do you say this?\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Jiang Biqbo chuckled. Indeed, children's interactions shouldn't be restricted by adults; she was becoming overly meticulous.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Mother is just giving you a casual reminder; you don't have to follow everything I say. By the way, last time we went boating with the Empress Dowager, we went to the palace together. You also entered the palace. How did you find it?\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Asking this, she heard Shi Jie say, \"There are indeed too many rules in the palace, aside from other things. The Empress Dowager changed her outfits three times during our visit. If she didn't give the order, the curtains would remain drawn, and no one dared to make noise. I felt really stifled. Also, the banquet—the banquet looked plentiful and elegant, but the sweet cakes were tasteless. We avoided eating the bone-in meats for fear of making noise.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Jiang Biqbo had never considered palace life from her daughter's perspective. Perhaps because of her merchant background, losing her parents young made her feel like a floating weed. She always believed that having power and influence ensured a good life, as wealth alone could easily be taken away.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Thus, she had a psychological dependence on the Empress Dowager. Moreover, the Empress Dowager's conduct was very methodical, and her two sons were intelligent. So, her agreement wasn't entirely due to status, as her husband thought, but because she believed the Empress Dowager would be an excellent mother-in-law.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">But she hadn't realized her daughter didn't long for palace life.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">\"So, you suffered in the palace.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Shi Jie smiled. \"We were considered lucky. We only enter the palace a few times a year. Miss Xun Jiying from the Xun family has it worse. The Empress Dowager's health is poor, and she still has to enter the palace like entering a cage.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Jiang Biqbo was stunned.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">After the foreign envoys left, Li Cheng didn't go to the Duanning Hall but rested well for two days in the Linde Hall. Huiyin took care of him the whole time, and they ate and slept together, even playing with their child.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Li Cheng couldn't help but say, \"You see, after resting for a few days, I feel full of energy. But you, who used to love riding, haven't played polo since your waist injury. It's a pity.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"Look at what you're saying. We have you in the family. Why do you always insist I ride?\" Huiyin pinched his nose, finding his words particularly endearing.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">In truth, he felt Huiyin should be free-spirited and refreshing. He feared she'd get bored cooped up in the palace, not knowing that Huiyin loved lying down. She was content because she had struggled in her youth, and now she didn't need to make friends through activities like polo.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">The couple indulged for a while before going to see the Empress Dowager. Before they entered, they heard a clear voice reciting Buddhist scriptures.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"It should be Miss Xun reciting,\" Huiyin said.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Li Cheng smiled, and they entered. Xun Jiying's voice stopped as she stood up to greet them. After the imperial couple allowed her to rise, Xun Jiying withdrew.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">\"How is the Empress Dowager's health?\" Li Cheng asked first.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">The Empress Dowager was delighted to see Li Cheng come to pay his respects, as the Emperor only visited a few times a month and not often. She hurriedly said, \"I am already better, and I must thank the Emperor for your concern.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">\"It seems that bringing Miss Xun into the palace was the right decision; Your Majesty’s complexion has improved greatly,\" Huiyin smiled.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Truly, mentioning what shouldn’t be mentioned, the Empress Dowager had caused such a commotion precisely for this reason. However, these tactics were ineffective in Huiyin's eyes. Because Li Cheng, out of respect for the Empress Dowager, had already shown exceptional favor to the Xun family. In the early days of the dynasty, granting them land and salaries came from tax revenues, when the state was in dire need of funds for numerous projects. Yet, the Empress Dowager still wanted perpetual wealth and was never content.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Li Cheng also looked at Huiyin, \"Indeed, all her provisions can be compared to those of a county or duchess, treating her as if she were at home in the palace.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Such care for her maternal relatives naturally pleased the Empress Dowager. However, Li Cheng continued, \"I plan to take the Empress, Crown Prince, and others on a tour of the capital region, which may last a month. If there is anything you need, Grandmother, just let Qin An know.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">This had been decided long ago by Li Cheng. Unlike the Wei King, who enjoyed annual hunts to display his martial prowess, such activities often led to accidents during actual hunts.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Now, the court had established a system for selecting military officials through examinations, eliminating the need for the Emperor to take personal risks. He thought that his children, having grown up in luxury, had no idea how people lived outside the palace, so he wanted to take them out to see the world.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Clearly, the Empress Dowager, nearing her seventies, was not suitable for travel. She sighed, having hoped that bringing Xun Jiying into the palace would give her an advantage, but now the Emperor was planning to leave.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Even Huiyin did not know about the trip until they left the Empress Dowager’s palace. She then said, \"We’re really going out to play?\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"Why not? When you were a princess, I took you back to visit my family. Now that you are Empress, should we confine ourselves to the palace every day? This is why I want you to learn to ride,\" Li Cheng, now as Emperor, found less time to talk with Huiyin, always hoping to maintain their closeness as before.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Huiyin clapped her hands and laughed, \"So you were teasing me. I can ride, but only if we ride together.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">\"Shh, keep it down,\" Li Cheng whispered guiltily.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Huiyin found it increasingly amusing to tease him, even as Emperor, he could still blush.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">When they told Jing'er and Zhan'er about the trip, the two children were almost jumping with joy. Tong'er, not understanding what the trip meant, simply clung to Huiyin, clapping along with her brothers' cheers, as if that was the way to join in.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Jing'er said, \"Mother, will Second Brother and I ride horses or take a carriage? I want to ride a horse.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">At ten years old, he always felt like he was more mature than his age. On regular days, Li Cheng discussed state affairs with him, making him feel different from other teenagers. However, his idea was immediately rejected by Huiyin: \"It's still cold outside, and you shouldn't risk catching a chill. Since this is a trip for fun, you should sit in the carriage and enjoy the scenery. If you ride a horse, many people will have to protect you. What if someone shoots a hidden arrow?\"</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">\"Hidden arrow? With so many people protecting me, would there still be hidden arrows?\" Jing'er didn't understand.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Huiyin smiled: \"That's why they say, 'A child of wealth should avoid danger,' meaning you shouldn’t take unnecessary risks. If you were just an ordinary person, Li Jing, I wouldn't care if you galloped around. In fact, I would be proud of you. But you are the Crown Prince, a child of great worth. If anything happens to you, it’s not just me losing a son—it’s the empire losing its future leader. Your father's kingdom might even be jeopardized.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Even though Jing'er had been studying both civil and military strategies, his parents treated him with great respect. Even the eunuchs and maids in the palace were chosen by him. However, there were times when Huiyin would directly tell him when he was wrong.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Being a sensible child, Jing'er acknowledged his mistake after hearing Huiyin's words: \"I understand, mother. Thank you for the reminder.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">\"Don't mind me for being talkative,\" Huiyin said, always mindful of her words. Her son was growing up, and she couldn't discipline him like a little child anymore. If she did, it might create opportunities for others to take advantage.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Seeing Zhan'er looking gloomy, Huiyin knew her words might have upset him, but there was nothing that could be done. Unless Jing'er were unusually mediocre and Zhan'er exceptionally talented, the eldest son of the empress would naturally inherit the throne.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Life was full of disappointments. Even Huiyin, despite having everything good now, still suffered from minor aches and pains. Whether it was her period causing discomfort or her legs aching, she kept these issues private.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Maybe sensing what Huiyin was thinking, Jing'er turned to Zhan'er and said, \"I remember someone gave me a Khitan saddle, which actually seems more suitable for you. Mom’s right. We can’t ride horses on the journey, but once we get to the summer palace, we can.\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Khitan saddles were renowned as the finest in the world. Although they were princes, Huiyin and Li Cheng did not raise their children to be prodigal. They only replaced items when they were broken.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Sure enough, upon hearing this, Zhan'er happily said, \"Thank you, Crown Prince.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Jing'er patted his younger brother on the shoulder: \"Why are you thanking me? I've been wanting to give it to you. I was just looking for a reason. Now it's settled, I can give it to you.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Huiyin was pleased with Jing'er’s thoughtfulness: \"You see, your elder brother always thinks of you when he has good things. By the way, I have some frosted preserved cherries here. This morning, I told Nanny Nan to save them for you.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">She wasn’t sure how to comfort her younger son, but she knew he’d have to learn to accept such realities as he grew up. Zhan'er was more open-minded than she thought. Although he sometimes got upset by certain words, after eating the cherries, his mood improved, and he even took Tonger out to play. Jing'er followed, and they played together.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">He told Li Cheng these thoughts in the evening: \"Our second son shows his happiness openly, which is good, but I still feel a bit guilty. Only one of our two sons can have ultimate power, while the other must always be a subordinate. And it just so happens that Zhan'er is smart, not some fool.\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Li Cheng had never thought about these issues; he loves both his sons equally. \"You're overthinking things, right?\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">\"No, I'm not overthinking it. There are many things we can’t foresee, even if we prepare ahead of time. What I mean is, if we spoil Zhan'er too much, Jing'er might resent it when he becomes ruler. How many royal brothers actually get along well? But if we favor Jing'er and ignore Zhan'er, that would be too harsh.\" Huiyin found this dilemma hard to solve.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Li Cheng put his hands behind his head, feeling troubled after listening to her. But then an idea struck him.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\"></p><p id=\"paragraph-95\" data-paragraph-id=\"95\"></p>\n</div>"
  },
  {
    "number": 96,
    "title": "Chapter 96",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 96</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Incognito Inspection Tour◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Until the imperial procession left, Huiyin begged Li Cheng to tell her what method he was using, but he refused to say.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">\"Mother, Mother, look, that's a moo-moo...\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">A child's voice interrupted her thoughts. It was her daughter speaking. The child, who had never left the palace in her two years, was making a fuss over seeing a water buffalo.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin smiled and said, \"That's not a moo-moo, that's a cow. Cows can be used for plowing fields and can also pull carts. Look, there's a cowherd riding on top of it.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"The cowherd rides the yellow cow, the song echoes through the forest shade. Intending to catch a chirping cicada, he suddenly closes his mouth and stands still.\" Tonger suddenly said.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Huiyin was surprised and said, \"My daughter is really amazing. I didn't teach her many times, but she already memorized it. She has such a good memory.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">In their free time in the palace, Huiyin taught her daughter poetry just as she did with her two sons. Jing'er and Zhan'er were also cheering for their sister. They both adored Tonger without any hint of jealousy. The two boys were playing a game of Go at the moment and continued their game after cheering. The carriage was spacious enough for her to comfortably manage all three children.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Since Huiyin was so eager to know Li Cheng's method, she even probed her sons, \"Has your father said anything to you recently?\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Jing'er had just placed a piece and looked at Huiyin, nodding heavily.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"What did he say?\" Huiyin continued to ask.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Jing'er thought for a moment, seeing his brother still pondering, then looked at Huiyin and said, \"He said a lot. He mentioned that this trip is about observing the people's lives, and I shouldn't act like a Crown Prince, but rather speak less and observe more.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Zhan'er, who had been thinking, added, \"Yes, Father told us the same thing.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\"></p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Huiyin forced herself to resist the urge to roll her eyes. \"That's it...?\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">It didn’t seem like any great strategy, so she didn’t ask further and continued to accompany Tonger in looking outside. Outside looked nothing like the palace. It was autumn harvest season, and the rice fields swaying in the breeze outside looked so inviting.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Since Li Cheng took the throne, all regions were required to report hidden farmland, but this touched the interests of many large landowners. For them, regime changes meant nothing, but touching their land was like creating an enmity. Some incited commoners to make trouble at government offices, while others deliberately bribed ministers heavily to speak on their behalf.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">In fact, Li Cheng’s days were not easy. He aimed to consolidate military power and redistribute land to the commoners, but instead, unrest erupted among the populace.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">The tour didn’t venture far, just around the capital, intending for his sons to inherit his legacy. He didn’t want them to be misled by the gentry if one day he passed away.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">By evening, they arrived at the temporary palace. This was originally the previous emperor’s palace for recuperation. Li Cheng, being frugal, did not have it renovated but only arranged for some defense, cleaning, and basic setup. The five of them moved in.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Jing’er and Zhan’er stayed in the palace opposite theirs. The couple stayed with their daughter. After arriving at the temporary palace, Li Cheng whispered to Huiyin, \"There’s a hot spring here. Go freshen up, and we’ll go soak in it.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Hot spring?\" Huiyin, who had been feeling very tired, brightened up at the mention of it.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Li Cheng smiled. \"Indeed. I’ve heard you’ve been uncomfortable for so long. Ever since you married me, you’ve endured hardships—traveling, giving birth to our children. Even though you seem to live in luxury, you've truly been enduring hardships, anxious and unable to sleep peacefully. How could your body be in good shape? We’ll soak in the hot spring, and tomorrow we’ll have some ginseng chicken soup. The day after, we’ll go out for a walk. Everything will be fine.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">While other emperors might feel they have the world at their fingertips, Li Cheng was filled with anxiety. He feared that his wife might not be able to stay with him forever and worried that many of his well-intentioned actions might be too radical, leading to bigger problems in the future.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Only Huiyin could truly understand his inner turmoil.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">While the children were asleep, they crept to the hot spring pool like thieves. The servants wisely retreated. Li Cheng wrapped his arms around his wife. She wore a delicate garment embroidered with carp playing among lotuses, which made her skin appear even more flawless. He couldn’t resist and pulled it down...</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">The hot spring water gushed over Huiyin’s body. She stood up and deliberately blocked the water with her waist, experiencing an unparalleled sense of relaxation.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Li Cheng, having grown up in the Jiangnan region, was excellent at swimming. Huiyin could swim too, but not as freely as Li Cheng. They splashed water playfully until late into the night before heading back.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">As a result, when they woke up, the sun was already setting. She touched her head. \"I’ve slept nearly a full day!\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Fugui carried a bowl of soup over and said, \"Empress, you've finally woken up. The emperor has taken the Crown Prince and the Second Prince out. The princess came by earlier, but when she saw you were asleep, the stewardess took her out to play.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Huiyin, who usually didn't feel like eating ginseng chicken soup, finished the entire bowl clean, likely because she was hungry.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">As soon as she finished, the two boys came in with flushed faces. Zhan'er had a bow and arrow on his back, and surprisingly, Jing'er was carrying two rabbits. After wiping her mouth with a handkerchief, Huiyin couldn't help but laugh and said, \"Oh wow, you two actually brought that in here. This isn't a hunting ground, you know.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Jing'er quickly replied, \"It was my fault. Today, Father took us hunting nearby. I shot two rabbits and wanted to bring them for you to see, Mother.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"Impressive, truly impressive. Zhan'er, did you shoot anything?\" Huiyin asked hurriedly.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Zhan'er shook his head. \"I didn't.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Huiyin smiled and said, \"Don't be discouraged. You're younger than your brother, yet. When the time comes, you'll definitely be able to do it.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Zhan'er nodded heavily and added, \"Mother, Father and Elder Brother also said the same. But I heard that Elder Brother was able to shoot rabbits at the age of six, so I'm still not as good as him.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"You can't say it like that. Your brother has his strengths, and you have yours,\" Huiyin understood Li Cheng's intentions. A real comparison, though harsh, was the most effective.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Jing'er chimed in, \"Yes, Mother, don't worry. I'll teach my younger brother.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"Well, that's good,\" Huiyin gently touched her younger son's face.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Zhan'er felt a bit ashamed and said, \"Sometimes I want to surpass my older brother, but he always wants to help.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Of course, after all, you two are your father's right and left arms. How could any outside officials be as trustworthy as you?\" Huiyin said with a smile.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">At dinner, there was braised rabbit meat, and the family ate heartily. Li Cheng was talking to Huiyin, \"You've rested enough. Tomorrow, we'll go out in disguise together.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"Alright, tomorrow I won't wear hairpins, a scarf should be fine,\" Huiyin, who had rarely dressed as a commoner when she wasn't Empress, found it novel.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Seeing her like this, Li Cheng said, \"You're still like a child.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">As the children ate heartily, Huiyin quietly spoke to Li Cheng, \"Now that we've left, I wonder what's happening in the capital? Are you worried?\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">She was the kind who feared someone might usurp the throne if she let go of control. Before Li Cheng was in the capital, she was there. Now that they were all out, the Empress Dowager was useless and knew nothing in the capital.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Li Cheng smiled and shook his head. \"You, stop thinking like a princess of a vassal state. I've unified the world for several years now. If someone causes trouble just because I'm away for a few days, then I shouldn't be emperor.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"I know, but I can't help but worry,\" Huiyin said as she placed a piece of rabbit meat on Li Cheng's plate.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Though they were royalty, their meals were quite simple. Exquisite dishes were only for festivals or when outsiders visited the palace. Usually, their meals were very simple.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">This time, while taking his family out of the capital, Li Cheng hadn't really relaxed his control over the capital. But if he told his wife, she wouldn't enjoy the trip fully, so he changed the subject. \"These candied sculptures seem a bit fibrous in the mouth.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"Fibrous? No, I think they're fine. The Fruit Bureau made these just yesterday; could they be fibrous already?\" Huiyin tasted them.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Li Cheng smiled slightly.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">The imperial guards in the capital are still under Pei Shuo's management. He was more diligent about his duties than anyone else. Even Xin Shi mentioned to Lady Dong, \"He's still like a young man, patrolling three times a day. The troops from the Five City Military Division have to avoid him.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Lady Dong laughed. \"That's because His Majesty trusts our Lord. Others would want this opportunity but can't get it.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Now in the family, Xin Shi had both a son and a daughter. Lady Dong hadn't had any more children since her second son. Her son had married into the Xin family, and she was practically the sole favorite. Xin Shi occasionally felt a bit sour but thought she would wait for her future blessings.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Now that Lady Dong had more control over the money, Xin Shi remembered she had several fur coats and a few fine pearl crowns. Since she had no children, perhaps these could be added to Xianjie's dowry in the future.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Pei Shuo may hold a high-ranking position and seem incredibly prestigious, but during the four seasons and major festivals, gifts are still sent to the palace for the Crown Prince, the Second Prince, the Princess, and even Pei Shuo's mother-in-law from the Zheng family. Additionally, Pei Shuo is a sentimental man who supports injured veterans from the Pei family, which costs an untold amount.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Our daughter Xianjie's dowry should be at least one hundred boxes to make it look presentable. It has to be ready within a few years, and I don’t want to touch the family's core funds for this. Last time, when we fled to Xuzhou, I couldn’t take my dowry with me, and thinking about it now still pains me.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Xin Shi is a highly dominant matriarch both inside and outside the household, seemingly treating money like dirt. However, in her heart, she meticulously calculates every grain and coin.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">The two wives were discussing how their interests were closely aligned with those of the Emperor and Empress. They even planned to have beef soup prepared by the mansion and sent to Pei Shuo at the yamen. A few others had similar ideas, but they were only a small minority.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Even Yin Lifang and Yin Liyi were concerned about the marriage of the Prince of Yuzhang. Yin Lifang once considered having her niece marry into her family, but now that their status has changed, it's no longer possible.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Yin Liyi is even more open than Yin Lifang. With Yin Lifang's help, they first purchased a three-courtyard house and then a shop. Xie Jiuyi, skilled in both literary and martial arts, opened a framing shop, which did well due to his excellent craftsmanship.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">The framing shop didn’t require Yin Liyi's direct involvement, so she often came to visit her sister, asking Yin Lifang to help find a match for her. Yin Lifang carefully selected the son of a Yuwen family official, who was a fifth-rank official. Xie Jiuyi and his wife were very satisfied with the match.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Now, Yin Liyi even said to her sister, \"I think Miss Sun would be a good match, don’t you? Don’t set your standards too high.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Last time, although she advised Yin Lifang, it was clear that Yin Lifang still thought families with lower status were not suitable for her son.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"It's not that I have high standards, but Miss Sun has a leg length discrepancy. It's not noticeable usually, but it’s quite obvious when she walks,\" Yin Lifang explained. She wasn’t looking for a prominent family like the Pei, Guo, or Yuwen families.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Yin Liyi smiled, \"Sister, feel free to pick carefully. If there's anything you need me to do in the future, just call on me.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Yin Lifang was grateful to have her sister by her side. Holding her hand, she said, \"Once the prince's engagement is finalized, the Imperial Clan Court will arrange his marriage. I'll give you some money for Fangjie's dowry. Don’t worry.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">\"Sister, what are you saying? You’ve given us the Huaiyin Mansion to live in and even a shop, and now a dowry. We are truly overwhelmed,\" Yin Liyi quickly waved her hands.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">However, Yin Lifang said, \"Living in the capital is not easy. The Emperor is touring the capital region and has left it in the care of Prime Minister Jian. The elder lady of the Jian family is also having a birthday soon, and we need to prepare a birthday gift.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">The Jian family has been extremely prestigious since Jian Qin became Prime Minister. This time, the Emperor left all government affairs to him while touring the capital region, making him second only to the Emperor.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Since becoming Prime Minister, Jian Qin was initially fine, but recently he has developed a love for indulgence, enjoying fine food and clothes. However, he has never changed his wife. He knows very well that the Emperor uses the term \"pig-eared husband\" from their Sichuan region, and their officials below must follow suit.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">However, the Emperor is too young and impatient, wishing for immediate political harmony, but that’s easier said than done. Look, someone is here to discuss matters again.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">\"Come in.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">The person who entered was the top scholar from the last imperial examination, personally selected by Jian Qin, now his disciple. Jian Qin asked, \"Why are you here? Aren’t you at the Hanlin Academy?\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"Teacher, I’m not here for anything else. I heard that the local gentry in Wu Prefecture have presented a petition concerning land disputes.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">\"A petition? That can’t be submitted lightly.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">\"Yes, Wu Prefecture is extremely wealthy with many large landowners. These people may have supported the Emperor before, but now that he has ascended the throne, they are the first to cause trouble.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">\"Should we advise the Emperor to take it slow?\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Despite the warlord conflicts in the past, it was ultimately these gentry who provided support.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">……</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Huiyin got up early and dressed in a blue top and soy-colored skirt, securing her hair with a ribbon. She was pleased with her outfit, though Li Cheng was less enthusiastic.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">\"This coarse fabric will make your skin rough,\" Li Cheng said.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">\"What does it matter? If we kept wearing silks and satins, it would raise more suspicions,\" Huiyin pulled at her clothes and patted the wrinkles.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">However, Li Cheng looked at Huiyin's face and said, \"Even dressed like this, you stand out. It’ll only draw more attention.\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Even in plain clothes, her beauty is hard to hide.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Huiyin clung to his arm, \"I'm not afraid as long as you’re protecting me, no matter what. Besides, we'll only be out for two hours. What could possibly happen?\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">\"Alright,\" Li Cheng knew he had to do this trip. Only by immersing himself among the common folk could he truly understand their thoughts and feelings.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">He initially wanted to bring Tonger, but she was too young, and Huiyin was afraid she might eat something unclean outside. Therefore, he only asked the stewards to watch over her at home while the four of them went out.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Li Cheng only let the secret guards follow from behind. He drove the carriage himself, and the group quietly left through a side gate of the palace. The servants at the imperial retreat didn’t even know they had left.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Coming out, this time without officials clearing the way, Jing'er frowned as soon as they stepped out, \"Father, Dad, look at those people kneeling with wooden sticks on the ground. There's a corpse next to them?\"</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Before Li Cheng could explain, Huiyin already said, \"That’s a grass marker. They’re selling themselves to bury a parent.\"</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">\"How sad. Should we give them some money?\" Jing'er felt reluctant.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Huiyin, however, said, \"We shouldn’t interfere with others’ fates. Moreover, many of these 'selling themselves to bury a parent' are scams, deliberately using beautiful women as bait. Since we’re heading to the countryside now, let's not cause any unnecessary trouble. When your father uncovers more hidden lands and redistributes them to the landless, that will be a great help.\"</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Jing'er still felt uneasy, but Huiyin smiled, \"If we pass by again on our way back, we can help them then.\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Only then did Jing'er let it go.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">They arrived at a small village called Zhanggou. Li Cheng quickly unloaded several wax-dyed fabrics from the carriage into a wheelbarrow, disguising himself as a peddler. Huiyin nudged Jing'er, \"Go on, shout like your father taught you.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Jing'er opened his mouth but still couldn’t shout. Zhan'er, being clever, quickly banged a gong, and only then did Jing'er, his face turning red, shout in a voice as thin as a mosquito's, \"One dou of rice for one bolt of cloth...\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">\"Louder, how can anyone hear you like that?\" Huiyin teased, covering her mouth with a mischievous smile.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Blushing, Jing'er finally dared to shout, \"Villagers, uncles, and aunts, one dou of rice for one bolt of cloth!\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Standing next to him, Zhan'er, who had been laughing, quickly hid behind his mother when he saw many people running out from the village entrance. He felt sympathy for his brother—being a crown prince in this era wasn’t easy, having to peddle through villages. Fortunately, he wasn’t one.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Seeing a group of women surrounding Li Cheng, Huiyin immediately stepped forward. These women hadn’t received much formal education and couldn’t help but glance at her handsome husband in his simple clothes. Huiyin said, \"Sisters and aunts, this coarse cloth was woven by me at home and dyed by my husband. Our grain was taken by my mother-in-law to help my brother-in-law. Our family of four is trying to exchange some for money. If you miss this village, you’ll miss the shop. In the past, this kind of coarse cloth would have cost at least four or five hundred wen per bolt.\"</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Seeing Huiyin’s emotional plea, the villagers immediately offered to let them stay at their homes, which she gladly accepted.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Li Cheng &amp; Jing'er &amp; Zhan'er...</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Weren’t they supposed to ask about hidden lands through selling cloth? How did the script change?</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Huiyin whispered to Li Cheng, \"This is how we inquire. How would we know without investigating? Only by staying there can we understand the situation.\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\"></p>\n</div>"
  },
  {
    "number": 97,
    "title": "Chapter 97",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 97</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎The Twist of Fate for the True and False Ladies◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Do you know how to sew clothes?\" Wang Guihua looked delighted at the young woman in front of her.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huiyin smiled. \"Of course. Thank you for taking us in. Since it's still bright out, how about I make some clothes for you? To be honest, if we had more time, I could even embroider them.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Wang Guihua, evidently one of the few women in her thirties in the village who could run a household without a mother-in-law, had a fiery and bold personality. People like her controlled the money and had a say in matters.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Don’t be fooled by the small rural households; not just anyone could afford to buy cloth.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Sister, I find you very fair and pretty, and your two children are also good-looking. Were you born into a good family?\" Wang Guihua felt that this woman was unusually beautiful, like a mountain spirit.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Huiyin sighed. \"Yes, my husband's family used to own a silk shop. My husband was the eldest son. Though we weren’t wealthy, we had enough to live comfortably. Although my second mother-in-law entered the family later, my father-in-law was still alive, and her true colors hadn’t shown yet. We lived in peace. But last year, my father-in-law passed away, and my second mother-in-law claimed that we shouldn’t inherit any money. She threatened to sue us for unfilial behavior, and she treated us cruelly. So my husband took me and the children and ran away. We didn’t expect life outside to be so tough. We don’t have any land to farm, and we struggle with food and clothing. At least your family has something to eat. I’ve also heard that the court is redistributing hidden land from landlords to the common people. In the future, you’ll all be rich.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Li Cheng, who was pretending to sit nearby, thought his wife was indeed clever when he heard her last sentence.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">But Wang Guihua sneered. \"Sister, you come from a wealthy family and don’t understand our struggles. How many people in our entire village own their own land? We’re all tenants. My husband is honest and doesn’t know how to network. If it weren’t for an uncle working for the Hu landlord’s family, we wouldn’t even be able to rent land.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Li Cheng felt truly angry and coughed, thinking Huiyin would scold the landlords.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Unexpectedly, Huiyin first praised Wang Guihua. \"Sister Wang, you have such connections. No wonder your home seemed the most presentable when everyone else was around.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Generally, when someone reveals their connections, you should praise them first, regardless of anything else.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Sure enough, Wang Guihua was somewhat pleased. \"You flatter me, sister.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Huiyin smiled. \"I’m just telling the truth. How is that flattery? Anyway, our plan is to sell these few bolts of cloth and then go to my great-uncle for help. He might help us buy a few acres of land. Sister Wang, is it easy to buy land?\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Wang Guihua saw Huiyin standing up and beginning to cut at the table, somewhat showing off. \"Let me tell you, when the court says it will distribute hidden land to the people, the slaves, relatives, and their connections of those wealthy families take it all. Ordinary people are still destined to be tenants. Actually, it's worse than before the decree. In the past, working for those wealthy families, they would sometimes waive rent in bad years. Now, these underlings are even more ruthless.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">……</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">That night, they rested at Wang Guihua’s home. Her family was considered relatively well-off, but the floor was still rough and uneven, and the meal consisted of coarse grains, pickled vegetables, and two boiled greens.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Li Cheng found it hard to swallow, but Huiyin ate with relish. Both sons couldn’t eat at all. Zhan'er found it hard to swallow and, after finally getting a sip of water, found the water had a strange taste and spat it out.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Huiyin quietly handed him the water flask and apologized to Wang Guihua. \"I’m sorry, sister. My kids are just too pampered.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Wang Guihua muttered to herself, thinking they were wasting food.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">At night, the whole family slept on one kang. Huiyin yawned several times. Jing'er whispered, \"Mother, it smells bad here.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"It’s probably the smell of chicken droppings. Actually, their family is quite well-off and even raises a pig,\" Huiyin said, preparing to sleep on Li Cheng.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Li Cheng didn’t expect the real problems to be unsolvable even after addressing the superficial problems. He felt somewhat disheartened.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"Huiyin, am I useless…?\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Huiyin said, \"You’re already better than those who sit in the grand halls and issue orders. I truly believe you’ll make things better someday.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">\"Tomorrow, let’s go back and have a good meal. I’m hungry,\" Li Cheng said.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"You’re hungry?\" Li Cheng immediately sat up, wishing he could find something to eat right away.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\"></p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Huiyin pressed him down. \"Let's eat when we get back tomorrow morning. We shouldn't consume any more of their food. They're not exactly rolling in wealth either. Sister Wang is actually a year younger than me, yet we seem like we're from two different generations. Her son is even skinnier than Jing'er, and he was struggling under the weight of that bundle of firewood.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">...</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">The next day, Wang Guihua woke up and went to check if the family in the guest room had woken up. To her surprise, they were gone, leaving two strings of cash on the table. She was stunned.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Huiyin and her group were already having breakfast in a teahouse. Jing'er and Zhan'er were so famished they seemed like they had just come out of a hungry prison. She had never seen her sons so hungry before.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Li Cheng, however, found the food bland. He had accompanied his wife and children for a trip, but the situation they observed during their inspection was far from ideal. He wanted to return to the capital as soon as possible but felt guilty for not enjoying the trip with them.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"Why aren't you eating?\" Huiyin asked, placing a meat bun on his plate. \"Is it because it doesn't taste as good as the food in the palace? When we get back, I’ll make them for you myself.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Li Cheng said with a troubled expression, \"I didn’t expect that what should have been a good deed turned out so poorly because of those under me. I feel like scolding those people when we return.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Huiyin looked at him and said, \"I don't fully understand your affairs, but I believe you shouldn't get involved personally. If you want others to do a good job, you must find capable officials and balance everyone. If you get too involved, it’s like showing your cards, letting everyone know you’re rushing things. You see, even though I know there's discord between my elder sister-in-law and my sister-in-law, I don’t intervene. Instead, I let them read my reactions.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Whenever she advised him, it wasn’t about guiding him on what to do but about using small examples to illustrate larger principles.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Li Cheng remembered that his wife rarely commented on her sisters-in-law, yet both of them sought her favor.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">He, on the other hand, thought about how he had ruled this land since he was young, and how these people dared not defy him. Although he had strategies for balance, he felt it wasn’t right to calculate people's hearts and make them lose hope.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Considering how Huiyin treats her relatives, she understands their little schemes but still manages to keep the Zheng and Pei families loyal to the crown, which isn’t bad at all.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Growing up, people think being honest with others is the best way, but it often ends up making everyone miserable.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Unconditional trust is great in war, but when exercising power, personal desires tend to surface.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">If these desires remain loyal to the crown, it’s fine, but if they are bought by others, it’s not good.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"Huiyin, I'm sorry, but I want to return first,\" Li Cheng said.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Huiyin understood and didn’t argue but told their two sons, \"Eat quickly, and we’ll return.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">They had been joyful when they left, but they returned with heavy hearts.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Jing'er had never imagined that families who ate pickles were considered well-off. Salt is expensive, and even those who lived in thatched cottages had some wealth. He had thought that a farmer's life was like the poems of Tao Yuanming, \"Don't laugh at the rustic wine of farmhouses, for in a bountiful year, they have plenty of chickens and pigs to offer guests,\" with chickens, ducks, and fish in abundance, though their clothing and food couldn’t compare to wealthy families.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">He had even been to a manor before and pitied the people there, but those people turned out to be quite wealthy.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Only Tonger, who didn’t know any of this, was still upset that Huiyin hadn’t come home last night. Huiyin held her in her arms, her arms aching, but feeling guilty for having neglected her daughter the previous night, she continued to hold her. Despite Tonger's young age, she was very concerned about her mother. Seeing Huiyin yawn, she quickly said, \"Mom, why don’t you go to sleep?\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"My dear, you know how to care for your mother now. It's worth all the extra love I've given you,\" Huiyin said with a smile.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Tonger nestled in her mother's arms, acting coquettishly.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">The journey from the capital to the central city was quick, and no one expected the emperor to return so soon. Jian Qin thought it was because the emperor had learned about the petition from the people and rushed back. After all, their emperor was known for being impatient.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Unexpectedly, after returning, the emperor first summoned the Minister of Revenue and the Minister of Works to inquire about the river repair project, which relieved Jian Qin.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Huiyin couldn’t yet manage state affairs, but Jing'er and Zhan'er had matured significantly after their trip.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Upon returning, they learned that Yin Lifang had come to the palace to inform them that the Prince of Yuzhang had arranged a marriage.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">\"Oh, I wonder which family's daughter the prince has married. Why haven't we heard about it before, and why was it arranged so quickly?\" Huiyin put down her teacup and asked curiously.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Yin Lifang smiled and said, \"It’s the daughter of the Zhang family from the Jiangnan region. Madam Zhang is also the daughter of the imperial uncle's family. We met at the birthday celebration of the elder Madame Jian and thought they were a good match. Jing'er is no longer young, and the wedding will take place in a year or two, so it’s settled.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Huiyin remarked, \"It truly is a world of coincidences; Yin Lifang and Madam Zhang, one the true heiress and the other not, are now in-laws.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">\"Who knows if the truth will ever come to light?\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Therefore, she was quite in favor: \"Once your two families have agreed, let the Chancellor submit a petition. The Emperor would not refuse it.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Yin Lifang rejoiced, \"This subject’s wife thanks His Majesty and Her Majesty the Empress.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">\"Jing'er is no outsider; I watched him grow up from a young age. Now that he has grown and manages an entire household, it is inappropriate for him to enter the palace frequently. Since this is such a joyous occasion, I must bestow some rewards so that he may visit the palace more often to pay respects to the Emperor.\" After saying this, Huiyin ordered the attendants to prepare the gifts.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">The new books numbered twenty-six, eighty-eight pairs of gold and silver ingots, two pots of coral jade trees, and various lengths of colored silk.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Yin Lifang was overjoyed and even praised Huiyin: \"Her Majesty the Empress's generous reward shows that our marriage alliance is indeed well-matched.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">In the past, they all thought they were not much inferior to Huiyin, and even looked down on others because of Prince Wei. Now, they could accept reality, and even Yin Liyi felt her sister had changed greatly.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">However, she smiled and said, \"Sister, you seem to like that Miss Zhang so much. Why don't you invite her to meet us? I wonder what kind of person could earn such praise from you.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"The first time I met her, I found her dignified and graceful, with the demeanor of a lady of the house. That Lady Huo wanted to claim acquaintance with her, but unfortunately, I cannot fulfill her wish. I will choose the best for my son; why should I need her false kindness?\" Yin Lifang recalled how the Princess Consort of Prince Wei had tried to strip the mansion bare when Jianjia married, which left her feeling stifled.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">The Yu Zhang Wang's residence was originally her son's home, yet the Princess Consort of Prince Wei, relying on her former status, had dared to give orders in her own household. If not for the show she had put on for the Emperor and Empress, she would not have let her off so easily.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Yin Liyi also agreed, \"Now that her daughter is married, she has no chance to cause trouble. Once Jing'er's bride comes through the door, where will she have any place to stand?\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">The Yin sisters had gone through many things, and their former competitive spirit had waned. Yin Lifang was now focused on waiting for her daughter-in-law to arrive.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">When the Cui family learned of Madam Zhang's stance, they were not entirely in agreement. Lady Cui said, \"Prince Yu Zhang is the orphan of the late Prince Wei, and the Emperor does not favor his family much. Why go to such lengths?\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Madam Zhang, however, had a different perspective: \"Madam, you are right; I am just a woman of little experience. When I met Empress Dowager Yin, my daughter had been away with us on official duties for years. Her father only returned to the capital this year and doesn't know many people. Marrying into a princely house, we only hope for a life of ease and comfort, not expecting anything more.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Even if he's not ideal, he is still a legitimate prince, and your daughter will become a commandery princess upon marriage. The emperor keeps the Prince of Yuzhang close, showing his affection.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Like me, even though I married into a wealthy family, my husband still had to pass the imperial exams. Nowadays, promotions through family connections have decreased significantly. Thanks to my father’s connections, my husband was recently promoted to imperial censor after passing the special exam.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Otherwise, as a third-rank scholar, he would have been posted to a provincial or county office, and who knows when he would have returned?</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">The emperor doesn’t particularly favor his in-laws, much less relatives like us.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Seeing that her daughter had her own thoughts, Madam Cui couldn’t argue and only said, “For now, stay with your husband here at our estate. I no longer manage the household; your elder sister-in-law manages everything now. Once you’re settled, you can visit your sister’s family.”</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Her younger sister, Cui Yuehuan, was married to the younger brother of the empress. When they fled to Xuzhou back then, they sought help from the younger sister and even introduced the then-Princess of Huaiyin, who was not yet empress.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">If a daughter can marry well, she should. It’s better than marrying into a scholarly family and not knowing how long it will take for him to succeed. As for whether the Prince of Yuzhang has power, she didn’t care much. In her opinion, officials who handle so many affairs still find it hard to get promoted, let alone her daughter.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Marrying into a scholarly family, who knows how long it will take for them to succeed? Noble families often rely on monthly allowances, and some even depend on women’s dowries after the family divides. The women suffer greatly.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">After making up her mind, Zhang Furen informed Cui Yuehuan about the marriage following her visit to the Zheng family. Cui Yuehuan had two sons and a daughter, and her relationship with Zheng Wuheng had always been good. Just back from the palace today, she hurried to congratulate Zhang Furen when she saw her.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">“How did you hear about it so quickly?” Zhang Furen was surprised.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Cui Yuehuan said, “It was the empress who told me. She said that your family had arranged a marriage with the Prince of Yuzhang, which is wonderful. A few days ago, the empress rewarded the Dowager Imperial Concubine Yin with many things, which shows she is very much in favor of this marriage.”</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Hearing that the empress had agreed, Zhang Furen was delighted. With her current status, it would be as difficult as reaching the sky to see the empress, but her daughter would easily be able to see her once she became the commandery princess.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Nanny Rong, standing behind Cui Yuehuan, almost cried out. What a coincidence.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Neither Zhang Furen nor Yin Lifang knew all this, and Cui Yuehuan wasn’t entirely clear on it either. After seeing off Zhang Furen, she sighed.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">“Why do you sigh so heavily?” Nanny Rong was puzzled.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Cui Yuehuan said, \"Even my niece is getting married, but our eldest Miss still doesn't have any prospects. I don't mind her living off us; with her here, she can help take care of the old Madam. But the old Madam just can't wait.\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">As she was worrying, she saw Zheng Wuheng come in and asked for his opinion, \"You know a lot of people outside—can you help look into it too?\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Zheng Wuheng, having just taken off his clothes, said impatiently, \"I’ve got my own problems to deal with right now. Prime Minister Jian said someone submitted a petition with tens of thousands of signatures. The emperor isn’t mad, but he’s getting tougher. He says the officials below are colluding and that what’s being distributed to the common people is just the big landlords giving to the small ones. He’s sent some tough officials to Wu Prefecture, clearly to make an example out of someone. I’m afraid it might provoke public anger again...\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">\"Wu Prefecture used to be the emperor’s power base,\" Cui Yuehuan remarked, understanding these matters.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Zheng Wuheng shushed her, \"Imperial spies are everywhere now, so watch your back. The emperor’s more resolute this time around. Some below agree, and some disagree. Those who disagree have been demoted. Even I was told by my sister today—if we have any hidden land, I should give it to the villagers directly and not hide it.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Cui Yuehuan couldn't say much about the outside matters, and thinking of this, Zheng Wuheng got up again to handle his affairs.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Now that Lord and Madam Zheng were no longer managing things, the old Madam was even less involved and instead caused trouble. Outside, Zheng Wuheng managed everything, while inside, Cui Yuehuan was in charge. But she didn’t say or ask much about the outside matters.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">\"It’s getting dark; you won’t get much done going out now,\" Cui Yuehuan said hurriedly, seeing that he was about to leave.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Zheng Wuheng put down his horsewhip, \"Alright, I'll rest for the night and go out early tomorrow morning during my day off.\"</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">He wasn’t worried about losing a few acres of land, but he feared his brother-in-law the emperor might provoke public anger. If the policies backfired, those who were genuinely willing to contribute might become reluctant in the future.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\"></p>\n</div>"
  },
  {
    "number": 98,
    "title": "Chapter 98",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 98</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Heavenly Empress◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Ever since Li Cheng got married, Huiyin knew that he was someone with a strong sense of duty and efficiency. Such people are very suitable to be efficient ministers dedicated to handling affairs. But he ended up becoming an emperor. As an emperor, one must balance the overall situation, not be hasty, and remain inscrutable. One cannot let others know what you're going to do.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">So, whenever he felt anxious and unsure, he would turn to Huiyin. Huiyin would personally make a bowl of lotus seed soup for him, have the attendants leave, and keep only the couple in the room.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Generally, she would read books, do some embroidery, or just sleep. In any case, she wouldn’t ask too much or bother Li Cheng.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">What Li Cheng needed was precisely such an environment. If Huiyin asked a few more questions or was too cautious, it would only annoy him. However, now that Huiyin was sound asleep, he didn’t have to worry about her emotions at all.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">At the Empress Dowager’s, there were constant probes, endless questions, and attempts to benefit the Xun family. In the Duanning Hall, the servants liked to snoop around, and he wasn’t sure if anyone close to him had been bribed.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Huiyin, on the other hand, was sound asleep. She was on her period and needed more rest. On usual days, she was either meeting someone or attending various palace banquets and managing palace affairs. She was very busy, so when she had time, it was best to rest.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">When she woke up, she noticed that Li Cheng's forehead was sweating. She was startled, \"What's wrong with you? You rested in the Duanning Hall last night. I don’t even know if I slept well?\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng gently brushed away her hand, \"It's nothing, just anxious.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"Yes, in the past, during years of war, everyone was only concerned about unifying the world. Now that you are the ruler of the world, you want to govern the country well. However, you spent many years by the Wei King's side before you made a name for yourself. Now that you are the emperor, it's the same. You need to proceed step by step and not be too hasty. You’re too stressed out right now. Don’t eat lamb soup tonight, have mung bean snow water instead,\" Huiyin said.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"Alright, I was just thinking about having some cold stuff, but they kept advising me against it.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"Of course, they are cautious because you are of great value now. Even though I advise you, I am not without fear.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">If Li Cheng ate something bad, the person who gave it to him would be blamed.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">But Huiyin knew that he was too hot and bothered, and ordinary advice would certainly be ineffective.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">So, in the afternoon, there really was mung bean snow water. Li Cheng drank two bowls one after another. Huiyin had been worried about his stomach, but fortunately, he was fine, and she felt relieved.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">This went on for two months until good news came from the capital region. The previously hidden estate fields were all distributed to the common people. Li Cheng finally breathed a sigh of relief. Especially the Wang Guihua family they had stayed with, who reportedly received six acres of land. Even Jing'er and Zhan'er were happy about this news.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Li Cheng wasn’t so anxious anymore. He needed to accompany Huiyin and the children for a lake outing, rowing on the lake, feeling the breeze, reminiscing about the past, which felt like a lifetime ago.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"Lu Xiao and I hugged this fake mountain. The former crown prince rescued us. He was quite clever, saving my elder sister on one side and us on the other,\" Huiyin shook her head.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Li Cheng, however, said, \"If I liked someone, I could never deliberately be cold to them. Even if I had to pretend, I couldn’t do it.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">These words struck a chord with Huiyin. \"I feel the same way. When you met me and saw me as your wife, I knew you were the one for me.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Speaking of the past, Li Cheng added, \"That Zhang Laosan’s noodle shop of yours is opening more and more branches. When we have time next year, we’ll go out and eat together. I was planning to take you there last time, but something happened.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"State affairs come first. Other things don’t matter to me,\" she leaned on his shoulder.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">In fact, their married life was very simple. In the past, when they were in Xuzhou, she needed to help him manage his subordinates, but now Huiyin didn’t need to do that anymore. The freedom to be herself came from her husband.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Becoming an emperor doesn’t mean one can act recklessly. The higher the position, the greater the responsibility.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Li Cheng, at a young age, was already a dragon among men, yet he still had moments of sleeplessness and loss of appetite.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">After the lake outing, the whole family was in a good mood. This was why Li Cheng loved Huiyin so much. She was truly understanding. For example, when everyone else didn’t want him to eat cold stuff, she would take the risk and let him have it because only she knew her own body best.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"The betrothal gifts for Prince Yuzhang have already been exchanged, and the wedding will take place next year,\" Huiyin looked at Li Cheng and said.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Li Cheng sighed, \"In the blink of an eye, Jing'er is getting married too.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"Still Jing'er? Jing'er is not young anymore. Your son is about to reach the age to select a Crown Princess,\" Huiyin looked at him.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">The couple never scrutinized their daughter-in-law's family background, because their son was already the Crown Prince, and their family wasn't like Li Heng's, who relied on marital alliances.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">When such topics were brought up, the adults would always tease, but the children would feel shy. Even someone as mischievous as Jing'er would run away upon hearing such talk.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">As expected, Zhan'er followed Huiyin's instructions to gauge his brother's thoughts. He only had free time at dusk since both brothers studied during the day, practiced archery and horseback riding in the afternoon, and Jing'er even attended political duties in the morning. It was only at dusk that they had some leisure time.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">When Zhan'er arrived, Jing'er was still writing. He quickly bowed and greeted him: \"Crown Prince brother, your younger brother comes to pay respects.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"Back to your usual antics, come over here. What brings you to see me today?\" Jing'er had grown up with his brother and knew the Crown Prince title was his. His brother was talented and clever, not inferior to him, so he naturally had to show the demeanor of an elder brother.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Zhan'er said: \"It's nothing much, just came to sit with you for a while. Today, Mother Queen took my sister to pay respects to the Empress Dowager, and Ancestor kept us for a meal. I had nowhere else to go.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Jing'er smiled: \"If you have nothing to do, why not practice calligraphy? Bring your homework, and we can work on it together.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"Don’t worry, brother, I’ve already finished my homework. I heard that Miss Yu Wen is getting married to our cousin, and Prince Yuezhang’s wedding is coming up soon. I was thinking if we could go out for some drinks?\" Zhan'er, being clever, never went straight to the point when asking about something.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Talking about attending a wedding banquet, Jing'er declined: \"Last time I went to Guo Xing's wedding, the groom ran off and is still at the border. I don't know when he'll be back. I'm too lazy to go anymore.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Zhan'er laughed as well: \"True, but you’re not so young anymore. Last time, Mother Queen mentioned finding you a Crown Princess. She doesn’t feel comfortable asking you directly, so she asked me instead. How am I supposed to know what kind of person you like? You should tell me properly, so I can relay it to Mother Queen and prevent her from randomly picking someone you don't like.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"Did Mother Queen ask you to inquire?\" Jing'er said.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Zhan'er gave a vague laugh and didn’t respond.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">The two brothers looked at each other again, and Jing'er finally said: \"Marriage is a significant matter, decided by parents and matchmakers. How could I possibly have any say?\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Seeing this, Zhan'er, being just a young boy, didn’t ask further.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Since Huiyin didn’t ask further, she didn’t pursue the matter. She didn’t think her son needed to marry too early. Li Cheng married at around twenty, which made him more mature. At fifteen, people were too prickly, always competing over things they didn’t like. A Crown Princess should be from a prominent family, otherwise, it wouldn’t be ideal.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">However, Xun Jiying had been in the palace for a year or two and rarely saw the Crown Prince's face.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">The Xun family didn’t know these details and merely thought that Xun Jiying being in the palace was an added assurance. The Empress Dowager also believed this, so she didn’t let Xun Jiying return home often. Besides, she needed someone to attend to her. Nanny Fan was getting old, and Huiyin, seeing that she couldn’t serve anymore, graciously allowed her to return home, which upset the Empress Dowager for a long time.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">While Huiyin could manage Nanny Fan, she couldn’t control the Empress Dowager's insistence on keeping Xun Jiying for company.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">As for the affairs of the previous dynasty, Li Cheng was exhausted. The Shengping Bureau had been neglected for a long time, and such trivial matters were not appropriate for her to bother her husband with anymore. Fortunately, she had family members like Madame Ji, who also came to the palace to keep her company.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Over the years, Madame Ji had been living in comfort, but age was catching up. Huiyin used to fear getting old, always feeling that once people aged, they would be disliked. However, her mother's vitality was enviable. She even told her: \"Yesterday at home, I drank a large cup of wine and slept so soundly.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">\"Your health is even better than mine,\" Huiyin smiled, though she didn’t have the luxury of such leisure.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Madame Ji held her daughter's hand and said: \"This is all thanks to your blessings. I believe you should also take good care of yourself, Your Highness. I see that despite your high position, you’ve become increasingly slender.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Huiyin said: \"I'm not as round as before, but I'm actually feeling more energetic now. In the past, in Xuzhou, the Emperor was often not at home, and I had to manage everything inside and outside the house. Sometimes, I couldn’t have meals on time. When I did eat, I would eat a lot, which naturally made me put on weight.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Being in a high position has its own challenges, something Madame Ji understood very well.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Just like her son, when Zheng Wuheng was mentioned, Madame Ji would say: \"Your brother is becoming more and more promising. Now he's helping the Emperor with official matters and volunteered to go to Jiangnan for a mission. He’s so young, and while he’s capable in war, handling civil official duties worries me.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"I’m worried too, but since he has the heart and energy, the Emperor can’t possibly stop him from contributing.\" Her brother Zheng Wuheng was passionate, and he was concerned that Jiangnan might rebel because of this matter, so he personally led people to handle it.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Additionally, one needs tasks to remain relevant in the Emperor's eyes. Without responsibilities, one risks being forgotten and ends up depending on ancestral connections. Pei Shuo was just a step too slow. He had intended to help the Emperor share his worries, but since his brother had already volunteered to go, he couldn’t go as well.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">\"These are civil official duties; why is Second Uncle going? It’s unclear if he can manage them effectively,\" Xin Shi said.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Pei Shuo and Zheng Wuheng were inseparable as brothers. He knew why his brother took on such a thankless task. He genuinely wanted to alleviate the Emperor’s concerns, but he worried that some people were only trying to curry favor by completing tasks, potentially offending others and causing future conflicts.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Therefore, he scolded Xin Shi, \"Since you have so much free time, why don't you help Guge find a good marriage? Why bother with these matters? He has his reasons for doing so.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Xin Shi was naturally indignant. Back then, Pei Shuo was the first to pledge allegiance to the Emperor, while Zheng Wuheng went later. Yet, whenever there were titles or merits to be awarded, Zheng Wuheng received more. She couldn't complain much, as her husband would get angry if she did.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">\"Fine, I was wrong to say anything. I happen to be going out now,\" Xin Shi took the opportunity to meet Jiang Bibo.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Jiang Bibo had invited them several times. Xin Shi hadn't planned to go, but now she used this pretext to leave, bringing Xianjie along. Actually, the two children weren't as preoccupied with thoughts as the adults assumed.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">When the sisters met, they were affectionate and chatted warmly. Xianjie pointed to the old lady behind her and said, \"You still have so many servants at your place?\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">\"Indeed, it's like this wherever I go, and I can't do anything about it,\" Shi Jie said. Recently, she had been strictly controlled by these servants, and even her father, who usually doted on her, didn't help her.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Xin Shi also said to Jiang Bibo, \"Has your heir sent any letters back? I think since Miss Yu Wen has already married into the Cui family, no one is gossiping about it anymore. You can't let him stay at the border forever. If he returns, with his appearance and status, he can marry again, and everyone can live in peace.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"My dear sister, do you think I haven't considered this? But after all, I'm not his birth mother. Everything depends on our lord,\" Jiang Bibo dared not wade into troubled waters.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Xin Shi laughed, \"True, I spoke out of turn. By the way, I heard that your family has donated five hundred acres of land in Jiangnan?\" This news had startled her a little.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Jiang Bibo smiled and confirmed it. After winning the battle, the Emperor redistributed the land. Guo Zhao received several good pieces, and naturally, during the war, he couldn't help but secure some benefits for himself. Unwilling to give these up, Jiang Bibo made this generous gesture, hoping that the Emperor would take it into account and perhaps overlook some matters in the future.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">\"You are indeed wealthy,\" Xin Shi's concerns were different from Jiang Bibo's. Ever since becoming a royal family, the Xin family couldn't interfere much with the affairs of the Pei and Zheng families, as the Empress had the final say.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Like how the Xin family had pledged a lot of land to Pei Shuo, much of which didn't require any taxes. Pei Shuo returned all of it, even at the cost of offending the Xin family, his in-laws.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">But Xin Shi had no choice. The Empress's words carried more weight than hers, and even the Zheng family had to return a lot of land.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Whenever she said something, her family dared not defy her openly.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Jiang Bibo was guessing Xin Shi's intentions, seeing her beat around the bush, knowing she might have come casually. So she had more tea served, \"Madam Pei, let's not talk about wealth. Others may not know my background, but you do. I was originally born to a merchant family and was fortunate enough to be noticed by the Empress, who married me well. If there's a chance, I naturally want to contribute...\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Hearing this, Xin Shi comforted her instead.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Now, with the Emperor strictly investigating lands, the Zheng and Pei families, following Empress Huiyin's instructions, weren't particularly greedy. Zheng Wuheng proactively returned the lands, while Pei Shuo even quarreled with the Xin family over it. However, the Cui family was reported...</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Li Cheng was very angry and said to Huiyin during a meal at Linde Hall, \"These people have long hated my policy, so this time they remained still and brought out the Cui family. The Cui family isn't above reproach, thinking they are my in-laws and can allow others to pledge lands.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">\"Calm down, calm down, and sit. There's no need to blame yourself. This is a good chance to set an example,\" Huiyin smiled.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"There might also be the Xun family. I'm afraid even the Empress Dowager will come to make a fuss,\" Li Cheng held his forehead.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">It's rare for people to give up wealth once it's in their pockets. The Zheng family wasn't short of money, had few family members, and Zheng Wuheng, young as he was, held a high position, so he needed to keep his reputation clean.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">It’s been so long, yet people still don’t take the ban on hiding lands and pledging seriously.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Before Li Cheng could punish them, Madam Cui requested an audience, which Huiyin naturally refused. Not only were they not close to the Cui family, but it was also inconvenient to meet at this time.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Unable to get an audience, Madam Cui went to see Cui Yuehua herself. She couldn't help but say, \"It's all our family's lands, not others. Since ancient times, relatives have protected each other. It's hard for your father to refuse.\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">\"Mother, this matter is serious. Father is being foolish,\" Cui Yuehua urged.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Madam Cui wiped her tears, \"These people have been targeting our family for a long time, planning to report us to the Emperor. If the Emperor judges according to the law, anyone hiding lands will be punished by law. Father could be exiled. You wouldn't want that, would you?\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Having lived in glory all her life, it was infuriating to be reported at the end. If the Wu Princess Consort were still alive... But she died early, and the Xun family had little relationship with them. As for the Zheng family's daughter, her daughter was most afraid of the Empress and was always respectful, so she couldn't be counted on.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Seeing this, Cui Yuehua said, \"You can't even see the Empress, so it's even harder for me to do so.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">\"You still have to speak up for our family,\" Madam Cui said.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Reluctantly, Cui Yuehua said, \"I'll do my best.\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Indeed, the Empress Dowager didn't bother with Cui Yuehua either, simply refusing to see her. Cui Yuehua went to Madame Ji, but Madame Ji pretended to be sick, making it clear that she didn’t want to get involved. Zheng Fang still had to go through the motions of serving medicine.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">\"There, take this. The Cui family is indeed too greedy, thinking they're extraordinary just because they're related to the royal family, and they don't even take the Emperor seriously.\" Now, Zheng Fang had become quite articulate.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Madame Ji shot her husband a glance, \"And you're bringing this up? Weren't you unwilling back then too? It was Heng'er who rejected it.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Zheng Fang was infuriated by her remark and slammed the medicine on the table, \"You're bringing up ancient history now, really?\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Madame Ji wasn't afraid of him. She had thought it through clearly. As their daughter said, their power and status all came from the Emperor. When the Emperor implemented any decree, they had to support it. It would be foolish to give up the Emperor's trust for a little immediate gain.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">...</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Outsiders believed the Cui family, being the Emperor's maternal uncle, was invincible, but in reality, Li Cheng wasn’t particularly close to the Cui family. Therefore, when Cui Xun’s concealed lands were discovered, Li Cheng announced in court that not only did the Cui family have to return the land, but Cui Xun would also be exiled for five years.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">It was the Cui family’s eldest son who wrote a letter requesting to take his father's place in exile, and Li Cheng agreed. However, Cui Xun didn’t want to drag his son into this. Though he was old, he couldn’t bear such humiliation and ended up hanging himself.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">This incident, while it frightened others, caused Li Cheng to collapse from a rush of blood.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">He’d been losing sleep over the land issue, and now with this added stress, Huiyin was deeply concerned. Even if he recovered, he would need time to recuperate. While Li Cheng was recovering, he arranged for the Crown Prince to handle court affairs and granted Huiyin the title of Heavenly Empress, allowing her to listen to the court behind a curtain.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Huiyin felt an odd sense of déjà vu.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\"></p>\n</div>"
  },
  {
    "number": 99,
    "title": "Chapter 99",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 99</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Regency Behind the Curtain◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The news of the Empress assuming regency spread throughout the court, and the most exhilarated person was Zheng Fang. He had been resting on the bed, with two young servants massaging his feet, enjoying a leisurely and comfortable life. Lately, he had fully embraced the lifestyle of a wealthy man of leisure. With the Emperor being shrewd and efficient, and his son always finding things to do, he could rightfully avoid responsibilities.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Unexpectedly, his daughter was about to assume regency. He first spoke boldly, scolding the Cui family, and immediately asked Madame Ji to find his long-stored official robes, as he needed to attend the grand court meeting.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Madame Ji was speechless. \"How long has it been since you attended court? Do you even know what’s going on at court? Don’t make a fool of yourself.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"Make a fool of myself? I’m going to help my daughter. You don’t understand. Even the Emperor, with his strong will, still has to face off against them. My daughter has probably never seen such a scene before, and I’m going for her own good.\" Besides this wish, Zheng Fang also thought that if his daughter truly took control of the court, he might become a regent, which would be quite prestigious.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Originally, Madame Ji didn’t understand these court affairs. When she was younger, being from a military family, she could go to the battlefield, but sitting down all day dealing with political intrigue was not something she could handle.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Hearing Zheng Fang’s explanation, she found it somewhat reasonable.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">However, she hesitated. \"Do you think the Emperor will be alright?\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">She didn’t want anything to happen to her son-in-law. After all, her daughter was a woman of the inner palace, and the Crown Prince was not yet grown. If something happened to the Emperor, the country might fall into disarray again.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Zheng Fang shook his head. \"The Emperor is a strong-willed person. If he steps back for a while due to his uncle’s passing, public opinion might claim that the Cui family infuriated the Emperor. But I don’t think he cares much about his reputation. It might really be—\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"What about her?\" Madame Ji was most worried about this.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"What about her? Isn’t our family here? You don’t think my two sons can handle things?\" Zheng Fang reassured her.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">The Pei family was also anxious. Today, Pei Shuo was resting at Dong Shi’s place. Dong Shi had just finished dining with her son, and when it came to her child, she had endless things to say. \"The wet nurse feeds him, but he refuses to eat. Only when I feed him does he eat.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Pei Shuo smiled, pleased to hear this. \"Even though he’s young, he knows who he’s close to.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Dong Shi struggled to respond. Actually, her son’s betrothal to the Xin family had made her relationship with Xin Shi somewhat better, but Pei Shuo was not entirely satisfied, and today, his words had a sharp edge to them.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">However, she couldn’t stay silent. She still cared for Pei Shuo and understood he was thinking about their son, so she smiled and said a few more things about household matters.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Pei Shuo said, \"I might not be home much these days. You should also avoid going out unnecessarily.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Dong Shi was puzzled. \"Why is that?\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"The Emperor’s health is not well, and the Empress is assuming regency. I’m responsible for safeguarding the capital, and at this time, we cannot afford any mistakes.\" Pei Shuo explained.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Dong Shi’s heart tightened. She had just had a few years of peaceful life and didn’t want anything to happen to the Emperor. If something happened to the Emperor, Pei Shuo would be in trouble, and who knew what the future would hold?</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">So, she asked again, \"Will the Emperor be alright?\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">It seemed that Pei Shuo noticed her unease and smiled. \"Don’t worry, and besides, there’s the Empress. She’s not an ordinary woman.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Other women, even if highly respected, mostly shared in their husband’s glory, but his sister was different. When they were in Xuzhou, she helped transport grain and managed everything inside and out. She was very capable.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Actually, Huiyin was not without her own anxieties. In her previous life, her son was too young, and the regency behind the curtain was to consolidate her son’s position. But no matter what she did, at least no one criticized her. Now that Li Cheng was still here, if she did anything wrong or was deceived, all of Li Cheng’s hard work would be for nothing.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">So she said to Li Cheng, \"Maybe we should wait until you’re better.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Li Cheng, who was usually impatient, became clearer after this fainting spell. Leaning on the cushion, he said, \"If I don’t let you handle things, how will we know who’s causing trouble? The Cui family is certainly detestable, but the people behind them who have been setting obstacles and making me stop are also a problem. I want to see who they are. Besides, my head really hurts.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">He knew that if he didn’t say this, Huiyin would never agree.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Sure enough, when Huiyin heard that he had a headache, she said, \"I’ll call the imperial doctor again and have you treated with acupuncture.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"No need. I know my illness. It’s just that I’m too anxious and angry, which makes me uncomfortable. I just need more rest. You always avoid seeing doctors even when your waist hurts, don’t you?\" Li Cheng sighed.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Huiyin would only seek treatment for obvious external injuries; for issues like back pain, she believed that unless there was a fracture, excessive movement by others could make things worse. So, she could empathize with Li Cheng. Now, with her hands spread, she said, \"In this case, I can only steel myself and proceed. But I will play it by ear and help you root out the people behind the scenes, just as you said.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Li Cheng clapped his hands and laughed, \"Good, good, good! I knew you had the ability.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"I agreed to your request easily, but in reality, I’m not confident at all,\" Huiyin looked at her husband and secretly worried.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">At this moment, Li Cheng seemed to have become deaf. Huiyin angrily threw a handkerchief at him, and Li Cheng just smiled.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">So, Huiyin called Jing'er over first. She said, \"I am troubled about tomorrow's court session. You are always better than me, and you often accompanied your father. Let's discuss this matter between us. We can't be controlled by the external ministers.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Jing'er had always been the crown prince and had been attending court sessions, but this time, with his father collapsed, he felt much more burdened.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Fortunately, the empress stepped up. Jing'er nodded, \"Mother, what is the plan?\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"We will first send someone to Duanning Hall to get the memorials from these days, and copy down the urgent matters. I think most of them are about farmland, and from these, we can also see your father's intentions. Then, each department will handle their own affairs. For those we don't understand, we will ask them to write detailed reports. In any case, we must remain calm. Once this period is over and your father recovers, both of us will be relieved.\" Huiyin stroked her chest, her expression highly tense.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Jing'er stood up and agreed.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">The memorials were quickly delivered. Jing'er had known that his mother was very measured. When his father reviewed the memorials, she would always step aside and rarely interfere, even with state affairs.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Now, seeing the memorials, she quickly sorted them.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">One batch was about farmland from various regions. She hastily registered the names of those who submitted the memorials. Jing'er saw her writing swiftly with great memory, mainly noting how Li Cheng had responded. She showed Jing'er the reviewed ones, \"Look, this is how your father replied. We will follow this.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Jing'er had previously thought that his mother was afraid of fatigue and would often want to lie down, but seeing her now full of energy, acting swiftly and decisively, making decisions in an instant, he found her completely different.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Even he might not have been able to endure. As Huiyin yawned, she went through the matters, which somehow calmed Jing'er's heart.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Neither of them had much confidence. Huiyin woke up startled in the middle of the night, not having slept well. Even after fully dressing, she told Jing'er, who came to fetch her, \"My heart is racing.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Jing'er, still a teenager, was very nervous hearing this but still comforted Huiyin, \"Mother, don't worry, your son is standing right next to you.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"You’ll be standing next to me?\" Huiyin grew even more anxious. This wasn't traditional regency from behind a screen; she would be directly seated on the throne, with the crown prince standing to her left.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">She couldn't let down his trust.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">After stepping down from the sedan, Jing'er saw that his previously anxious mother now appeared calm. The courtiers were almost all waiting here. They walked in, and everyone knelt down, shouting long life.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Huiyin couldn't see the people clearly, just a dark mass before her. She didn't feel the superiority of being an emperor. Having this power, she couldn't abuse it.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">She signaled to Qin An on her left, who raised his fly-whisk and called out, \"Rise.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Everyone stood up. Some of them had seen Huiyin before, while others were seeing her for the first time. Previously, they had only glimpsed her from afar during the sericulture ceremony, barely making out her features. Now, they saw her with a crown and sitting upright, with sharp eyebrows and a calm expression.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">As an outsider, Zheng Fang stood in front, ready to charge for his daughter at any moment. He carefully looked at his daughter a few more times. As an external minister, he was not as fortunate as his two sons, who had been serving in the imperial court and could see the emperor more often. He rarely had the chance.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"If you have matters to present, do so now. Otherwise, the court will be dismissed.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">They exchanged uneasy glances, thinking that as a woman, she wouldn’t meddle in state affairs—otherwise, it would be akin to a hen crowing at dawn, which was unacceptable.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Left Chancellor Jian Qin spoke first, asking, \"Esteemed Empress, may you enjoy long life and prosperity. How is His Majesty’s health?\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">This question was a subtle trap. Inquiring about the emperor’s health could reveal whether Li Cheng was still capable of ruling.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Jian Qin, a senior minister from Xuzhou, didn’t press further, but some ambitious officials saw an opportunity for advancement.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"Your Majesty, Imperial Academy Scholar Wang Pao has a matter to present. Our primary concern is the emperor’s safety. Without him, we cannot focus on governing effectively.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">His words did indeed garner several nods of approval. Just as Zheng Fang was about to speak, he heard Huiyin above say, \"You constantly invoke the Son of Heaven, yet in reality, you are spying on the emperor's actions. The emperor's oral decree has appointed me to oversee the court, but you disregard it. You say one thing but think another. Truly, you are full of hidden intentions. What reward do you think you deserve for such behavior?\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Zheng Fang quickly stepped forward and said, \"In reply to the Heavenly Empress, this official does not follow your orders and should be relieved of his duties.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">\"Oh, but the Son of Heaven encourages open discourse. How can I, as the empress, casually dismiss an official? The emperor's health is not yet recovered, and I am merely standing in for him to safeguard the household. If everyone wishes to question the emperor, then continue. I don't believe anyone would dare defy authority just because the emperor is not present.\" Huiyin said this with a smile, but those below were sweating profusely.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Zheng Fang thought to himself, good, good, good, she is indeed my daughter.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">The sharp-tongued Wang Piao dared not say more. To continue would mean inviting the empress to remember any defiance, and even if the emperor did not heed whispered advice, the crown prince was still present.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Where there were thorns, there were also those particularly adept at handling situations. A young official stepped forward and said, \"Your Majesty, Dong Fen, Director of the Ministry of Rites' Guest Affairs Bureau, has a memorial. The students from Goryeo, Southern Barbarians, and Dali have entered the Guozijian, and their envoys have been settled. Please review, Heavenly Empress.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">An attendant quickly brought the memorial, and Huiyin, who had already seen it, simply said, \"They have all arrived, and their customs vary. The Reception Office must host them well.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Non-committal responses were sufficient by this point, and Huiyin also breathed a sigh of relief.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Then came the Ministry of Finance's report, and indeed, this time it concerned land matters. Jing'er glanced at Huiyin, and Zheng Fang was also anxious since he wasn't very clear about this matter. Pei Shuo, though frequently reading the court gazette, was not a member of the cabinet and, being a military officer, could not easily comment on unrelated matters.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Huiyin said, \"The lands of Qing and Xu have already been measured. Why do the previously measured acres differ from what is being reported now? Please draft a detailed report.\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">After saying this, she also glanced at Jing'er, who thought to himself that his mother was indeed clever. For matters not understood, they should be detailed in writing, with only a general summary given orally.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">The Ministry of Works then reported on water conservancy matters. Huiyin thought that she had seen this memorial before, and Emperor Li had also discussed it with her. It was a fitting topic, so Huiyin gave an extensive discourse, to the astonishment of the Minister of Works.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Jing'er thought to himself that his mother's memory was indeed too good, with many replies from the memorials the day before.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">This was called handling known matters by stalling for time and presenting detailed reports for unknown matters.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Everyone below listened as the empress spoke. Her words were clear, her voice soothing, and her reasoning impeccable. She was quite appropriate and unhurried, earning the silent admiration of those present.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Even Zheng Fang couldn't help but stroke his beard and exchanged a glance with Pei Shuo, smiling.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">After court, Huiyin changed out of her formal attire and said to Li Cheng, \"Hurry and rise. I truly cannot hold on any longer.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Li Cheng laughed and pointed at her, \"I heard that you remained composed in all matters. Good Huiyin, let me rest for a few days.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">\"You've rested enough, but I was overwhelmed. Teach me again, will you?\" Huiyin's coquettishness was unbearable for Li Cheng.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Li Cheng explained a few more things, only to find that Huiyin had fallen asleep. He couldn't help but laugh. It was hard on her, but he also felt a sense of relief. His wife indeed responded swiftly, though she was a bit lazy. Unexpectedly, even though Huiyin was like this, there were still secret letters saying that the empress wanted to dominate the court.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">If she really took his place, it would be good. Then he could rest more and enjoy some easy life. It's just that some people couldn't see it that way.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">While she slept, Li Cheng seized the chance to kiss her repeatedly.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Huiyin felt she was trembling with fear, but Zheng Fang was delighted and even invited Pei Shuo to his home, where he talked non-stop at the banquet, \"My sister truly remained composed. Some of the things people said made me angry, but she could think of countermeasures. It's exhausting, truly exhausting.\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">\"Yes, my son thinks the same. Sister, wearing the yellow robe and sitting there, had an imposing presence. Her words were appropriate and precise, and no one below dared to act rashly.\" Pei Shuo thought that while other women might desire to be protected, she could stand on her own, though one wonders how tricky the court and the public could be.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">However, ten days later, when Li Cheng attended court, he appeared completely normal, much to Huiyin's relief.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">The Zheng family quickly came in to pay their respects. Cui Yuehua did not dare to mention the Cui family's matters. Now that the Cui family's title was with her elder brother, they did not dare to make a big deal out of mourning, especially since they had angered the emperor, which was the Cui family's fault.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Huiyin remained calm and did not bring up the Cui family, only saying, \"As long as the emperor's health is secure, we are all well.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Madame Ji smiled and said, \"Who wouldn't agree? The emperor's health brings peace to the empress as well.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">\"I also say this. I heard that my younger brother has handled matters well in Wu Commandery, and the emperor praised him just yesterday. Mother, you also benefit from this.\" She only said a few pleasantries.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Madame Ji then said, \"Thanks to the fortune of the Heavenly Empress, many more people visit our residence now. I just wish I could hide away for some peace.\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Huiyin shook her head with a smile. \"As the saying goes, extreme prosperity is inevitably followed by decline. I've only listened to one political matter on behalf of the Emperor, and already people are looking for connections. Go back and tell Father and the others: if they accept anything from others and commit illegal acts in my name, I won't show mercy, not even to family.\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">It was unclear whether she was referring to the Cui family or her own. Madame Ji didn't dare say anything and immediately went back to tell Zheng Fang and the others. Zheng Fang was speechless. \"Why are you only telling me this? Am I really the one most likely to cause trouble around here?\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">\"I wouldn't know about that. But I'm just passing on Lady Huiyin's instructions. If I didn't tell you, it would be worse.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Madame Ji could only stifle a laugh behind her hand.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Only Cui Yuehuan was feeling quite upset, but now she didn't dare say a single defiant word. A woman who could debate with courtiers in the imperial court was no ordinary person.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">In the past, everyone called her the Empress, but now they call her the Heavenly Empress.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Nanny Rong, however, said, \"The mistress has also realized this. She asked me to tell you that since the title has been inherited by the eldest master, just focus on living peacefully in the Zheng family and stop bringing it up. Don't worry about your birth family.\"</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Cui Yuehuan sighed. Luckily, Zheng Wuheng isn't here; otherwise, he might clash with the Cui family if he found out.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">She wondered when he would return.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">She had hoped her husband would come back in about a year, but instead, she ended up waiting three years. Seeing him return from Jiangnan without any entourage, she was first delighted, then teased, \"You've returned just in time. The Emperor and Empress are about to choose a Crown Princess for the Crown Prince, and here you are, the Crown Prince's very own uncle.\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\"></p>\n</div>"
  },
  {
    "number": 100,
    "title": "Chapter 100",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 100</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎The Grand Finale◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">When Li Cheng had just ascended the throne, some ministers suggested he hold a selection to expand the harem. Li Cheng refused, citing that it would burden the people and waste resources. After Huiyin gave birth to Tonger, the ministers became even more convinced that the emperor refused to take concubines because of the Empress. There were all sorts of rumors. Even the Empress Dowager couldn't help but make a few snide comments, but Huiyin simply ignored them.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Later, Li Cheng began to inspect the farmlands, and his subjects were so opposed to his actions that some even wished for his death.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Now, the selection was entirely for the Crown Prince to choose his wife. Huiyin had a clear understanding. She had been loved wholeheartedly by her husband and didn’t want to give her son any concubines before marriage. Therefore, the future daughter-in-law would benefit similarly. However, once they entered the family, she wouldn’t interfere in their lives.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">For this selection, Li Cheng left the decision to Huiyin. However, Huiyin had an idea. She said to them, \"We are not just selecting an ordinary daughter-in-law, but a Crown Princess, the future mother of the nation. If we chose her like any ordinary woman, it would be simple. But the Crown Princess must be agreed upon by the three of us. If one of us disagrees, we will not proceed. It must be someone we all approve of.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Jing'er quickly stood up and said, \"Mother, from ancient times, it has been the parents' decision and the matchmaker's word. You and Father can make the decision.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Huiyin shook her head. \"You're talking nonsense. Who are we selecting for? It's for you. The first requirement is that you must agree. If you don't, even if we force someone into the family, what joy would there be? Also, it can't just be based on your satisfaction. You young people are drawn to beauty and youth, but you don't consider character and talent. If we only let you choose, we wouldn't be at ease. That's why I suggest the three of us choose together, so no one will have cause to complain in the future.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">\"This is a good idea,\" Li Cheng agreed first. He didn’t want his son and daughter-in-law to become an unhappy couple, but he was also afraid that his young son might choose someone unsuitable.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">After they agreed, the selection began. Li Cheng selected three regions: Wujun, Xuzhou, and the capital. Wujun was the former fiefdom of the King of Wu, and Xuzhou was where the uprising began. The capital, of course, was a place of high-ranking officials.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Of course, not just any woman could participate. They had to be from officials of the third rank or above and between the ages of thirteen and sixteen. It was forbidden to pass off a commoner as a noble, to conceal disabilities or odors, or to allow remarried women to participate. Anyone caught breaking these rules would face severe punishment.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">The young ladies in the capital felt more assured. Jiang Bipbo had already prepared many clothes for her daughter and consulted a doctor to help her adjust. \"I heard there are three stages. The first stage checks if the reputation matches the reality. The second stage involves staying in the palace for two months to prepare for tests in music, chess, calligraphy, embroidery, and other feminine arts. The third stage is the final selection by the royal family.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Shi Jie usually put on a show in front of others, but behind closed doors, she would lie on the bed and feel exhausted. \"In my opinion, the palace is meaningless. Are we like livestock to be chosen?\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"Don't talk nonsense. I've raised you to be so unaware of the world,\" Jiang Bipbo said, slightly regretful. As a merchant family, they rose with Guo Zhao's status, so she had always been cautious. She didn’t want her daughter to follow in her footsteps, so she raised her as if she were a noble lady, educating her and allowing her to socialize. She hoped her daughter would manage the household from a young age. However, instead of raising a noble lady, she had raised someone like a free-spirited scholar.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Shi Jie felt sorry for her mother in her heart but apologized on the surface. She knew her mother had a hard life.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">But in her heart, she didn’t care much. Life in the palace was anything but simple. Everyone believed the emperor adored the empress, and even her mother believed it. So, they assumed that marrying the Crown Prince would not only bring the honor of being the Crown Princess but also the emperor's love. If the Empress was truly good, how could the Empress Dowager be suppressed like that? Whenever Jia Jia from the Xun family came home, though she didn’t say much, she hinted at this indirectly.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Even Pei's sister seemed to disapprove of the Xun family.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">The Empress might only be good to her son and might not be good to her daughter-in-law. The palace was like a cage. According to what Elder Madam Zheng mentioned, the Empress loved playing polo when she was at her family's home, but since entering the palace, she had never organized a single game. Her family's polo field had even invited the Empress to attend, but she didn’t come.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Compared to Shi Jie's resignation, Xianjie was well-prepared. She often visited the Empress, her aunt, and knew the preferences of the people in the palace.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">But she had many competitors. Xin Shi counted on her fingers, \"The granddaughter of Prime Minister Jian, the youngest daughter of General Xie, and the most beautiful woman in Wujun, the most talented woman in Xuzhou. Although their status might not be as high as our Xianjie's, it's possible the Crown Prince might like them.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Pei Shuo shook his head with a smile. \"On these matters, my sister told me that even dynasties that lasted over three hundred years were rare, let alone preserving wealth for future generations.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"Lord, you're right. But we also rely on the foundation we've built ourselves, and it's fine for our children to enjoy the wealth,\" Xin Shi complained that the Empress was too harsh for not giving any benefits to their family.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">If it were in the past, Pei Shuo might have been eager for power, but now he found Huiyin's words very reasonable. People with ability are not hindered by anything. If one's virtue does not match their position, disaster will follow. The Zheng family and the Pei family were already extremely wealthy as a duke and a count. To be greedy would be too much.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Pei Shuo had never dared to defy his sister, as her words and actions were always correct. After so many years, her position in the palace remained unshaken, and the emperor's trust in the Crown Prince was the best thing for the Zheng and Pei families.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">The higher one's position, the more restraint one needed. That’s what his sister had told him.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Of course, if their daughter was selected, it would be wonderful. If not, they could take comfort in his sister's wisdom; otherwise, they might become overly anxious about gains and losses.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">As the couple was talking, Dong Shi came in holding a pearl crown. The pearls were round and lustrous, and the craftsmanship was exquisite. It was clearly not an ordinary item. She smiled and said, \"I originally planned to give this crown as a gift to our eldest miss, but since the selection is such a big event, I had someone bring it out. If you don't mind, it would be its destiny.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Xin Shi, seeing how thoughtful she was, couldn't help but praise her. \"My dear sister, whenever I say you're good, others don't believe me. I'll call Xianjie to thank you properly. It's rare that you've made such preparations for her.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Dong Shi quickly said, \"Madam flatters me.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Usually, no matter how the three of them were, now they all hoped that Xianjie would be selected as the Crown Princess. It would be the ultimate honor for the Pei family.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Not to mention these three, even Madame Ji and Cui Yuehuan also came over, bringing many exquisite hair ornaments and fashionable silk fabrics, causing Xin Shi's face to ache from smiling so much.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">The first round of screening reportedly eliminated many candidates. Some presented adopted daughters as their own, others were eighteen or nineteen but claimed to be sixteen, and more secretively, some had already lost their virginity but were still sent in.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Li Cheng was furious: \"These people are too bold.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"It's for a tremendous wealth. No wonder people say it's like grabbing coals from the fire,\" Huiyin shook her head, but added, \"Although these people went too far, it's not worth punishing them with exile.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Li Cheng snorted coldly: \"The crime of deceiving the emperor—don't bother pleading for them. I was just worried that some were hiding their true intentions, and now they've revealed themselves. Families who lie about their daughters' ages will be demoted, but those who falsify or confuse bloodlines will be dismissed from office, and their family will be banned from taking imperial exams for ten years...\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Huiyin stood up: \"Alright, you're the emperor, and they dared to do this because of you. If others beat them to death, so be it.\" In fact, she saw that although Li Cheng was angry, he was still very measured.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">The first round screened out many people, and Xianjie and Shi Jie naturally passed smoothly. They had always held themselves in high regard, but when they saw Lu Yuan from Wujun, who was stunningly beautiful, Liu Qi from Xuzhou, who was incredibly talented, and Jian Xiwei, the granddaughter of Prime Minister Jian, who was dignified and elegant, they realized these competitors were formidable.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Living together, Xianjie said to Shi Jie: \"I thought I was quite good, but there are indeed people beyond people, skies beyond skies.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Shi Jie had been very resistant to entering the palace, but once she actually entered, she began to compare herself unconsciously.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Especially since the final selection was led by the Empress Dowager, the biological mother of the Crown Prince and the beloved wife of the Emperor, her opinion carried the most weight. Shi Jie said: \"Yesterday, Lu Yuan had an audience with the Empress Dowager. She was so appreciated that the Empress Dowager assigned her several female attendants and allowed her to study and paint freely with others.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"Truly wonderful.\" Xianjie had assumed that being the Empress Dowager's niece would give her more privileges, but the Empress Dowager had always been impartial. If Lu Yuan was chosen, she might end up being laughed at.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">These teenage girls were the cream of the crop from different regions. Huiyin invited one to play the zither and gave her gifts today, and tomorrow she would invite another to dine with the Empress Dowager. The day after, she had them compose some fitting poems.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Among all of them, Xun Jiyi was less outstanding. Li Cheng reviewed their poems: \"This poem by the Xun family girl isn't good, and her calligraphy is average, but Jian family girl has excellent calligraphy, though I hear she's rather dull.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Yes, she's a bit too proper,\" Huiyin replied. \"But since the second round is testing talent, we can wait until the final round to decide.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">As the second round began, some girls started scheming, some managed to stay out of trouble, and others tried to cause chaos. In the end, Lu Yuan from Wujun, the granddaughter of Prime Minister Jian, and Xianjie—thanks to Huiyin's influence—were among the few left for the third round.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Nobody could argue against it. Xun Jiying’s poetry wasn’t great, and Xianjie often called on heaven to judge right from wrong, always trying to stir up drama. Shi Jie seemed modest, but she was really just causing trouble behind the scenes. Some couldn't handle the pressure at all.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">This was quite a blow to Shi Jie. She thought her abilities were enough, but in truth, she didn’t want to participate. Yet, she hadn’t expected that she wouldn’t even make it to the final round.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">The Pei family pinned their hopes on Xianjie, but surprisingly, the emperor and empress picked Lu Yuan from Wu County.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">She was stunningly beautiful, confident, and skilled in music, chess, calligraphy, and painting. Huiyin even had the royal doctors examine the girls’ pulses, and this girl’s pulse was as strong as an ox’s.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Her father, the governor of Wu County, has been fully committed to implementing the new policies. Her grandfather is the Deputy Minister of Rites. Truly, everything about her is perfect.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Jing'er was clearly very pleased too.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Before long, the Imperial Astronomical Bureau determined an auspicious wedding date. The preparations for the crown prince’s grand wedding were extensive and magnificent. Huiyin and Li Cheng, seeing that it was late, returned to Linde Hall.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Huiyin smiled and said, \"Today’s our son’s wedding. Time really flies.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"Yeah, it feels like we just got married yesterday,\" Li Cheng added wistfully.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Huiyin teased, \"Last night you were whispering to Jing'er and didn’t tell me what about. But even if you don’t tell me, I still know your secret.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"What do you know? How could you possibly know what I said?\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">\"That must be some kind of trick, no doubt about it.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Huiyin remained calm and said, \"Actually, I’ve been wondering about that. You said you had no experience because you were in mourning, but you were pretty skilled on our wedding night. It turns out you had read hundreds of erotic manuals, all kinds of them... haha...\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Li Cheng quickly tickled her, and Huiyin couldn’t stop laughing. But she was genuinely happy because the mystery that had been bothering her was finally resolved.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">—End of the story.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\"></p><p id=\"paragraph-61\" data-paragraph-id=\"61\"></p>\n</div>"
  }
]