[
  {
    "number": 41,
    "title": "Chapter 41",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 41</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Yunzhi, He Guogu has sincerely invited everyone to the capital to crusade against Lü Wei. Now, you will go in my place to capture the traitor. I grant you two thousand troops and you will act on my orders. However, you’ll need to find your own way through Qingzhou,\" said the Prince of Wei, looking at his nephew, Li Cheng.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Li Cheng clasped his fist. \"I accept the order.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">The Prince of Wei discussed more official matters before his expression softened from seriousness to gentleness. \"You, ah, you... I could have trusted Xie Jiuyi with this, but you insisted on going with your wife to visit her family. The Prince of Wu, my second brother, has only you as his son. With the current unstable situation, I'm genuinely worried.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">His concerns were valid, but Li Cheng had his own thoughts. What was the point of building a career if not to secure a better future for his wife and children? Now that he was married, his wife was truly someone he cherished. How could he not fulfill her wishes? Moreover, he often served under the Prince of Wei, and it was difficult to stretch his wings.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Like last time, when Qingzhou was occupied, he believed that if it had been him, he would have performed better than Xie Jiuyi.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">But he couldn't voice these thoughts, as it would be seen as questioning the Prince of Wei. Even though the Prince of Wu's territory had been largely taken by the Prince of Wei, he couldn't show any discontent.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">As people grow older, they tend to shatter some once-beautiful memories, and their thoughts change accordingly.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Coming back to his senses, Huiyin had already started packing. The little Jing'er in her arms looked at him with wide, dark eyes. Li Cheng smiled and hugged his son. \"Naughty boy, you eat and sleep all day long. Just like your mother, you're like a little piglet.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"Don't say that about Jing'er,\" Huiyin, who was ironing clothes, scolded immediately.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Li Cheng frowned. \"But you've said it yourself before? How come you can say it and I can't?\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin smiled. \"Because when I say it, he doesn't get mad. If you say it, you should be careful. He especially loves to scratch people now.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"C'mon, he's just a little kid. Why are you getting so worked up over this?\" Li Cheng found his son irresistibly cute.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Just as he finished speaking, Jing'er swiped at his face. Fortunately, Li Cheng reacted quickly and dodged. \"You little rascal, really...\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Huiyin laughed uncontrollably. \"I told you. You need to help him break this bad habit.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Li Cheng held their son's hand and said to Huiyin, \"He's still so young, he can't understand words yet. How can you expect him to change? He'll be better in a few days.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">\"That won't do. Like when I slapped his hand after he scratched me, he didn't dare continue. Even though he can't understand words yet, he can see our actions,\" Huiyin wasn't one to coddle her child.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Li Cheng was extremely lenient with his son. \"No, Jing'er will change on his own in the future.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"You're just spoiling him,\" Huiyin was speechless.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">For lunch, Huiyin had many of Li Cheng's favorite dishes prepared. They had been married for almost two years, and she had come to understand his tastes fairly well. He had the palate of a child, liking dishes like Squirrel-shaped Mandarin Fish and Braised Pork Ribs—either sweet and sour or strongly flavored—but he would never admit to liking them after finishing the meal.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">She smiled as she noticed Li Cheng going back for more of the Squirrel-shaped Mandarin Fish.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Why are you only eating the light stuff?\" In fact, Li Cheng was also paying attention to Huiyin.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Huiyin replied, \"You don't know, after attending so many banquets and flower parties recently, even though I've been trying to control myself, I've gained quite a bit of weight. So, I need to be more careful now.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Southern women were generally slender and delicate, while Huiyin, being tall, often stood out like a crane among chickens. Even standing next to Li Cheng, she couldn't appear as delicate and dependent.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Now, with her face looking even rounder, she felt strong enough to take down a tiger.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Li Cheng looked his wife up and down, finding her incredibly beautiful, like a ripe peach ready to be savored. For some reason, he blushed slightly. \"I think it's quite nice like this.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">It was just a simple sentence, but upon seeing his gaze, Huiyin quickly turned her head away.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">They finished the meal in silence, and then it was mentioned that Xie Jiuyi had arrived. Li Cheng immediately got up to go to the front hall, and Huiyin changed her clothes to meet Yin Liyi.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"You're expecting, why did you come here yourself?\" Huiyin smiled.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Yin Liyi rubbed her belly and said, \"At this stage, the baby is stable, and I wish I could go out for a walk. My mother-in-law doesn't allow me to go out and always tells me to rest and recuperate. I'm really bored to death.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Huiyin pointed at her and said, \"This just shows how much you and your husband are in love. Wherever General Xie goes, you follow. We’re all so envious of you.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">This was the first time Huiyin had teased her, and Yin Liyi felt a bit flustered. \"Stop making fun of me. It's not about being in love. I just can't let my guard down with him.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"Last time, thankfully you went to pick him up. If it were me, I definitely wouldn't dare to.\" Huiyin flattered her a bit, and she was in a good mood since they were about to go to Jizhou.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Yin Liyi believed that a couple should be honest and supportive of each other, unlike the political marriage between the Little Prince and Princess Zheng, who each did their own thing.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">But no matter what she said, it felt inappropriate, so she shifted to the safer topic of their child. \"With such a long journey ahead, what about Jing'er?\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"Jing'er will be taken back to meet his maternal grandfather and grandmother. We'll do our best to take care of him.\" The main reason was that Huiyin didn't trust leaving the child with Grand Dowager Wu.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Huiyin's health had been good recently, except for one day when she ate too late and too greasily, which caused her to have diarrhea. Other than that, she had been in good shape and was well-prepared, so she wasn't very afraid.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Huiyin didn't know what Xie Jiuyi had discussed with Li Cheng, but she assumed it was some military matters. After all, they were passing through Qingzhou to go to Xuzhou, and Xie Jiuyi was very familiar with the terrain of Qingzhou.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">She had also asked Lady Gao, the wife of the young master of the Lu family, to help her keep an eye on the tea plantation's harvest. As for Zhang Lao San's noodle shop, she had quietly provided financial support.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">The couple bid farewell to Grand Dowager Wu. Although she disagreed, her opinion was no longer important, and neither Li Cheng nor Huiyin would listen to her.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">When Li Cheng and Huiyin passed through Qingzhou, they couldn't go as themselves but had to disguise themselves as merchants, carrying goods from the south to sell in the capital.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">In these times, only merchants could travel freely between the north and south, as they followed profits. Whether it was large or small warlords, they all needed food supplies to recruit soldiers, which was why Hu Qi was willing to marry Jiang Bipbo, and why Huiyin had intervened. Including the Cui family's daughter that her younger brother might marry in the future, she was from a prominent local family, to gain support.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Of the 2,000 soldiers who followed, 1,000 went by a small path, and the other 1,000 disguised themselves as servants.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Li Cheng became a merchant with the Cui surname, taking his wife back to her parents' home while also conducting some business in the capital. They couldn’t dress as they had before. Huiyin changed into ordinary Hangzhou clothes, removed all the palace-made jewelry from her head, only combed a yuanbao bun, inserted two three-pronged gold hairpins, and wore a gold-inlaid jade ring before nodding in satisfaction.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"You're dressed too plainly.\" Li Cheng felt that his wife should dress nicely for the visit to her parents' home. He thought she looked a bit shabby now.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Huiyin smiled and said, \"You're already wearing a square hat, and yet you say this. Master Cui, let's go. Oh, and please tell the soldiers not to drink untreated water. If they really need to, put alum in it. I've already prepared the alum, so have your personal guards distribute it to them.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Li Cheng said to her, \"You're really a chip off the old block, coming from a military family. I don't remember these details.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"Of course you don't. I learned the importance of alum the year my father led his troops to battle. Many people drank water from a small ditch and ended up with malaria or diarrhea during battle. That's when we realized the importance of alum.\" Huiyin took the opportunity to show off a bit.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Li Cheng had arranged everything else meticulously. This was the first time Huiyin had seen such a detail-oriented man. He delegated even the most trivial matters one by one. Since the fabrics from the south were of high quality, they decided to disguise themselves as fabric merchants. He loaded the carriages with expensive and fashionable fabrics and even researched the origin of the fabrics.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">He even brewed tea for Huiyin in the carriage and said with a smile, \"I modified this carriage myself. It doesn't need to be luxurious, but it's very comfortable. Look, you can take a nap here, and you can pour water directly through this tube. These are minor details, but important ones. The most important thing is that the carriage rides very smoothly. You can rest here, and when you wake up, I'll sleep.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"Okay.\" Now that the carriage had entered Qingzhou, where Lü Wei and He Guoguo's people were stationed, these people weren't easy to deal with.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Huiyin sipped the tea, savoring its fragrance, and looked at him with a tilted head. \"How do you know how to do everything? I really admire that about you.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Li Cheng simply said, \"I admit I have some intelligence, but the main reason is that I'm the heir of the Prince of Wu. Since I was young, my father invited great scholars to teach me. Others can't compare to that.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"No, that's not it. You lost your father at a young age but can command a state's military. Although you joined the Prince of Wei, you've become his right-hand man. Whether it's military affairs or managing household matters, you really can do everything and do it better than others. I'm truly proud of you.\" Huiyin said sincerely.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Li Cheng was pleased, \"Thank you for the compliment.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Huiyin knew he was confident, but in front of her, he might seem a bit unpredictable, so he didn’t dare to praise himself. But she genuinely thought he was remarkable. He lived with great integrity and was always true to his heart.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">The couple exchanged a glance, and then Li Cheng pulled her into a hug, resting his head on her shoulder. \"Those few days when you wouldn’t let me near you, I've been so uncomfortable.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">As a couple, Huiyin didn't shy away from these matters and whispered, \"Wait until we check into the inn.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Since they were currently disguised as merchants, they couldn't stay at official post stations, but they could still stay at inns. Though inns were often crowded with all sorts of people, they could still rent the best rooms and stay in comfort.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Li Cheng's eyes lit up. \"Excellent!\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">After entering the city, to avoid drawing attention, Li Cheng had half of their group check into another inn. He, Huiyin, and Jing'er stayed at the Yuelai Inn, west of Qingzhou. They couldn’t book out the entire inn since a few people were already staying there. After settling everyone, the couple took a bath and, exhausted from the journey, fell into a deep sleep together.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">The next day, Li Cheng made a list and sent people to prepare some dry rations, but before they returned, the inn was surrounded.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Huiyin, who was getting dressed, frowned. \"Could it be that they’ve discovered us? But no, so many merchants entered the city together yesterday, all dressed the same way. How could they single us out?\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">\"Don’t panic. Get up, keep Jing'er close, and I’ll go take a look. Don’t worry, I’ll protect you,\" Li Cheng said confidently.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">It turned out the inn was surrounded because of a murder—a man and a woman had been found dead.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Li Cheng explained to Huiyin, \"Although Lü Wei's men control this area now, the county magistrate here is diligent and cares for the people. He’s well-loved by the locals. He defended the city of Qingzhou, so he treats the people under his care well. It has nothing to do with us.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"Hmm,\" Huiyin nodded inwardly.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Unfortunately, Magistrate Feng came to investigate the case in person and decided to question everyone staying at the inn. Huiyin, who always stayed calm in crises, comforted the wet nurses and servants, and double-checked their cover story with them.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">The dead man was a merchant from the Western Regions, and the woman was a Taoist nun. Their rooms were next to each other, but they were unrelated—the nun was on her way to the Qingfeng Temple in the Jiangnan region, while the merchant from the Western Regions had bought raw silk and tea in Jiangnan and was returning home.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">When Magistrate Feng questioned Li Cheng and Huiyin, his eyes lit up. He didn’t expect to find such distinguished individuals here. The man, though only around twenty years old, carried himself with the grace of a high-ranking official. His handsome appearance was striking. His wife, though a merchant’s wife, was stunningly beautiful, not coquettish but with an extraordinary demeanor.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">\"We are silk merchants from Jiangnan, delivering goods to the capital and accompanying my wife on her homecoming visit. We’re passing through this place and didn’t expect to encounter such a matter. Magistrate Feng, we are on our way to the White Pagoda Temple in the capital and hope to offer incense. Please, grant us passage,\" Li Cheng said, cupping his hands respectfully.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">After Li Cheng finished, he looked at Huiyin. She sighed softly. \"We never expected this to happen. My husband, when we reach the White Pagoda Temple in the capital, let’s go offer some incense.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Magistrate Feng shook his head. \"It doesn’t seem right. Your demeanor doesn’t quite match that of merchants. Although your travel permits are in order, your bearing suggests otherwise.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Li Cheng was about to explain when Huiyin, quicker on the uptake, spoke first. \"If you can see through us, then I’ll explain. My husband and I were betrothed in our mothers' wombs. We come from aristocratic families, but his family fell into ruin because of his family’s financial situation, and he became a merchant. My parents wanted to break off the engagement, but I believe a gentleman should keep his word. How could we abandon him just because of his family’s situation? So, I defied my parents and married him, even though it meant being disowned by my family. Fortunately, my husband has earned some money and revived our family, so now we wish to return home in triumph.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">\"I see. If you’re from aristocratic families, that makes sense,\" Magistrate Feng said, though he suspected there was more to their story. Having met countless people, he found Huiyin’s tearful eyes and her tone of having endured hardships convincing. He believed her and even admired her integrity.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">But he still had to ask the necessary questions. \"What time did you check in? When did you turn off the lights?\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">\"We arrived at the inn around 3 PM. We wanted to book out the place because we had many people with us, but that wasn’t possible. We ate dinner around sunset and rested around 7 PM. We asked the innkeeper’s boy for water. Because we were so tired from the journey, we fell asleep. We stayed in the Heavenly Room to the east. We know nothing about the incident in the Earth Room. My servants and the innkeeper can vouch for us. They can all testify.\" Huiyin said calmly.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Magistrate Feng called the innkeeper over, who nodded hurriedly. \"These guests are important patrons. We moved all the previous guests to the Earth Rooms because they wanted quiet.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Li Cheng realized Huiyin’s greatest strength was her clear mind and quick thinking. Some people had a certain charm, like Yin Liyi, who was a bit naive but could easily win people over. Then there were people like Princess Wei, who remained calm and steady like a mountain, or Yin Lifang, whose calmness allowed her to resolve issues effortlessly.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">But Huiyin had always been patient with him, rarely contradicting him. He had never quite figured her out, but now he saw just how quick-witted she was.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Magistrate Feng might have sensed something unusual, but Huiyin’s teary-eyed expression moved him. They passed the inspection smoothly in Qingzhou.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Once they were outside, Li Cheng couldn’t help but ask, \"How did you come up with that story on the spot? It sounded so convincing.\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">\"Of course, from storybooks! Scholars love stories where noble ladies give up everything for them. I noticed that although the magistrate was a military official in charge of catching criminals, he spoke in a refined manner, so I just made up a story,\" Huiyin said with a mischievous smile.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Li Cheng laughed. \"I owe you one, my dear.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Huiyin took his hand. \"Actually, I think it’s because we look wealthy. A handsome man and a beautiful woman—most murders are either for love or money. We don’t have a motive for either.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">\"You clever thing,\" Li Cheng said, finding himself liking her more and more with each passing day.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Huiyin looked at him. \"Just now, I thought you were going to stay behind and help Magistrate Feng.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Li Cheng chuckled. \"I’m not the meddling type. Magistrate Feng is handling things well. Why should I interfere?\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">\"It’s hard to believe that the person who once listened to Yin Liyi complain about sparrows or how a mountain chicken can’t become a phoenix is the same person you are now. Back then, you thought everyone was clumsy. Now, you’re so open-minded, composed, and considerate of others,\" Huiyin said, gently touching his face.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Li Cheng chuckled softly, \"After we got married, you worked so hard to write all those wedding gift lists, and I pointed out issues with each one. Yet you didn't complain at all and were actually very grateful that I helped you solve problems. I realized that if I were in your position, I would have been upset at first. But your attitude made me see my own limited perspective. In fact, capable people need to be even more open to others' opinions. You also taught me how to express myself. You share everything with me, encourage and praise me, and often commend me, which makes me feel comfortable opening up to you.\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">This was the first time they had such a heart-to-heart conversation as a couple. Though he appeared cold, he was actually very perceptive.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Huiyin leaned in his arms and said, \"The first day we entered Qingzhou, we stumbled upon a murder case. Fortunately, this county magistrate is a reasonable person, but I always feel that things won’t be smooth sailing from now on.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">\"Are you losing heart?\" Li Cheng looked at her.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Huiyin shook her head, \"No, the greater the challenge, even if we fail, we can learn and grow from it. Otherwise, we'll end up like Ma Kui, who thought he could sit comfortably in Qingzhou, only to have it taken away from him. Through struggle, we truly come to understand our own limitations. So, don't worry, I and our son will stand by you.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">The situation was uncertain, and war could break out at any moment. Whether it's today or tomorrow, death is inevitable. Even if we hide in Jianye for a few more years, could we really avoid a catastrophe in the future? If that's the case, it's better for us, as a couple, to spend more time together and for me to give you more confidence.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Li Cheng looked at his wife and smiled, \"Don't worry, even if He Guoguo and Lü Wei's men really catch me, they won't be able to do anything to me. He Guoguo is waiting for everyone to join forces to defeat Lü Wei. Lü Wei surely knows this and, of course, needs to win him over.\"</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">But his wife was fearless, and she had indeed proven with her actions that she would never be a burden. Instead, she was clever and smart. It would be a waste for such a woman to stay confined within the inner chambers. She should step out and use her intelligence and wit to make a difference.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\"></p>\n</div>"
  },
  {
    "number": 42,
    "title": "Chapter 42",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 42</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Two Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Huiyin thought that despite Li Cheng's youth, his sense of responsibility outshone many men. For instance, he was currently accompanying their son, always holding Jing'er in his arms during the journey.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">At first, Jing'er only sought closeness with his mother since he had spent most of his time with Huiyin, but now he would also open his arms to ask for Li Cheng.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">\"We'll arrive at the next place soon; it's called Yangping. After Yangping, we'll be even closer to our destination,\" Li Cheng said with a smile to Huiyin.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin put down the county records and topographical maps she was studying. Initially, she couldn't understand the maps at all, but now, whenever she encountered something unclear, she could ponder it herself and even ask Li Cheng, which made things much clearer.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Yes, Yangping County seems to have many mountains. Look at the terrain here; it's layered and overlapping. I think we should rest on flat ground and avoid stopping when we encounter mountainous areas. I've heard that there are many bandits in these times who occupy the mountains and live by robbing others,\" Huiyin said.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Li Cheng nodded. \"Don't worry, we've got two thousand crack soldiers with us. They're strong and capable.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Huiyin was still somewhat worried. \"Let's still be cautious. Better safe than sorry.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng, of course, agreed. They had a pleasant meal at an inn before entering Yangping County. Neither of them was particularly fond of extravagant displays. Jing'er ate egg custard and enjoyed it, but perhaps because of the strong sun the previous day and the long journey, he had developed diarrhea.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">The doctor who was part of their entourage stepped forward. \"This is diarrhea. If not treated early, it may lead to dehydration.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Li Cheng, anxious, said, \"Please treat him. His mother has brought all kinds of medicine.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"Little Prince, in my humble opinion, we should stay here for a few days until the young master recovers before continuing our journey. The carriage is stuffy, and the wooden boards are hot, which may worsen the child's condition if his belly is exposed to heat,\" the doctor advised.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Huiyin looked at Li Cheng pleadingly. \"Little Prince...\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Li Cheng nodded. \"Alright, but staying in an inn won't do. I'll find a house, and we'll stay here for a few days.\" He then comforted Huiyin. \"It'll be fine.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">As new parents, they were always worried about Jing'er suffering. Huiyin felt even more guilty because Li Cheng was fulfilling her longing to return to her hometown, bringing such a young child along. If anything happened to the child, she would feel utterly responsible.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">The usually energetic little one was now weak from the diarrhea, breaking Huiyin's heart.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Fortunately, Li Cheng not only found a suitable house within half a day but also arranged for meals. Huiyin was astonished. As she walked in and looked around, she noticed that even the floor was free of dust. Considering this was the north, where the wind and sand could be quite severe, this was no small feat.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"You're amazing,\" Huiyin praised sincerely.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Achieving this was not easy; it required more than just money—it needed coordination and planning. She whispered to Jing'er, \"Your father is truly a good dad.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Jing'er had what the doctor called 'heat-induced diarrhea,' likely caused by overeating or eating something that didn't agree with him. The doctor prescribed medicine to clear heat, strengthen the spleen, and stop diarrhea. However, since Jing'er was not yet one year old, he vomited upon smelling the medicine. The doctor then suggested a folk remedy of fried flour. Sure enough, after taking this remedy, Jing'er's diarrhea stopped. Nevertheless, Li Cheng and Huiyin decided to stay for a couple more days before continuing their journey.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"Once we get to Jizhou, it will be cooler, and I'll feel better about leaving Jing'er at home,\" Huiyin said, gently stroking her son's head, feeling a sense of guilt.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Li Cheng's mother, Princess Wu, had a short fuse and would lose her temper over the smallest things, causing Li Cheng to grow up in a tense environment where he was quick to pass blame and deflect responsibility. If it were his mother facing this situation, she would surely complain and create a scene.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">But Huiyin was entirely different. She was merely self-critical, actively sought solutions, and cooperated earnestly with Li Cheng.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"You're wonderful,\" Li Cheng couldn't help but smile.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Huiyin looked puzzled. \"You're the one who's great. In such a short time, you managed to find a house and all the necessities. Honestly, you don't seem like someone who pays attention to daily life, but you're actually quite good at it. I've found a treasure.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Li Cheng looked at Huiyin. \"Are we going to live a life where we praise each other every day?\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"We should focus on each other's strengths. Constantly nitpicking faults isn't the way to live. Besides, neither of us is too worldly. If we started playing games with each other, it might work for a while, but in the end, it would tear us apart. If our own family isn't united, how can we manage external affairs?\" Huiyin believed that if Li Cheng were a bad person, she would have had to rely on their son to inherit the title and handle matters.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">However, to her surprise, he turned out to be a good person, which is why she felt comfortable sharing so much with him.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">After they set out, the couple spent every day together. Now, with their child finally asleep, Huiyin took a short nap on the bed, while Li Cheng read a book beside her. He rarely took afternoon naps. Seeing Huiyin's peaceful face as she slept, he couldn't help but smile softly.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Three days later, the couple set off with their son, heading into Pingyang County. Since they had decided not to rest along the way, they didn’t dare give the child minced meat. Even fruit mush was out of the question, as it might upset his stomach, so they could only feed him rice porridge.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">In addition, there were two wet nurses to nurse the child, and as a result, he remained in good health.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Unfortunately, just as they were halfway into Pingyang County, it started to rain.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Li Cheng found a teahouse to take shelter from the rain. Huiyin got off, holding the child and wearing a raincoat. All the while, Li Cheng held an umbrella over her, ensuring not a single hair on her head got wet.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">The shopkeeper brought over some hot tea, and soon the air was filled with its fragrant aroma. Li Cheng said to Huiyin, “Don’t worry, I had this tea made with the Jade Spring water from the house we stayed in.”</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">“I see,” Huiyin replied, no longer hesitating.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">This was thanks to Li Cheng’s reflection on the previous incident with the egg meat paste, which had caused their son to have diarrhea due to uncleanliness. They couldn’t afford to be careless again.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">The tea and snacks were a perfect pairing, but Jing’er, being a curious child, tried to grab some with his hands. Fortunately, Huiyin pulled him away in time. Li Cheng just smiled at the sight. However, when he looked back, he noticed a pregnant woman with a swollen belly, tattered clothes, stumbling through the rain, seemingly trying to approach the teahouse.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Some attendants and soldiers moved to intercept her, but Li Cheng found it strange. In such a deserted place, why would a pregnant woman appear? He considered driving her away but feared his wife would think him heartless.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Huiyin thought the same. After all, King Chu of Chu, a sovereign ruler full of ambition, was killed by bandits. One couldn’t let their guard down.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Perhaps she would never have that level of empathy.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">The couple exchanged a glance, and Huiyin said, “In such a desolate place, the sudden appearance of a pregnant woman seems suspicious. As the saying goes, ‘when something is abnormal, there is bound to be something devilish.’ We shouldn’t let this person get close.”</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Li Cheng breathed a sigh of relief. “That’s what I thought too.”</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">The pregnant woman was said to have fled after being beaten by her husband. Huiyin said to Nanny Nan, “Give her some food and silver, but not you directly. Have the soldiers do it.”</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">She knew Nanny Nan had a soft heart, but this wasn’t the time for that.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">The teashop owner came over to refill the tea, feeling regretful. “That woman is from Xiaogou Village. She used to sell wine here and saved quite a bit of money to return home and marry. At first, her husband treated her well because she had money. But after she spent it all, he started to beat and scold her, which is why she was chased out even while pregnant.”</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">“Since she’s so pitiful, I gave her twenty strings of cash, enough for a year. People need to stand on their own feet. Once she has the child, we can ask the teahouse owner to employ her,” Huiyin said, not drinking the tea the teashop owner had poured.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">As soon as the rain stopped, Huiyin urged Li Cheng, “The rain in the north passes quickly. We should move on.”</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">They left without delay. After all, the people following Li Cheng were soldiers used to marching, and Huiyin’s attendants were efficient as well.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">However, once they were far away, the teashop owner, who had been so kind-faced earlier, discarded the toothpick he had been chewing and said to the pregnant woman, “Phoenix, your trick didn’t work.”</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">The pregnant woman, who had been looking miserable moments earlier, now slammed her hands on the table fiercely. “We waited patiently for a big catch, but they didn’t fall for it. The men following that guy are all tough nuts to crack.”</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">The teashop owner glanced at his tea. They hadn’t used their own utensils to brew it. Even though he had managed to pour a cup of water, the woman hadn’t drunk it.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">The woman named Phoenix said, “Still, no need to worry. They’re carrying a lot of stuff. Just the white jade hairpin that woman is wearing on her head is quite valuable.”</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">The teashop owner quickly put down his crossed leg. “We can’t let such a big fish go. I’ll inform the brothers right away, set up roadblocks, and rob them directly. If we pull off this job, it’ll sustain us for years.”</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">……</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Huiyin had the water stains outside the carriage wiped off. Fortunately, the sky cleared after the rain.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Li Cheng was riding his horse outside when he suddenly knocked on the carriage door. Huiyin lifted the curtain. “What is it?”</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">“We’ve entered the mountains now. I have a feeling something’s off. Huiyin, don’t panic, alright? You and the child stay here. I’ll handle everything, understand?” Li Cheng said.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Huiyin certainly wouldn’t cause any trouble. She couldn’t fight anyway, so what good would she be? But she did have a trick up her sleeve and quickly said, “Wait, I have something for you.”</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Li Cheng asked puzzled, “What do you have for me?”</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Is it a peace charm?</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">But then Huiyin removed a small white jade object from her hairpin and pulled out a packet wrapped in red paper. She said, \"This is a highly toxic substance, colorless and tasteless. If the opponent is difficult to deal with, just force it into his mouth.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">\"Is this poison?\" Li Cheng whistled, realizing how lucky he was to have never offended Huiyin; otherwise, he might not have known what hit him.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Huiyin pouted. \"What's wrong?\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Fearing she was about to lose her temper, he hurriedly slipped away.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Inside the carriage, Nanny Nan was full of fear, but Huiyin smiled. \"It's alright. We should trust the Little Prince.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">However, she warned the wet nurse and the maids in the carriage, \"We mustn’t leave the carriage or cause any unnecessary trouble.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">As Li Cheng had expected, there was an ambush ahead. He did not underestimate these bandits. The bandits were preparing to roll stones down the mountain, but unexpectedly, those in the ambush were shot dead instead. Li Cheng saw that some people ahead were trying to rush up; they were attempting to trip the horses with ropes. But Li Cheng, on horseback, deftly used his spear to knock several of them down.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Outside, the sounds of battle were deafening. Nanny Nan was terrified, but Huiyin remained calm, covering her son's ears. Jing'er thought she was playing with him and stretched out his hand to touch Huiyin's face.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Perhaps it was the child's laughter that eased the tense atmosphere inside the carriage.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">In less than an hour, Li Cheng came over and lightly knocked on the carriage door. Huiyin quickly pulled it open and popped her head out. Li Cheng didn’t expect her to come out so quickly and whispered, \"The enemies are dealt with. Let's go.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">\"Are there any wounded soldiers?\" Huiyin asked.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Li Cheng shook his head. \"They were just a bunch of bandits and ruffians. No need to entangle further; we must hurry on our journey.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Huiyin looked at him. \"In a while, you should calm the soldiers first, then we can talk.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Li Cheng loved talking and listening to Huiyin the most. He couldn’t help but nod.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Perhaps because Li Cheng had written ahead to Jizhou, just as they reached the border between Qingzhou and Jizhou, they saw a young man waiting there. Li Cheng's heart stirred.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">The young man was tall and imposing, with bright, piercing eyes. The warm look he gave them carried a hint of familiarity.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">\"Are you the Prince of Huaiyin from Xuzhou?\" the man asked.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Li Cheng clasped his fists. \"That's me.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"Brother, husband, that's my brother,\" Huiyin exclaimed and quickly got off the carriage.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Pei Shuo, seeing his sister and then glancing at Li Cheng, immediately bowed. \"General Pei Shuo, Commander of the Jianwei Army, pays his respects to the Little Prince.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Li Cheng quickly dismounted to help him up. \"We're family; there's no need for formalities. I'll just call you brother. My courtesy name is Yunzhi; may I know your courtesy name, brother?\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Pei Shuo, seeing that Li Cheng was as excellent as his younger brother Zheng Wuheng had described, felt as if he had drunk a bowl of honey water. More importantly, he was a man of deep loyalty and righteousness, treating his sister so well. After his sister wrote about the effort Li Cheng put into making time for this trip home, Pei Shuo had already formed a favorable impression of his brother-in-law. Seeing how affectionate Li Cheng was being, Pei Shuo was delighted.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">\"My courtesy name is Yuanyuan. Prince, just call me Yuanyuan,\" Pei Shuo smiled.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">After exchanging a few pleasantries, Pei Shuo couldn’t resist teasing his sister. \"You, where is the demeanor of a lady from a great family? Running down from the carriage like that, aren't you afraid the prince will laugh at you?\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">\"Brother, I hurried down from the carriage as soon as I heard your voice,\" Huiyin replied, feeling alive again now that she was back in Jizhou.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">\"Sister, did you have a smooth journey? I had planned to meet you in Qingzhou, but the He and Lü families should respect our father’s wishes, shouldn’t they?\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">\"Brother, you asked so many questions at once that I don’t know where to start. When we get home, I’ll tell you everything in detail.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Watching the siblings chat so warmly, Li Cheng felt a twinge of envy. After all, he was an only child. When he was younger, his mother had invited the Yin family sisters and other children of similar age to be his companions, hoping to provide him with more friends.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">From here on, the soldiers no longer needed to maintain their disguises and returned to their usual uniforms.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">They were arranged to wash and dress at the post house the day before they were due to arrive home. When Li Cheng entered, he saw Huiyin had just put on her night clothes and was sitting in front of the dressing table, arranging herself. He couldn't help but be drawn to her and leaned down on her shoulder. \"We'll be home soon. Are you happy?\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">\"Of course, we women marry far away and rarely see our relatives. If it weren’t for you bringing me back, I might not have been able to see my parents and brothers again.\" Huiyin rubbed her cheek against his, involuntarily becoming more intimate and softening her voice. \"I didn’t tell you much about my family before because I didn’t know if I could return to my parents' home. But now I should tell you, so you’ll be aware of the relationships in my family.\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Li Cheng actually had some understanding of Zheng Fang's family and had even commented on them before he married Huiyin. But now, hearing Huiyin speak so openly, he felt that his wife had no secrets from him and gladly said, \"Go ahead and tell me.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Huiyin stood up and said, \"My father rose from humble beginnings. His father passed away early, and he was raised by his widowed mother, Madame Xu. He was originally a captain under Lu Ji, the governor of Gannan, and later earned successive military merits, gaining Lu Ji's trust. My father was rewarded and appointed to a fairly high official position. At that time, he married the daughter of the Xu family from Donghai, who was also a niece from my grandmother's side. Later, when Lu Ji rebelled, my father killed him but was then pursued by Lu Ji's subordinates. He ended up in Gaoyang, where my mother was recruiting a husband. My grandfather was the commanding general of Gaoyang at that time. Madame Xu deliberately had my father marry my mother to preserve himself, and even requested to step down from the marriage. But after my parents married, things changed unexpectedly. Therefore, besides my brother and I that you've seen, my elder sister, who married into the Eastern Palace, is of a different mother. She was born to the divorced Madame Xu.\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">\"I see,\" Li Cheng said, listening attentively.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Huiyin smiled and continued, \"My brother, Pei Shuo, is my mother's son with her first husband, Pei Ye from Hedong. My mother and Uncle Pei were deeply in love and had long agreed not to take concubines. Once, Uncle Pei encountered danger, and while my mother was pregnant, she lost the child trying to save him. The doctor said she would never be able to have children again. But unexpectedly, Uncle Pei took an external concubine, which my mother discovered, leading her to divorce him and leave with my brother. In recent years, when Uncle Pei passed away, he left all his estate to my mother and brother, but the illegitimate sons and clan elders of the Pei family disagreed. My mother helped my father secure the estate for my brother. Now, my brother works under my father, but my mother, fearing he might feel constrained, also arranged a separate residence and assets for him.\"</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Li Cheng hadn't expected Madame Ji to be so resolute, a truly passionate woman, unlike what the Xu family said about her being fickle.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Huiyin continued, \"After my mother married my father, my grandmother and Madame Xu were very hostile toward her. After all, Madame Xu believed my father married my mother as a mere pretense, and it turned into reality, thinking my mother had no shame. Fortunately, my mother gave birth to me and my brother, and eventually established herself firmly. Our family is divided into two factions: my grandmother and elder sister form one faction, while my mother, my brother, and I form another. So, if my grandmother says anything about me in front of you, please be tolerant and don't be angry. You know what kind of person I am.\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">She wanted to warn him because if Elder Madame Xu saw Li Cheng treating her too well, she might feel uncomfortable and say something negative. Who would think their own grandmother's words about their granddaughter were false?</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Li Cheng sensed some unclear matters, such as why the Zheng family didn't help at all when the Crown Prince went south to fight. There might be family disputes involved. Huiyin's brothers were all in the military, and their strained relationship with the Xu mother and daughter meant they wouldn't support the Eastern Palace.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Li Cheng didn't know about such things and, recalling Huiyin's warning, realized she was likely worried about what Elder Madame Xu might say. He brightened and said, \"Don't worry, no matter what she says, I won't take it seriously.\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Huiyin nestled into his arms and said, \"In the past, we were often apart, but you always protected me in your family. Now, in my family, if anyone gives you trouble, come to me if anyone gives you trouble.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">In the past, Li Cheng would have been too proud to let a woman protect him, but now, hearing these words, he felt sweet and held Huiyin, saying seriously, \"Now I'm a son-in-law living in my wife's family, so you must protect me!\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">This made Huiyin a bit uncomfortable. This man usually spoke with such certainty, rarely with such sentimental tones.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">She quietly tickled him, knowing he was ticklish, and Li Cheng restrained her hands as they had a playful tussle.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Meanwhile, the Zheng family was also in turmoil. Every time Elder Madame Xu saw De Yin, she noticed her becoming thinner and wanted Zheng Fang to bring his daughter back to recuperate. However, both Zheng Fang and Madame Ji disagreed. Zheng Fang's stance was that unless the Crown Prince accompanied her back, De Yin, not being the primary wife, couldn't casually return home. Elder Madame Xu was, of course, deeply troubled by this.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">While De Yin couldn't return, Huiyin was back for a family visit. Madame Ji was extremely happy, bringing her daughter-in-law, Madame Xin, to arrange the new residence. \"Indeed, our Huiyin is blessed. Look, even the Prince of Huaiyin is personally accompanying our daughter back.\"</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Madame Xin felt a bit sour inside. Her mother-in-law had never been so good to her family, but remembering that her son-in-law was the Prince of Huaiyin, her sense of injustice dissipated, and she even offered, \"Mother, I think this folding screen is too heavy, making the bedroom appear too dark. How about replacing it with a lighter-colored one?\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Madame Ji clapped her hands. \"You’re right. You and Huiyin have great taste. I have a huanghuali screen embroidered with orchids. The color of huanghuali is lighter than that of purple sandalwood.\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">The mother-in-law and daughter-in-law exchanged a few more words before Madame Ji asked Madame Xin to return first as she went to see her mother-in-law.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Madame Ji was well aware of why Elder Madame Xu called her over. With Huiyin and her husband returning, Elder Madame Xu was upset and resentful, often venting on family members, and her daughter-in-law was the primary target.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">As expected, upon entering, Elder Madame Xu scolded her, \"Isn’t De Yin your daughter as well? Don’t you feel heartbroken seeing her like this? Even if the palace isn’t safe and you can’t bring her back home, she’s still someone you’ve watched grow up.\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\"></p>\n</div>"
  },
  {
    "number": 43,
    "title": "Chapter 43",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 43</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The ongoing disputes between Elder Madame Xu and her daughter-in-law, Madame Ji, did not dampen the enthusiasm with which Madame Ji and the entire Zheng family welcomed the Prince of Huaiyin and Huiyin. Even though Prince Wei had previously defeated the imperial army and Lü Wei and He Guoguo had taken control of Qingzhou, it did not change Zheng Fang's high regard for Li Cheng.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">In his view, when Li Cheng led his troops to capture Xuzhou years ago, he had managed to hold onto it firmly, and the people of Xuzhou were very supportive of him. On the other hand, Xie Jiuyi, who had taken Qingzhou, was driven out. It was clear that if Li Cheng had been the one to take Qingzhou, the Crown Prince would not have been able to seize it.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Zheng Fang was now glad he hadn't gotten involved in Li Heng's affairs. Li Heng was still under Lü Wei's control, and even his favorite concubine had been executed. He was nothing more than a puppet. No matter how much he wanted to fight, his daughter wasn't capable of helping him. There was nothing in her belly, so what could supporting Li Heng achieve?</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">For now, it was better to remain neutral, avoiding any losses while gathering strength for a future counterattack.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Seeing Madame Ji's red-rimmed eyes, Zheng Fang understood her emotions. He set aside his favorite concubine and came over to comfort her. \"We'll see our daughter soon. The scouts just reported that they've reached Bailipo.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"Lord, I understand,\" Madame Ji said. Her gratitude towards Zheng Fang exceeded her love for him. After all, he had protected her and her children when they were vulnerable, and their current status was due to this man standing before her. This was why she tolerated Elder Madame Xu.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Zheng Fang saw that Madame Ji had calmed down and sighed in relief. \"Don't be too sad. It wouldn't be good if the Prince of Huaiyin saw you like this.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"Yes, Mother said she isn't feeling well today, so she won't be coming. I'll send a table of food and wine to her later,\" Madame Ji said.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Zheng Fang knew why his mother was upset, but taking his daughter back from the palace was a poor decision. If the Crown Prince ascended the throne, their daughter might at least become a consort. If the Crown Prince failed, they could make other plans. Since the Crown Prince hadn't mistreated De Yin, there was no reason to bring her back.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">But he didn't dare to confront his mother directly. After all, she was his own mother. He could only pretend not to know.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Both husband and wife had their own calculations. The only one who was truly happy was Zheng Wuheng. He was still anxious to ride out to meet them, but Madame Ji said, \"You're about to get married. Don't be so reckless. Your brother has already gone to meet them. Don't mess up your hair.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Xin Shi added, \"Yes, little uncle, it's very windy outside. It's better to wait here.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Zheng Wuheng clung to Madame Ji, restless. Seeing his son, Zheng Fang felt joy. He only had this one son, Zheng Wuheng, so he wasn't a strict father. Instead, he doted on his youngest son quite a bit.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Compared to the indulgent father, Madame Ji was very strict with her son. Zheng Wuheng was obedient, though sometimes he slacked off. Still, he trained hard and was proficient in martial arts and tactics.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">After a while, the scout reported back, \"Lord, Lady, our young miss and her husband have arrived at the gate.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Only then did Madame Ji go out with Zheng Fang to welcome them.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Huiyin hadn't expected both her parents to come out. This was Li Cheng's first time visiting his in-laws' home in Jizhou. Even though he was a prince, he still felt like an anxious son-in-law. But outwardly, he maintained a calm and composed demeanor.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Huiyin wasn't as restrained. As soon as she saw Zheng Fang and Madame Ji, she rushed forward. \"Father, Mother,\" she called, and then greeted her sister-in-law Xin Shi with a \"Sister-in-law.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Before she could continue her introduction, she saw Zheng Fang and his wife bowing to Li Cheng. As a prince, Li Cheng's status was higher than theirs.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">After the formal greeting, Li Cheng smiled at Huiyin. \"Just now, I performed the national ceremony. Now, let me perform the family ceremony. Your son-in-law pays his respects to you, Father-in-law and Mother-in-law.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">In truth, Li Cheng was also observing the Zheng family. Zheng Fang was tall, about seven feet, as tall as him. Though he was no longer young, his nose was straight like a jade pillar, and his mouth was red like cinnabar, making him very handsome. Dressed in a brocade robe with both civil and military sleeves, he looked dignified yet elegant, completely different from the Zheng Fang Li Cheng had imagined.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Looking at his mother-in-law, Madame Ji, like Huiyin, she was tall and strong, even slimmer, appearing capable and sharp.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Li Cheng also noticed that Zheng Fang and his wife were observing him. Madame Ji was particularly emotional. In her heart, her daughter was the best in the world, and there weren't many who could match her. In this chaotic world, a man's handsomeness didn't matter much. What was important was whether he could protect her.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Seeing this son-in-law, Li Cheng, dressed in a black python robe with golden clouds embroidered on the cuffs and a reddish-orange belt with inlaid beautiful jade, his black hair tied up with a hollow-carved gold crown, he looked both godly and unapproachable. The more Madame Ji looked, the happier she became. Her son-in-law not only doted on her daughter but also looked extraordinarily handsome and strong, not just a pretty face. The smile on her face deepened.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Looking at her daughter, who had been a young girl when she married, she was now a woman. Her bright forehead was exposed, and her hair was styled in a lily bun, making her look even more like a peach blossom with autumn water eyes. After such a long journey, she wasn't haggard at all but instead looked radiant. Madame Ji felt reassured.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"Prince, we have prepared a feast for you and the princess. Please sit and join us for a family reunion meal,\" Madame Ji said with a smile.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Li Cheng, of course, was humble. \"Everything is at the discretion of the in-laws.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Zheng Wuheng was eager and impatient, wanting to talk to his sister and brother-in-law, but also looking at his brother holding his little nephew. He wished he had eight eyes to take everything in. Pei Shuo handed the baby to Zheng Fang, who weighed him in his hands. \"This child is so well-proportioned. He must be over a year old.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Walking ahead, Huiyin turned around and smiled. \"Father, what are you saying? Our Jing'er isn't one year old yet. But he's really healthy. He's already twenty pounds at just four months old.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Seeing that Zheng Fang was holding the baby, Madame Ji hurried over, looking very worried. \"My lord, you should give the baby to the wet nurse. A man's hands are too rough; we wouldn't want to injure the baby's skin.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Huiyin hadn't had a chance to talk to Madame Ji since returning, and seeing how Madame Ji's eyes never left Jing'er, she felt a little jealous.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Laughing and chatting, they entered the house. Madame Ji had Li Cheng and Huiyin sit at the head of the table, while she and her husband sat below them. Opposite them sat Pei Shuo, his wife, and Zheng Wuheng.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Once everyone was seated, they heard Li Cheng talk about the journey. \"We disguised ourselves when we came from Qingzhou to avoid unnecessary trouble. The adults could handle it, but Jing'er had diarrhea for a few days before he got better.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Huiyin felt that Li Cheng wasn't giving himself enough credit, so she added, \"Actually, it was all thanks to the prince's arrangements along the way. When Jing'er fell ill, he immediately arranged a house for Jing'er to recover. We even encountered bandits, but we escaped unharmed. If it weren't for me, neither he nor the child would have gone through all that.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"Don't say that. I should have come to visit my in-laws sooner,\" Li Cheng said, feeling a bit embarrassed. Although he had indeed returned to satisfy his wife's homesickness, he didn't want to discuss such personal matters in public.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Both Zheng Fang and Madame Ji could see Li Cheng's shyness, and they were quite pleased. Zheng Fang even said, \"It's the greatest joy for the Zheng family that the prince has accompanied the princess back to her parents' home. My son was previously in Xuzhou under your care, and I'm deeply grateful, Your Highness.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"Please, father-in-law, it's what I should do,\" Li Cheng replied with a smile.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">When they heard that the banquet was ready, Huiyin and Li Cheng joined the others in the dining hall for the meal. Huiyin felt like she was back in her element, having not eaten home-cooked food for so long. Madame Ji helped her daughter by putting food on her plate. \"This is your favorite fried shrimp. Have more.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"Mother, I will,\" Huiyin replied.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">When she was at home in Jizhou, Huiyin rarely ate fried food. It wasn't that she didn't like it, but it was easy to get heaty, and as a young lady, she had to be mindful of her appearance.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Madame Ji loved watching her daughter eat and immediately served her another bowl of noodle soup. Meanwhile, Zheng Fang also spoke up, \"Why serve this noodle soup? It's not appropriate for the Princess to eat this.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Father, I like these. And is there any steamed cabbage rolls? I've been craving that dish,\" Huiyin said coquettishly.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"Bring that dish immediately,\" Zheng Fang urged the servants.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Parents show their love through endless feeding, especially Madame Ji and Zheng Fang. With Huiyin away from home, they felt as if they had lost their backbone.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Normally, such a grand banquet would be very formal, with the rule of \"no talking while eating,\" and the Zheng family had always been like that. But seeing Huiyin so happy, Zheng Fang, who wasn't from a noble family, relaxed. He even used a small knife to cut roasted lamb and beef for Li Cheng and Huiyin.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Huiyin was worried that Li Cheng might think they were too informal, so she whispered, \"My parents haven't seen me in a long time, so they're like this. It's not because they're treating you like an outsider.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"I understand. You don't need to explain,\" Li Cheng replied. He didn't find anything wrong with it and could see that his wife was very pampered at home.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"Are any of the dishes not to your taste? I'll talk to my mother. We have a chef who can cook southern dishes. We'll eat together then,\" Huiyin said with a smile.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Li Cheng nodded inwardly.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Pei Shuo had also been observing his younger sister and brother-in-law. Seeing the two whispering, it was clear they were very intimate in private. This young prince seemed far more genuine than the Crown Prince. He truly treated his sister well, traveling all this way to accompany her back for the visit, taking care of her the entire time, and having no concubines or secondary wives—even I would find that hard to do.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"Your Highness, I'd like to propose a toast to you. Our northern wine is strong. If you can't handle it, you can switch to the jade dew wine,\" Pei Shuo raised his cup.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Li Cheng laughed heartily. \"Why not? I've been wanting to try this 'burning knife' wine.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">The two of them, being of similar age, quickly became like brothers over drinks. Even Zheng Wuheng liked to join them, but Madame Ji wouldn't let him drink too much.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">After the banquet, Li Cheng and Huiyin returned to freshen up. They also checked out the courtyard where they were now staying. It was a small, well-prepared courtyard by their family, very spacious. The front of the courtyard was filled with all kinds of flowers. Two cranes were drinking water, and a peacock was displaying its feathers. Not to mention the exquisite furniture inside, everything was of the highest quality.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Huiyin supported Li Cheng's arm as they sat down. \"You drank so much; aren't you afraid it'll burn your heart? Now that you've bathed, you should rest properly. You've been exhausted from this journey; you need to take a break.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">She had planned to have a private chat with her mother. When she was still at her parents' home, the two of them had endless things to talk about. Now that they were far apart and sending letters was inconvenient, she definitely needed to go.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">But Li Cheng held her hand and said, \"Can you stay and sleep with me?\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">\"I'll be back soon. I haven't had a private conversation with my mother since I came back. I have to go,\" Huiyin replied with a smile. Li Cheng seemed a little reluctant, but Huiyin understood. Since traveling from Jiangnan to Jizhou, the couple had been inseparable, spending every moment together. Now that they were separated, even if just for a short while, they both felt a little unaccustomed to it.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">In our own home, Huiyin naturally wanted to spend time with her family. She said, \"Tomorrow, we'll go to Brother's house for a meal, and Father will take you to inspect the border. There are many things to do, so go to sleep.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">She covered Li Cheng's eyes with her hand, and he felt a warm sensation, which lulled him to sleep instantly.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Madame Ji hadn't slept either. Seeing her daughter come over, she patted the empty space on the bed. Huiyin quickly took off her shoes and climbed onto the bed, nestling together with her mother like they used to.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">\"Has the prince gone to sleep?\" Madame Ji asked. Being a wife was different from being a daughter. As a daughter, one could be more carefree, but as a wife, one had to take care of one's husband first.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Huiyin nodded. \"He's already asleep and didn't want me to leave. We're usually apart, so it's been hard to be together these days, which is why he was reluctant to let me go.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Hearing this, Madame Ji reminisced about her own wedding days with Pei Ye. He knew she loved the beef buns from the street corner, so he, a young master from a prominent family, queued up to buy them for her. He was anxious when she gave birth to Shuo'er, but that didn't stop him from caring for other women later.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">However, she didn't want to mention this in front of her daughter. The early years of marriage were the happiest, and if she said something that caused misunderstanding between her daughter and son-in-law, what good would it do? Besides, even if Pei Ye was like that, there were still good men in the world.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Thus, Madame Ji teased, \"He couldn't bear to part with you, which shows how strong your relationship is.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">\"Let's not talk about us. How are you, Mother? I heard my younger brother is getting married?\" Huiyin asked in rapid succession.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Madame Ji smiled and said, \"Hold on, let me answer one by one. I'm doing well, but your sister has been causing a fuss about wanting to come home. Your grandmother wants your father to fetch her, but both your father and I don't want to. Even the Crown Princess can't visit her parents' home freely, let alone a secondary consort like a Liangdi.\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Huiyin agreed, \"That's true. In my previous life, after becoming a Liangdi, I was mostly summoned by my family. Even as Empress Dowager, I couldn't casually return to my parents' home.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">So, she was a bit speechless, \"How could Grandmother make such an unreasonable request? Why is she suddenly so insistent on coming home?\" In her previous life, after Li Cheng passed away, her sister didn't make a fuss about going home, but now she was.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Madame Ji sighed, \"It's because a concubine in the Eastern Palace was beaten to death by Lü Wei after she became pregnant, and even her brother was implicated. Your sister witnessed her death and was frightened, thinking the Eastern Palace was a dangerous place. She chose to marry into it, and it's not like a regular family where she can just come back.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Madame Ji thought that if it were her own daughter, she would have done everything to protect her, but Huiyin wasn't her daughter. Zheng Fang turned a blind eye, so how could she interfere in such matters?</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">\"A concubine beaten to death by Lü Wei? Was she from the Dong family? I think I heard about her from Tong Niangzi before.\" Huiyin was surprised that such a thing had happened, which didn't occur in her previous life.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Madame Ji nodded, \"She was a concubine named Dong, originally a palace maid and one of Empress He's attendants. The Crown Prince didn't favor her much, but she was fortunate to be pregnant with the Eastern Palace's child, only to meet such an end. Actually, what does this have to do with your sister? Your father is the Grand Commander of Jizhou and a marquis; how could Lü Wei dare to clash with him now?\"</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Huiyin thought that in her previous life, although her father eliminated Lü Wei, his situation didn't improve much, and he had to follow the Crown Prince, only to realize later that the Crown Prince wanted to betray him.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">But this Huiyin went to great lengths to change her marriage, yet she was so timid and hadn't discovered that the Crown Prince was giving them contraceptive medicine.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">If I were in her position, I would need to have a child to persuade Zheng Fang. Otherwise, what leverage did she have?</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"Mother, the main reason we came back this time with the prince is to visit family, but we also need to go to the palace to celebrate the Emperor's birthday. Otherwise, as the prince, who oversees the navy, he can't easily leave his post.\" Huiyin explained their purpose.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Madame Ji asked in a low voice, \"Your father already knows about that. We'll go to the palace together. But there's one thing, I heard you and Zheng Fang delayed your wedding by more than ten days? Does he have any other women?\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Huiyin shook her head, \"I'm not sure about his past, but he told me he didn't. However, he was quite skilled on our first night, not like a novice.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">\"And after you married, how has he been with you?\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">\"Even if he's injured, we sleep together. You know what? His grandmother didn't treat me well and tried to punish me, refusing to let me manage the household. When he returned, he sold all his grandmother's people and gave the money to me to manage.\" Huiyin said with a hint of sweetness.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Madame Ji was about to say something more when Huiyin continued, \"When I was giving birth to Jing'er, he stayed by my side in the delivery room, holding me from behind and comforting me. At that moment, I was deeply moved. No matter what happens in the future, at least he's truly good to me. He has no parents, and his grandmother is quite muddled, but he's very good to me.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">\"You're defending him before I even say anything!\" Madame Ji instructed, \"I know he's good to you, so don't worry. I can see he's a fine man. As a member of the royal family, he's truly remarkable. But as a woman, you mustn't completely rely on a man.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Huiyin smiled, \"Don't worry, Mother, I have a sense of proportion.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Madame Ji touched her daughter's hair and couldn't help but say, \"When you came back today, I almost didn't recognize you. You look so good, like a peach blossom. I knew your life must be going well, and most importantly, giving birth to Jing'er is the best thing.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Back then, Madame Ji could still remarry with Pei Shuo, and even if she couldn't, when her son grew up, she would have someone to rely on. In these uncertain times, even a strong woman without family support or a son would be vulnerable.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">\"How are you and Father?\" Huiyin asked, concerned about Madame Ji.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Madame Ji smiled. \"Your father comes to see me a few times a month. He still consults me on important matters. Even those concubines, even the difficult ones, don't dare to say anything in front of me. I'm not afraid of them.\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Madame Ji had a fighting spirit. Her gratitude towards Zheng Fang outweighed her love, and she didn't have a strong sense of possession. As long as they didn't go too far, she wouldn't care. Moreover, some of those concubines were former singers or dancers, born into poor families. In these turbulent times, they were like duckweed, very good at reading the room. They knew clearly who was in charge in the household.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">\"That's good. In the future, your daughter will also support you,\" Huiyin smiled.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Madame Ji lowered her eyes. \"There's also your grandmother. I know her well. She might think your sister wasn't worthy of her son-in-law. But let's not talk about this. Since you're back, we'll choose an auspicious day. When the time comes around for your brother's wedding, you'll be able to meet your future sister-in-law.\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Huiyin naturally agreed but frowned. \"Mother, why the rush? Brother is only eighteen.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">\"That's already considered late. In our family, with all the battles, once your brother is married, people will start treating him as an adult. Also, if anything unexpected happens, it's good to leave behind a descendant.\" Madame Ji, born in the military, was more open about life and death than ordinary people.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Huiyin naturally asked about her brother's fiancée. \"I've only heard from Lady Tong that Miss Cui is known for her virtue and grace. I don't know the details.\"</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">When mentioning her future daughter-in-law, Madame Ji couldn't help but say, \"She's pretty but not seductive. She doesn't have the same beauty as you and your brother. However, her personality is very gentle, with a natural aura of gentleness. Although she's the youngest daughter in her family, she doesn't act coquettishly or throw tantrums. She's broad-minded. Your brother, who can be rash and headstrong, was immediately smitten with her.\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">\"So it was my brother who fell for her. That reassures me. By the way, Princess Wu's family is related to the Cui family. When the time comes, I can visit his uncle's house with the prince.\" Huiyin relaxed.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">The mother and daughter chatted about family matters for a while. Huiyin yawned and prepared to go back. Since she was home, she could talk to her mother for a long time.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Madame Ji had someone bring a lantern to escort her. \"It's pitch black outside. Be careful.\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">\"Mother, please don't see me off. I'll be careful. Besides, it's not cold, and there's no snow. Don't worry.\" Huiyin insisted on preventing Madame Ji from seeing her off.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">As she left her mother's main room, she felt the moon was bright and the stars sparse. She was a bit emotional. In this lifetime, her sister was so timid. She couldn't help but wonder how Li Heng would cope with such a timid sister.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Just as she was thinking, she walked out of the courtyard and saw someone standing there with a lantern. The lantern light cast a glow on his blue brocade sleeve, and when she looked up at his jade-like face, his eyes, which had been vacant, suddenly filled with joy. In the dim light, Huiyin could see a warm, golden light in his eyes.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">\"Husband, why are you here?\" Huiyin had assumed he was already asleep.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">She wondered if he had come to confess something, or perhaps it was for her safety, or even out of reluctance to part.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">To her surprise, Li Heng looked puzzled. \"I wasn’t thinking. I just found myself walking here.\"</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Huiyin laughed. \"You have a sharp face but a slow heart. Couldn't you just say you missed me?\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\"></p><p id=\"paragraph-109\" data-paragraph-id=\"109\"></p><p id=\"paragraph-110\" data-paragraph-id=\"110\"></p>\n</div>"
  },
  {
    "number": 44,
    "title": "Chapter 44",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 44</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Two Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Huiyin was awakened by the chirping of birds and the voices of children. She hadn’t expected it to be broad daylight by then. When she sat up, she was momentarily disoriented, unsure of her surroundings.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Fugui and Qiufeng were sitting not far away, dividing threads on stools. When they heard the noise, they hurried over.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">“What time is it now?” Huiyin asked, stifling a yawn. She leaned on a pillow, finally having slept soundly.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Fugui replied, “It’s almost noon, Lady Huiyin. Marquis Zheng Fang has taken the Little Prince to inspect the troops. He said he won’t be back for lunch and asked you to dine with the Lady of the Marquisate.”</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Huiyin nodded. Her father had been able to hold on until now entirely due to his old foundations, which was also why both of his daughters were hedging their bets. Especially in recent years, her father had indulged in sensual pleasures and was no longer the man he used to be. Her brother, after all, bore the Pei family name and wasn’t being raised as a potential heir, and her younger brother was too young. The family was in a difficult transitional period.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">For instance, in Prince Wei’s army, they used a new type of trebuchet. During a recent skirmish with bandits, when the bandits shot arrows down, they were all destroyed by the trebuchets. Li Cheng, being young and eager to learn, likely made the army under Prince Wei far more formidable than their own.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">But she couldn’t express these concerns openly. After washing and dressing, she went to speak with Madame Ji. Madame Ji said, “Now that you are a princess, it’s we who should pay our respects to you. How could you come to us?”</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">“Mother, we’re all at home. Why worry about such formalities? Besides, I slept in until late morning. I’m already afraid of what people might say.” Huiyin leaned on Madame Ji’s shoulder and acted spoiled.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Madame Ji smiled and said, “You traveled a long way back. It’s only right that you sleep in longer. What’s the big deal? Who would dare say anything?”</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">The mother and daughter exchanged a knowing smile, seemingly deliberately forgetting about Elder Madame Xu. She claimed to be ill, and Huiyin had sent some tonics over, but no one really cared about her.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Feelings between people develop over time. Elder Madame Xu and Huiyin had little emotional connection, so there wasn’t much of a grandmother-granddaughter bond. Similarly, Grand Dowager Wu had some affection for Li Cheng after the death of his parents, but her indulgence of her greedy servants and her mistreatment of herself, driven purely by self-interest, had greatly disappointed Li Cheng.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">As the mother and daughter sat down for lunch, Madame Ji said, “Your father seems to like your husband quite a bit. They discuss history and his past heroic deeds together, but your father also seems a bit insecure.”</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">It wasn’t that Zheng Fang was insecure; he was just getting old and felt incapable, yet he still had to hold on.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">“Mother, my husband is considered both wise and brave in Prince Wei’s army. He’s intelligent and lives and eats with the soldiers, earning their respect. In the future, if father or my brothers encounter any difficulties, don’t hesitate to trouble us.” Huiyin, of course, wouldn’t immediately suggest anything about serving someone.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Even after she became Empress in her previous life, the threat of Wei Duo still existed, and her father would still be afraid. Her position as Empress Dowager was actually precarious.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Now, with a calm heart, Huiyin naturally hoped her family could become self-reliant. But if that failed, they would need to quickly find a backer. Lü Wei and He Guoguo weren’t easy to deal with. Li Cheng was capable. If he makes a firm decision, the Zheng family could still survive.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Madame Ji was very pleased to hear her daughter’s thoughts. “You’re always the one who thinks of us. Unlike your elder sister, who makes your father want to kill Lü Wei one day and asks him to bring her back the next. She’s not capable herself but is good at ordering others around.”</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">“As a daughter, one should naturally share the worries of one’s parents. By the way, I heard that Lü Wei has been throwing his weight around recently and that He Guoguo is quite dissatisfied. Is that true?” Huiyin sipped her tea and asked.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Madame Ji smiled faintly. “It’s a well-known fact. Besides, Dong Yuniang was a person given to the Crown Prince by Empress He. As the saying goes, ‘Even if you don’t respect the monk, you should respect the Buddha.’ Yet Lü Wei dares to act this way. The Crown Prince used to favor the Crown Princess, but recently, he seems to have grown quite cold towards her. He can only rebel in these small ways.”</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Huiyin thought it made sense, but she said, “Has my elder sister, who is by the Crown Prince’s side, found out anything? What about the He family’s arrangements and the Crown Prince?”</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">“She’s only concerned with gaining favor and affection. How could she think about anything beyond her own desires? Yet she still expects us to prioritize her?” Madame Ji was at a loss for words.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Xu Shi was still alive, living in her temple and harboring hopes of rising again through her daughter, though she wasn’t foolish enough to think it would be easy.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">After the meal, it was heard that Xin Shi had come over. She had specifically invited Huiyin to listen to a play. Huiyin certainly wouldn’t refuse her sister-in-law, especially since Xin Shi had been busy the day before. The two sisters-in-law had gotten along well enough.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">When Pei Shuo married, Madame Ji had given him a residence in Tongling Ward. Last year, Xin Shi had connected the neighboring house, making it even larger. Xin Shi had specially built a theater there and was explaining as she spoke.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">“We’ve invited the Four Joy Troupe. Princess, it’s been two years since you’ve been in Jizhou. Why not listen to some local plays from Jizhou? The movements are quite wonderful.” Xin Shi introduced.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Huiyin nodded slightly.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Today, she was undoubtedly the center of attention. Xin Shi had invited guests from her parents' home and local gentry families. Among them was a young woman who, for a moment, reminded Huiyin of Yin Liyi.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Xin Shi introduced her, “This Madam Zhang is from the Cui family of Boling.”</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">The local aristocratic families of Zhang and Cui in Hebei were quite renowned, and the two often intermarried. Although Huiyin didn’t recognize this Madam Zhang, she assumed that anyone invited by Madam Xin would certainly be of high standing.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Madam Zhang hurriedly came forward to pay her respects. Huiyin smiled and gently waved her off: “Madam, there’s no need for such formality.”</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">In truth, Huiyin wasn’t particularly adept at socializing. Deyin was more skilled at socializing; she knew how to make friends quickly, what to wear and say for different occasions, and even how to play games. Huiyin had once admired Deyin greatly for this, but now she could handle social situations with ease. She had come to understand that without the backing of real power, all these so-called social skills meant nothing.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">If you have influence, even a casual remark can draw admiration.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Now, even though she admitted she didn’t understand opera, everyone was eager to explain it to her, treating it as an honor to do so.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Next to her, Madam Xin’s mother, Elder Madam Xin, spoke to Madam Ji: “Now that the princess has returned to her parents' home, I wonder if we might have the honor of hosting Her Highness.”</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Madam Ji explained: “In a few days, they will head to the capital for the emperor’s birthday celebrations, so they won’t be staying long. I also mentioned that the relatives at home are all waiting for you to return so we can have a lively gathering, but the prince and princess are busy; we can’t delay their important affairs, can we?”</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Madam Xin immediately understood. Neither side genuinely wanted this, but both had found a way to give the other a graceful exit.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">The table was filled with the pastries, teas, and wines that Huiyin loved when she was still in the boudoir. Though she didn’t like drinking alcohol, she particularly enjoyed iced grape beverages or wine. As soon as she finished a cup, the servants behind her would refill it. Huiyin drank half a cup more, and when the opera performance was nearly done, she went to see her nephew, Guge. The child resembled his mother, Xin Shi, but was noticeably thinner, which was more typical for a child his age.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Madam Ji looked at her grandson and sighed: “Look how thin Guge is. He had diarrhea for many days and even hit his head. I don’t know how your sister-in-law takes care of him.”</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">“Mother, no mother would deliberately harm her own child. It’s normal for children to have bumps and bruises. Even Jinger traveled so far with me, and I couldn’t bear to see him like that.” Huiyin gently squeezed her nephew’s small hand.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">She had brought a gift for her nephew, including writing supplies, a longevity lock, gold and silver bracelets, and a box of intricate toys like clay whistles, kites, nine-linked rings, and ceramic rattles. She even brought two carts of exquisite soft silk clothes for the child.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">When Xin Shi came in and saw her mother-in-law holding the child and her sister-in-law looking at Guge with affection, she felt warmth in her heart. Xin Shi had been thinking long-term. After all, this region of Jizhou would eventually belong to Zheng Wuheng, with Pei Shuo currently holding it on his behalf. In the future, the elder brother would have to defer to the younger. Her husband might not accept this easily.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">In this vast world, with various powers vying for control, one had to choose between joining the crown prince, Prince of Wei, Wei Duo, He Guoguo, or even warlords like Lü Wei. Xin Shi thought that since her sister-in-law had married the Prince of Huaiyin and seemed to be greatly favored, perhaps her husband could also pledge himself to the Prince of Huaiyin. The prince had spoken confidently at the banquet yesterday and showed great courage, leading two thousand soldiers without fear even when passing through Qingzhou. Such bravery wasn’t something ordinary people possessed.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">With such a heroic brother-in-law and her sister-in-law thriving in the ancestral lands of her maternal family, Xin Shi thought it wouldn’t be impossible for her husband to pledge allegiance to the Prince of Huaiyin. This way, Madam Ji wouldn’t be too upset either.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">So, Xin Shi became even more enthusiastic toward Huiyin. Huiyin, of course, understood her thoughts. She was waiting until Li Cheng truly took power, at which point she could formally extend an invitation.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">But for now, being outnumbered and without real power, she couldn’t make guarantees to her natal family. She had to proceed slowly; otherwise, the variables would be too great, and things could backfire.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Thus, Huiyin brought up a light topic: “By the way, Sister-in-law, is Madam Zhang from the same branch of the Cui family as my younger brother’s fiancée?”</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Xin Shi smiled: “They both seem to come from the main branch of the Qinghe Cui family, but Madam Zhang is from a concubine’s line. The woman my younger brother is marrying is from the legitimate wife.”</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Madam Ji added with a slight smile: “You may not know this, but Madam Cui comes from the prestigious Longxi Li family, which shares the same surname as the imperial family, making her lineage highly distinguished.”</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">“To me, whether someone is from the main line or a secondary line isn’t as important as having a good heart.” Huiyin, who once cared about these things, now believed that having a righteous heart was more important than anything else.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">That said, there were still subtle differences in status. For example, Huiyin and Deyin didn’t have a large status gap, but Huiyin had brothers, while Deyin didn’t, which made Deyin’s words carry less weight. If one was born to the main wife and had a brother who might be the future head of the family, that person’s influence would be different.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">After returning from her elder brother’s home, Jinger was clamoring for his mother. Huiyin spent the entire afternoon playing with her son. It was only when the sky began to darken that Li Cheng returned.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Li Cheng strode in, one corner of his clothes tucked into his waistband, looking even more refreshed.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Huiyin stood up, wrung a towel, and handed it to him: “Why are you back so late? Where did you all go today?”</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Li Cheng wiped his face and couldn’t help but smile: “I went to inspect the Jizhou army. I even arranged for my soldiers to have a friendly match with the Jizhou army. Your father agreed to it.”</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">“That’s wonderful. My father wishes for someone like you to be by his side, but he has a weakness: his resolve isn’t firm, and he’s easily swayed by others. As his son-in-law, with both literary and martial abilities, don’t be too formal.” Huiyin hoped they could maintain a good relationship.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Speaking of Zheng Fang, he wasn’t inherently evil. People criticized him for killing Lu Ji because they saw him as impulsive and self-serving. But in this complex world, who can truly be relied upon for loyalty?</p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Even Prince of Wei had taken a significant amount of Prince of Wu's territory, and Li Cheng didn't dare to say anything.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Before coming to Huiyin's parents' home, Li Cheng had assumed the Zheng family would be very defensive toward him, but it turned out they were quite sincere. He cleared his throat lightly, \"They didn't treat me as an outsider.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Huiyin nodded. \"That's good. I just asked my mother, and she said my younger brother is preparing to get married in half a month. We can attend both the Emperor's birthday celebration and my brother's wedding, and then return.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Huiyin wondered if this timeline might be a bit too long, and wasn't sure if Li Cheng would agree.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Unexpectedly, Li Cheng readily agreed. \"That's fine.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">\"But is everything alright in Xuzhou?\" Huiyin asked.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Li Cheng was indeed worried, but if he eliminated Lü Wei now, his prestige would rise, and no one would be able to replace him. This was his plan, and he sensed his father-in-law agreed.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">So, he reassured Huiyin, \"Everything's fine. Don't worry, enjoy the time with your parents.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Huiyin nodded.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Elder Madame Ji was full of vitality. In the evening, they had planned for a simple meal, but she prepared a small banquet instead. Huiyin and Li Cheng attended, and with the music, it became a joyous gathering.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">However, to Elder Madame Xu, this felt like mockery. Nanny Luo couldn't help but say, \"Actually, Second Miss also sent tonic. Why don't you go out and meet them? Would they dare to disrespect you?\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Elder Madame Xu glanced out the window. \"I heard the Prince of Huaiyin treats Second Miss very well?\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">\"Yes, he came to pick her up in the evening and brought gifts for everyone in the household. Even the servants received fine fabrics from Jiangnan, let alone the others.\" Nanny Luo also felt regretful. If the eldest miss had married the Prince of Huaiyin, she would likely have children by now.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Elder Madame Xu decided to stop pretending to be sick. She wanted to see if this Prince of Huaiyin was genuinely good to her granddaughter.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">The next day, Huiyin and her husband met Nanny Luo, who conveyed that Elder Madame Xu's health had greatly improved and that she wished to see her great-grandson.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Huiyin smiled. \"I actually wanted to pay respects to grandmother on the day we returned, but I was afraid of disturbing her due to her illness. Now that she has recovered, I will go with the prince to pay our respects.\"</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">As soon as she finished speaking, Nanny Nan looked troubled. \"Your Highness, why would you and the prince go in person?\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">\"She's our family grandmother; why put on airs?\" Huiyin shook her head.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Nanny Luo was startled and realized that both she and Elder Madame Xu had forgotten. This wasn't just any married-off lady returning to her family; it was the prince and princess. There was a distinction between ruler and subject.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">She quickly said, \"Although the princess is approachable, our elder Madame Xu insists on observing propriety. She will come to see the young prince later.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Huiyin didn't refuse further. Once Nanny Luo left, Li Cheng was visibly annoyed.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">No wonder Huiyin said Elder Madame Xu was difficult. Even during a princess's return to her family, there was still an air of superiority. He had to meet this elder Madame Xu properly.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Because of Nanny Luo's message, Elder Madame Xu realized she had breached etiquette. Though reluctant, she came over under the pretext of seeing Jing'er and certainly didn't want to perform the formal greeting. Huiyin didn't intend for her elder family member to kneel and quickly stepped forward to help Elder Madame Xu up. \"Grandmother, there's no need for such a formal gesture. You are my elder; this is absolutely not allowed.\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">\"Etiquette cannot be neglected, Princess is too kind.\" Elder Madame Xu had never liked Huiyin. She knew Huiyin's respect was just pretense. If she truly respected her, why put on airs?</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Elder Madame Xu said in a seemingly affectionate tone, \"I felt unwell when you returned, as I was concerned about passing my illness to you.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Li Cheng smiled. \"It's a filial duty to pay morning and evening respects, but we rushed back, carrying the dust of the journey, and were also concerned about passing on any illness.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Elder Madame Xu couldn't help but notice Li Cheng. She had thought Crown Prince Li Heng was unparalleled in handsomeness, noble and elegant, and few could match his appearance. Unexpectedly, Li Cheng was also very handsome, with a dashing demeanor, clear brows, and sharp speech. Though raised in Jiangnan, he spoke Mandarin very well.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">If De Yin had married the Prince of Huaiyin as planned, just look at this precious little one, so endearing!</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Bringing her thoughts back, Elder Madame Xu began to reminisce. \"I heard your maternal uncle's family is from the Cui family of Qinghe?\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Li Cheng smiled. \"This prince's uncle is General Bo Ling Cui Xun.\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Huiyin noticed that Li Cheng referred to himself as \"this prince\" when speaking to Elder Madame Xu, but when talking to his mother, Madame Ji, he called himself \"your son-in-law.\" The difference was quite significant, but one couldn't fault him for maintaining his status as a prince.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">\"Oh, what a coincidence! Your younger brother is marrying the daughter of the main branch of the Canghe family. It's truly a case of kin marrying kin. I believe your uncle also had a daughter who married into the Zhang family,\" said Elder Madame Xu, trying to show off her knowledge of familial relations.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Li Cheng nodded. \"After the passing of my father, the Prince, and my mother, the Princess, we haven't kept in touch due to the distance. I wasn't aware of the affairs in my uncle's household, but this time, I plan to visit him with the princess.\" In truth, after the death of the Prince and Princess of Wu, Li Cheng had written to his uncle, but Cui Xun always made excuses and was unwilling to truly support him, not even willing to make a trip. At that time, Li Cheng was isolated and had grown indifferent to this uncle.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">These matters were not something he could discuss with outsiders, especially since after the conquest of Xuzhou, his uncle had written several times.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Recalling that his mother was raised by his uncle and aunt, Li Cheng couldn't bring himself to completely sever ties.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Elder Madame Xu, hearing this, circled back, \"Just have some congratulatory gifts prepared and sent over.\"</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">These familial matters didn't make Elder Madame Xu seem like a major issue to Li Cheng. As long as they maintained a courteous facade, everything would be fine as long as she didn't act out. He would treat her with normal respect.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">However, Elder Madame Xu couldn't hold back. She glanced at Huiyin and said with a smile, \"This second granddaughter of mine has always been mischievous. If she offends you, Prince, please don't take it to heart. Just let me know.\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">\"Please rest assured, Elder Madame Xu. The princess is gentle and virtuous. She is kind to me and the people of my fief, and she is well-loved,\" Li Cheng naturally spoke well of Huiyin. He wasn't foolish enough to think speaking ill of his wife would elevate him.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Elder Madame Xu smiled. \"Yes, this granddaughter of mine has always been charming. There was a young gentleman who was so infatuated with her that he was willing to die for her. I told her parents that such a clever and lovely child shouldn't be married off hastily. Coincidentally, my natal family, the Xu family of Donghai, came to our Jizhou, which led to your perfect match.\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Li Cheng had heard about this from Huiyin before. Apparently, there were those who called her a temptress, which was why Huiyin rarely socialized afterwards. She was admired by someone who, when she didn't reciprocate, vilified her.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">If Li Cheng had only known about Elder Madame Xu through Huiyin's words, hearing her mention it now made him narrow his eyes. This old woman is overstepping. Despite my courtesy, she now speaks in a sarcastic manner.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Huiyin was also angry. As the saying goes, family shame should not be aired in public. While Elder Madame Xu had been distant and cold to them at home, she had never acted like this outside. Huiyin was worried that Elder Madame Xu might speak ill of her to Li Cheng, but to say such things in front of her, implying she was fickle, was clearly intentional, meant to undermine her in Li Cheng's eyes.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Nanny Luo, standing next to Elder Madame Xu, knew that the old lady was upset. Neither the Marquis nor his wife cared about the eldest daughter's well-being, and the second daughter's return with an air of nobility was clearly a challenge, deliberately making the elderly suffer.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">If the Prince of Huaiyin could see through the second daughter's true nature, it would be a blow to Madame Ji.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Unexpectedly, Li Cheng, furious, smiled instead, \"You are mistaken, Elder Madame Xu. This has nothing to do with the Xu family of Donghai. After much inquiry, this prince learned that the princess is the most beautiful woman in Jizhou and a paragon among women. Thus, I asked Uncle Wang of Wei to propose marriage for me. At that time, it was said that there were two young ladies in your family, but it was Huiyin that I favored and had always wished to marry. Thankfully, fortune smiled upon me, and my dream came true. I married the woman I had always desired.\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Upon hearing this, Huiyin felt her heart swell with warmth, as if it had been filled with honey. She glanced at Elder Madame Xu, whose face turned pale with anger, and thought, \"Now you've brought shame upon your beloved granddaughter!\"</p><p id=\"paragraph-107\" data-paragraph-id=\"107\"></p><p id=\"paragraph-108\" data-paragraph-id=\"108\"></p>\n</div>"
  },
  {
    "number": 45,
    "title": "Chapter 45",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 45</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Double Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Huiyin didn't know how Elder Madame Xu felt when she left, but she herself felt much better. Nevertheless, she still said to Li Cheng, \"You shouldn't have brought up my elder sister. She's not having a smooth time as Liangdi in the Eastern Palace. My grandmother is already upset, and seeing how affectionate we are might make her say something unpleasant.\"</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">\"That's no reason for her to speak poorly of you. Are you not also her granddaughter?\" Li Cheng, who was inherently indifferent to familial affection, especially when family members failed to support each other and even disparaged Huiyin in front of him, believed that Elder Madame Xu was not a good grandmother.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Huiyin smiled and said, \"Alright, I understand. You're always thinking of what's best for me. Let's not talk about this anymore. You mentioned visiting your uncle's house; I'll prepare the gifts. If it's feasible, we'll go.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Li Cheng nodded. \"You draw up the list, and I'll check if anything needs to be added or removed.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Sure.\" Huiyin didn't feel that Li Cheng was doubting her. When they handled matters as a couple, they were always open to each other's suggestions without any possessive attitudes.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Li Cheng was about to say something more when they heard the voices of Pei Shuo and Zheng Wuheng outside. Huiyin nudged him. \"Go with them; it's important for you to socialize too.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">For someone his age, Li Cheng was unusually mature. Constantly dealing with intrigue could wear a person down, so spending time outside would help him feel more refreshed.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng smiled. \"Alright, I'll go out and see what they want. If it's nothing important, I'll come back early.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Of course, he didn't come back early, which Huiyin had anticipated. So, she began drafting the list. Given how generous the Cui family had been in the past, they couldn't afford to give less this time.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">It was nearly dusk when Li Cheng returned, looking quite pleased. Huiyin showed him the list she had prepared, to which Li Cheng had no objections. He flopped onto the bed, resting his head on his arms, and said to her, \"The Emperor's birthday is coming up in a few days, so we need to leave for the Cui family soon and avoid any delays on the way.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"We can leave our son with my mother. Knowing she'll take care of him will give me peace of mind.\" Huiyin smiled.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Li Cheng clapped his hands and laughed. \"That's perfect. Our son won't have to endure the journey with us. This is a good thing.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">The two planned that the next day, they would first send a fast horse to inform the Cui family, and then they would follow after. The journey from Jizhou to the Cui family would take about a day and a half.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Huiyin had imagined Cui Xun to be a handsome man in his forties, similar to her mother-in-law, Lady Wu, who would be in her early forties if she were still alive. But Cui Xun was already in his sixties, with graying hair and sagging skin, though he remained well-preserved.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">But she wouldn't ask if Lady Li was a second wife, as that would be impolite.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">So, Huiyin simply sat down and exchanged some trivial remarks with Lady Li. \"I got married a few years ago, but I didn't expect that our families would become even closer relatives.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">She had initially thought it might be a different branch of the Cui family, but it turned out that Uncle Cui's daughter was marrying her younger brother.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Lady Li clearly doted on her daughter. \"My daughter is of humble appearance, but it is her fortune to be favored by the Marquise. The engagement will take place soon, and it will be her honor that both the Prince of Huaiyin and the Princess will attend the ceremony. Would you like my daughter to prepare some tea for you?\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Huiyin readily agreed. \"Why not? I'd like to meet her too.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Miss Cui, whose small name was Yuehuan, wore a white jade crown and light purple flowers in her hair, with a matching dress. She was graceful and elegant. Huiyin silently praised her and sipped the tea she offered.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">She watched Miss Cui prepare the tea seven times, resulting in a pure white color and fine, even froth. Her technique was impressive.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Huiyin took another sip. \"Yes, the taste is right, the aroma is clear and pleasant, and the color is beautiful. Excellent, excellent.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Lady Li and Miss Cui exchanged glances, both pleased.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Miss Cui, trying to socialize like the adults, said, \"This tea is called Ling Tea. If you enjoy it, Princess, we can send some over for you.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">\"Sure, pack two bags for me. Any more, and I won't be able to finish it.\" Huiyin smiled.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Li Cheng dismounted quickly and approached as he saw the Cui family waiting at the gate.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">But he was still a robust and imposing figure, befitting his former status as a general.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Madame Cui was also very happy and added, \"When I married into the family, my younger sister-in-law was about to get married. Although we didn't spend much time together, we have been thinking of each other over the years while being separated by distance. When we heard the news of Princess Zheng's passing, my husband was so heartbroken that he couldn't make the journey to attend the funeral. This has been weighing on his mind, and he hasn't been able to forget it.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">\"Given his condition and the long journey, I’m sure my late mother-in-law wouldn’t have blamed him,\" Huiyin thought. If the relationship had truly been close, he would have gone no matter what. She had heard from Li Cheng that Princess Zheng had only one brother.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">When she went back home, her brother met her three hundred miles from the capital.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Madame Cui felt relieved when Huiyin said this. She was wholeheartedly intent on making this marriage alliance successful. Zheng Wuheng, the son of the Marquis of Zhaojie, was young, the heir and only son. Moreover, Jizhou was under the jurisdiction of the Marquis of Zhaojie. This marriage would be beneficial for both her daughter and the Cui family.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">At lunch, the Cui family had prepared fine wine, but Li Cheng ate a little and prepared to leave, saying he was getting ready to go to the capital. The Cui family didn’t try to keep him, but Huiyin said to Lady Cui, \"In the future, we'll be relatives, so it will be easier to visit each other. We'll have more opportunities to meet.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">After getting on the carriage, Huiyin furrowed her brow. Li Cheng, seeing this, asked in surprise, \"What's wrong? Are you not satisfied with my cousin?\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"It's not that. I was just thinking that your uncle's age seems like he could be Lady Cui's father. Is she a second wife?\" Huiyin was curious.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Li Cheng waved his hand. \"Of course not. You don't know that in this dynasty, noble families must marry someone of equal status. My uncle lost his father young and raised his younger sister, who is my mother. My uncle is eighteen years older than my mother, and he essentially raised her. He had high aspirations and came from a prestigious family. It wasn't until he was in his thirties, when he received an official title, that he had the qualifications to marry into one of the five great surnames, the Li family of Longxi.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"I see. Since I'm not from a noble family, I wouldn't have known that,\" Huiyin realized.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Li Cheng added, \"After marrying, my uncle and his wife had two sons and a daughter. My elder cousin was recruited by Wei Duo. It's truly a case of like father, like son.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Huiyin, resting her chin on her hand, found it strange. \"If your uncle hadn't made it big, would he have remained without a woman? How would the household have been managed?\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">\"Even without a principal wife, there would be concubines,\" Li Cheng saw nothing strange about it.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">After visiting Li Cheng's uncle, they returned first to the Marquis of Zhaojie's residence in Jizhou. The couple was most concerned about their son, and they were surprised to see Jing'er nestled in Madame Ji's arms.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Madame Ji smiled and said, \"When you first left, he cried for half an hour. After that, he became very attached to me. He's been sleeping with me these past few days.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"It seems it's not the child who can't leave the adults, but us adults who can't leave the child,\" Huiyin tickled Jing'er, making him giggle.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">The women were primarily focused on household affairs. On the surface, Li Cheng appeared to be out having fun with his brothers-in-law, but in reality, he and Zheng Fang were discussing the plan to eliminate Lü Wei with He Guoguo.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">It took only a day to travel from Jizhou to the capital by carriage. The streets of the capital were already decorated with lanterns and streamers to celebrate the emperor's birthday.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">This time, Madame Ji wouldn't be coming. She had already entered the palace many times and didn't want to deal with Empress He. She always said that Empress He was full of schemes. Thus, Madame Ji reported an old illness and stayed home to look after Jing'er. On the other hand, Elder Madame Xu, at her advanced age, still had to go. Everyone knew why, and it was understood.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">In truth, entering the palace was no big deal for Huiyin, but for Li Cheng, it stirred new and strange thoughts.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Born in a vassal state and raised in the Jiangnan region, he was still a descendant of Emperor Taizong, with the blood of Emperor Taizong flowing through his veins. Seeing the frail emperor behind the curtains and Prime Minister Lü Wei standing beside him, Li Cheng thought that if he were the emperor, he would have executed such a rebellious figure. The moment this thought arose, he felt his ambition was too great.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">\"Your subject, Prince of Huaiyin, Li Cheng, along with Princess Zheng, offer birthday greetings to the emperor. We wish Your Majesty a long and prosperous life,\" Li Cheng and Huiyin bowed together.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Huiyin, slightly raising her eyes, saw the hall brightly lit as if it were daytime. Standing below the emperor was Crown Prince Li Heng, with Lü Wei on either side. Li Heng, with elegance and nobility, had a smile at the corner of his mouth. The shadows from the lamps covered half of his face, adding a touch of mystery.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">To Huiyin, Li Heng now seemed like a stranger.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">The emperor, coughing for a long time, seemed pleased as he said, \"You are the son of the Prince of Wu's brother. You are, in fact, my close nephew. Come closer and let me take a look at you.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Li Cheng stood up, adjusted his clothes, and walked forward, appearing even more outstanding and imposing. Li Heng also seemed to notice his cousin, the Prince of Huaiyin, for the first time. He had heard that Li Cheng was in the capital to celebrate the emperor's birthday on behalf of the Prince of Wei and that he had been training the navy for the Prince of Wei, becoming famous in the Jiangnan region at a young age.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">More importantly, he had married the second daughter of the Zheng family, while another had married the eldest daughter.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">As Li Cheng ascended the steps, the light seemed to follow him. The rows of candles illuminated his path. Li Heng looked up, and Li Cheng stopped, smiling as he greeted him.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">The emperor studied Li Cheng for a moment and smiled. \"The Prince of Huaiyin is truly remarkable and handsome, worthy of being the son of the Prince of Wu. Since you've come from your fief to celebrate with me, I can't let you leave empty-handed.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">The attendants by the emperor's side read a long list of rewards, and Li Cheng thanked him. But inwardly, he felt somewhat disappointed. He had thought the emperor might ask him about his usual activities or how things had been in the fief since his father's passing. It seemed he was merely a figure to display the emperor's harmony with his kin.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">At this moment, Li Cheng had to maintain his perfect composure as the Prince of Huaiyin.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">After Li Cheng came down from the stage, Huiyin sat down with him. Today, the emperor was celebrating in the three main halls, while royal family members like them were celebrating together with the emperor in Lijing Hall.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">\"You did great,\" Huiyin whispered to Li Cheng once she was seated, careful that no one around noticed.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Li Cheng felt a warmth in his heart. Everyone else was concerned about his status and whether he had received any rewards, but only Huiyin worried that he might be nervous and was concerned about him as a person.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">The couple smiled at each other, but Deyin, sitting opposite, caught sight of Li Cheng unexpectedly. In her previous life, Li Cheng had never entered the capital, and the two had never even met. Yet now, they appeared to be a loving couple, which was increasingly disheartening for her.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">If her grandmother had warned her about the relationship between Huiyin and Li Cheng earlier, she might have had time to prepare herself. After the crown prince sat down, he even whispered, \"My father told me that the Prince of Huaiyin is accompanying his sister back to her family for a visit. You two haven't seen each other for a few years; you might want to go and have a chat with her.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">No wonder—Li Cheng was accompanying his sister back for a family visit and also participating in the emperor's birthday celebration.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">In her previous life, she and Li Cheng had rarely been together. Even when he returned to Jianye, it was just a fleeting glimpse, and they had no interaction. He had been very caring towards Yin Lijun, the daughter of a recorder, but even though he treated Yin Lijun well, he had never gone out of his way to do something like this for a woman.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"Is that so? I'm often in the Eastern Palace and know nothing about family matters. Fortunately, the crown prince informs me,\" Deyin said with a forced smile, pretending to be virtuous and magnanimous.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Li Heng also wanted to win over Li Cheng. Between him and the Prince of Wei, of course, he had the advantage. Once the emperor passed away, he would rightfully become the crown prince, while the Prince of Wei, stationed in a remote region under the title of royal family, could only dream of being legitimate.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">But honestly, what he could offer Li Cheng right now was not as much as what the Prince of Wei could. However, if Li Cheng sided with him, together they could take over Jizhou, Qingzhou, and even Xuzhou.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">So, he needed Deyin's help to act as an intermediary.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Deyin understood Li Heng's intentions. She looked at Huiyin across from her and was somewhat stunned. In her previous life, the crown prince doted more on her younger sister, who had a successful pregnancy and gave birth to a son, later becoming the empress dowager. In this life, Huiyin was also deeply loved by Li Cheng. She really wanted to know how her sister had managed to win Li Cheng's heart.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">As an older sister, she shouldn't feel this jealous, but she didn't think she was inferior to Huiyin in any way.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Back in the day, she had a wide circle of friends, and her home was always bustling with wealthy and noble suitors, while her sister was more reserved and received far fewer proposals. It wasn't until later that Madame Ji, seeing that her sister was inferior in every way, started claiming that her daughter was the first beauty of Jizhou, spreading the word about her daughter's beauty.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">How could their fortunes change so drastically after marriage? Ultimately, her sister's advantage was having a brother to support her. If she had a brother, how could she have fallen to such a state without anyone to help her?</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">This was innate and not because she was inferior to her sister.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">But Huiyin didn't see it that way. She toasted with Li Cheng and enjoyed the performances. Especially after the emperor left, everyone in the hall became more relaxed. People kept coming to toast Li Cheng. Among them was He Guoguo. Huiyin saw them smiling and exchanging pleasantries, but beneath the smiles, there seemed to be something deeper. Huiyin didn't ask or look too closely, trying not to attract attention.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Her behavior was observed by Li Cheng, who admired her even more. He had never told her about certain military and state affairs, but Huiyin seemed to have an innate understanding of his thoughts.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">\"He Guoguo, I understand what you said,\" Li Cheng said with a smile.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"Then I will take my leave. I will invite you to my residence for a taste of Sanhua wine, a fine liquor, in the future,\" He Guoguo said, raising his cup.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Li Cheng courteously saw him off. The people around didn't pay much attention. Soon after, Li Heng reconnected with He Guoguo. \"The Prince of Huaiyin agreed to persuade Zheng Fang to defect, but he has one condition: Qingzhou must be divided, with Zheng Fang taking half.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">\"He's trying to get a free ride,\" Li Heng was unwilling to agree.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Qingzhou was something he had worked hard to obtain, and there was no way he would hand it over.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">He Guoguo smiled, \"Naturally, the crown prince keeps his promises, but do you remember the story of Zhang Yi, the Qin state's prime minister, who tricked the Chu state into betraying the Qi state? To entice Chu into breaking its alliance with Qi, Zhang Yi offered to return the Shangyu region, a vast area of 600 li, to Chu. After Chu severed ties with Qi, they sent an envoy to Qin to demand the land, but Zhang Yi denied the promise. Furious, the King of Chu sent troops to attack Qin but lost three battles, leading to the decline of Chu's status as a major power.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">For now, they could agree. After all, Qingzhou was controlled by both the He and Lü families. Once Lü Wei died, it would all belong to the He family. Whether to give any part to Li Cheng would be up to them.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">In He Guoguo's eyes, his biggest threat right now was Lü Wei. Once Lü Wei was eliminated, he could swiftly deal with Zheng Fang. By then, the world would practically be his.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Hearing this, Li Heng also smiled, \"Uncle is right. I will agree for now.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\"></p><p id=\"paragraph-88\" data-paragraph-id=\"88\"></p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Even Li Heng had a strategy that could kill three birds with one stone. By using Qingzhou as a bargaining chip, he could make the He, Lü, and Li families fight among themselves, leaving him to be the balancing point.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">It must be said that Li Heng was also a master at manipulating people's hearts. Just like now, De Yin had personally invited Huiyin to the Eastern Palace. De Yin spoke with a smile, \"Dear sister, you've been back for a while but haven't come to visit me in the palace. I've been so worried about you.\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Words like these, if coming from sisters who usually got along, would be sweet. But the relationship between De Yin and Huiyin had always been rather cold, so such words felt out of place.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">However, Huiyin didn’t show any surprise. Instead, she smiled and said, \"I was planning to come to the palace for the birthday celebration and didn’t want to trouble anyone. Besides, your Eastern Palace isn’t just any place. How could ordinary people casually enter?\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">As soon as she finished speaking, Lianzhi brought over a cup of Jin Junmei tea. Huiyin picked it up and sniffed it, \"Sister, your servant is quite clever to remember that I used to love Jin Junmei when I was at our parents' home.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Lianzhi bowed, \"It's not that this servant remembered. It was Consort Liangdi who remembered.\"</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">\"It was sister. I feel so awkward,\" Huiyin pretended to be at a loss for words.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">De Yin was somewhat pleased. She had been learning social etiquette from elder Madame Xu since childhood. She knew which ladies preferred which teas, how to arrange seating for them, and how to quickly form friendships. These were mere trivial skills to her.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">But she knew her sister wasn’t good at these things. Huiyin’s interactions with others were often cold and distant, making her unsuitable to be a mistress, and even basic interactions were difficult for her.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">So, De Yin simply said, \"You also love osmanthus cakes, steamed pork with rice flour, and chicken soup with peanuts. We are sisters. How could I not know these things? Since I moved into the inner palace, it’s been hard to see our family, and I’ve started missing the old days. Because of our families' influence, we sisters never really got to know each other. Thinking about it, I feel it was my fault as the elder sister.\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">\"Sister, don’t say that. I’m already grateful that you, as Consort Liangdi of the Eastern Palace, still think of me,\" Huiyin couldn’t be moved by these few words.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">De Yin was good at showing vulnerability. Seeing that Huiyin didn’t seem very emotional, she intensified her act with glistening tears, \"I’m older than you and already married, yet you have a son, and I have nothing. Sometimes, I really envy you.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">\"Having a child is a matter of luck. Sister, you’re still young. What is there to worry about?\" Huiyin prepared to leave. It was simple. De Yin suddenly calling her to the Eastern Palace during the birthday banquet probably also involved the Crown Prince’s plans.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">After all, Li Heng’s so-called schemes were mostly used on women.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Sure enough, De Yin shifted her tone, \"Alas, now I dare not have a child. In the Eastern Palace, there was a woman who became pregnant with the Crown Prince's child. Because she conceived before the Crown Princess, she was beaten to death by Prime Minister Lü.\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Huiyin was shocked, \"To such an extent—\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">\"Yes, so even if I were pregnant, I wouldn’t dare to keep it with Prime Minister Lü still around,\" De Yin’s voice was desolate.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">But soon, she took a deep breath and continued, \"The Crown Prince is also controlled enough. If Lü Wei continues to dominate the court, I’m afraid that my father, even my brother Wuheng, and I will be harmed in the future. You see, Dong Yuniang's elder brother was implicated.\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">\"Father and Wuheng—\" Huiyin showed a worried expression. She already understood why De Yin had called her. It was still about persuading Zheng Fang to eliminate Lü Wei. Probably, when He Guoguo approached Li Cheng, he was talking about the same thing.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">He Guoguo didn’t ask Wei Duo for help because Wei Duo is too powerful, and once you bring him in, it’s hard to get rid of him. As for Zheng Fang, he was being used first. After all, Zheng Fang was brave but lacked strategy. He could kill Lü Wei because he was Lü Wei’s loyal follower, obeying Lü Wei’s commands and ruthlessly eliminating Lü Wei’s political enemies. Although Lü Wei was wary of Zheng Fang’s growing power, their relationship was complicated.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Zheng Fang was the only one who could command Lü Wei’s army.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">In her previous life, she had her father help kill Lü Wei without hesitation, binding the Zheng family to the Crown Prince’s cause. Her elder brother lost his life, and her younger brother almost did too. But in this life, she couldn’t allow her father to be bound to anyone like that.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Li Cheng was not yet fully established. If her father killed Lü Wei, the He family, who had been eyeing Qingzhou for a long time, would eliminate him immediately. Jizhou was also a prime target.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">How could she turn the tables? Regardless of whether Li Cheng agreed or not, everyone was looking out for themselves.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">So, Huiyin looked at De Yin with raised eyebrows, \"Sister, don’t put too much faith in the Crown Prince’s words. The Crown Prince is hedging his bets. Years ago, when the Crown Prince saved you from the water, he also saved me the next day. Even between us sisters, whoever marries him first will tie her family to the Crown Prince's cause. I originally didn’t want to say this, but now that you keep mentioning these matters, I have to bring it up.\"</p><p id=\"paragraph-115\" data-paragraph-id=\"115\"></p>\n</div>"
  },
  {
    "number": 46,
    "title": "Chapter 46",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 46</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Two Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Really?\" Elder Madame Xu had no idea there was this aspect to the situation.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">She believed Li Heng was deeply in love with her and had married into the family to follow in her younger sister's footsteps from her past life. She was afraid her sister might steal the marriage proposal, but she hadn't expected the Crown Prince to...</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Huiyin didn’t want to speak ill of Li Heng in the Eastern Palace, but Li Heng kept using Elder Madame Xu to stir up trouble, which was annoying. Frankly, men’s affairs should be handled by the men themselves. Li Heng should show his sincerity on his own.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Therefore, what Huiyin needed to do was make Elder Madame Xu say that the He family wasn’t helping, causing the relationship between Li Heng and the He family to fall apart. As the saying goes, when the world is in chaos, the situation is ripe.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Why would I lie to you, sister? I’m leaving for Jianye soon, and we might never see each other again. I hope you, elder sister, will rise to great heights, and I, your younger sister, can bask in your glory. But think about it—if Father fights with the Crown Prince and Lü Wei, and both sides suffer, who would the He family ultimately benefit by marrying into our family?\" Huiyin found that using broad examples didn’t work with Elder Madame Xu, so she used simpler terms.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Sure enough, Elder Madame Xu’s expression turned sharp. \"But the He family has no daughters?\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Huiyin smiled. \"The He family can have a pregnant maid, not to mention they have nieces, as long as they carry the He surname. What can you do about it in the future, elder sister?\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Elder Madame Xu shuddered.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Although she didn’t want to admit it, it was indeed true. The Crown Prince always wanted the Zheng family, and even had Li Cheng cooperate, to deal with Lü Wei. But was Lü Wei so easy to handle? If her father and brother were to perish, wouldn’t the He family ultimately benefit?</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Seeing the change in Elder Madame Xu’s expression, Huiyin continued, \"Elder sister, if Father can preserve his strength, your position will always be secure. Why can’t we be the ones watching from the sidelines? If the Lü and He families suffer mutual losses, elder sister, you will stand out.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Elder Madame Xu thought it was a good idea. She privately admitted that Huiyin, who had thrived in both lives, indeed had some talent. But she didn’t want Huiyin to feel too smug, so she said, \"Younger sister, be careful with your words. These are not things that we women should discuss. I see that the banquet is almost over; let me send you off.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"Alright, I will take my leave now.\" Huiyin didn’t linger.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">The Eastern Palace wasn’t far from Lijing Hall, which is why Huiyin had agreed to come. Even though it was a celebration, no one dared to make loud noises. She stood at the palace entrance for a moment, then quietly went inside.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">The imperial palace was like a fragile bubble of beauty tonight, but once it popped, the harsh reality of starving people and bandits became all too visible. Some of the women looked to be of marriageable age, some were just little girls, and some were even young women like her. Even with blackened faces, it was useless. Huiyin thought that if she didn’t have status and was beautiful, it would be hard to survive.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">\"Why didn’t your grandmother return with us?\" Li Cheng asked as he entered the carriage.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Huiyin smiled. \"She probably has a lot to talk about with my elder sister. She has always treated my elder sister like her own daughter.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Indeed, Elder Madame Xu was talking about Huiyin with De Yin in the Eastern Palace. \"It’s truly petty behavior. I wanted to see her son, but instead, I was lectured and had to put on a show of authority. I don’t know how she enchanted the Prince of Huaiyin, who speaks well of her at every opportunity.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">De Yin cast her eyes downward. \"I heard from the Crown Prince that the Prince of Huaiyin accompanied her back to visit her family and treated her very well. Your Highness, I don’t know where I fall short compared to her, to have ended up in this situation. Please rest assured, I am much better now.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Perhaps because Huiyin had come over, De Yin no longer indulged in self-pity and instead felt a renewed sense of determination, her previous fears alleviated.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Elder Madame Xu sighed. \"It’s also because I am incompetent and unable to persuade your father.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Grandmother, I think Lü Wei holds significant power, and my father has always had a good relationship with Prime Minister Lü. On the contrary, it is He Guoguo who is competing for power with Prime Minister Lü. Let them fight it out; I don’t need to involve myself. Anyway, I haven’t been able to conceive these past few years, so why worry unnecessarily?\" De Yin had fully listened to Huiyin’s words.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Elder Madame Xu didn’t know that Huiyin had come by the previous day and thought that De Yin had figured things out. She found her reasoning sound. \"Liangdi, you understand things well despite being in the deep palace.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"Grandmother, in the future, please worry less about me and take care of your health.\" When the situation changed, she would ensure that her grandmother and mother enjoyed their lives.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Elder Madame Xu felt even more content.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">However, the Crown Prince noticed that De Yin wasn’t enthusiastic about what he had said that day and didn’t try to win over the Prince of Huaiyin and his wife, so he subtly probed.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">But hearing this, De Yin interpreted it differently. In her previous life, the Crown Prince and Huiyin were deeply in love, even more so than with her. What if Huiyin returned, and their old feelings reignited?</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Therefore, to verify the truth of Huiyin’s words, De Yin said, \"Yesterday, I invited my younger sister, and she asked me to thank you, Your Highness, for saving her.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Li Heng was certainly aware of this matter. At that time, Zheng Fang was under the command of Lü Wei and had even eliminated Empress He's forces. Naturally, Empress He was unhappy with the Zheng family girls and had intended to make things difficult for them. It so happened that I was able to rescue the two Zheng family girls, which earned the favor of the Zheng family towards me. As it turned out, it was a successful move.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">But he glanced at De Yin and said with a smile, \"You mentioning this almost made me forget. I happened to be passing by and rescued her.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">If Huiyin were here, she probably wouldn't believe him, but De Yin trusted him completely. She even speculated that it was because Huiyin was her sister that the Crown Prince rescued her, which also served to illustrate the Crown Prince's inherently kind nature.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"So it was like that. Sigh, it's not that I don't want to keep my sister here, but they are in a hurry to return. They said they would head back after attending my brother's wedding.\" De Yin said with a smile as she came up with a reason.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Li Heng closed his folding fan and said, \"Since that's the case, why don't we also return to your parents' home and attend your brother's wedding together? The last time we visited, we had to ask for something, which made your father look down on us. This time, we should return in triumph.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">De Yin felt something was off. She wasn't sure if Li Heng's intention was to win over Li Cheng, or Huiyin, or if he genuinely wanted to accompany her back.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">However, she couldn't question the Crown Prince, so she agreed.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">When Huiyin returned home, it coincided with the Cui family sending over the dowry. Cui Yuehuan, being from the prestigious Cui family of Qinghe, had an exceptionally rich dowry. The steward and servants of the Cui family had come a day earlier to prepare the bridal bed, and at that moment, they were reporting back to Madame Ji.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"This is the list of dowry items prepared by our master and mistress for your perusal, Lady Hou.\" Although the Cui family was no longer as formidable as when Cui Xun held the position of senior general, their status as a noble family still overshadowed Jizhou. The dowry reflected the depth of the Cui family's heritage.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Madame Ji flipped through the dowry list, noting items such as the grape-embedded gem-studded mirror of Princess Shouchang, Gu Kaizhi's bird-and-flower painting, and Lady Wei's calligraphy. Each item has a prestigious history, showcasing the Cui family's deep roots, unlike those of newly wealthy families. She nodded slightly and instructed the servants to continue with their tasks.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">After they left, Huiyin emerged from behind the screen.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Madame Ji smiled and said, \"You are a princess. Why are you hiding behind the screen as if you're avoiding them?\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Mother, I'm just trying to avoid the hassle. With my status, even offering greetings would take a long time. I'd rather avoid it.\" Huiyin waved her hand.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">The mother and daughter shared a smile. Madame Ji was busy with her son's wedding but couldn't help feeling concerned about her daughter's impending departure. \"Are you leaving so soon?\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">If they weren't married, staying at home would naturally be the most comfortable. However, Li Cheng had responsibilities on his shoulders. It was already wonderful that he could accompany her back this time. Staying longer in the capital wasn't necessarily a good thing, especially with the looming threat against Lü Wei.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">In these uncertain times, it was best to keep their power close.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"It's time to go. I'll miss my parents, but being able to see you all is more important than anything.\" Huiyin held Madame Ji's hand, feeling a deep sense of regret.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Although she was attached to her family, she knew how to prioritize matters. It was better for everyone to be well than to be together all the time.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">The next day, Zheng Wuheng had already changed his wedding clothes twice. When Huiyin entered and saw his silly appearance, she laughed and said, \"What are you so happy about?\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"Sister, I'm not happy. Having a tigress of a wife to manage me isn't a good thing. It's just that before I was married, everyone treated me like a child.\" Zheng Wuheng was a bit frustrated.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Huiyin said, \"Your brother-in-law had taken over Xuzhou even before he was married...\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"Now you're comparing me to your husband, and he's older and slightly more capable than me.\" Zheng Wuheng still felt a bit resentful.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Huiyin relented, \"It's my fault. You're still young and haven't been to the battlefield yet. In the future, you need to do well. I don't expect you to have overwhelming power, just to be safe.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Recalling her previous life when her younger brother had taken the poisoned arrow meant for Li Heng, Huiyin's eyes turned red. No matter who I married, my younger brother always treated my husband like a true brother-in-law. As she was lost in thought, Li Cheng entered and misinterpreted her feelings. He thought it was because they had to return to Xuzhou after Zheng Wuheng's wedding the next day, and he sighed inwardly.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">When Li Cheng's parents were alive, he was doted on. But after their passing, he had to rely on himself. It had been a long time since he had experienced such familial warmth. In his in-laws' home, they treated him like their own child, showing him immense care. When they went out together, his father-in-law even gave him a saddle, worried that he might not eat well. His two brothers-in-law did their best to entertain him, feeling it was still not enough.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">They treated him like family, readily agreeing to his plans.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">The next morning, Zheng Wuheng dressed in new attire, bid farewell to his parents, sister, and brother-in-law, and set off with his guards to fetch the bride from the Cui family.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Huiyin offered to help, but Madame Ji insisted otherwise. \"You are our honored guest. Please rest at home.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"Alright, I won't be busy then.\" As a princess, if she helped with chores during her visit, it would be seen as losing decorum.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">After the long journey and disrupted routine, her menstrual cycle became irregular. It had started five or six days ago, paused for two days, and then resumed with light bleeding.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">\"I’m not feeling well, and my mood is understandably low. When I returned to my room, I happened to find Li Cheng there. He specifically asked, 'Is your period over?'</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">'Is it happening again?'</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">'This won't do. We'll need to find a doctor to take a look in the future,' Li Cheng is very worried.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Princess Huizhen smiled and said, 'It's nothing. I used to always feel pain when my period came before I got married, but it's much better now than before.' After saying that, she continued, 'I'm currently having things packed and loaded. We'll leave after we meet the bride tomorrow.'</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Li Cheng was helpless. It’s not that he doesn’t care for his wife, but he’s also preoccupied with matters in Xuzhou. As a general, if he's not there, he's afraid the people under him might have other intentions.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Princess Huizhen changed her menstrual pad and went out with Li Cheng. They happened to run into Rong Mama, who was a dowry steward from the Cui family. She hurriedly came forward to greet Li Cheng when she saw him. Li Cheng seemed to recognize her and said, 'Why did you come along?'</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Rong Mama smiled and said, 'I've long heard about your return to your natal home. Now, I finally get to greet the young master and mistress.'</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Li Cheng introduced Rong Mama to Princess Huizhen and said, 'She was my mother's personal maid. Before my mother got married, she stayed at the Cui family. I met her once when I was little.'</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">'Now that everyone is together, it’s truly fate,' Princess Huizhen smiled.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Rong Mama nodded repeatedly, her gaze filled with affection for Li Cheng.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Li Cheng was about to say something more when he heard that the Crown Prince and De Yin had returned. Zheng Fang asked everyone to go and receive them, so they had to go. Strangely, it was not previously heard that they would attend the wedding. Now, the Crown Prince has brought her back. It’s unclear what it’s about.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">The Zheng family knelt on the ground. Elder Madame Xu knelt willingly, looking at the noble Crown Prince and her delicate granddaughter. Elder Madame Xu glanced at Li Cheng and Princess Huizhen, thinking that even if they were to act defiant, they still had to bow before the Crown Prince.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">After the Crown Prince entered, Zheng Fang and Li Cheng, among others, attended to him. As for De Yin, Elder Madame Xu and Madame Ji invited her to the upper seat. Princess Huizhen sat below her. Although the position of princess is no less than that of Liangdi, the status of the Crown Prince is higher than that of a prince. Fortunately, De Yin wanted to visit Madame Xu, so Princess Huizhen didn’t have to stay and entertain.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">De Yin definitely wanted to see Madame Xu. It’s easy for her to meet Elder Madame Xu since the Crown Prince and Empress He were eager for her to influence her natal family. Elder Madame Xu submitted her request, and it was promptly approved. However, Madame Xu was in a nunnery, and she couldn’t meet her. Today, with so many people and the presence of her sister, the Princess of Huaiyin, everyone's attention wasn’t on her. So, she wanted to see her mother.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">As for Princess Huizhen, she simply went to take a look at Zheng Wuheng's new room. Unexpectedly, Rong Mama was there. When she saw Princess Huizhen enter, she hurried over.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">'Please continue with what you're doing. I just came here to take a look,' she said, looking at her younger brother's new room, feeling a little dazed that her brother was also getting married and starting a family.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Rong Mama was very interested in Li Cheng and specifically came over to ask, 'Greetings to Princess. I'm truly happy to see how well the prince has turned out.'</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">'Yes. The prince is both wise and brave, and he's a valiant warrior. He handles both big and small matters to the satisfaction of everyone around him,' Princess Huizhen praised Li Cheng with ease.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Rong Mama kept saying, 'That's good, that's good.'</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">For some reason, Princess Huizhen recalled how the late Princess of Huaiyin had appointed Yin Lifang as princess. She had also heard that the Yin sisters had entered the prince’s mansion as companions when they were young, which struck her as unusual. However, not many people in Huaiyin Mansion knew about this, and even Granny Chao, whom she had placed people to ask, seemed unaware.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Just then, Princess Huizhen looked at her and said, 'Mama, I actually have something I want to ask you.'</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">'Princess, please go ahead. I'll tell you everything I know,' Rong Mama said seriously.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Princess Huizhen smiled slightly and said, 'Don't be nervous. I'm asking about some small matters.'</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">'Do you know if the Yin family and the Cui family are related by marriage?'</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Rong Mama immediately shook her head and said, 'Our family doesn't know anyone with the surname Yin.'</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">'Oh, then maybe I was mistaken,' Princess Huizhen said.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Rong Mama looked completely puzzled.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">The new bride, Cui Yuehuan, had completed the wedding ceremony earlier that evening and now entered the bridal chamber. As the senior housekeeper from the Cui family, Rong Mama had already found out everything here. After the groom lifted the veil, Rong Mama explained everything to her.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">'We live in the east courtyard of the mansion. The side rooms are on both sides, and the back rooms are at the rear. The family matriarch lives in seclusion and mostly stays home to practice Buddhism. Lady Hou, Madame Ji, has a straightforward and easygoing personality.'</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Cui Yuehuan smiled and said, 'During the wedding ceremony earlier, we had the honor of meeting the Crown Prince, Liangdi, and the Prince and Princess of Huaiyin. Liangdi kept smiling and seemed very approachable, while the Princess of Huaiyin exuded confidence and sharpness in her gaze.'\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Rong Mama said, \"Things cannot be judged by their surface. Consort Zheng is highly favored, which is naturally related to her temperament. However, the Princess of Huaiyin is also not to be underestimated, as she managed to have the Prince of Huaiyin accompany her on a long journey back to her family for a visit.\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">\"Mama, my aunt wrote back saying that my cousin would marry a woman from the Yin family, but why did he end up marrying someone from the Zheng family?\" Cui Yuehuan, still young, had many doubts.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Li Cheng, her first cousin, was a young and handsome prince who protected his wife. Even she felt a twinge of envy at their love. Especially since she was about to get married herself, she felt a great deal of fear. Her mother had used the example of the Prince and Princess of Huaiyin, saying that there were also couples in the world who were very much in love.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Upon hearing this, Rong Mama's expression changed slightly. \"Please don't mention this again. If someone overhears, it could cause trouble.\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Cui Yuehuan, of course, understood the gravity of the situation. \"I understand. By the way, Mama, when my elder sister was escorted to her marriage today, she acted as if my mother had mistreated her. She behaved in a very petty manner.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Cui Yuehuan thought that it was common for noble families to take concubines before marrying a woman of equal status. Her elder sister's mother had refused to accept her fate and had wanted to compete with the first wife, which led to her current situation.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">……</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">As the night grew darker and the dew heavier, Huiyin yawned and asked Li Cheng, \"What was the Crown Prince doing here today?\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Li Cheng smiled slightly. \"The Crown Prince was trying to get something for free.\"</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">\"Oh, and what are you going to do about it?\" Huiyin looked at him.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Li Cheng yawned. \"I've discussed it with your father, but we still need to report it to the Prince of Wei, so tomorrow we'll have to travel day and night to get back. I’ll entrust Jing'er to you.\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Huiyin smiled. \"Of course. By the way, do you want to guess what my brother and his new wife are doing right now?\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">She was thinking about whether they were having dinner or drinking a celebratory cup of wine, but Li Cheng replied with a hint of mischief, \"They're doing what couples do. Unfortunately, because of your current condition, I'll have to wait.\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Huiyin blushed. \"You...\"</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Bringing up the topic of marriage, she looked at Li Cheng and said, \"Let me ask you, why did you and your mother both favor Yin Lifang back then? Your mother's brother waited until he was over thirty to marry a woman of appropriate status because he valued propriety so much. You also place great importance on propriety, so I really don't understand.\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Even now, she felt that Li Cheng's decisive rescue to cut ties with Yin Lifang had been a huge sacrifice. While there was a part of him that was resolute, she still wanted to know the underlying reasons.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">If Li Cheng didn't tell her the truth, she would never be able to fully open her heart to him, even though she already liked him very much. There were still some reservations.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">If Li Cheng had truly loved Yin Lifang before, she was confident that she could make him fall in love with her. Now that Li Cheng already liked her a lot, it was still important for him to clarify other matters.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Li Cheng hadn't expected that Huiyin was still troubled by this matter. He had thought that she had believed him the last time.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">\"I'll tell you on the way tomorrow,\" Li Cheng said, patting her shoulder. It wasn't the right time to talk about it now.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Huiyin could only nod.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">The next day, the newlywed couple came to greet them. Huiyin saw that Zheng Wuheng was tall and heroic, while Cui Yuehuan was charming and lovely. They were a very matching pair, and it was likely that they had been very harmonious last night.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">\"I wish you a long and happy marriage, and may you have children soon,\" Huiyin said with a smile.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Upon hearing the words \"may you have children soon,\" Cui Yuehuan blushed slightly. She had been a young lady and already felt uncomfortable, but hearing these words made her feel like she had become an adult.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">Though she was shy, Zheng Wuheng was not. He smiled and said, \"Thank you for your kind words, sister. Your words are sure to come true.\"</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Everyone smiled knowingly.</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">Seeing how well the couple got along, Huiyin felt relieved and prepared to return home. Madame Ji had wanted to send them off with Pei Shuo and had even prepared a farewell feast, but Huiyin declined.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">\"My sister-in-law has just entered the family, and the household is busy. Don't worry about us. We're also in a hurry to return.\" Huiyin didn't want to disturb the family any longer, especially since she was eager to know what Li Cheng had mentioned the day before.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">With her heart set on returning, Huiyin boarded the carriage. Li Cheng rode ahead on his horse, and at the first rest stop, Huiyin looked at him and, without even saying a word of concern, simply said, \"Tell me.\"</p><p id=\"paragraph-119\" data-paragraph-id=\"119\"></p><p id=\"paragraph-120\" data-paragraph-id=\"120\">\"I've never met a woman as stubborn as you. If I don't tell you, it'll always be a thorn in your side, so I might as well tell you now.\" Li Cheng thought that since they're already this far, it would be fine to speak.</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">Huiyin prepared tea and snacks, propping her chin on her hand as she looked at him. \"Spill it,\" she said.</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">Li Cheng didn't plan on revealing this secret. After all, it wasn't right to talk badly about someone important. But now he realized that if he didn't tell her, she'd probably always keep him at arm's length.</p><p id=\"paragraph-123\" data-paragraph-id=\"123\">Author's note:</p><p id=\"paragraph-124\" data-paragraph-id=\"124\">I'll try to post a huge update tomorrow.</p><p id=\"paragraph-125\" data-paragraph-id=\"125\"></p>\n</div>"
  },
  {
    "number": 47,
    "title": "Chapter 47",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 47</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Two and a Half Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"My uncle is from the eldest branch of the Cui family of Qinghe. After my parents passed away, their branch of the family declined, so from a young age, my uncle had the ambition to carry on the family legacy. After finishing his studies, he became an advisor to the former Grand Marshal, Heng Shuo. At that time, my mother was too young to be by his side, so he took in a concubine surnamed Du to help manage the household. This woman practically raised my mother, and my uncle also favored her quite a lot.\" Li Cheng paused here.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huiyin waited for him to continue, but instead, he took a sip of tea, prompting her to urge, \"You’ve barely started talking, and you’re already drinking tea. I have a stuffy nose and sore throat, and I’m not constantly drinking tea.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Li Cheng rubbed his thumb across his hand, \"For ten years, she bore a son and a daughter. During that time, my uncle didn’t marry, not because he couldn’t find a wife, but marrying a daughter from a top-tier aristocratic family was very difficult. Just as another son was born to Du, my mother was very happy for her, regardless of whether someone else would enter the household later. With this child, she had some security. By then, my mother was already betrothed and about to marry, but my uncle told her that he intended to marry a daughter from the Li family of Longxi, so that a well-born daughter-in-law could see her off to her marriage.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"But what about that Du woman?\" Huiyin wondered. If she were in Du’s position, her situation would have been very difficult. Du had both sons and daughters but was only a concubine. If the new wife came from a virtuous family that didn’t mind or was of lower status than the Cui family, it would be fine. But the wife was from the prestigious Li family of Longxi.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Li Cheng took a deep breath, \"The condition for the Li family to marry their daughter was that my uncle had to settle all pre-marital matters. Otherwise, their daughter had other better options. I even heard that a man from the Yang family of Hongnong also went to propose. Fearing that his past would be uncovered, my uncle sent pregnant Du and her children to a country estate.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"But at that time, conditions at the estate were poor. It was the middle of winter, and Du’s children, who were used to being pampered, couldn’t adapt to life at the estate. However, the main wife of the Cui family was about to enter, and who would care about Du’s desire to return? My uncle even tightened security on Du to prevent her past from being revealed. Unfortunately, Du’s children developed high fevers, and they wanted to invite a doctor for treatment. The estate manager suspected Du was trying to cause trouble and only agreed to call a doctor. But as you know, it’s hard to find a good doctor in the countryside. Both my cousin and sister died of illness.\" Li Cheng felt the impermanence of life.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Huiyin opened her eyes wide, \"They died?\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng looked gently at Jing'er, \"We always bring several doctors with us, carrying various precious and rare medical supplies. Even if our son has a slight headache, we feel heartache. But at the estate, conditions were crude, and the doctor they called was a rural physician. A rural physician can harm people. My uncle didn’t care, leading to the tragedy.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">At the end, Li Cheng sat down, \"At that time, my mother received a letter from Du. In the letter, she said my uncle intended to put her to death, and her child was about to be born. She begged my mother to send a midwife. This was probably the most difficult situation for my mother. How could an unmarried princess send a midwife when the palace even sent a steward? Unfortunately, Du didn’t see anyone sent by my mother and had to manage on her own.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"Later, my current aunt from the Li family of Longxi entered the household and became pregnant within three months. The managers, seeing that the situation was irreversible, became less strict with Du. Du then met the Yin family, who were of humble origins and lived a simple life. Du gave Yin’s wife a fur coat, and their relationship grew closer. Du, fearing that her child would become a thorn in the eye, swapped her child with Yin’s since both were due at the same time.\" Li Cheng sighed in relief after finishing.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin understood the rest without him needing to say more, \"So, Madam Zhang is actually the original Yin Lifang, and she is Yin Liyi’s older sister? No wonder I felt a sense of déjà vu when I saw her.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"Yes, Du was brought back to the Cui family with her daughter when the daughter was eight years old. Du never thought she would return to the Cui family, and Aunt Li was not the type to be intolerant. Instead, she treated Du and her daughter generously. However, while Yin’s daughter became the eldest daughter of a high-ranking general, Du’s daughter remained the daughter of a low-ranking official. Du felt overwhelming guilt. But if this matter were revealed, my uncle would surely be furious, and as you know, such scandals in large families often invite criticism. Since Aunt Li had already borne two sons and a daughter, and my uncle cherished them dearly, he had no feelings left for Du. Du could only write to my mother, asking her to look after the Yin family.\" Li Cheng laid out all the facts.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Huiyin didn’t expect the truth to be so complicated, \"So, Yin Cifei is actually your cousin?\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"Yes, my mother was raised by Du, who had both nurturing and lifesaving merits towards my mother. That’s why my mother recommended Yin’s elder brother to the Wu Prince’s mansion as a companion. Later, to continue having companions, she invited the Yin sisters to join. My mother always felt guilty towards Yin Cifei, so she wanted Yin Lifang to marry me, creating many opportunities for us. But out of respect for the King, she never said anything until the King passed away. Then, she told me the truth, that Yin Lifang was actually my cousin. Du had begged her for help many times, and she couldn’t lend a hand, feeling deep guilt. Before she died, she asked me to marry Yin Lifang.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">This was the full story. Du had both nurturing and lifesaving merits towards the Princess of Wu, but her biological daughter’s identity could never be acknowledged. The Princess of Wu could only repay her in her son’s marriage.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Thus, Li Cheng fought desperately to save Yin Lifang’s son, as another form of repayment.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Huiyin no longer dwelled on whether he had feelings for her, given how shocking the truth was.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"Why did your uncle insist on marrying a daughter from a high-ranking aristocratic family? Or he could have chosen not to take concubines...\" Huiyin felt that the entire situation was caused by her uncle from the Cui family.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Li Cheng said, \"That’s why I said these are matters of the elders. From Du’s perspective, it was a human tragedy, but from my uncle’s perspective, his alliance with the Li family of Longxi brought honor to the family. It was also because of my uncle’s official position that my mother was able to marry my father and even raise me by her side without fear of her mother-in-law.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">This was also why Li Cheng found it difficult to judge.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">But Huiyin looked at Li Cheng and said, \"If we are to blame anyone, it should be your uncle, not you. I think you don’t need to take responsibility for this. As for Du, while she was a victim, she was also a perpetrator. She swapped someone else’s child, thinking it was for her daughter’s good, not considering the other child’s feelings. Little did anyone know that the other child would grow up to become the eldest daughter of the prestigious Cui family of Qinghe and marry into the Zhang family of Qinghe, a family of equal standing. Life is unpredictable, and we can only look forward.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Even Huiyin herself could only look forward. Then she realized, \"You deliberately waited so long to tell me because you were afraid I’d be upset and break up your cousin’s marriage, right?\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Li Cheng just chuckled twice.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">After learning this secret, Huiyin felt a weight lift from her heart.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">However, with relief came a new challenge. As she relaxed, she caught a cold and had to drink bitter medicinal herbs every day, which made her face turn yellow. Fortunately, Jing'er was already one year old during the return journey, and his health was stronger than Huiyin's.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"I will still accompany you to Jianye. You and our son should rest well. I will head to Xuzhou for training as soon as possible,\" Li Cheng said.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Huiyin nodded, \"Alright, I understand. By the way, last time my sister invited me to the Eastern Palace. I guess the Crown Prince intends to recruit you, but I must warn you. The Crown Prince is skilled at gaining advantages without offering anything in return. You shouldn’t trust him easily, and don’t think you’ll gain much by cooperating with him.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Li Cheng was puzzled, \"Why didn’t you mention this to me sooner?\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Huiyin smiled awkwardly; she wouldn’t be so foolish as to reveal everything unless she was certain her husband truly cared for her.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Li Cheng gently pinched her cheek, \"Oh, so you've been keeping things from me?\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Huiyin wrinkled her nose and made a playful face, which made Li Cheng chuckle.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">When the couple returned, they could openly announce their arrival. After a long and dusty journey, they finally arrived in Jianye. Huiyin and Jing'er headed back to the Huaiyin Mansion, while Li Cheng went to report to the Prince of Wei.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">They had been away for months, leaving in spring and returning in autumn. Huiyin first had Jing'er’s room moved from the left side chamber to the right wing. She herself was extremely tired but had to hold on.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Nanny Nan was elderly, so Huiyin allowed her to retire for the day. As for Fugui and the others, they were bustling about like busy bees. Fugui saw Sister Wang come to pay her respects and invited her in.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">No one entered the secondary room; Fugui only heard Sister Wang speaking with the Princess for a long time inside. She shrank back, realizing that the Princess’s vigilance was indeed strong. Even though most of the people in the mansion were hers to use, she still didn’t fully trust them and had to summon her informants for questioning.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">On the other side, the Prince of Wei was similarly cautious. Although he allowed Li Cheng to go to the capital, he was still worried that Li Cheng’s loyalties might change.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"Please rise. You've been away for a long time; Xuzhou needs you,\" the Prince of Wei said with a smile.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Li Cheng clasped his fists, \"Your praise is undeserved, nephew has limited abilities. I do not dare to make decisions on major court affairs. This is a letter He Guoguo asked me to deliver to you. The Eastern Palace wishes for me to persuade my father-in-law to execute Lü Wei, but my father-in-law cannot do business without profit. Therefore, he asked the Crown Prince for Qingzhou.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">The Prince of Wei frowned. \"Why would the Eastern Palace send you to persuade him?\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">State and military matters were serious business. Even though Li Cheng was his son-in-law, he was still considered an outsider. Why would the Eastern Palace approach him? Li Cheng smiled, \"My father-in-law dotes on his youngest daughter, my Princess, very much. He is old, and his son is still very young, so he relies quite a bit on his nephew.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Li Cheng wasn’t exaggerating, but he wasn’t about to work for someone else’s benefit. After all the hard work of persuading his father-in-law to kill Lü Wei, if the Crown Prince didn’t acknowledge it later and the Prince of Wei blamed him for giving up Qingzhou, he would be stuck between a rock and a hard place.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Seeing Li Cheng’s response, the Prince of Wei furrowed his brow. \"Oh, and how do you intend to handle this?\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"Nephew does not dare to make decisions; I will follow your instructions, Uncle,\" Li Cheng said, not revealing his own intentions.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">The Prince of Wei wouldn’t decide immediately either. He still needed to discuss it with his advisors. Li Cheng also delivered the Emperor’s rewards, and the two shared a drink and some conversation before Li Cheng left the Prince of Wei’s presence.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Walking down the corridor of the Prince of Wei’s Mansion, a gust of autumn wind sobered Li Cheng up considerably. Today, the Prince of Wei seemed to trust him a lot, which was one of the reasons he decided to align himself with the Prince of Wei. The Prince had both strategy and the grace to accommodate others, but in the future, things might not be the same.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">If he had the authority to decide, he could come up with a solid plan without putting himself at a disadvantage.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">But he couldn’t make the call…</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Lost in thought, he was jolted by a collision. He looked closely and realized it was Li Jing, the eldest son of the Prince of Wei.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">\"Young Master Jing, what are you doing here? It's getting late; you should head back,\" Li Cheng said, puzzled.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Li Jing was slightly plump and preferred reading over martial arts. However, whether he was good at studies or not, the Prince of Wei didn’t care much. He favored the son of Second Consort Xu, Li Zhi, more. Li Cheng was well aware of this. But since Li Jing was the eldest son, standing out too much wasn’t good, and not standing out was also problematic. In the end, nothing seemed to satisfy the Prince of Wei.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">But that wasn’t Li Cheng’s concern anymore. In the past, he would have been concerned since the identity of the next heir affected them as subordinates. But now that he had decided to stand on his own and had his own son, he didn’t need to meddle in other people’s affairs.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Seeing Li Jing hesitating, Li Cheng simply said, \"Go back quickly. I have things to attend to as well.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">With that, Li Cheng left. The servants accompanying Li Jing quickly took him back. By then, Yin Lifang had already sent people to look for her son. Ever since Li Jing fell into the well, Second Consort Yin had been very strict with her son. Seeing him return, she finally breathed a sigh of relief.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"Come here quickly. Today, I had the kitchen prepare your favorite mushroom meatballs and fried chicken.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Li Jing sat down, still a child who couldn’t express his emotions well. He said glumly, \"Mother, I wanted Father to see the characters I wrote, but he hasn’t come out.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Second Consort Yin could only comfort her son, \"Your father is very busy; how could he have time for these things? But don’t worry, when there’s an opportunity, I’ll show your writing to your father. Wasn’t the inkstone you used last time bestowed by your father?\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Now that she was out of favor, her son also lost favor.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Second Consort Xu couldn’t compare to her; even though she had been previously married, she knew how to win the Prince of Wei’s heart.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">A child might have believed it in the past, but now...</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Li Jing shook his head. \"But even though my second brother doesn't do as well in his studies, Father still praises him for being gifted. Even the tutor speaks more highly of him.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Yin Cifei thought that she didn't dare to speak ill of Prince Wei. If her son felt any resentment toward his father, he wouldn't be able to hide it, and the conflict would only grow deeper. So, she rubbed her son's head. \"I've told you, just do your own things well, and in the future, your father will see your worth.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Just like whenever she was with her younger sister, people would initially get along better with Yin Liyi because she was so sincere that she made others lower their guard. But over time, people would realize her true nature. Just like how the Princess of Wu seemed to treat Yin Liyi well, she never expected to end up marrying Li Cheng.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">He was the heir of the Prince of Wu. In reality, becoming a secondary consort was nearly impossible given her status. Not to mention, she wasn't particularly beautiful, yet the Prince of Huaiyin fell deeply in love with her.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Even now, she found it hard to believe.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">No, she couldn't show her feelings now; otherwise, it would harm both herself and her son. At the right moment, she must ensure that they would support her son as the heir.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Night fell at Huaiyin Mansion.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">The meatballs, fish balls, vermicelli, and egg dumplings in the pot were boiling away. Huiyin and Li Cheng sat opposite each other, eating. She knew it would be hard to lose weight since she always indulged in food.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"I'll be heading to Xuzhou tomorrow, so you and Jing'er take care in Jianye.\" Li Cheng was reluctant to leave his wife, but there was no choice; this wasn't something to be sentimental about.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Huiyin picked up a fish ball. \"Sigh, we've been together day and night for several months, and now we're suddenly going to be apart. I'll really miss you.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Li Cheng seemed uncomfortable with such emotional farewells. He placed a large piece of smoked chicken on Huiyin's plate. \"We have to part; I need to get to Xuzhou quickly.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Seeing how serious he was, it was clear he was anxious. Huiyin lost the mood to tease him and said, \"I'll pack your things later.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">\"Good. I'm starting to feel sleepy as I eat.\" Li Cheng could get tired too. After days of travel, Huiyin could rest in the carriage with their son, but he had to ensure their safety without blinking.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Huiyin felt deeply for him. \"Don't sleep just yet; there's ginseng soup to drink.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Noticing that Li Cheng was too tired to lift his hand, Huiyin fed him the soup herself. Perhaps because he was extremely tired, he fell asleep as soon as he finished drinking.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Huiyin didn't mind that he hadn't had a chance to bathe yet. She instructed the servants to leave and prepare hot water. \"Once the Little Prince wakes up tomorrow and bathes, you can all get some rest. I'll be heading to bed too.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">That night, they both slept deeply, and the next morning, Huiyin realized that Li Cheng had already left.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">\"Has he already gone?\" Huiyin pressed her temples.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Nanny Nan smiled. \"When we came over this morning, the young prince specifically told us not to wake you. How are you feeling? I see you still have dark circles under your eyes.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Huiyin yawned. \"After all that travel, even though it's good to be home, it's really exhausting. I'm starting to understand how difficult life must be for the young prince and his soldiers. Some journeys are hard to truly appreciate unless you experience them yourself.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">But she couldn't rest either. She first sent many local products from Jizhou and the capital to the Prince of Wei's mansion and personally went to pay her respects.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">She thought it would be a simple visit, but to her surprise, the Princess of Wei looked much older after just a few months. Huiyin was puzzled. \"Aunt, have you encountered something? Please, if you have, you must tell me.\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">The Princess of Wei held her forehead, unsure where to begin.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">It was the steward by the princess's side who spoke. \"Young Princess, our prince wants to marry Princess Jianjia to the second son of Wei Duo.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">You mean Wei Xiao, Wei Duo's second son?</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Huiyin said, \"I've heard that Wei Xiao is highly talented and is a renowned scholar. It wouldn't be a disgrace.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">She only knew that Wei Duo had a penchant for other men's wives, but among his sons, there were those with scholarly reputations, and Wei Xiao actually sounded quite good.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">As daughters of regional lords, most women of her status were often married off for political alliances. Just like Huiyin, even though she knew Li Cheng would pass away, she had no choice but to marry him in this life. Because the next political marriage might involve a man who already has a large household and worse conditions.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">The Princess of Wei said, \"Wei Xiao already had a primary wife, and she was divorced because of the marriage to Princess Jianjia. A man who casually divorces his wife like that—who's to say he won't divorce Princess Jianjia in the future?\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">As a mother, she always worries more. Jianjia is still quite young, but the Prince of Wei is only concerned about maintaining a good relationship with Wei Duo, even willing to arrange a marriage. This shows the heartlessness of men.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Huiyin could only analyze it from a better angle: \"Aunt, since the marriage has already been announced to the world, can we still change it? If not, we have to buck up.\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">If you can resist, that's good. Otherwise, focus on making your life better. Constant complaining won't help, and in the end, it will only make things harder for you.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">When Huiyin said this, the Princess of Wei suddenly grabbed her as if she had found a glimmer of hope. \"Actually, there might still be a way to change it. Our Prince has always listened to your Prince. If he helps, then we might...\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">After all this talk, it turned out they wanted Li Cheng to step in. Huiyin didn’t refuse directly but just smiled. \"That’s quite a coincidence. He’s already gone to Xuzhou; he left yesterday. Why didn’t you mention it when he was here yesterday?\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">The Princess of Wei said, \"What we say, he might not listen to.\"</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">This wasn’t the Princess of Wei being modest. It was because Li Cheng had previously managed some affairs at the Prince of Wei's mansion for a period. He was notoriously difficult to work with, but he got along well with Princess Zheng.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">\"Then I can't help. I’ve never been involved in arranging marriages.\" Huiyin wasn’t foolish enough to step forward on behalf of others.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">She avoided it, but Yin Liyi immediately agreed.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Yin Cifei scolded, \"Is this something the Prince of Wei decided? How can we change it? Why didn’t you use your brain and just promise the Princess on your own?\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">\"Hehe, sister, I've already agreed. I do feel sorry for Jianjia. I've watched her grow up, and now she's marrying a man ten years older than her, which is unbearable to think about. If others want to stay out of it, that's their business. I, on the other hand, will definitely get involved. If I can persuade the Prince of Wei, that would be the best.\" Yin Liyi said with a smile.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Yin Lifang saw her sister like this and couldn’t do anything. \"Then you figure out a way yourself. I'm out of ideas.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Yin Liyi stood up. \"Don't worry, I'll find a way.\" She had just given birth to a son and was in a period of overflowing maternal love, so she couldn’t bear to see such things happen.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">But Yin Lifang knew very well that her sister often acted without thinking things through. If you really asked her, \"What's your plan?\" she would have no idea. She tended to act on impulse, and Yin Lifang had long grown used to it.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">So she simply remained silent and waited to see what Yin Liyi would do. If her actions were all talk and no substance, then so be it.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">After visiting the Princess of Wei, the next day, Lady Gao and Lady Gao of the Lu family came to visit. Huiyin said to them, \"I had planned to send the things I brought back from the capital to you, but since you're here, it saves me the trouble of sending them over.\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Jianye is just as prosperous as the capital. Though they had seen fine things before, these gifts from the Princess held special meaning.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">After some pleasantries, Lady Gao of the Lu family said, \"Now that you're back, I'll hand over the account books to you. The tea estate's business may not be booming, but the profits are quite substantial.\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Huiyin said, \"Thank you for your hard work in managing the tea estate and finding the tea plantations for me.\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">\"You're too kind. It's our honor to work for you,\" Lady Gao of the Lu family wasn't being fake. Climbing the ladder to the Princess of Huaiyin had made her gatherings more high-end.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Lady Gao quickly added, \"Yes, it wasn't much effort.\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Huiyin was satisfied with their responses and then asked about what had happened in Jianye. Lady Gao smiled. \"Recently, the hottest news is that Lady Xie finally gave birth to a child. The Xie family's old lady was very happy and invited the whole city to the third-day celebration banquet.\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">\"That's wonderful news,\" Huiyin deeply understood the pressure of bearing children as the wife of an only son.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Lady Gao of the Lu family interjected, \"It seems that at the banquet, Lady Xie said something about you, but since you weren't back, we didn't say much.\"</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">As people who had already sided with Huiyin, they gathered any information that might be unfavorable to her.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Huiyin frowned. \"What did she say about me? I don't remember having much interaction with her.\"</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">Lady Gao said, \"I remember it was during the Huo family's flower banquet. Lady Xie was still pregnant at the time and was invited. Someone mentioned you, saying that the Prince had changed and was now treating you so well, that you were as beautiful as a fairy, and so on. But Lady Xie said that after you entered the household, you took charge and dismissed many old servants, and that the Grand Dowager Wu was now forced to live in seclusion...\"</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">\"And then?\" Huiyin couldn’t understand why Yin Liyi would say so much.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">Lady Gao of the Lu family continued, \"She said that when she wanted to bring Lord Xie back, you obstructed her. Thankfully, heaven blessed us, and both the Prince of Wei and the Prince of Huaiyin agreed.\"</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">She didn’t expect Yin Liyi to spread this story everywhere, while Huiyin, even if she had occasional dissatisfaction with Yin Liyi, had never spoken about it outside.</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">After Lu and Gao left, Nanny Nan and Fugui were indignant. \"I really didn’t expect Madam Xie to spread such gossip about you. If you don’t put a stop to it, people might start to look down on you.\"</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">People in this world admire the strong. Even if you are a villain, as long as you have skills, there will be those willing to follow you loyally. But if you lack abilities, even if you hold a high position, some will still look down on you.</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">For now, Huiyin glanced at Nanny Nan. \"First of all, it remains to be verified whether Yin Liyi really spoke ill of me behind my back. Secondly, she doesn’t need me to suppress her; she’ll get into trouble sooner or later.\"</p><p id=\"paragraph-123\" data-paragraph-id=\"123\">Yin Liyi is a brainless woman, always talking about relying on herself, full of passion, but in the end, she ends up seeking help from one person or another. She’s just been lucky so far.</p><p id=\"paragraph-124\" data-paragraph-id=\"124\">Take now, for instance. She insists on meddling in the affairs of Princess Wei. If Princess Wei really cared so much about her daughter, wouldn’t she have taken action herself instead of letting others step forward? If she were truly desperate, the Prince of Wei might not have agreed.</p><p id=\"paragraph-125\" data-paragraph-id=\"125\">You can’t always count on luck. Sooner or later, something will go wrong.</p><p id=\"paragraph-126\" data-paragraph-id=\"126\">Huiyin knows how to bide her time. Since she didn’t hear it herself, she can’t fully trust what Gao and Lu said. What if someone was deliberately trying to stir up trouble, and she fell for it, only to worsen the relationship between the two families?</p><p id=\"paragraph-127\" data-paragraph-id=\"127\">Huiyin has no tolerance for the Yin sisters. What the Uncle of the Cui family does has nothing to do with her. Li Cheng may feel guilty because he’s a beneficiary, but she doesn’t have to. If Yin Liyi really does talk about me behind my back, I won’t let her off so easily.</p><p id=\"paragraph-128\" data-paragraph-id=\"128\">Just like when Yin Liyi’s son had his full moon celebration, Huiyin went and greeted Madam Xie and Yin Liyi with a smile.</p><p id=\"paragraph-129\" data-paragraph-id=\"129\">\"Congratulations on your new addition to the family. We were on the road when the child was born, and today I’ve brought the gifts to make up for it. I hope you won’t mind,\" Huiyin said with a smile.</p><p id=\"paragraph-130\" data-paragraph-id=\"130\">Madam Xie said, \"Your presence here is already an honor for our Xie family.\"</p><p id=\"paragraph-131\" data-paragraph-id=\"131\">Yin Liyi knows that Huiyin is not someone who meddles in other people’s affairs, nor does she have the spirit of standing up for justice. Telling Huiyin about Jianjia was just asking for humiliation.</p><p id=\"paragraph-132\" data-paragraph-id=\"132\">In the past, she was a little afraid of Huiyin, always feeling that Huiyin carried a natural dignity and was sharp, not easy to deal with. But gradually, she felt that Huiyin’s presence had eroded their childhood friendship.</p><p id=\"paragraph-133\" data-paragraph-id=\"133\">Even...</p><p id=\"paragraph-134\" data-paragraph-id=\"134\">She heard Xie Jiuyi mention that Xuzhou had become as tight as a drum, with the soldiers only listening to the Prince of Huaiyin and not the Prince of Wei, which wasn’t the case before. If the Prince of Huaiyin hadn’t defected to the Prince of Wei back then, how could he have achieved what he has today? And now he wants to betray the Prince of Wei? That won’t do.</p><p id=\"paragraph-135\" data-paragraph-id=\"135\">People shouldn’t forget their roots.</p><p id=\"paragraph-136\" data-paragraph-id=\"136\">Xie Jiuyi suspected that Princess Zheng might have played a role in this. He feared that if Li Cheng couldn’t break free from the Prince of Wei, his intentions might be discovered, which would spell his doom.</p><p id=\"paragraph-137\" data-paragraph-id=\"137\">Yin Liyi didn’t want to see Li Cheng die. We grew up together and should all live well.</p><p id=\"paragraph-138\" data-paragraph-id=\"138\">So, she felt she could no longer back down and let Princess Zheng harm Li Cheng.</p><p id=\"paragraph-139\" data-paragraph-id=\"139\">\"Young Princess, how is the young prince doing?\" Yin Liyi asked.</p><p id=\"paragraph-140\" data-paragraph-id=\"140\">Huiyin smiled. \"He’s doing very well.\"</p><p id=\"paragraph-141\" data-paragraph-id=\"141\">\"That’s wonderful. The young prince was only at your parents' home for a few months, and the journey was exhausting for all of us adults. I didn’t expect that he didn’t get sick at all. It’s truly divine protection,\" Yin Liyi said, clasping her hands together and murmuring a prayer.</p><p id=\"paragraph-142\" data-paragraph-id=\"142\">Her words were actually an implicit criticism of Huiyin for being selfish, traveling with a young child just to return to her parents' home. Who in their right mind would subject a child to such a long journey? It’s exhausting for both the child and the adults.</p><p id=\"paragraph-143\" data-paragraph-id=\"143\">Huiyin raised an eyebrow, not expecting her to find fault here, and replied with a smile. \"I also said we didn’t have to leave, but the young prince took my homesickness into account and arranged everything. I couldn’t not go. However, it wasn’t divine protection that kept us safe throughout the journey; it was due to the meticulous care of us as a couple. I believe the true deities have better things to do than handle such trivial family matters. I’ll leave the wishing to those who truly need it.\"</p><p id=\"paragraph-144\" data-paragraph-id=\"144\">Even though Yin Liyi isn’t known for her tact, she realized Huiyin was criticizing her for meddling. She immediately said, \"Young Princess, please don’t be angry. I have a straightforward personality and always speak my mind. It’s out of concern for you.\"</p><p id=\"paragraph-145\" data-paragraph-id=\"145\">Huiyin couldn’t help but find this somewhat sarcastic. She smiled and said, \"You seem to have forgotten that when your daughter was sick, you violated a military order by going to the camp to fetch someone even though women weren’t allowed. I advised you, but you didn’t listen. It seems that people generally don’t listen unless it’s their own concern.\"</p><p id=\"paragraph-146\" data-paragraph-id=\"146\">Yin Liyi looked up sharply, her expression serious. \"I had the Prince of Wei’s approval.\"</p><p id=\"paragraph-147\" data-paragraph-id=\"147\">\"I thought, as the Prince of Wei’s sister-in-law, you’d adhere more strictly to the Prince of Wei’s military orders. Instead, you’ve managed to get an exception. Your usual 'I’m just being honest' routine has backfired. She stammered, not knowing what to say.</p><p id=\"paragraph-148\" data-paragraph-id=\"148\">Author’s note:</p><p id=\"paragraph-149\" data-paragraph-id=\"149\">Today, 8k words, still 2k short. Let’s see if I can reach 10k tomorrow.</p><p id=\"paragraph-150\" data-paragraph-id=\"150\"></p><p id=\"paragraph-151\" data-paragraph-id=\"151\"></p>\n</div>"
  },
  {
    "number": 48,
    "title": "Chapter 48",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 48</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Two Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Why are you clashing with her? I've heard about your situation. There's no need to teach others a lesson in everything; everyone has their own way of living.\" Yin Lifen felt that her sister's actions were unwise.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Yin Liyi, however, said, \"I think after she had the child, her arrogance has only grown. Initially, I thought it had nothing to do with me, but now the Little Prince has grown distant from the Prince of Wei. What if it's discovered by the Prince of Wei in the future? We might end up in internal conflict before any external threat.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Yin Lifen shook her head. \"You worry too much. I'm not aware of these matters.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"I'm just concerned. We were once close; what good would it do if we turned on each other?\" Yin Liyi's husband, Xie Jiuyi, had a close relationship with Li Cheng, and they worked together for the Prince of Wei. Wasn't that a good thing?</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Yin Lifen looked at her sister and said, \"These matters are not for us to meddle in. We should know our place. I'm fortunate to be in the Prince of Wei's mansion, and thanks to my caution, I've been able to protect myself.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Though Yin Liyi was usually impulsive, she forced a smile when she saw her sister's serious expression and said, \"Alright, I'll stay out of it.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">After a few days of lying low, Huiyin was invited by Lady Gao, the wife of the young master of the Lu family, to a tea party, where she, of course, shone brilliantly. Lady Gao and Lady Gao felt that Huiyin's fearless attitude towards the Prince of Wei and the Xie family only confirmed that they had made the right choice in aligning with her.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Having achieved her goal, Huiyin knew when to stop and began to organize household matters.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">First, she checked if the allotments for Grand Dowager Wu, the high-ranking concubine, were sufficient. Although she didn't like her, she still needed to maintain appearances. Fortunately, Grand Dowager Wu now had several nuns to keep her company, and the troublemakers had been sent away. Nanny Fan had already pledged allegiance to Huiyin and always spoke well of her.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">After confirming Grand Dowager Wu's situation, she turned to the internal accounts. The external accounts were managed by Li Cheng, who would transfer the funds to the internal accounts. All unresolved matters from the past were now being addressed uniformly.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"Granny Chao made some mistakes before, but she is still the prince's wet nurse, so she should still receive her usual rewards. As for Yun Hui, there's no need to elevate her,\" Huiyin said.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Yun Hui was already at her breaking point. Huiyin couldn't be too ruthless.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Unbeknownst to Huiyin, Yun Hui's days were also tough. Although she was a widow in the mansion, she used to be the chief housekeeper, managing many people and commanding respect like a second mistress.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">But now, she was just the head of a nunnery, living a hard life with only two rough servants under her, having to do chores herself. As the weather turned cold, she had to fetch water to wash her hair, catching a cold from the wind and coughing incessantly.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">At her age, Grand Dowager Wu, though kind-looking, valued her life even more. \"Nanny Fan, please inform the princess that someone here is coughing non-stop and should be sent home,\" she said.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">This matter didn't require Huiyin's involvement. The current manager, Lady Liu, handled it quickly and sent Yun Hui home. Granny Chao still had some personal savings and used them to buy medicine for her daughter, but she could no longer enjoy the tea house in the mansion.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"If I were still serving in the mansion, the tea house would have brought medicine,\" Granny Chao sighed. \"They would also have sent four types of dried fruits and four types of candied fruits.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"Cough, cough, Mother, please don't say that. Others are pushing people out, and there's nothing we can do. Fortunately, we've saved enough money to get by,\" Yun Hui sometimes thought of revenge but knew she needed to endure, just as she had endured with Xun Rou before, taking it step by step.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">After handling the mansion's affairs, Huiyin finally began her real rest, with constant nourishing foods. To truly recover, one should focus solely on rest without thinking about anything else.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">When Li Cheng returned two months later, he saw that Huiyin's complexion was as fresh as a peach blossom, so soft that it seemed to glow with moisture. He touched his own face and said, \"Have I gotten much darker?\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"You're a man, why worry about that? It's already the twelfth lunar month; are you going to Xuzhou again this time?\" Huiyin hugged his arm as they walked in.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Li Cheng took off his armor and changed into casual clothes, saying, \"We'll have to see what Uncle Wei Wang says.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"It's been months; what have you decided about Lü Wei's matter?\" Huiyin asked.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Li Cheng smiled. \"We're not the ones in a hurry. Why should we rush into action?\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">The Crown Prince’s promises were just empty words. Who knew if they would come true? Besides, killing Lü Wei was extremely risky. Without a significant enough temptation, who would take such a risk? Empty promises won't fool anyone.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"You're right; let's just have a peaceful New Year,\" Huiyin ordered, calling for warm almond milk to be served. Warm drinks were perfect for the cold season.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">After the servants brought in the almond milk, they also served hot chestnut and peanut cakes. Only after drinking it did Li Cheng feel warmer, but as soon as he did, he felt sleepy.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Huiyin indulged him. Home was a safe harbor where no matter how tired and worn out you were outside, it was always the warmest and most healing place.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">After a good night’s sleep, Li Cheng woke up to the warm glow of an orange lamp filtering through the screen, which instantly made him feel at ease.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">“Huiyin…”</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">As soon as he called out, Huiyin entered the door and said with a smile, “You woke up just in time! Dinner is ready, and I’ve been waiting to share it with you.”</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Lamb is especially nourishing in the winter months, and today they had a lamb hotpot. Li Cheng looked at his wife and said with some embarrassment, “I don’t know what came over me, but I was exhausted as soon as we got home.”</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">“Probably because home is the most comfortable place, so you fell asleep right away. Sleeping more helps to recover. I wish you could sleep longer.” Huiyin didn’t mind.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">She wasn’t the type to feel idle or bored. Managing the household, reading, preparing gourmet dishes, and attending social gatherings were all part of her role as the lady of the house.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Huiyin never found these daily tasks tedious. To her, if she couldn’t manage a small family, how could she manage a larger one? Besides, interacting with people every day kept her mind sharp.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Li Cheng asked again, “How have you and the children been in Jianye?”</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Huiyin smiled and said, “Everything else is fine, except that Lady Xie seems to be acting strange, as if she took the wrong medicine.” She then told him how Yin Liyi had spoken ill of her behind her back and openly targeted her during a banquet.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">At the end, she added, “Those who don’t know might think she’s been possessed. Isn’t it funny? What does my life have to do with hers? In the past, she was sometimes overly innocent when talking to me, but never this confrontational.”</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Li Cheng listened and wondered, “Maybe someone put ideas into her head.”</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">“What do you think they said? Could it be that she’s getting involved just because I visited my parents with you? She’s not my mother-in-law, so why does she meddle so much?” Huiyin just wanted to vent a little.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Sometimes, when women want to vent, it doesn’t mean they really want to do something about it. When it came to verbal sparring, she had never lost.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Li Cheng hesitated before responding, “Before, I saw her being quite respectful to you. It’s strange that she’s become so arrogant now. She’s not the type to scheme. There must be something going on. Don’t worry, she’s easy to talk to. I’ll see her when I go to the Xie family tomorrow.”</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">“Ah, don’t say that I instigated this,” Huiyin just wanted to vent and didn’t expect Li Cheng to help.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Li Cheng found it amusing and said, “I understand.”</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">After their brief separation, the couple reconnected. After the meal, Li Cheng picked up Huiyin and carried her to the bed. His hands gently caressed her, and Huiyin held him tightly…</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">When Li Cheng woke up in the morning, he noticed the dark circles under his wife’s eyes and her tired appearance, while he felt refreshed and in high spirits. He bent down and kissed Huiyin on the cheek. Huiyin, ticklish, quickly turned away. He chuckled and said, “I’ll go to the Xie family now and then to Uncle Wei Wang’s place. You rest well at home.”</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Huiyin, with her eyes closed, waved her hand and said, “Go, go.”</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Li Cheng was extremely elated, like they say about newlyweds. Every night with Huiyin was an ultimate enjoyment.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">When he saw Xie Jiuyi again, they sat according to their ranks. “I came back yesterday evening and visited you early this morning. What’s the plan? What does the lord think?”</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">As a senior advisor to the Prince of Wei, Xie Jiuyi only shared information with Yin Liyi after careful consideration, not something spoken casually. Seeing Li Cheng come to his residence so quickly, unlike before when everything was centered around the Prince of Wei, he slowly confirmed his suspicions.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">“The Qingzhou territory is like a cooked duck that flew away. Naturally, the lord wants to take it, but as the Eastern Palace said, perhaps only the Marquis of Zhaojie can accomplish this.” Xie Jiuyi said.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Li Cheng clapped his hands and said, “I think that if we’re afraid the Eastern Palace will go back on their word, we should occupy Qingzhou first. This way, your father-in-law can decisively fight with his back against the wall. If the Eastern Palace is truly willing to give up Qingzhou, they shouldn’t fight us. As for Lü Wei, if your father-in-law wants to take it, he’ll inevitably clash with Lü Wei.”</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Xie Jiuyi smiled and said, “In your opinion, Little Prince, who should lead the charge? I can’t, as I lost the last battle, and the prince won’t send me for a while.”</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">His implication was, of course, that Li Cheng should take the lead, but Li Cheng wouldn’t easily express what he wanted. He only said, “Everything depends on Uncle Wei Wang’s arrangement.”</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">The two men exchanged a knowing smile, and Li Cheng drank another cup of tea. Seeing Yin Liyi serving tea and snacks, Li Cheng tried one and said, “Madam Xie’s skills are getting better and better.”</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Yin Liyi was delighted by the compliment, “These are pastries made with milk, topped with red and green grapes from the Western Regions. Naturally, they taste good. You won’t find such purity outside.”</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Li Cheng thought that Yin Liyi couldn’t possibly target Huiyin for no reason. While the Xie family is closely aligned with the Prince of Wei and related by marriage, their rank is still below mine. He was still a prince of a commandery!</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">After finishing a pastry, Li Cheng put it down and looked at Xie Jiuyi and his wife, “I heard that Uncle Wang plans to marry Jianjia to Wei Duo’s second son. Is there such a thing?”</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Indeed, as soon as he said this, he saw Yin Liyi's eyebrows rise in anger. Xie Jiuyi nodded and said, \"Yes, Wei Xiao dominates the Central Plains. It's only natural that our lord would seek a marriage alliance with him. For now, it's not advisable for us to open hostilities on the northern front.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">\"This marriage alliance actually makes sense,\" Li Cheng thought. Currently, the Prince of Wei cannot compete with Wei Xiao, so it's better to form an alliance. Besides, Wei Xiao is a talented individual and is a suitable match for Princess Jianjia.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Xie Jiuyi remained noncommittal.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">However, Yin Liyi interjected, \"Little Prince, Wei Xiao has divorced his first wife. Now he wants to marry Princess Jianjia. A family like that—\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">For the past two months, Yin Liyi had been trying to find a solution to this matter but couldn't figure out where to start. She didn't expect that Li Cheng would agree with the alliance.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Before she could finish, Li Cheng, visibly displeased, said, \"This isn't an ordinary marriage. This is a political alliance for the sake of peace between two regions. Even I have to form a marriage alliance. Why wouldn't Princess Jianjia have to?\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">If not for Xie Jiuyi's presence, Li Cheng felt he would have spoken more harshly. It wasn't that he didn't care about his cousin, but times had changed. Even Huiyin had to marry into a distant family.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"Why should women be burdened with such national affairs?\" Yin Liyi asked. She always felt that because of their childhood relationship, she could be more candid with Li Cheng than with others.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Li Cheng, seeing her indignation, retorted, \"You don't need to tell me this. You should speak to Prince of Wei about it. Why are you shouting at me? You see that Xie Jiuyi agrees too. Your opposition alone is useless.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Who was she venting to? He wasn't her husband and wouldn't indulge her. If she had the energy to lash out, she should direct it at Prince of Wei.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Yin Liyi, deflated, said, \"If I could persuade Prince of Wei, why would I complain to you? I just feel sorry for Princess Wei!\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Mentioning Princess Wei did make Li Cheng feel a pang of guilt, but he didn't want to engage further with Yin Liyi. However, her unconcealed hostility towards Huiyin made him wonder if his status had been compromised, giving her the courage to act this way.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Now, seeing how pregnancy had made her more impulsive and unrestrained, he knew he wouldn’t get anything useful from her.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Xie Jiuyi had also remained silent. Li Cheng then stood up, dusting the wrinkles on his right shoulder, and said, \"I'll go pay my respects to Uncle Wang then.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Xie Jiuyi stood up to see him off. After sending Li Cheng out, he turned to Yin Liyi and said, \"I know you are upright and love to fight for justice, but many things are not up to us to decide.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">\"But I know you must have a way,\" Yin Liyi said with a sly smile, knowing her husband was capable.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Xie Jiuyi shook his head, \"You think too highly of me. I love your innocence the most, but there are some things even I can't do anything about. However, I believe there are still a few years before this marriage takes place. Things might change in those years.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Hearing there was a possibility of change, Yin Liyi was immediately happy, \"That's wonderful.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Xie Jiuyi thought that if Prince of Wei could rely on Li Cheng to secure Qingzhou, they could eventually move north, and Zheng Fang in Jizhou wouldn’t pose a threat. If Prince of Wei were to confront Wei Xiao in the future, perhaps Princess Jianjia wouldn't have to marry Wei Xiao's son.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Seeing that his wife was no longer concerned about Princess Jianjia's marriage, he said, \"I need to go to Prince of Wei's mansion. Keep the household in order while I'm gone.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">\"Alright,\" Yin Liyi agreed.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">When Li Cheng met with Prince of Wei, the prince echoed Xie Jiuyi's sentiments. He even took the initiative to say, \"This matter requires your involvement. You and I, as uncle and nephew, are serving the emperor. The emperor won't mistreat us.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">\"Uncle Wang is right. I am unworthy and lack the means. I can barely govern Xuzhou. I am grateful that you still trust me with such an important task,\" Li Cheng spoke highly of Prince of Wei.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Prince of Wei smiled, \"Only you can do this. This is also the purpose of our previous marriage alliance.\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Li Cheng stayed and discussed the details with Prince of Wei before returning to his mansion. As soon as he returned, he told Huiyin about it, \"The crown prince is trying to pull a fast one, but we're not falling for it.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">\"Yes, but be careful—remember how the crown prince used poisoned arrows before; he’s unpredictable,\" Huiyin advised.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Li Cheng laughed, \"It's too early to talk about war. I think we should first send a letter to the crown prince and ask for his sincerity.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Li Cheng's letter was quickly delivered to Li Heng. It stated that Prince of Wei agreed to withdraw his forces south of Jiahui Pass in exchange for the crown prince's assistance in eliminating Lü Wei.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">\"This brat...\" Li Heng was certainly displeased.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">He Guoguo had already been confined by Lü Wei. Recently, he had been promising Zheng Fang. Although they were technically father-in-law and son-in-law, Zheng Fang had been playing dumb with him.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">So, when De Yin sent over the silver ear and lotus seed soup, he immediately threw the bowl to the ground.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">The servants dropped to their knees, calling out, \"Crown Prince!\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Li Heng suppressed his temper. After all, Qingzhou was caught between the Prince of Wei and the Marquis of Zhaojie, and he couldn't fully control it. Moreover, it was merely the He family's army. It would be better to withdraw his men first. Otherwise, Lü Wei's next move might be to depose the emperor and declare himself emperor, let alone what he would do to Li Heng himself.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">He forced out three words through clenched teeth: \"I'm fine.\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">That night, he ordered his trusted aide to take his token and head to Qingzhou. He had no choice but to agree, even though it meant letting others take advantage of the situation. Otherwise, it would be hard to maintain the balance.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">A half-month later, without losing a single soldier, the He family withdrew from Qingzhou, and Li Cheng moved in with his troops. He specifically sent a trusted aide to Jizhou to tell Zheng Fang not to make any rash moves and raise Lü Wei's suspicions. Then, when Lü Wei was off guard, they would strike.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">…</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">In Jianye, Huiyin heard the news from the frontline that Li Cheng had successfully occupied Jiahui Pass and was very pleased for him. No wonder the Crown Prince in the past life marched to Xuzhou and suffered so many casualties without gaining anything. Li Cheng was indeed extraordinarily strategic.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Lady Gao also had many praises, and Huiyin smiled. \"The situation at the frontline is uncertain. I think it's better to stay low-key.\"</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Huiyin remembered from her past life that her father had helped Li Heng kill Lü Wei but didn't gain any advantage. Instead, he was bound to the Crown Prince's chariot and used thoroughly. She couldn't let that happen again in this life. Fortunately, Li Cheng's plan was excellent. He advised Zheng Fang to kill Lü Wei and then quickly occupy the north of Jiahui Pass, but not be the Crown Prince's scapegoat. Instead, they should first consolidate Lü Wei's troops.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">This might be why Zheng Fang trusted Li Cheng. But in this life, would her father be able to kill Lü Wei without complications?</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Zheng Fang was indeed successful. He had always been a supporter of Lü Wei. Although he usually had some power, he was very respectful to Lü Wei, and many people wanted to assassinate him. It was Zheng Fang who helped him fend off these attempts numerous times.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Just like now, as Lü Wei was preparing to declare himself emperor, he asked Zheng Fang to help guard at night.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">On this ordinary night, Lü Wei was trying on the emperor's crown when he was stabbed in the back. The sword was sharp and fast, and soon a hammer smashed his chest. Lü Wei fell in a pool of blood, pointing at Zheng Fang. \"You, why are you doing this to me? I... didn't I promise to make you a non-royal prince after I ascend the throne?\"</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Zheng Fang laughed. \"Old thief, do you think I'm a fool? If you ascended the throne, the first thing you'd do is kill me.\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Lü Wei wanted to say something, but Zheng Fang said, \"I, Zheng Fang, have no desire to be emperor...\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Lü Wei never imagined that after a lifetime of brilliant and flawless strategies, he would meet his end at Zheng Fang’s hands. So many people had tried to assassinate him, and it was Zheng Fang who protected him. And now, he was killed by this very man.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Yes, Zheng Fang was indeed tempted by the sight of the crown.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">But remembering his son-in-law's instructions, he had to hold back. First, he needed to find where He Guoguo was being held. He Guoguo thought Zheng Fang had come to rescue him and was very pleased.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">\"Marquis of Zhaojie, you've finally come.\"</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Zheng Fang smiled. \"Yes, you've been through a lot. Lü Wei is dead, but I haven't released the news of his death yet. Soon, the whole world will know...\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">He Guoguo was overjoyed. \"Good, good, good. With his death, no one will threaten the Crown Prince anymore.\" He was already thinking about how to swallow Lü Wei's army, but it wasn't the time to say it yet.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">He needed to reassure Zheng Fang. \"How did you kill Lü Wei?\"</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Zheng Fang repeated what Li Cheng had taught him, word for word. \"Lord He, it was you who killed Lü Wei, how can it be me?\"</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">\"What do you mean?\" He Guoguo didn't understand.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Zheng Fang said impatiently, \"It means I'm framing you.\"</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">His son-in-law told him not to take the lead. Everyone wanted to see chaos in the capital, but whoever stuck their neck out might be targeted by others under the pretext of \"cleansing the court.\" It was better to push it onto He Jin.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">In this way, Zheng Fang not only got the north of Jiahui Pass in Qingzhou but also the He family's northwestern army without drawing attention to himself.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">That night, the Crown Prince rested at De Yin's place but tossed and turned, unable to sleep. De Yin was puzzled. \"Is something bothering you, Crown Prince?\"</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">\"Nothing, I was just wondering how the national uncle is doing while being held,\" Li Heng lied casually. For now, he was still loosely aligned with the He family. If Lü Wei fell, his threats would be greatly reduced. At least He Guoguo didn't have the courage yet and still needed Li Heng to give him wealth and honor.</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">De Yin was lost in thought. In a past life, she had heard that the Crown Prince nearly died from a poisoned arrow during a battle with Li Cheng. Fortunately, Zheng Wuheng had shielded him from the arrow. But in this life, Zheng Wuheng might not do the same, and who knows what the future holds...</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">She warned Li Heng, \"Prince, you must be careful of my brother-in-law, the Prince of Huaiyin. I suspect he has great ambitions and sharp tactics; he will surely become a major threat in the future.\"</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">Li Heng thought to himself that he was just waiting for Zheng Fang to kill Lü Wei. Then he would have He Guoguo kill Zheng Fang and take Jizhou in his hands. Zheng Fang was brave but easily influenced and lacked strategy, so he would be easy to deal with. As for Li Cheng, while he was formidable, Li Heng had already dealt with him in Qingzhou. Why fear him now?</p><p id=\"paragraph-123\" data-paragraph-id=\"123\">Just as he was thinking this, an attendant urgently reported, \"Prince, something terrible has happened. He Guoguo discovered that Lü Wei was planning to usurp the throne, and they both perished.\"</p><p id=\"paragraph-124\" data-paragraph-id=\"124\">\"What? He Guoguo is dead as well?\" The prince couldn't believe it.</p><p id=\"paragraph-125\" data-paragraph-id=\"125\">Outside the capital, Zheng Fang had already fled from Lü Wei's residence, feeling elated. Li Cheng's plan was clever, and he genuinely liked it.</p><p id=\"paragraph-126\" data-paragraph-id=\"126\">The next morning, he planned to take control of the Lü and He family armies under the guise of stabilizing the capital.</p><p id=\"paragraph-127\" data-paragraph-id=\"127\"></p>\n</div>"
  },
  {
    "number": 49,
    "title": "Chapter 49",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 49</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Merged Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After the expansion of territory, Li Cheng had already stationed Yuwen Dang to guard Qingzhou, while Zheng Fang sent his stepson, Pei Shuo, to occupy the area north of Jiahui Pass. The two families, bound by marriage, coexisted peacefully without losing a single soldier. Huiyin was pleased for both her family and Li Cheng, knowing they had gained this land without a single battle.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Although there might be differences of opinion in the future that could lead to conflicts or even war, it didn't hinder her good mood at the moment.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Even if Li Cheng were to be unfaithful someday, that wouldn't change how much they loved each other now. If people only worried about the future and lost the joy of the present, it would be too pessimistic.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Li Cheng was also worried about leaving his wife and children in Jianye, fearing they might be taken hostage. So he discussed with Huiyin, \"Perhaps I should take you back to Xuzhou. Although Xuzhou isn't as wealthy as Jianye, it's within my control.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"My lord, I truly want to return to Xuzhou with you, but I'm afraid of alerting our enemies prematurely. Now that you've taken control of Qing and Xu provinces, the Prince of Wei might see you as a threat. Even if I and Jinger go with you, what about your grandmother? She can't come with us, and staying here might put her at risk.\" Huiyin wanted to go but feared it might be too much, especially since Li Cheng hadn't fallen out with the Prince of Wei yet. In fact, on the surface, the Prince of Wei seemed quite supportive of him.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Li Cheng was startled and said, \"It would have been better if you and our son hadn't come to Jianye back then.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Huiyin smiled and said, \"Things were different then, and they're different now. I know you do everything for our family, but if something happens to you, how will we survive?\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"My wise wife, you are truly understanding. Alas, I will have to travel frequently between the two places in the future, which will be hard on you.\" Li Cheng took Huiyin's hand and said.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin shook her head, \"Why should we say more? The Prince of Wei is hosting a banquet tonight, and we must attend. Let's not be late.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Li Cheng wondered whether this banquet would turn out to be a good one. In the past, he kept such thoughts hidden in his heart and didn't dare reveal them even to his subordinates, but now he spoke honestly to Huiyin.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin comforted him, \"If you want to return to the uncle-nephew relationship, you would have to remain a servant without desires forever. But on the other hand, if you did that, who among your subordinates would follow you? Who would truly be loyal to you?\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">When a person reaches a certain status, if they are unwilling to act, their subordinates will work hard for them but won't receive any benefits, which can easily lead to rebellion.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Even when I dealt with the troublesome servants in the Prince's mansion, I had to give extra monthly payments to keep the others calm.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"I think the same. Last time, the Prince of Wei bypassed me and sent Xie Jiuyi to attack Qingzhou, but he lost. Now, I've taken it without a fight, and my troops will be stationed there. If it were someone else, the Jizhou army might have been snatched away.\" Li Cheng didn't consider his father-in-law to be a man of his word.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">However, now that Lü Wei and He Guoguo were finished, and the emperor's days were numbered, the crown prince was just a figurehead, and the future was still uncertain.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Zheng Fang had ambitions but lacked ability and strategy. The Zheng family's Jizhou army appeared strong but was actually rotten and demoralized inside.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">But if these words were spoken, it would hurt his wife's dignity.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Huiyin actually knew in her heart that this was why Lü Wei didn't want to deal a fatal blow to Zheng Fang. Personally, Zheng Fang's martial prowess was unmatched, but his military discipline was lax, and his troops were disheartened. Zheng Fang listened to one thing today and another tomorrow.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Leaving that aside, Huiyin said to Li Cheng, \"By the way, I have something else to tell you. Xu Cifei sent me a generous gift, and the other day when I went to pay my respects to Wei Imperial Consort Princess, she seemed to be waiting for me on purpose. What do you think this means?\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Li Cheng smiled and said, \"Don't worry about it. It's just about the heir position. Last time, Li Jing accidentally fell into a well, and it was probably her doing. Now that the Prince of Wei has another son, Xu Cifei must be the most anxious to have her son confirmed as the heir.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">When people are anxious, they tend to be cautious.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Huiyin snorted coldly, \"The Prince of Wei is still so young. What is she in such a hurry for? The future is still uncertain. Instead of this, she should urge her son to study and practice martial arts diligently. That way, even if power slips away, it can be easily regained. Even a commoner with a skill can live without worry.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Harming a child is no way to show strength. If she has the guts, she should go after the adults.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Either the Prince of Wei should decide to make her son the heir, or she should aim to become the Princess herself.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">This perspective amused Li Cheng, \"Since you already know, I won't say more.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">He thought the Prince's mansion would not be peaceful either. Xu Cifei was becoming restless, and Wei Princess and Yin Lifang were not to be trifled with, not to mention the Prince of Wei's new favorite.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">While the Prince's mansion was dealing with its own unrest, the Eastern Palace was undergoing significant changes. Lü Xiao was confined to her quarters by Empress He. Zheng Fang wasn't content to let his daughter remain just a Liangdi. When Lü Wei was alive, he had let it go, but now that Lü Wei was gone, how could he allow the Lü family to continue lording over the Zheng family?</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">The crown prince truly hated Lü Wei. He resented how Lü Wei had treated him like a puppet for years, constantly overstepping his bounds and disregarding his dignity. But at the same time, he also hated the Zheng family. During the Bingchen uprising, Zheng Fang, who was a Tiger Guard General at the time, was supposed to protect Xi Fei, but when the Rouran invaded, he fled with his men, leading to Xi Fei's suicide after being dishonored by the Rouran army.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">For some reason, he found himself at Lady Lu Xiao's palace. Usually, he sneaked there late at night. As a child, he hadn’t been favored, but Lu Xiao, the daughter of Lu Wei, always had a bright, spring-like smile and had been the first to share pastries with him.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">When Lu Xiao’s father passed away, she couldn’t observe the mourning rites, and her family was completely purged. There was nothing she could do.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Thanks to Grape’s reminder, she realized Li Heng had arrived, and a glimmer of hope sparked within her. \"Crown Prince, I beg you, please let my family live. They are innocent.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Lu Xiao’s biggest worry had once been the strict rules of being Crown Princess. Other than that, she had no friends. However, the provisions in the Eastern Palace were sufficient, and when she ran out of money, her father and brothers would give her more. But now, everything had changed.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Prince Li Heng helped her to her feet. \"Don’t kneel. Your father committed a capital crime. He hid a dragon robe—a crime too severe to pardon.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"I don’t dare to plead for my father, but my brother is innocent,\" Lu Xiao kowtowed and pleaded.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Mentioning her brother only fueled his anger, but he held it in because he still cared for Lu Xiao. With effort, he managed a smile. \"Alright, I promise you.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Seeing Lu Xiao’s joy, Li Heng signaled Grape and helped her up. \"There are some things even I can’t control.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Lu Xiao didn’t know her backing was gone and her status was shaky. She was just happy that Li Heng had saved her family. After comforting her, Li Heng arranged for his people to protect Lu Xiao once he left. Lu Xiao was innocent and naive, and now that Lü Wei was gone, many were ready to strike at her.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">After leaving Lu Xiao, he went to Zheng Deyin. In truth, he didn’t like coming there, but he had no choice. Zheng Fang had now taken over parts of Lu and He’s troops, becoming even stronger. He still needed to win over the Zheng family.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">De Yin seemed pleased. Elder Madame Xu had visited and mentioned that, with the Zheng family’s growing influence, her father intended to ask the Crown Prince to depose Lu Xiao and appoint De Yin as the new Crown Princess.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">But she couldn’t appear too eager and only mentioned other things. \"My father has brought in some fresh dried fruits. Please try them, Crown Prince.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Mentioning Zheng Fang made Li Heng hate this coward who betrayed him even more.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">For now, he had to swallow his anger. \"No need. I just finished eating. I came to inform you that I’m busy lately and need to nap in the study.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">De Yin was startled for a moment but immediately became docile. \"Yes.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Grandmother was right. The more she wanted to become Crown Princess, the more composed she needed to remain. Looking at Huiyin, a county princess, she appeared radiant because she was the principal wife and mistress of the household. No matter how favored a Liangdi like herself was, there was still the Crown Princess above.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Li Heng had already seen the determination in De Yin’s eyes, and his face darkened. He would never let the Zheng family succeed, or else it would be another Lü Wei. No, Zheng Fang, once in power, might be even more arrogant.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">At that moment, Huiyin also noticed Xu Cifei’s determination. She sat at the Wei King’s family banquet, where wine cups clinked and elegant figures mingled. Li Cheng was in the center, drunk and dancing with a sword, receiving applause from all sides.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Xu Cifei didn’t watch like the others but personally poured wine for Huiyin, saying with a bright smile, \"This is Gaochang’s grape wine. I always like to warm it before drinking. Young Princess, please try.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Surprised by the gesture, Huiyin quickly protested, \"Why would you pour wine for me? Let the servants handle it.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">The more Huiyin dared not accept, the more attentive Xu Cifei became. \"I’ve wanted to befriend Young Princess for a long time but was afraid you might disdain my status and dared not approach.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Her humble demeanor likely masked a significant request.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"Lady Xu is too polite. You are my elder. How could I dare to disdain?\" Huiyin wasn’t foolish and wouldn’t let Xu Cifei get too close, or else outsiders might find it hard to distinguish truth from falsehood regarding their relationship.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Seeing that Huiyin didn’t drink and only watched the sword dance, appearing quite distant, Xu Cifei left disappointed. After she left, Huiyin picked up a piece of candied litchi and put it in her mouth. Though it wasn’t in season, it was still delicious.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Li Cheng was already dancing with such grace and vigor, moving like a dragon soaring through the air. Huiyin had never seen him so spirited and couldn’t help but smile at him. Sensing her gaze, Li Cheng turned and used his sword to offer her a cup of wine.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Everyone cheered, and even the Prince of Wei was intrigued. Huiyin accepted the wine and drank it in one gulp. Li Heng finished with a flourish of his sword, knelt before the Prince of Wei, and said, \"Nephew won’t be in Jianye for the New Year. I ask Uncle to take care of my wife and children.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">The Prince of Wei raised his cup and praised him.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">After sitting down, a Hu dancer began a Hu spinning dance. Li Heng whispered to Huiyin, \"When I’m not home, are you afraid?\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">He actually wanted to keep his family close, where he could see them, to feel at ease. But his wife was right. Even if they all went, the Empress Dowager would still be in Jianye. If the Empress Dowager went too, it would be too obvious that she was being threatened, and he would still be controlled. It was better to create an illusion.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Huiyin frowned. \"You know I’m not afraid during the day, but I’m scared sleeping alone at night.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">\"There are no ghosts in this world, don't be afraid,\" Li Cheng gently comforted her.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Huiyin whined, \"I'm not afraid of ghosts. I'm afraid of people. When you're not at home, I always feel a cold wind at night. The mansion is so big, and I'm all alone. It scares me.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Li Cheng was speechless. \"Then I guess you should come with me...\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">\"No.\" On this point, Huiyin was firm.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">As the couple spoke, although outsiders didn't know what they were saying, from their expressions, it was clear that Li Cheng was coaxing Huiyin. Yin Liyi sat next to Yin Lifang and couldn't help interjecting, \"Zheng Fang of Jizhou now occupies the area north of Jiahui Pass, and the western capital has also sent troops. His momentum is vast; no wonder even the Prince has to show her some deference.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Seeing her sister like this, Yin Lifang couldn't help but say, \"What's gotten into you? Why do you care so much about the Zheng family? Whether they are good or bad has nothing to do with us. Now that you are Lady Xie, although your mother-in-law is in charge of the household and you don't have to worry about it, you can't be a shirker forever.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">In Yin Lifang's opinion, the Prince of Wei might not necessarily like the Princess of Wei, but in certain situations, they still had to act like a loving couple. Isn't that the nature of marriage among the upper class? The relationship between husband and wife isn't based on love but on interests.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">The Prince of Wei could easily subdue Jiangnan, and the Huo family deserved some credit for that.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Reminded by her sister, Yin Liyi suddenly realized, \"Cough, this really has nothing to do with me. You're right, sister.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Yin Liyi wore her emotions on her sleeve, and Yin Lifang thought that was why Xie Jiuyi liked her—because she was like a blank sheet of paper. But while it might seem cute when one was young, as one grew older, being so transparent would make people see her as a fool.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">\"Don't worry. In the future, no matter what happens, don't act impulsively,\" Yin Lifang said gently.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Yin Liyi nodded. \"Rest assured, sister.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">After a pause, she hesitated but still reminded her sister, \"I see that Lady Xu is trying very hard to please that Zheng woman. It's probably because of the heir apparent. Sister, what should we do?\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Last time, although there was no evidence, everyone knew that it was definitely Lady Xu who did it. She didn’t avenge her nephew and allowed the enemy to run free, which was truly infuriating.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Yin Lifang glanced at her sister. \"Don't worry, the Prince won't listen to her.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">\"Why?\" Yin Liyi felt that men could change their hearts easily. Since Zheng was charming and lovely, even if the Prince had some genuine feelings for her sister, he might still be tempted.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Yin Lifang smiled, \"Just trust me on this.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">After enjoying the Hu Xuan Dance, it was time for the Lotus Picking Dance from Jiangnan. Huiyin felt a bit tired and a little warm, wanting to go out for some fresh air, so she told Li Cheng.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Li Cheng looked at her, \"Make sure you come back soon.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"Okay.\" Her forehead was already dripping with sweat. As she went out, a cold breeze hit her, and she felt refreshed.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Wondering why she felt so warm today, perhaps she had worn too many clothes, Huiyin saw a stone bench and decided to sit down for a rest. It was close to the entrance and safe, and the wind wasn't too strong here.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">As soon as she sat down, a round-faced maidservant approached her. \"Little Princess, would you like me to bring some fruits and wine for you?\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">\"No need, I'll go back in a moment,\" Huiyin smiled.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Seeing how enthusiastic the maidservant was, Huiyin couldn't help but ask, \"Did the Princess send you to attend to me?\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">She shook her head, \"No, it's because when the Prince was in charge of the Prince of Wei's Mansion, my father was in debt, and my mother was ill. The Prince gave us twenty taels of silver, which helped my family get back on their feet. Now both my parents are doing well, and I've become a senior maid here. My whole family is grateful to the Prince.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">\"That’s interesting. What was the Prince like back then?\" Huiyin asked.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">The round-faced maidservant smiled, \"The Prince was quite young then. At first, the people in the mansion didn't respect him, but he managed to handle every task assigned by our Prince beautifully, proving them wrong. We all say that among men, the Prince was top-notch, and among women, Yin Cifei was the best.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">\"Yin Cifei is now the Yin Cifei, right?\" Huiyin noticed.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">The round-faced maidservant nodded, \"Yes, that's her.\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Feeling that her answer might not have been adequate, she shifted to another topic.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Inside the hall, Consort Xu entered with a pot of warm wine. By this time, the performance had ended, and Prince of Wei was discussing ancient and modern matters with Li Cheng, Xie Jiuyi, and others.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Prince of Wei, an accomplished artist, had a painting brought out for everyone to admire. He said to the group, \"They say you can see different things depending on how you look at this painting. Come and take a look.\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">To Li Cheng's eye, what he saw was a horse, and he remarked with a smile, \"This horse is as good as my Dawan steed...\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Xie Jiuyi, however, said, \"How come it looks like a carriage from where I'm standing?\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Prince of Wei laughed heartily, \"You see a horse and a carriage, but from where I stand, I see a beautiful woman.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">\"Uncle, are you daydreaming about another woman?\" Li Cheng joked on purpose.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Prince of Wei pointed at Li Cheng, \"You really don't hold back, do you?\"</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Princess Wei, feigning jealousy, added, \"My Lord, what beautiful woman are you hiding?\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">\"I just made a comment about the painting, and now you're all suspicious of me?\" Prince of Wei said with a laugh, appearing carefree.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">In truth, Prince of Wei could have any woman he wanted, so Princess Wei wasn't really jealous. Her real concern was whether she could still bear a child. She was still taking conception medicine, hoping that Prince of Wei would visit her more often.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">\"What I meant is that we all stand at different angles, seeing different things. The painting itself is not at fault.\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Prince of Wei's words carried deep meaning. Li Cheng understood. Prince of Wei was implying that from Li Cheng's perspective, Xuzhou was conquered by him, and Qingzhou to the south was obtained through strategy. It was understandable that Li Cheng didn't want to share it with others, but Prince of Wei had his own stance. There were things he didn't want to do but had to.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">This was exactly why Li Cheng had defected to Prince of Wei. This uncle was calm, far-sighted, and ambitious. If others knew of his ambitions, they would likely try to eliminate him. Yet, Prince of Wei was willing to maintain a superficial peace because he needed Li Cheng, and Li Cheng couldn't completely break away from him yet.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">But Li Cheng couldn't respond immediately; that would be too obvious.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Xie Jiuyi also understood. He was surprised that Prince of Wei valued Li Cheng so much. It was clear that Prince of Wei was someone worthy of support. Pushing Li Cheng to rebel now would be unwise.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Li Cheng had already indicated his loyalty by leaving his family in Jianye. He was the only person under Prince of Wei who was both literate and martial.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">At that moment, Huiyin entered. Seeing the subtle atmosphere, she didn't know what was happening but smiled and said, \"I didn't expect such a cold night to have a bright moon.\"</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Everyone began composing poems inspired by the moon. Xu Cifei even had moon cakes brought out. The moon cakes, filled with vegetables and meat, were surprisingly delicious. Prince of Wei clearly preferred savory, as he ate two moon cakes and left the sweet desserts untouched.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Recalling her visits to Princess Wei, who preferred sweets and rarely had such simple food, Huiyin realized that Xu Cifei's favor wasn't just by chance.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Li Cheng noticed Huiyin enjoying a moon cake and a tangerine, and couldn't resist teasing her, \"You have a good appetite tonight?\"</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">\"I ate less in the evening, hoping to lose some weight, but after sitting for so long, I got hungry. The aroma of the moon cakes was too tempting,\" Huiyin wrinkled her nose.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Li Cheng laughed heartily but managed to contain himself in the formal setting.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Xu Cifei kept moving around, and hearing Huiyin's comment, she felt relieved. It wasn't in vain that she had people deliberately mention Li Cheng and Yin Lifang's past in front of Huiyin. Last time, Li Cheng had saved Li Jing. Without him, Li Jing would have died, and her son would have been the heir.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Princess Zheng was still young. A little provocation, and even if Li Cheng supported Yin Lifang, Princess Zheng wouldn't agree.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">But as soon as they got into the carriage, Huiyin asked Li Cheng, \"Did you once save a round-faced maid named Guo, giving her father money to repay debts and her mother money for medical treatment?\"</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Li Cheng, having a good memory, said, \"There seems to be such a thing, why?\"</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">\"Why? That person turns kindness into enmity?\" Huiyin snorted.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">Li Cheng looked at her, \"What are you talking about?\"</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">\"While I was outside getting some air, I met a senior maid who talked about how you helped their family and casually mentioned your past with Yin Lifang, trying to provoke my anger. Luckily, I'm composed enough and, having no secrets with you, didn't believe these nonsense.\" Huiyin was dismissive of such petty tactics.</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">Li Cheng held Huiyin, knowing who was behind the trick. \"You say their methods aren't sophisticated, so why do they like doing this?\"</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">Huiyin shook her head, \"If we weren't so open with each other, these tactics could create a rift. If I lost my temper, it could drive us apart.\"</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">The key was that they had no secrets from each other and were very honest, which prevented anyone from sowing discord. If they were a couple filled with suspicion, it would be a different story.</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">Li Cheng felt incredibly fortunate to have married Huiyin.</p><p id=\"paragraph-123\" data-paragraph-id=\"123\"></p>\n</div>"
  },
  {
    "number": 50,
    "title": "Chapter 50",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 50</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Double Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Although Li Cheng wouldn't be returning home for the New Year this year, he had spent a great deal of time with her throughout the year. The months he spent in Jizhou were practically day and night together. However, Huiyin was well aware that they were living in turbulent times, and danger could arise at any moment. Li Cheng needed to keep a close eye on the situation in Xuzhou.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">\"I originally thought you'd be able to spend the New Year at home with us. Jing'er can now call for his father, but you, as his father, can't be with him,\" Huiyin said with a playful reproach.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Li Cheng laughed. \"Can you be a bit more reasonable? I specifically came back to fetch you all. As for Jing'er, I wish I could spend more time with him too, but there's no way around it. When he grows up, I can take him out with me every day, but that would leave you alone. How about giving me a daughter instead?\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin pulled away from him. \"Don't get your hopes up.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"I'm serious now. A real man, if he cannot live in luxury, should at least die in honor. During the days I'm not here, take good care of yourself and don't be afraid. I've left a team of people to specifically protect you,\" Li Cheng said, gently rubbing her face.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Huiyin patted his hand. \"Hurry up and go. Don't dawdle.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Just moments ago, she was reluctant to see him leave, but now she was urging him to go. Li Cheng, feeling a bit reluctant himself, went to take one last look at Jing'er in the anteroom. The one-year-old child was walking on the Persian carpet in the room, surprisingly steady for his age, not as wobbly as other children his age. He looked at Li Cheng, wanting to come over but also glancing back at his wet nurse.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng picked up Jing'er, and the scent of milk on the child filled him with motivation.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Li Cheng's departure left Huiyin with memories of his sword dancing. He was, without a doubt, a born hero, someone who could attract attention wherever he went. No wonder so many women liked him.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Even the Huo family had intentions of sending their daughter over as a Cifei. This was after Xu Cifei, who failed to cause trouble, sent someone to inform them.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"Are you saying that the Prince of Wei intends to marry Miss Huo, the third daughter, into our household?\" Huiyin frowned.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">The person sent by Xu Cifei said, \"What our Noble Consort heard is indeed so. The Huo family, being the natal family of Princess Wei, has deep roots in Jiangnan and is different from others.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">This was a method of consolidating alliances. Women were treated like tools by them.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"Fugui, give a reward. Tell Xu Cifei that I appreciate her persistence,\" Huiyin remarked, somewhat admiring Xu Cifei's relentless efforts.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">After the servant of Xu Cifei left, Nanny Nan anxiously said, \"Princess, what are we going to do?\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">\"When the sky wants to rain and a woman wants to marry, who can stop it? Unless the Little Prince himself doesn't want to marry her, there's no point in me trying to stop it. Another woman will always come along,\" Huiyin said. Now that she had a son and status, and Li Cheng's affection for her was evident, she wasn't too worried. However, she was curious about the extent of his affection.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">The competition for beauty and favor could only begin once this woman from the Huo family entered the mansion.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Princess Wei was also thinking about this matter. As Li Cheng's elder, the marriage of her younger sister through her didn't align with their ranks, but the royal family didn't concern themselves with such details.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">She took the opportunity to ask the Prince of Wei, who had come over today, \"My Lord, are you really going to betroth your third sister to the Little Prince?\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"Yes, haven't I already mentioned this before? Your sister is a Jiangnan lady of virtue, and my nephew is a dragon among men. Are you saying you look down on him?\" the Prince of Wei said with a smile.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Princess Wei quickly replied, \"If she can marry the Prince of Huaiyin, it will be her fortune. However, I've observed that Zheng isn't someone who tolerates others. As Lady Xie mentioned, after she entered the household, she expelled all the wet nurses and concubines who had served the Prince of Huaiyin. This shows her character.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">In reality, Princess Wei was eager for her sister to marry into the Prince's household. Who in Jiangnan, besides the Prince of Wei, could be more prestigious than the Prince of Huaiyin? She was just worried that Zheng might interfere and seek the Prince of Wei's support.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">The Prince of Wei, frowning slightly, said, \"On that day, I thought to consolidate Zheng Fang by having Li Cheng marry Zheng. I didn't expect her to be so fierce. Now that they've been married for almost three years, I worry that with his family staying in Jianye and him alone in Xuzhou, no one is taking care of him. That's why I intend to marry him to a virtuous lady from a noble family. It seems I made the right call.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">For him, arranging a secondary consort for Li Cheng was like a reward. Which man of status didn't have multiple wives?</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">So, he told Princess Wei, \"There's no need to worry. Once your sister marries into the household in Xuzhou, Zheng will be in Jianye, and they won't interfere with each other.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">In reality, the Prince of Wei had his own plans. Previously, marrying Li Cheng to Zheng was to seize Qingzhou and eliminate Lü Wei. Now that these matters were resolved, he couldn't allow the Zheng family's influence to become too powerful. After all, from now on, Jizhou would become an obstacle for the Prince of Wei's northern expansion.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Princess Wei, being the Prince of Wei's confidante, hadn't considered his deeper strategy. She thought he wanted to use her sister to keep Li Cheng in check, fearing that Li Cheng might become uncontrollable.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Wei Imperial Consort had invited Grand Dowager Wu over, seemingly revealing a few things in their conversation. While speaking, Grand Dowager Wu caught sight of the third daughter of the Huo family. She had a slender figure, striking features, and an innate elegance that far surpassed that of a woman from a humble background like Zheng.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"This girl looks very good to me,\" said Grand Dowager Wu with a smile.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Dowager Wei nodded and, after allowing Miss Huo the Third to withdraw, said, \"As long as you're satisfied, that's good. The prince plans to proceed with this when Prince Yunzhi returns. My daughter-in-law, as you know, has always been respectful, and her sister is equally virtuous.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">For Grand Dowager Wu, there was no room for satisfaction or dissatisfaction. After being outmaneuvered by Huiyin, she had been confined to the Buddhist chapel. Fan Mama and the others by her side had been secretly colluding with that Zheng woman. Now that it was at the request of Prince Wei, she was eager, almost wishing it had happened sooner.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Upon hearing that they would still need to match the eight characters and that she shouldn’t spread the news for the time being, Grand Dowager Wu kept her lips sealed, eager to catch the Zheng woman off guard.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">The more she thought about it, the happier she became!</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Previously, Zheng shi had driven away her grandniece Xun Rou, which was an affront to her own dignity, but she wouldn’t dare do the same to Prince Wei.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Yet Huiyin remained unmoved. Nanny Nan couldn’t help but interject, \"When the Grand Dowager visited the Prince of Wei’s mansion today, it was surely to discuss this matter. You can't really remain so still; you need to come up with a plan.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"That’s exactly why I can’t make decisions casually. How can I casually interfere with someone the Prince of Wei’s mansion is sending?\" Huiyin smiled.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">It was now the twelfth lunar month, and her menstruation had not come for a month. She already had a sense that she might be pregnant. However, the Hos were not like Xun Rou, who could be kept at a distance under her control. With the Prince of Wei backing them, she wanted to see how much Li Cheng truly cared for her. She intended to leave the decision up to him.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Nanny Nan urged, \"But...\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"Mother, rather than worrying about whether my husband will take a secondary wife, why not take the initiative? Why must I be the one anxious about him, instead of him being anxious about me?\" Huiyin shook her head.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Nanny Nan didn’t fully understand but felt that the young lady she had nurtured was giving her heart sincerely and naturally hoped for the same in return. If not, she would never forgive the other party. Miss Huiyin was clearly the same as her late mother, a person of extreme emotions and principles.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Fugui brought bird’s nest porridge and said, \"Princess, in my opinion, since Nanny Xu is trying so hard to curry favor, why not leverage her—\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"No, that woman is relentless. Once she latches onto you, she’ll put in endless effort. In the future, if something happens, she’ll also relentlessly drag you into it. I don’t like dealing with such people; I have my own methods and don’t need to rely on others,\" Huiyin smiled.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Fugui also breathed a sigh of relief. \"Seeing how she treats the prince’s eldest son, I knew she couldn’t be a good person. I was afraid you’d collaborate with her.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Huiyin laughed. \"You girl, are you deliberately testing me? Rest assured, I definitely won’t.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Fugui always felt that dealing with such people was like trying to steal from a tiger, especially when it involved the struggle for the heir in the Prince of Wei’s mansion. Now, hearing Huiyin’s firm stance, she felt relieved. Serving a wise mistress was better than anything else.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Huiyin drank all the bird’s nest porridge, which she usually wouldn’t touch. Today, she finished it completely, and Fugui happily said, \"Tomorrow, I’ll have them prepare bird’s nest with rock sugar again.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"But tomorrow, I want to drink pork stomach soup. Have them stew it with lotus seeds for a refreshing taste, without adding anything else,\" Huiyin said, rubbing her belly.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Fugui raised her eyebrows in surprise. \"Princess, are you pregnant?\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">\"I feel like I am, but for now, it’s better to be cautious. I’ll invite the doctor when my menstruation doesn’t come next month,\" Huiyin said.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Both Nanny Nan and Fugui were delighted. Nanny Nan thought to herself that it was no wonder the princess was so calm; she was pregnant. With an heir and another child to come, nothing would be able to shake her position.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Seeing how happy the two of them were, Huiyin couldn’t help but shake her head. They were too naive. If one day the Zheng family lost power, she and her two children would become disadvantaged, and the children might even resent their birth mother for becoming their stain. Although she was optimistic, she believed in the inherent evil of human nature; anyone could betray you.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">If something were to happen to Li Cheng, she wasn’t sure she could hold on forever either.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Huiyin’s calmness left Xu Cifei dumbfounded. She couldn’t help but say, \"I went through great efforts to pass on this news, but she’s not as the rumors described. Last time, Grand Dowager Wu said she had driven away Lady Xun, and I thought she was a woman of means.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"We can’t count on the young princess anymore. What do you plan to do? I heard that next month, the Weis from Xuzhou will come to propose. Although the princess doesn’t want to marry the princess to Wei Xiao, if she does, she’ll gain support. In the future, Yin Cifei’s side will be even more powerful,\" the servant analyzed.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Xu Cifei stood up. \"That’s exactly why I’ve been working hard. The prince wants to make my Zhizi the heir, but those old ministers are opposed. My son’s position has always been precarious. Originally, I was counting on the young prince and princess, but the young princess won’t take the bait, no matter what. Now that someone else is sending a woman, she remains unperturbed.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">In reality, Xu Cifei could only rely on these methods now; she was at the end of her rope.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">This year, with Li Cheng away, Huiyin and Grand Dowager Wu eyed each other with mutual dislike. Huiyin had indeed been confirmed pregnant and had a legitimate reason to focus on her health. Even Grand Dowager Wu’s sarcasm didn’t bother her. After the New Year, when the old trees sprouted new leaves and the lake ice broke, the Wei family from Xuzhou came to propose in person.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Huiyin was three months pregnant and personally attended the family banquet in place of Li Cheng. In contrast, Princess Wei was very considerate. \"You don’t need to attend; you’re expecting.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">\"As Aunt says, I'm already three months pregnant, and the baby is stable. How could I miss Jianjia's wedding?\" Huiyin's expression remained calm, and she smiled gracefully.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Princess Wei felt a little guilty, especially since her younger sister was about to marry Li Cheng. No woman was truly as virtuous as they claimed to be, and perhaps their relationship would deteriorate. Therefore, she became even more considerate: \"It's just a formal engagement. You know, I wasn't keen on having Jianjia marry into that family.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Huiyin gave away nothing in her words, only praising, \"Aunt Wang, you come from a prestigious family in Jianye, and Uncle Prince Wei is of royal blood. The daughter born to the two of you is sure to have a smooth and peaceful life.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">\"Let's hope so,\" Princess Wei sighed softly.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Meanwhile, Li Cheng received Huiyin's letter. The letter said that she was already pregnant and everything was fine, telling him not to worry. Along with the letter were two cotton coats, a box of tangerines, a glass lantern, and a hairpin.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">The tangerines were personally picked by his wife, each one bright and glossy. He peeled one and popped it into his mouth—it was incredibly sweet.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">He wondered what kind of chubby baby they would have this time, a boy or a girl. He needed to find out the due date so he could be back in time for the birth.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Thinking of the last delivery, he shuddered at the memory.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">For now, she couldn't leave easily. Last time, he helped his father-in-law with a strategy, but Zheng Fang seemed to be getting out of control, beyond Li Cheng's influence. He needed to secure his own territory first to have a future. The situation was constantly shifting, and he had to stay on his toes.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">He wrote back to Huiyin, urging her to take good care of herself, and included a small portrait of himself.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">When this letter returned, Huiyin was changing into new clothes. She hadn't dressed up for a long time, but today, for the banquet, she was dressed very formally.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Nanny Nan was astonished: \"My lady, you're pregnant. Just showing your face should be enough.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">\"It's not that simple. I heard that the Weis are coming to propose, and their second son is highly talented. There's also a renowned scholar named Yang Huan, who excels in composing odes. If he could write one for me, wouldn't I become famous in the Da Ye dynasty?\" Huiyin smiled.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">She was thinking of herself. This lifetime, Zheng Fang used Li Cheng's strategy to take the northwest of the capital. As the saying goes, when talent does not match position, disaster follows.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Thus, she needed to increase her reputation. In the future, if Li Cheng feared her fame, he wouldn't dare to act against her. Naturally, this would also make Li Cheng pay more attention to her.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Nanny Nan and the others didn't understand these thoughts. They believed a woman's reputation spreading wasn't a good thing. A woman should be virtuous and not attract attention.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Huiyin didn't know if what she was doing was right. She only knew that even if she made a mistake, there was no turning back.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Prince Wei was hosting a banquet for Wei Xiao and others in the Deyun Hall. He seemed appreciative of Wei Xiao. The advisors around Wei Xiao were all talented, including a young man in white who had an elegant demeanor. Prince Wei, being a lover of talent, immediately inquired about him.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Wei Xiao smiled: \"This is Yang Huan, whose courtesy name is Zijia, and he excels in writing poetry and odes.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"So this is Yang Zijia. I've heard of your fame in Jianye. Your 'Qingchuan Fu' and 'Deng Huanghe Lou' are excellent works that I admire,\" Prince Wei said, though his favorite was actually 'Yu Meiren Fu,' but it wasn't appropriate to mention it in front of everyone.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Yang Huan bowed: \"Thank you for the compliment, Your Highness.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Prince Wei noted that Yang Huan had a touch of arrogance, but it was common for scholars to be somewhat aloof. Moreover, Yang Huan came from the prestigious Hongnong Yang family. After chatting with everyone for a bit, Prince Wei smiled: \"Today, I'm hosting a banquet. We're all family here. Later, the Imperial Consort and Princess, as well as Princess of Huaiyin, will join us.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Even though it was a family banquet, men and women were separated by screens. The men sat outside, and the women sat inside, allowing Princess Wei to have a good view of her son-in-law.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Soon, several women arrived and took their seats, followed by the men.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Princess Wei, looking at the seat next to her, said to Wei Imperial Consort: \"I told her she didn't need to come because of her pregnancy. Now she says she's not feeling well and will be a bit late. I'm worried something might happen to her.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Yin Lifang spoke in Huiyin's defense: \"The young princess is here to represent the young prince. Since he's not in Jianye, she certainly doesn't want to let him down.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Sometimes, Xu Cifei thought Yin Lifang was just as two-faced, trying to play both sides. If she was truly close to Princess Zheng, why didn't she remind her?</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">As they were lost in thought, a fragrant breeze swept in from the doorway. Everyone looked over. A stunning beauty entered gracefully, her hair like clouds and her skin as smooth as porcelain. Dressed in a bright red gown, her hand, resting casually on her maid's arm, was as pale as frost. For a moment, everyone was stunned.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">This was the first impression of Huiyin for those seeing her for the first time. Although her personality could be strong, after the initial shock of her beauty, most people became more wary of her. She hadn't interacted much with Yang Huan. Now, making a stunning appearance, she wondered if he would write an ode for her. If not, she could always offer gold to entice him to compose one. Fame was worth trying for, and everything needed to be tested.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Her beauty, nobility, and grace left everyone speechless.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Yang Huan instantly found inspiration. The woman before him reminded him of only one person from his memory, Lady Xi, who was associated with peach blossoms. He wasn't foolish; of course, he wouldn't explicitly name her. Beauty had a strong impact, and he appreciated beauty, as well as every beautiful woman.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">At this banquet, Huiyin paid special attention to her appearance, unlike before when she focused solely on dignity. Princess Wei found it strange that Huiyin looked radiant and showed no sign of her earlier weakness.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">\"You're pregnant; there are many things you can't partake in. Just have a little taste. I've prepared a special table for you outside,\" Princess Wei said considerately.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">\"It's alright. I've already eaten before I came. Don't worry. By the way, who is our son-in-law, Lord Wei?\" Huiyin asked with a smile.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">The steward beside Princess Wei pointed to a man in a purple round-neck robe. Huiyin glanced at him and then said to Princess Wei, \"Aunt, what do you think?\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Upon seeing him in person, Princess Wei's resistance lessened considerably because Wei Xiao was indeed elegant and handsome, not at all like the older man she had imagined.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">\"It was decided by the prince. What can I say? I appreciate your concern,\" Princess Wei replied with a smile.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Huiyin pressed her lips together. \"What's so troublesome about this? Marriage is no laughing matter. As the saying goes, 'A man fears choosing the wrong career, and a woman fears marrying the wrong man.' I wish you a fine son-in-law.\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">It was somewhat inappropriate for Huiyin to say such things. Yin Lifang secretly thought that usually, Zhengshi was quite sensible and wouldn't ask so much. Now, she was even asking about Jianjia.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">But at this banquet, there was no room for the secondary consorts to speak. Yin Lifang remained silent and continued eating.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">On the other hand, Consort Xu took the initiative to offer Huiyin a mandarin orange. Even without a prior connection, it’s best to create one, she thought. If Huiyin didn't take the bait, it was fine. If she cut off Huiyin's retreat and made Princess Wei and Consort Yin believe they were close, Huiyin would have no choice but to rely on her.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Huiyin, however, seemed to understand her intention and couldn't help but say, \"Please don't offer me any more oranges. I don't know why, but since I've been pregnant, I've been craving spicy food.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">\"If you like spicy food, I have some pickled mustard greens. They are spicy but not overwhelmingly so,\" Consort Xu quickly said, adding, \"Did you finish the bird's nest I gave you last time? It was top-quality blood nest, very fine quality.\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Princess Wei really didn't expect Consort Xu to try and win over Zhengshi privately. But what use was winning over Zhengshi? The Huaiyin Mansion was still ruled by the Prince of Huaiyin. Once her sister married into the family, everything would be settled.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Huiyin smiled and said, \"That was indeed good, but I couldn't use it when I wasn't feeling well. When I wanted to eat it, it had spoiled, so I ate what was sent by Aunt Wang. I'm truly grateful for your concern, but I dare not accept. In the future, please don't send anything to avoid unnecessary complications.\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Consort Xu understood the implication. Huiyin was saying that although she wanted to help, if she really associated with her, she might be targeted by others.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">And who would target her? Obviously, Princess Wei.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Having successfully sown discord, Huiyin didn't say much more.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">The family banquet went well. It was said that after the feast, Yang Huan wrote the famous \"Ode to Jianye\" in his room, with a small dedication to Princess Zheng.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Huiyin had the storytellers in teahouses spread the word and even had shops like Zhang Laosan Noodles promote it. Soon, Huiyin's reputation soared, and when she went to worship at a temple, so many people came to catch a glimpse of her that West Street was packed.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">When the \"Ode to Jianye\" reached Xuzhou, Li Cheng was the first to see it. The prose was indeed magnificent, with a smooth and catchy flow. Yang Huan was truly talented. However, the small dedication was to Princess Zheng.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">\"Princess Zheng? Who is Princess Zheng?\" Li Cheng had a sinking feeling.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">The messengers looked at each other, not daring to speak. Li Cheng continued to scold, \"Who is it? Tell me!\"</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">\"Young Prince, we heard that Yang Huan wrote it after seeing the Little Princess at the Prince of Wei’s Mansion,\" the messenger said, kneeling and not daring to rise.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">Li Cheng slammed the table. \"That Yang Huan! Pack your things. We're going back to Jianye.\"</p><p id=\"paragraph-115\" data-paragraph-id=\"115\"></p><p id=\"paragraph-116\" data-paragraph-id=\"116\"></p>\n</div>"
  }
]