[
  {
    "number": 1,
    "title": "Chapter 1 Prologue",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 1 Prologue</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Prologue◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">In the bright spring of March, when the grass was growing and birds were singing, it should have been a good season for people to visit the Qujiang Pond for outings as they did in previous years. However, due to the grand mourning for the late emperor, the entire capital was under martial law. Not even a mosquito could escape the city.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Inside the palace, however, the atmosphere was less somber and tense. The new emperor had just ascended the throne and was holding an audience with his ministers in the Duanning Hall.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">The new emperor was twenty-five years old. Even when seated, he was taller than ordinary people. His face was as warm and gentle as jade, giving him the appearance of a handsome scholar. His gaze occasionally swept over the ministers below, sharp as a falcon's.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">He was dressed in a white mourning robe, with a dark green dragon-shaped jade pendant tied around his waist, giving him a dignified and solemn air. He was no longer the carefree youth of the past.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Your Majesty, Zheng Fang's troops have all withdrawn from the capital as per the order and are now heading to Bozhou as per your instructions.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">The new emperor murmured in contemplation before saying, \"There is a large army in Bozhou led by Wei Duo, who has long been eyeing Jizhou. I have already promised to make Wei's daughter the empress. I believe the Wei family knows what to do. This is also to avenge your sister, Yuniang. If it weren't for you, I wouldn't have known that Princess Zheng could be so ruthless.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">The person reporting to him was the brother of Dong Yuniang, who had been a concubine of the then-Crown Prince. He was originally a groom but rose to become a servant of the Eastern Palace because of his sister, who was selected as a Zhaoxun of the sixth rank in the Eastern Palace. Later, because she became pregnant, she was promoted to the third-rank Liangyuan by the Crown Prince. At the same time, her brother was recognized for his military talent by the Crown Prince and recommended to join the imperial guards.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Their future should have been bright.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Unfortunately, his sister, Dong Yuniang, was persecuted by Princess Zheng Liangdi, resulting in the death of both mother and child.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Dong Yu had risked his life to protect the Crown Prince from numerous assassinations and found witnesses and physical evidence, all to bring down Princess Zheng. Upon learning that Princess Zheng was also implicated in the death of Crown Princess Chuo Ren, he was thrilled to learn that her father might be eliminated by Wei Duo, who commanded an army of millions.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Dong Yu knelt again, expressing gratitude, and said, \"Your Majesty is wise and just.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">The new emperor smiled and said, \"You may leave.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Dong Yu rose, bowed as he stepped back a few paces, and then walked out briskly. The emperor was indeed a wise ruler, willing to punish even his favorite concubine for the sake of justice. With two charges against her, Princess Zheng was as good as dead this time.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">The new emperor stood with his hands behind his back, feeling a bit dizzy. These days, with the loss of his father, the mourning ceremonies, and state affairs, he was extremely fatigued.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Dong Yu, who was serving as a guard in the palace, naturally paid close attention to the situation in the Duanning Hall. He first noticed the servants of Princess Zheng Liangdi speaking with the chief eunuch.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">The chief eunuch asked, \"Is it you, Xiao Kangzi? Has Princess Zheng sent you here again?\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Xiao Kangzi smiled and replied, \"In response to the chief eunuch's question, this is the beef knee bone soup personally made by Princess Zheng. She has been simmering it since early morning. As you know, the emperor loves the food made by our Princess Zheng.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">After Xiao Kangzi entered the Duanning Hall, Dong Yu consoled himself, thinking that Zheng Fang had not gone far yet and that the emperor still had to give face to Princess Zheng Liangdi. Moreover, the emperor only had one son, the Fengyi Prince, born to Princess Zheng Liangdi. Besides, a night of conjugal bliss lasts a hundred days. Yesterday, Princess Zheng Liangdi accompanied the emperor and personally made a nourishing soup for him, reportedly burning her hand in the process.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">However, his relief was short-lived when the emperor bestowed fifty bolts of palace silk and one hundred taels of gold upon Princess Zheng Liangdi in the Lingde Hall. But he was not discouraged and continued to closely monitor the situation in the palace.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">The Lingde Hall, where these lavish gifts flowed in, housed Princess Zheng Liangdi, who had not yet received her official title after the emperor's ascension. She had entered the Eastern Palace five years ago and was exclusively favored by the Crown Prince for three years. In the following two years, the Crown Prince was sent to Xuzhou for battle and returned to ascend the throne.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">In the Lingde Hall, the crystal curtains were high, revealing a splendid scene. The jade-colored silk curtain in the middle added to the richness. The carpets and cushions were adorned with orchid patterns. Not far away, a large Geya vase held thousand-leaf green lotuses and water orchids. The white jade incense burner emitted fragrant Suhe incense, creating a delightful atmosphere.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Xiao Kangzi immediately knelt down behind the curtain and said, \"Your servant has not disappointed you.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">The woman inside was Princess Zheng Liangdi. She laughed and said, \"Rise. I heard that the emperor has bestowed many good things upon me.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Xiao Kangzi said, \"The emperor's affection for you, Your Highness, is known to all under heaven.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Princess Zheng Liangdi sighed again, \"The emperor usually doesn't concern himself with women. Crown Princess Chuo Ren's father defied the court and repeatedly massacred cities. The emperor personally executed her clan. But she was innocent. Upon hearing this news, she hanged herself. I regret telling her. I thought she already knew about it.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Xiao Kangzi hurriedly said, \"Your Highness, why concern yourself with her? She couldn't let go. If it weren't for her, you would still be the crown princess, but Empress Dowager He interfered. Better days are ahead for us.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Princess Zheng Liangdi smiled again. Even her maids, who often saw her, were amazed by her beauty. Princess Zheng was beautiful and stunning, with delicate and lustrous skin, a graceful and enchanting figure, making her an unparalleled beauty.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"I need to rest for a while. Making the beef knee bone soup this morning was exhausting.\" With that, Princess Zheng Liangdi yawned widely.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Soon, night fell, and Dong Yu saw the chief eunuch preparing to head to the Linde Palace in the middle of the night. He was elated, guessing that the young emperor might be about to order Zheng Liangdi's execution. However, just then, a eunuch from the Duanning Hall shouted, \"Something terrible has happened! His Majesty has suffered a severe headache and collapsed, no longer breathing.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Dong Yu was greatly shocked.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">The sudden death of the young emperor left only his son, born to Zheng Liangdi. Under the protection of Zhaojie Hou Zheng Fang, Zheng Liangdi was elevated to Zheng Taihou, and her son, Prince Fengyi, ascended the throne as the new emperor. Due to his young age, Zheng Taihou took control of the government.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Upon rising to power, Zheng Taihou swiftly appointed her father, Zheng Fang, as Grand Marshal, General-in-Chief, and Chief Minister of the Ministry of Rites, granting him control of the government. Her younger brother, Zheng Wuheng, was named Marquis of Quyang, and even her half-brother, Pei Shuo, was posthumously bestowed the title of Imperial Attendant and Director of Water and Parks.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">How prosperous the Zheng family had become!</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">**</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Outside the capital, a luxurious carriage arrived. The carriage had crimson wheels and a blue-gold canopy, adorned with exquisite gold and silver ornaments, appearing extraordinarily luxurious. The woman sitting in the carriage was composed and proper, her skirt designed to be graceful and ethereal, yet it remained still. Beside her, the young girl was lively, with the inner lining of her dress even showing.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Several officials at the post station immediately came forward respectfully upon seeing the carriage, saying, \"We, the humble officials, greet the Princess of Huaiyin. The Empress Dowager has instructed us to await you here. If it is late, she said that you should rest at the post station and that tomorrow, she will specially dispatch thirty imperial guards to escort you into the palace.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">The woman in the carriage was the Princess of Huaiyin, the Empress Dowager's sister. The officials treated the Princess of Huaiyin with great respect. The young girl accompanying her remarked with a smile, \"Aunt, look how good the Empress Dowager is to you.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">The Princess of Huaiyin had been widowed for a year, and her clothes were quite plain, her face showing much numbness. Hearing her niece, she managed a faint, forced smile.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">The young girl, however, found her aunt's smile to be more like crying. She couldn't understand why her aunt was like this. Now that her sister was the Empress Dowager, shouldn't she be happy?</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">The young girl was staying in the finest room, vastly different from the usual post stations she had stayed in when coming to the capital. However, she overheard Chun Mama, who was with the Princess of Huaiyin, say, \"Your Highness, it isn't even dark yet. Why are you to stay at the post station?\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Mama, now that we are in the capital, we should be cautious with our words and actions,\" the Princess of Huaiyin replied.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">But Chun Mama began to grumble discontentedly, \"Your Highness, you were raised under the Grand Lady's care and were taught the best manners and were well-read. You are nothing like the unruly Second Miss.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">The Princess of Huaiyin turned pale and said, \"Mama, don't speak nonsense.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Chun Mama continued, becoming more animated, \"You have had such a hard life. Prince Huaiyin was indeed intelligent and handsome, skilled in both literary and martial arts. But he had already set his heart on someone else and was narrow-minded, passing away prematurely, leaving you estranged, and now you must mourn him for the rest of your life. How can this be endured?\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Seeing the Princess of Huaiyin's face grow paler, the young girl realized there was a complex story behind it. She recalled her mother mentioning that Zheng Taihou, when still a young lady, was not as talented in literature, poetry, calligraphy, and the arts as her aunt.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">The Princess of Huaiyin continued, \"I am useless and unable to bring honor to my mother. My second sister has had more fortune than me. When she was a liangdi, she managed to make the Crown Prince neglect the Crown Princess and favor her alone, bearing the only child of the Crown Prince. Now, with the new emperor's death, she has become the Empress Dowager, and her son is the emperor. I have not had such fortune.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Chun Mama, who had been her mother's maid and had accompanied her from birth, became even more tearful at the mention of her late mistress, saying, \"Our late lady was the original wife of General Zheng, a compassionate woman who sympathized with the poor and weak. She had taken pity on Ji-shi for her virtuous and jealous nature, helping her as she raised her son alone. Who would have thought that we had invited a wolf into our home, causing our mistress to live a life of solitude and piety? Now, we must bow to them and their illegitimate children.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">The Princess of Huaiyin wept uncontrollably.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">The young girl had not anticipated such complexity. The next day, as she entered the imperial palace with her aunt, the imperial guards stood majestically, and the jade steps rose in layers, exuding grandeur and splendor. Inside the Empress Dowager's chambers, the roof was covered with white glazed tiles, crystal and jade lamps illuminated the space, golden dragons were carved on the inner pillars, and the floor was paved with gold bricks, exuding even more luxury and opulence.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">With every step they took inside, the young girl felt as though her aunt was walking on knife tips, with no joy of a family reunion. When they paid their respects to Zheng Taihou, she was astonished to see that her aunt, also a widow, looked like a withered tree, while Zheng Taihou appeared stunning and vibrant.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Why was this so?</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Seeing her aunt collapse from exhaustion, like a fragile lotus in the wind, the young girl realized the stark difference between the two sisters.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\"></p><p id=\"paragraph-55\" data-paragraph-id=\"55\"></p><p id=\"paragraph-56\" data-paragraph-id=\"56\"></p>\n</div>"
  },
  {
    "number": 2,
    "title": "Chapter 2",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 2</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Husband Exchange (Part 1)◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Jizhou was in the northern lands, where it turned cold and windy in the deep autumn.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">In front of the spacious manor, the wind blew from all directions, not only hitting the face but also blowing into the wide sleeves and trousers. The young woman tightened her hat, deeply regretting that she hadn’t worn the one with a shoulder cape. Otherwise, she wouldn’t have shivered as much. As she passed through the manor’s hallway, she could still hear the howling of the cold wind.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">However, upon arriving at the main courtyard, the maids lifted the curtains, and a wave of warmth rushed in. The young woman took off her hat and fox fur, handing them to the person beside her, and respectfully entered the inner room.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">This young woman’s maiden name was Xin. People called her Eldest Madam Xin. She was about twenty years old, with an oval face, neatly trimmed sideburns, and a silver hairpin on her head, surrounded by gold-plated hairpins, looking very opulent and splendid.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Entering the inner room, she quickly bowed and greeted her, “Mother, your daughter-in-law is here to pay her respects.”</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Madame Ji, the wife of Marquis Zhaoji, sat by the kang table near the eastern window, leaning against a half-old and not-so-new cushion. She was an extremely beautiful woman, still very charming despite nearing forty, and her laughter was particularly hearty, “Why have you come in this season? I told you to take good care of yourself during your pregnancy.”</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">After marrying Madame Ji’s eldest son, Pei Shuo, Eldest Madam Xin moved to Tongling Fang. Madame Ji wasn’t the type to make things hard for her daughter-in-law, nor did she like excessive formalities, so she only required Eldest Madam Xin to come over to pay her respects on the fifteenth of each month.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">“I appreciate your care, Mother. I shouldn’t decline, but I came today because I heard that my younger sister-in-law is ill, so I came to visit her.” Eldest Madam Xin knew that her mother-in-law loved her daughter the most, so she felt obliged to come.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">At the mention of her daughter, Madame Ji couldn’t help but feel distressed, “My poor daughter has endured much.”</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">A few days ago, Madame Ji and her mother-in-law, Elder Madame Xu, took their two daughters into the palace to pay their respects to Empress He. The Empress, who had no children, kept them and several other young ladies in the palace for an extra day. However, an accident occurred on that very day. While they were boating on the lake, the boat hit a strange rock. The eldest daughter, De Yin, who was playing the guqin at the prow, fell into the water. The palace servants rowing also fell out, causing chaos. Prime Minister Lu’s daughter desperately tried to row but drifted further away.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Neither of them could swim, and after drifting far, the boat capsized. The daughter clung to a rock in the lake all night and was rescued the next morning, only to fall ill after returning.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Eldest Madam Xin pressed her palms together, “Thank Buddha, has my sister-in-law taken her medicine?”</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">“She’s been taking medicine for a day, but the high fever wouldn’t subside. It wasn’t until the doctor added coptis that the fever broke. She’s resting now, and I’ll go see her later,” Madame Ji said worriedly.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Eldest Madam Xin rubbed her belly, glanced around, and hesitated to speak. Seeing this, Madame Ji dismissed the servants.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">“Is there something you want to say to me?” Madame Ji looked at her somewhat shrewd daughter-in-law.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Eldest Madam Xin said, “Speaking of which, the eldest miss is seventeen, and our miss is sixteen. The Empress summoned both of our misses to the palace. May I ask, is the Empress intending to bestow the position of Crown Princess?”</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">The Emperor was weak and often ill. Empress He had no children, and her brother dominated the capital with the support of Prime Minister Lu. They had deposed the original Crown Prince and installed the second prince, Li Heng, as the new Crown Prince. The Crown Prince was eighteen this year and had reached the age for marriage.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Although Madame Ji was a capable and straightforward person, there were things she didn’t wish to discuss with outsiders, not even her daughter-in-law. It was because the Crown Prince had saved her daughter from a rockery, abandoning Prime Minister Lu’s daughter and rescuing her own daughter in front of everyone, which made it hard not to speculate about his intentions.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">However, nothing was certain yet, so she simply shook her head, “I don’t know about that. There’s still her elder sister above her. Good things won’t come to our second daughter so readily. The Grand Madame has never liked me, and the Marquis follows his mother’s every word. Since the eldest miss was raised by the Grand Madame, she will definitely be favored. Everything is uncertain.”</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Eldest Madam Xin thought that though Elder Madame Xu, the Grand Dame of Marquis Zhaoji, disliked her mother-in-law, Madame Ji had given birth to the Zheng family’s only male heir, Zheng Wuheng. Her husband, Pei Shuo, although born to Madame Ji and her previous husband, was already serving in the Jizhou army and was highly regarded by the Marquis. The mother of the eldest miss, Madame Xu, although a niece of Elder Madame Xu, had long been living a secluded life of a widow, and couldn’t be compared to her own mother-in-law.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">She was about to say more when she saw Madame Ji stand up and hurriedly took her leave.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Madame Ji called out to her, “Take my warm sedan chair back. Don’t catch a cold. Go back and take good care of your pregnancy.”</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">“Yes,” Eldest Madam Xin bowed again before leaving.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">After Eldest Madam Xin left, Madame Ji went to the back room to see her daughter. As she entered, the room was filled with the bitter smell of medicine. It used to be filled with the fragrance of books and ink or a faint medicinal aroma. Huiyin was filial and would always help her father and brothers with medicinal soups to recover whenever they returned from battle injured.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Her daughter was still asleep, seemingly having a nightmare, her hand tightly gripping the bedding below her.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Madame Ji sat by the bed, gently patting her daughter’s shoulder, “I’m here, my baby. I’m here. My precious one will be alright.”</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">“Madame, the eldest miss woke up a long time ago and has already gone to the capital to thank the Empress. Why is our miss still unconscious?” Ji Xue, Huiyin’s maid, was very anxious.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">She had witnessed the Crown Prince carrying her miss down from the rockery with her own eyes. Her miss said that the Crown Prince didn’t even glance at the higher-born Miss Lu, which showed how special he was to her.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">With the season for selecting the Crown Princess upon us, the young lady must not fall ill.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Just as Lady Ji was about to speak, she heard a soft murmur from the bed, and her daughter woke up.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"Huiyin, my Huiyin, you’ve finally woken up,\" Lady Ji said with a smile.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Zheng Huiyin looked at her mother in a daze, listening as her mother chattered about her falling into the water, and looked at her attire and familiar bedroom. She had actually gone back to the age of sixteen.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Only her mother would call her Huiyin.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Lady Ji continued, \"Your grandmother and your elder sister have gone to the palace to give thanks, but you were sick. Still, it’s probably for the best, saving you a long and tiring journey, though...\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Huiyin had spent an entire hour coming to terms with the fact that she had been reborn.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Hearing her mother say \"though,\" Huiyin asked with a smile, \"Though what?\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"The Crown Prince is intent on marriage. Your elder sister went to the palace to give thanks, but since you didn’t go, I’m afraid you might miss your chance,\" Lady Ji said.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Huiyin felt an inexplicable urge to vomit at the mention of the Crown Prince. In her previous life, at this time, her elder sister had gone to the palace with her grandmother to give thanks. Coincidentally, the Prince of Huaiyin, on behalf of the Prince of Wu, was also seeking a wife. As the saying goes, when two powers clash, choose the stronger. The Prince of Huaiyin, who was the son of the Prince of Wu, was of similar age and interests to his uncle, the Prince of Wu. When the Prince of Wu rose in rebellion, the Prince of Huaiyin assisted him with troops.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Later, after the death of the Prince of Wu and his wife, the Prince of Huaiyin went to seek refuge with the Prince of Wu. The Prince of Wu was delighted and gave him troops to defend Xuzhou, a strategic location. At this time, the Prince of Huaiyin was only twenty and had not yet married, still in mourning for his grandfather and parents. The Prince of Wu intended to strengthen his alliance with Zheng Huiyin’s father and sent the Xu family from Donghai, the elder sister’s uncle, to persuade her father to betroth one of his daughters to the Prince of Huaiyin.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Originally, Huiyin’s father had considered making his eldest daughter the Crown Princess and his second daughter a princess. However, Grand Lady Xu and the Xu family believed that the Prince of Huaiyin, young and talented with real power, was far better than the puppet-like Crown Prince Li Heng. Moreover, the Prince of Huaiyin was of royal lineage. Li Heng could be deposed at any time, while the Prince of Huaiyin held significant power. Thus, Grand Lady Xu decided that the eldest daughter should marry the Prince of Huaiyin.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">In her previous life, Huiyin had thought she would marry a local lord to survive in such turbulent times, but unexpectedly, Empress He summoned her and said that the Crown Prince liked her very much and was willing to make her Crown Princess. Her father, who was easily swayed and fickle, agreed.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">However, Prime Minister Lu had not anticipated this turn of events and married his daughter to the Crown Prince as his primary consort. Huiyin, who had been considered for Crown Princess, became a concubine. For the sake of her position, her elder brother died in a conflict with the Lu family, and her younger brother followed Li Heng to attack Xuzhou. When Li Heng was ambushed, her younger brother swapped clothes with him, allowing Li Heng to escape. This had been her greatest regret in her previous life, and now, seeing her younger brother again, she couldn’t help but smile.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"Mother, if I miss my chance, then so be it. The palace is a place of schemes and dangers. We were only there to accompany the Empress for a day, and look what happened. If I were to enter the palace, it would be fraught with peril,\" Huiyin said, fully aware.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">In her previous life, if it hadn’t been for the Crown Prince’s excessive favor early on, she would never have spoken to her mother about his goodness, and her father and brothers wouldn’t have fought so hard for the Crown Prince.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">But this life…</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">\"Madam, Grand Lady Xu and the elder Miss have returned, and they’ve brought back an imperial edict. The whole family is to receive it,\" Lady Ji’s trusted servant, Liu Ma, entered to report.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Huiyin was puzzled; there had been no such edict at this time in her previous life. Nevertheless, she followed her mother to the front hall, where she saw her mischievous younger brother, her father who slightly opened his tiger-like eyes, Grand Lady Xu, and her elder sister De Yin, who had looked withered in her previous life but now appeared elegant and reasonable.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"Kneel,\" Lady Ji pulled her daughter down.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Having been an Empress Dowager for years, Huiyin was no longer accustomed to kneeling, and it felt uncomfortable.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"By the mandate of heaven and the decree of the emperor: the foundation of the world lies in the virtuous prince, who must be matched with a lady of noble birth. The eldest daughter of Zhao Jie Marquis Zheng Fang of Jizhou, from a prominent family, is deemed fit to join the Crown Prince’s household as his concubine. The necessary rites shall be prepared, and may you uphold your duties as a wife and heed your mother’s teachings. So be it!\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"This commoner, Zheng De Yin, gives thanks to the emperor. Long live the emperor!\" Zheng De Yin gracefully stepped forward, her demeanor dignified and her bearing elegant, as she glanced at Huiyin.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Huiyin realized that during her coma, her elder sister must have also been reborn. In her previous life, her elder sister had fainted upon seeing her become Empress Dowager. Now, she had taken the initiative to become Li Heng’s concubine, aspiring to be Empress Dowager like her.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Otherwise, with Grand Lady Xu’s sharp and unyielding nature, she would never have allowed her to marry the Crown Prince.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">It must have been her own decision.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">…</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">\"Elder sister, allow me to congratulate you,\" Huiyin offered her congratulations first after the officials left.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Zheng De Yin looked at her younger sister, feeling a little guilty for taking her rightful place. However, she consoled herself that by marrying into the Eastern Palace and securing a good match for her younger sister, she would be doing right by her. If she could gain the Crown Prince’s exclusive favor and attain the highest status, she would also be able to honor her mother, Lady Xu, properly. It would be a win-win situation.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\"></p><p id=\"paragraph-61\" data-paragraph-id=\"61\"></p>\n</div>"
  },
  {
    "number": 3,
    "title": "Chapter 3",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 3</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Exchanging Husbands (Part 2)◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Why did a marriage edict suddenly come down from the palace? Didn't they say they were going to express gratitude?\" Ji Shi personally served a cup of tea to her husband, Zheng Fang. He hadn't mentioned any of this when he accompanied Grandmother Xu and her grandchildren to the capital, so it must have been decided there.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Zheng Fang sipped the hot tea before saying, \"What can we do? The eldest girl said that the Crown Prince personally rescued her from the water and that the Empress also expressed her fondness for her. However, the eldest girl was initially supposed to be the Crown Princess. I just inquired from the eunuchs, and it turns out that the Crown Prince's official wife is Prime Minister Lu's daughter. What a pity.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Ji Shi thought that since the eldest girl was already the Crown Prince's concubine, there was no need to bring up her daughter's situation anymore. Only the two young maids by Huiyin's side knew about it.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"The Crown Prince is of royal lineage, and if he accomplishes great things, the eldest girl will become a high-ranking consort in the future. This is for the best,\" Ji Shi thought, not wanting to say more. After all, the eldest girl wasn't her own.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">As the couple exchanged a few words, they heard someone sent by Grandmother Xu saying, \"The old lady said that the second girl has just recovered from a serious illness and needs to warm her body. She requests that you accompany the second girl to Xuelang Manor for a few days to enjoy the hot springs.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Xuelang Manor was specially dedicated to Grandmother Xu when Zheng Fang conquered Jizhou. In previous years, Grandmother Xu only took the eldest girl there, but today she specifically sent someone to say this.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Ji Shi smiled and said, \"Thank you for the old lady's kindness.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">She didn't really think it was out of kindness. Having the experience of a thousand-year-old fox, this move was clearly intended to send them away. Ji Shi was not willing to go.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">But she agreed verbally for now. Ji Shi had been through a lot over the years.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Zheng Fang didn't grasp the underlying meaning and only asked Ji Shi, \"Is Huiyin feeling better? I'll go see her in a little while.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"She just woke up and went out in the cold air. How could she possibly be better? I think she still has a fever and needs to recuperate.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Ji Shi, originally a daughter of a military family from Pingyang County, was the daughter of a Deputy Military Commander. She was first married to Pei Ye of Hedong County and gave birth to Pei Shuo. Later, when Pei Shuo went out to meet the enemy, someone attacked from the rear. It was Ji Shi, who was pregnant, who led several squads of soldiers to protect the Pei army and rescued her husband. However, she miscarried the child, and the doctor said she could no longer bear children. At that time, she and Pei Ye had a very good relationship, so she made him promise not to take any concubines since they already had a son, Pei Shuo. Unexpectedly, Pei Ye took five or six concubines. In a fit of anger, Ji Shi divorced Pei Ye, taking her dowry and son with her.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">After marrying Zheng Fang, she believed she couldn't have children, but a few months later, she gave birth to Huiyin. She considered it a medical miracle.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Initially ostracized in the Zheng family, she only gained a foothold because she gave birth to Huiyin and her brother.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">The hardships she endured were beyond the understanding of outsiders, so she was particularly concerned about her daughter.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Although Zheng Fang had concubines, his relationship with Ji Shi was strong. They had been a couple for over a decade. Now, the most important thing was their daughter's marriage prospects. Ji Shi tactfully said, \"They say that after misfortune comes good fortune. Now that the eldest girl has been chosen by a noble, I wonder what will happen to Huiyin?\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"Don't worry, I'll carefully select a good husband for her,\" Zheng Fang said with a smile.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Zheng Fang, originally from a poor family, was once a captain under Lu Ji, the prefect of Gannan. After repeatedly distinguishing himself in battle, he was highly regarded by Lu Ji. Later, when Lu Ji went to the capital to seize political power, Zheng Fang was drawn in by Lü Wei and killed Lu Ji. His promotions were entirely due to his own abilities, and he had no background. Even Grandmother Xu, known as the Xu family of Donghai, was merely seeking influence.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Grandmother Xu, however, didn't see it that way. She had someone serve a bowl of almond milk to De Yin, saying, \"This milk is very nourishing. Your uncle will come to Jizhou from the Jiangnan region in a few days. It wouldn't do for him to see you looking sick.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"Uncle is coming?\" Zheng Deyin was very pleased.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Grandmother Xu smiled and said, \"He wrote last month. I've calculated the days, and he should arrive in a few days.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">\"That's wonderful. My mother will definitely be happy too, Grandmother. Please bring my mother back on that day.\" De Yin's biological mother, Xu Shi, was living in a nunnery near Jizhou and usually visited her. But this time, since her uncle was coming from Huainan, she wanted to bring her mother back.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">The old lady's servant, Aunt Luo, by Grandmother Xu's side, smiled and said, \"Miss, the old lady has already arranged for Ji Shi and her daughter to go to Xuelang Manor for this very reason.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"Grandmother...\" Zheng Deyin was moved.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Grandmother Xu said, \"It's not only for that. You're grown up now, and I have to talk to you. You're the only granddaughter in my heart. Ji Shi is scheming, and I don't want to deal with her daughter. Your uncle said that the Prince of Wei intends to propose marriage on behalf of his nephew, the Prince of Huaiyin, to your father for you. This marriage was originally yours, but now that you're betrothed to the Eastern Palace, you can't marry the Prince of Huaiyin. I'm afraid that if Ji Shi finds out about the proposal, she might do something underhanded, and our family will be disgraced.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Realizing this, Zheng Deyin thought that Huiyin had a marquis family, a mother, and brothers—everything she could want. In her previous life, Huiyin had been lucky to become the Empress Dowager. In this life, it might be better for her to marry within Jizhou, not leaving her hometown, living a peaceful life with an ordinary family. Many people would envy such a life. Besides, the Prince of Huaiyin had been at odds with her in her previous life, and they almost became enemies. It would be better for her sister not to marry him.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Thinking of this, De Yin felt a little relieved.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">**</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"You should continue to pretend to be sick for the next few days, understand?\" Ji Shi tucked the blanket around Huiyin and said.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">\"Mother, I originally didn’t want to go out either. Who would want to go out in such harsh weather to rest and recover?\" Huiyin smiled and said.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Ji Shi lightly pinched her daughter’s nose. \"You little imp, I knew you’d figure it out. Although your grandmother has been keeping it a secret, your father told me last night. The Prince of Huaiyin wants to marry a daughter of the Zheng family as his consort. Since your elder sister has already been quickly married off, this proposal has now fallen onto you.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">The Prince of Huaiyin? Huiyin remembered that he had also died young and had a very troubled relationship with her elder sister. It seemed Mother had mentioned that the Prince of Huaiyin had someone he admired.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">She said, \"Mother, the Prince of Huaiyin may not be such a good match. Don’t jump to conclusions.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">But Ji Shi disagreed. \"My dear child, your father rose from a humble background. He’s excellent in martial arts and leads troops brilliantly, but he lacks strategic thinking. He and Lü Wei have long been at odds, though they pretend to get along. However, we are not from one of those great families with our own private armies. If trouble arises, those people will scatter like chickens. The Prince of Huaiyin is descended from the Prince of Wu, who is the emperor’s brother. Prince Li Heng is merely a puppet crown prince. As the saying goes, when a brother dies, the younger takes over; when a father dies, the son succeeds. It’s possible that the Prince of Huaiyin could ascend...\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"Mother, isn’t Prince Wu also the emperor’s brother?\" Huiyin asked with a smile.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Although Prince Wu also seemed to have died early in her previous life, everything felt like a new perception after her rebirth.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Still, the Prince of Huaiyin did seem like a good choice. Prince Wu was already married, and his son was only a few years old. It wouldn’t do to marry Prince Wu, would it?</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Ji Shi’s thoughts were exactly what Huiyin had been thinking. \"Prince Wu is already married. Unless I am willing to be a secondary wife, but how could I let my daughter be a concubine? I wouldn’t even do that myself.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"Mother, if Prince Wu seeks a marriage alliance with our family, it definitely won’t go as grandmother wishes,\" Huiyin said. She had originally considered the Wei family from Bozhou, but recalling her previous life, she knew the Wei family favored married women.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Ji Shi thought the same. The two of them just used the excuse of the cold weather and their incomplete recovery as reasons to stay. Elder Madame Xu hadn’t expected this mother-daughter duo to be so shrewd. She thought it wouldn’t matter much. If Elder Uncle Xu knew that the eldest daughter had been betrothed to the crown prince of the Eastern Palace, he definitely wouldn’t push for this marriage. After all, why would Uncle Xu want to see the daughter of his enemy, Ji Shi, marry into a high position?</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">But she was wrong. Upon learning that the eldest daughter had already been betrothed to the crown prince of the Eastern Palace, Uncle Xu immediately spoke to Zheng Fang at the welcome banquet. \"The Prince of Wu has long admired General Zheng’s prowess and wishes to form a marital alliance with the Marquis. He would like to marry your second daughter, and in the future, both families can serve the court together.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Zheng Fang secretly thought that the Prince of Wu, having recently taken control of Yangzhou, was indeed a splendid match. He readily agreed.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">When Elder Madame Xu learned of this, she couldn’t help but say to Uncle Xu, \"I already told you that my granddaughter is betrothed to the crown prince. How can you now ask to marry Ji Shi’s daughter?\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Uncle Xu replied, \"The Prince of Wu once told me that marrying the Zheng family’s elder daughter would be ideal, as it would bring us closer. But if the second daughter can also marry, then forming an alliance with the Zheng family will suffice.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Truthfully, as long as they could marry into the Zheng family, does it really matter who it is?</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Elder Madame Xu was so angry she nearly fainted, and Zheng Deyin hurried to take care of her grandmother. Originally, she had been relieved that Huiyin wouldn’t have to marry the Prince of Huaiyin, thinking it would allow her to live a peaceful and healthy life. But fate was unkind. In her past life, she had lived a withered existence, and now it seemed Huiyin would experience the same.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">However, Huiyin secretly thought that even if she married the Prince of Huaiyin, who’s to say she couldn’t become empress?</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">She never believed that a woman’s fate was tied to her husband. A good fate is something you earn yourself. She was determined to forge her own path to success.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\"></p>\n</div>"
  },
  {
    "number": 4,
    "title": "Chapter 4",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 4</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎My Mother Was Actually a Black Lotus◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Ahem, ahem,\" Huiyin coughed a few times. Her cold had mostly recovered, but the cough was unavoidable.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Madame Ji pushed the small green porcelain jar on the table and said, \"Here, drink some pear soup. I woke up early and cooked it for you myself. It helps moisturize the lungs, quench thirst, and soothe a dry cough.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">It had been a long time since Huiyin had drunk pear soup. In her previous life, a year after entering the prince's mansion, she started experiencing intense menstrual cramps every time her menstruation came, and it would last for a long time. She was unable to enjoy many cooling foods like pears.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Now, she naturally drank a bowl without any hesitation. It was sweet and very refreshing.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Seeing her daughter finish the soup, Madame Ji continued, \"Your elder sister made a pair of knee pads for your father, and he was very pleased. It's clear that your grandmother has been paving the way for her, wanting her to excel in everything from music and chess to needlework and embroidery. I just don't understand why there's such favoritism between granddaughters. We're both her granddaughters, so why is there such a difference in treatment? I suppose it's because of me.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"Mother, there's actually something I've always wanted to ask you. What exactly happened? I've heard some rumors before, but whenever I asked, you always brushed me off with 'children shouldn't meddle in adult affairs.' But I really want to know, how did you marry my father?\" In her past life, Huiyin recalled overhearing whispers from those around Empress Dowager Xu, as if they were calling her mother a fox spirit or something similar.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">This was also why, after becoming Empress Dowager, Huiyin invited her elder sister to the capital for grace.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Madame Ji looked at her daughter and finally nodded decisively, \"Alright, I'll tell you.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"Back then, after I divorced your father, I lived at your grandfather's home. After staying there for a long time, it was inevitable that my sister-in-laws would say things like I was eating without working. How could I bear that? So, your grandfather advertised for a son-in-law. At that time, during the chaos caused by Lu Ji, Lu Ji was killed by your father, and his followers pursued and attacked your father and the others. In a panic, your father fled with Madame Xu, and they happened to pass through Pingyang County. To avoid the pursuit, Madame Xu devised a cunning plan.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Seeing that her mother's tone had a hint of sarcasm, Huiyin couldn't help but ask, \"What plan?\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Madame Ji replied, \"Madame Xu told your father to tear down the notice and become my son-in-law, so that it could protect her entire clan. I didn't understand what was going on, but when I saw your grandfather praising your father for his martial prowess and masculinity, and after I saw him myself and agreed, we got married. However, I didn't expect that before the wedding, Madame Xu came to me and revealed her plan. She said your father was willing to marry me only to escape the pursuit and hoped we could be a fake couple, and after everything settled down, he would set me free.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"What a despicable person,\" Huiyin thought. Madame Xu wanted to use the Ji family to help them escape the disaster and even revealed the plan on the wedding day, making it so obvious.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Madame Ji smiled, \"I had already been divorced once. If I were to be divorced again, where in the world would I have a place to stay? So, I maintained a calm exterior but secretly had my father announce that since your father was already married, I couldn't agree to the marriage. At this point, if Madame Xu had given up, it would have been fine, and your father even suggested running away with Madame Xu. But Madame Xu, seeing how obedient I was, treated me like a concubine. She asked your father to fake a divorce to stall for time.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"She thought the divorce letter was just a temporary measure, but I had it legally registered, making it official. Your father and I were married with the proper rites. Since I was his legitimate wife, I no longer had to depend on others. Madame Xu ended up losing everything. Whose fault was that?\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Madame Xu tried to cross the river by breaking the bridge, but Madame Ji turned the fake into reality and took the upper hand.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Huiyin thought, so that's what happened. She then asked, \"What about Father? How did he feel about all this?\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Madame Ji smiled, \"When I was younger, I valued feelings the most. But later, I realized that most men are the same. Since that was the case, I might as well find someone to rely on. Your father was brave and good at fighting. At the very least, when he fled for his life, he was willing to take his wife and children with him. That was enough.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">The situation was such that Madame Ji wasn't entirely innocent either, so she didn't talk much about it. Madame Xu thought she was clever but ended up being out of the picture, going from a legitimate wife to a divorced wife.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"Mother, even though you managed to turn things around, Madame Xu must have been resentful, right?\" Huiyin asked.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Madame Ji nodded and looked at her daughter with affection, \"Yes, at first, she was resentful and had the support of your grandmother. After all, she was your grandmother's niece, and she would nitpick everything I did. I thought I wouldn't have any children and just wanted a place to stay with your elder brother, so I endured as much as I could. Even a powerful dragon can't overpower a local snake. But then you were born, and your younger brother was born. My position as the legitimate wife became stable. No matter how dissatisfied your grandmother was, since your father and I had a good relationship, my position was secure, and she couldn't do anything.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">After listening to Madame Ji, Huiyin said, \"I've never heard you mention these things before. I didn't realize your life was also difficult.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">\"Whose life isn't difficult? This world is a dog-eat-dog place,\" Madame Ji said, stroking her daughter's head.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Huiyin thought that she was truly her mother's daughter, also being schemed against but eventually turning the tables. Crown Prince Li Heng's true love was Lu Xiao, the daughter of Prime Minister Lu. But he needed to clear obstacles for himself, so he neglected Lu Xiao and favored Huiyin, deliberately using the Zheng family to eliminate the Lu family.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">At the same time, he secretly gave her a cooling potion, which was also a contraceptive. It sounded bitter but tasted sweet, like honey water. If Huiyin hadn't suffered excruciating pain each month during her menstruation and hadn't noticed that despite being heavily favored, she couldn't conceive, she might have fallen for Li Heng's deception.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">She knew that if she got pregnant, the child would likely be harmed, so she deliberately didn't take the contraceptive medicine before Li Heng went on a campaign and indeed got pregnant.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">After the Zheng family helped Li Heng eliminate the Lu family, Huiyin had planned to tell Crown Princess Lu about the plan, hoping Lu Xiao would eliminate Li Heng. After all, Li Heng deeply loved her and wouldn't have been on guard against her. But to her surprise, Lu Xiao was so weak that she took her own life.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">With no other option, Huiyin pretended ignorance and first laced Li Heng's ox knee soup with poison in two doses. The first time, in front of his father, Li Heng drank it to show his affection. After the second dose, he died suddenly.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">When she did this, Huiyin was terrified because if she failed, she could have lost her life. But Li Heng was overly arrogant and dismissed her as just a woman, believing he had everything under control. Ultimately, he died suddenly.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\"></p><p id=\"paragraph-31\" data-paragraph-id=\"31\"></p>\n</div>"
  },
  {
    "number": 5,
    "title": "Chapter 5",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 5</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Wedding Reception◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The Winter Solstice was one of the most important days in the Da Ye Dynasty apart from the Lunar New Year. It was the only time when all family members gathered. Huiyin and her younger brother accompanied their parents to pay respects to Madame Xu, their grandmother.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Despite disliking Ji Shi, Madame Xu doted on the family’s only male heir, Zheng Wuheng. Before he finished his bow, she called out, \"Heng-ge, come to Grandma quickly.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">However, Zheng Wuheng replied, \"Grandmother, I’ll just sit here; I won’t take your spot.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">He wasn’t foolish; he knew the old lady’s affection for him was because she saw him as the future heir to his father’s title and military power. A few days ago, she had urged him to get closer to his elder sister, saying they were all one family. But who was family? His second sister was his true sibling. Usually, they had bullied his mother and sister, and now they remembered they were family?</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Huiyin looked around and then stood up to present a headband she had embroidered to Madame Xu, saying, \"Grandmother, this is a headband I embroidered for you. My skills are not excellent, so please forgive any shortcomings.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">In her past life, she truly believed that her mother had usurped Madame Xu’s rightful place, so she had been more tolerant of her elder sister. Although her embroidery skills were not inferior, she never showed them off publicly. Even after becoming empress dowager, she had invited her elder sister to the capital, fearing her sister would be bullied in the fief.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Now that she knew the truth, she realized that Madame Xu had created her own web, and Zheng Deyin had taken someone else’s life. She would no longer be the younger sister who yielded in everything.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Everyone could see that the headband was unique. One part featured a phoenix among peonies on a brow band, and the other part was a dark blue satin base embroidered with cranes and auspicious clouds. The craftsmanship was intricate, and the symbolism was auspicious.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Those with discerning eyes could see it was excellent, but Madame Xu, being biased, thought Huiyin was trying to curry favor with her to pave the way for herself in the Prince of Wei’s court.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Indeed, Ji Shi was only the daughter of a commandant from Pingyang County. Their Xu family of Donghai had served as high officials for generations, assisting the Prince of Wei, who governed as the emperor’s younger brother. They were the legitimate authority. With her limited skills, Huiyin could, at most, deceive her son, who was soft-hearted, but not real aristocratic sons.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">However, in front of her son, Madame Xu couldn’t say much and only lightly remarked, \"There’s no need to go through all this trouble for these things.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Huiyin wasn’t upset and only smiled, \"It’s not troublesome to show heartfelt respect to elders. I learned this from my elder sister. My elder sister made kneepads to show filial piety to our father, so I thought I’d do some needlework to show respect to our elders.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Yes, you didn’t stop Zheng Deyin from showing filial piety.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">When Zheng Deyin heard Huiyin mention her, she recalled her visit to her birth mother, Madame Xu, a few days ago. Madame Xu had been depressed for years. Initially, she was happy to hear that she had become a Liangdi (a concubine of the Crown Prince). As a Liangdi, she would become an imperial consort or imperial noble consort when the Crown Prince ascended the throne. However, upon hearing that Huiyin had married the Prince of Huaiyin, with her uncle acting as the matchmaker, she felt it was a bargain for Ji Shi and her daughter.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">\"Back then, Ji Shi behaved humbly in front of me, considering herself a concubine, but secretly conceived a child with your father, leaving me, the legitimate wife, with no peace. Now her daughter is to become the legitimate princess, and you are to be beneath the Crown Princess...\" This was what Madame Xu cared about the most.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">De Yin could only say, \"The Prince of Huaiyin is just a prince, how can he be compared to the Crown Prince? Moreover, there are many complexities in the Huaiyin Mansion. I heard that the Prince of Huaiyin has someone he admires and that she will have a hard time.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Only then did Madame Xu say, \"I am trapped, and seeing the children of my enemies rise in status fills me with anger. What you say eases my frustration a little.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">In De Yin’s view, there was no great enmity between her and Huiyin. Ji Shi had not mistreated her; at most, she had favored her own children, which was understandable. In the future, she would marry into the Eastern Palace and, in a few years, become Empress Dowager. It would be easy to bring her mother out then.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Ji Shi could have her moment; there was no need to argue.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Secrets lead to success, while leaks lead to failure; those who achieve great things keep their mouths shut!</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Bringing her thoughts back, seeing Huiyin say this, she smiled and said, \"Your skills are really good, but I haven’t seen you embroider much before. In the future, we sisters can do needlework together.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">What she actually meant was that Huiyin had never shown this kind of filial piety to the old lady before and was only doing so now to compete. Huiyin understood this and smiled, \"Elder sister is right. If you like, come to my room. It’s been a while since you’ve visited.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">De Yin thought that Huiyin was being sarcastic, pretending to be close but not actually being intimate. She looked up at her grandmother for help, knowing that many times, she didn’t need to fight because her grandmother always sided with her.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Sure enough, Madame Xu said, \"Second girl, you are the younger one. You should often visit your elder sister. How can you let your elder sister visit you?\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Huiyin immediately respectfully said, \"Grandmother is right. I will remember that.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Only then was Madame Xu satisfied. Ji Shi saw her daughter giving gifts to this old woman, who was scolding her daughter, and she deeply resented it. Not to mention Zheng Wuheng.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Ji Shi just didn’t understand why her daughter was offering warm faces to cold backs.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">The question was that Huiyin was proving that she would no longer yield to De Yin. In the future, if she married the Prince of Huaiyin, she would never let her brothers help this person.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">When Madame Ji asked this question, Huiyin smiled and said, \"Mother, I've noticed recently that Grandmother has been drawing Brother and Elder Sister closer, revealing her plans today. She wants Brother to serve Elder Sister loyally, and at heart, she still looks down on us. I believe the Empress deliberately married into the Zheng and Lu families, intending to provoke conflict between the two sides. Father is weak-willed, but he still listens to you. Don't let him charge into battle. If she really ascends to the imperial throne and brings her mother out, what will happen to Brother and you?\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">It's not that Huiyin is narrow-minded; she can only focus on her own family right now.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Just yesterday, Madame Ji received a pair of pouches from Deyin, who thanked her for preparing the dowry. Madame Ji is easily moved by kindness, and Huiyin wanted to reveal the truth to her today.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"I heard that she visited Madame Xu a few days ago. You know best what kind of person Madame Xu is and whether she respects you.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Madame Ji then understood her daughter’s well-meaning intentions and deeply agreed.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">After the Winter Solstice, the family was almost entirely occupied with preparing the dowry—horses, carriages, servants, and trousseaus, all had to be arranged. The Great Yi Dynasty has always placed great importance on wedding dowries, with grandeur and splendor.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">As a noble family, the Zhengs were no exception.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">By the time the New Year arrived, Madame Ji had been the busiest in the household. Huiyin was frequently being measured for clothes, as her spring dresses, winter coats, fur garments, and skirts were being made at different tailor shops.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">She also had to embroider some pieces, such as fan cases and pouches. Naturally, Deyin had to do the same. The elders knew that whether marrying into the royal family or an ordinary household, while etiquette was important, gifts for the elders were also necessary.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">At this moment, Princess Xinning invited the Zheng sisters to a poetry gathering in the capital. Despite ongoing wars elsewhere, the nobility continued to live luxuriously.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">In her previous life, Huiyin didn't get along with this princess. Li Heng’s strategy of feigning indifference to show affection, favoring her while being cold to his true love, Lu Xiao, made the warm-hearted princess dislike her.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Obviously, Princess Xinning truly wanted to invite Zheng Deyin this time. Princess Xinning had always been close to Li Heng, and since Zheng Deyin was about to enter the Eastern Palace, she wanted to meet her future sister-in-law as a favor to Li Heng.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">The two sisters traveled to the capital together. The splendor of the princess's mansion was beyond description. Huiyin even saw Lu Xiao there. They had been companions in misfortune when they fell into the water together.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">This naive girl quietly said to Huiyin, \"Though it's not appropriate to say, I saw the Prince carrying you away. Are you upset?\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Huiyin pretended not to understand, \"Upset? Upset about what?\" She hadn't fallen for him at this point in her previous life, and in this life, she found it even more disgusting.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Seeing that Huiyin didn't seem to mind, Lu Xiao awkwardly changed the subject, \"I heard you're betrothed to the Prince of Huaiyin. Is that true?\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Huiyin nodded, \"Yes, my elder sister will be married next month, and I will be married in May, going to Jianye. I haven't had the chance to pay my respects to you as the Crown Princess yet.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Even in her previous life, Huiyin didn't dislike Lu Xiao. She truly lived up to her name, always smiling. It was surprising that someone as ruthless as Lu Wei had such an innocent and naive daughter.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Lu Xiao was very candid, \"What Crown Princess? It's just a political marriage. Li Heng seems to dislike me a lot. I married him for my father's sake.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Lu Wei loved power, but he wanted even more to control the emperor under the guise of legitimacy.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">In this setting, Deyin was more adept than Lu Xiao. Although Lu Xiao was Lu Wei's daughter, she wasn't skilled in court etiquette or socializing. Huiyin, aware she wasn’t the main focus, quietly ate in a corner.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Deyin glanced at Huiyin, who was sitting in a corner eating, while she was being honored by everyone. Originally, Lu Xiao should have been the center of attention, but she was so clumsy and unreliable that it was no wonder the Crown Prince didn't like her in the previous life. Deyin didn't want to overshadow the Crown Princess but felt some sympathy for Lu Xiao, though she couldn't stop others from engaging with her more.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Several of her former close friends also came to talk to her, women of similar age, most of whom were betrothed. Some were married off to Yuzhou, and others to their fathers' subordinates. Each had their own troubles.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">She hesitated about whether to tell her sister the truth that the Prince of Huaiyin had someone he loved, but decided against it. Perhaps, by not telling her, she could stay happy for a few more days.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">In early March, Deyin was about to be married and enter the Eastern Palace as a new Liangdi.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">In May, the Prince of Huaiyin sent Guo Qishan, the Chief Secretary, and Yuwendang, the Commandant, as marriage envoys to present betrothal gifts. There were a hundred carriages, twenty horses, a dowry of a thousand jin of gold, and various precious items and fabrics.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">The Zheng family didn't fall behind. After the death of Madame Ji's husband, Pei Ye, she inherited most of the Pei family's wealth. Some was used for Pei Shuo's marriage and estate, and some for purchasing land. Much of it went to Huiyin. Additionally, Zheng Fang was a feudal lord, so the dowry was abundant and extravagant.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Huiyin covered her head with the veil and boarded the bridal sedan, heading towards a path she had never experienced in her previous life.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p>\n</div>"
  },
  {
    "number": 6,
    "title": "Chapter 6",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 6</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎On the Journey◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The wedding procession moved farther and farther away. Madame Ji wiped her tears and stepped through the gate. Her eldest son, Pei Shuo, supported her and comforted her, saying, \"Mother, don’t be sad. As long as our sister is happy, that’s what matters most.\"</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">\"The elder Madame knew that your sister was marrying into the Xu family in Jianye, who serve the Prince of Wei, yet she didn’t offer any advice. I don’t expect much from her, but Huiyin is her own granddaughter.\" Madame Ji shook her head. This marriage was entirely the result of her husband’s political maneuvers.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">The Emperor was ill, and the Crown Prince was under the control of the He family. Empress He used the Lu and Zheng families to balance the power dynamics, thereby controlling the He family. The Lu family wanted to treat the Zheng family like dogs, and the He family wanted to annex the Zheng army. By marrying the Prince of Huaiyin, the southern front would not be attacked from both sides.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Although Madame Ji relied on Zheng Fang, she always felt that Zheng Fang's actions were unpredictable. Her own son, Zheng Wuheng, was a decisive person, but he was only fifteen years old and too young to command respect. These thoughts, she could only confide in her eldest son.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Pei Shuo had followed Madame Ji when she remarried, and although Zheng Fang treated him well, he had heard plenty of gossip. But ultimately, he owed his position to the Zheng family, and he naturally hoped the Zheng family would thrive. Therefore, he told Madame Ji, \"Mother, rest assured, I will assist my brother well.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"You two have always been close since childhood, so I'm not worried. It's just that your sister is marrying far away. I have met the Crown Prince, and he seems gentle and refined, but the Prince of Huaiyin is another matter.\" Madame Ji had spoken confidently when persuading her daughter to marry, but now that her daughter was really leaving, she was worried.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Pei Shuo comforted his mother, \"Xuzhou isn't very far. If I have time in the future, I will visit our sister on your behalf.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Madame Ji nodded and also mentioned that Madame Xin had just given birth and needed to take care of herself.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Compared to the worries of Madame Ji and her son, Elder Madame Xu was displeased. \"Madame Ji is really partial. For the same daughter leaving the family, Huiyin’s dowry is clearly more than De Yin’s.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Her son was a fool and cared about nothing, allowing Madame Ji to take advantage and help raise her son from her previous marriage. Now her daughter was a princess, while De Yin was only a concubine, unable to even visit the palace.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">So, she deliberately didn’t inform Madame Ji and her daughter about the Prince of Huaiyin, nor did she seek help from the Xu family. She wanted to see how they would manage on their own in that place.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">**</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">The wedding procession left Jizhou City in just three to five days. Huiyin’s dowry included over a hundred servants. She specifically asked Madame Ji to find two female physicians to accompany her, drawing from past experiences.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Along the way, it was the General Yuwen Dang who made the arrangements. He was said to be the Prince of Huaiyin Li Cheng's most trusted subordinate. He was tall and sturdy, with piercing eyes, a brave general who seemed eager to return.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Huiyin’s personal attendants included her wet nurse, Nanny Nan, and four senior maids: Le Yun, Fugui, Qiufeng, and Dong Shun. Currently, only Nanny Nan was attending to her in the carriage. Nanny Nan had been with her since birth; her own children had died young, and she treated Huiyin like her own daughter.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Therefore, she was genuinely happy for Huiyin. \"I wonder if we are heading to Xuzhou or Jianye. If the wedding is in Xuzhou, it will be closer, and you can meet the groom sooner.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Under the red veil, Huiyin pouted. Meeting him sooner might not be better. She had no impression of the Prince of Huaiyin. Li Cheng had lost both parents at a young age and inherited the title. He was decisive and charismatic, quickly deciding to join his uncle. He certainly had people who had followed him since childhood, and their loyalty was not something an outsider could easily join.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">But she wasn’t concerned. There are no difficult tasks in the world, only those without determination.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"Nanny, I heard you’re from Qingzhou, right?\" Huiyin asked.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Nanny Nan smiled, \"Yes, when the Marquis was fighting in Qingzhou, you were born, and we were looking for a wet nurse. The lady found me. You stayed in Qingzhou for a while, then went to Xiaopei and then Yuzhou. You probably don’t remember much since you were so young, but once you became aware, you’ve been in Jizhou ever since.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Now that we’ve left Jizhou, I think we’ll rest at the Qingzhou inn.\" Huiyin estimated.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Nanny Nan was delighted, \"That would be great. You can freshen up; this journey has been exhausting.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Huiyin yawned, leaned on the pillow, and coquettishly said, \"Nanny, I want some ginger plum.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"Alright, I'll get it for you.\" Nanny Nan doted on the girl she had nursed since childhood.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">...</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">When the procession reached Qingzhou, Yuwen Dang personally approached the carriage and said, \"Your subordinate, Yuwen Dang, pays respects to the County Princess. Please rest at the Qingzhou post station for two days, and we will reorganize the carriages before continuing the journey to Xuzhou.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Yuwen Dang came from a prestigious family, and his father was loyal and brave. He looked down on Zheng Fang, who had previously been a lackey of Lu Ji and had turned against his master. Now, he bowed to the despicable Lu Wei. However, this marriage was arranged by the Prince of Wei for the Prince of Huaiyin. The Prince of Huaiyin had always despised Zheng Fang's character and disliked him, but the Prince of Wei needed to pull Zheng Fang in to deal with Lu Wei.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"Very well, I will follow the general's arrangements.\" Huiyin spoke with a lowered voice.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Not for any other reason, but her voice was so sweet that people might think she was deliberately speaking that way.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Upon seeing her descend from the carriage with the help of servants and maids, Yuwendang dared not linger and ordered the soldiers to keep a tight watch.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">After entering the inn, Huiyin had Nanny Nan take out some silver to buy food and drink for the guards. She then removed her hairpins and outer garments, feeling much lighter and able to move her neck more freely.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">She also freshened up. The food at the Qingzhou inn was average, but it was at least hot and fresh, much better than the snacks she had been eating on the road. Even the tastiest snacks can become tiresome after a while.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">This was her first long journey since growing up! The room she was given was the best in the inn, with the bedding and mats already prepared. However, Huiyin wasn’t sleepy, and as it started to drizzle outside, she began reading the *Book of Legal Cases* she often read.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">As a bride, she couldn’t go out and could only pass the time by reading.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">As dusk fell, Chief Administrator Guo Qishan and Yuwendang were dining together. The table had only a few meat dishes and a bowl of soup. After taking a bite of kidney, Guo Qishan couldn’t help but say, “We need to be extra cautious in Qingzhou territory.”</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">“Yes, outwardly relaxed but inwardly vigilant. If someone is reckless, I won’t hold back,” Yuwendang replied indifferently.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Currently, Qingzhou Governor Ma Kui has not yet openly opposed the Prince of Wei, but he was known for his greed and had risen from a bandit leader. It was said that in Qingzhou, even a dog wouldn’t be spared if it passed through. Now, with the bride’s dowry containing wealth, grain, and gold, how could the Ma family resist such temptation?</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">They had switched to land travel due to rough seas earlier, and sending Yuwendang to escort the bride ensured safety.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Guo Qishan nodded. “With the word of the Commander, I am reassured.”</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">After two days of rest, Yuwendang sent out scouts to survey the terrain. Huiyin changed back into her wedding attire, covered herself with a veil, and boarded the carriage.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Governor Ma Kui of Qingzhou was indeed envious of the wealth. In Qingzhou, he was notorious for plundering and committing all sorts of atrocities. Huiyin had heard of his reputation. It was said that when her father’s army initially won battles, they would loot. Later, after her mother married her father, she advised him that to truly win the people’s love, one must be benevolent. Because the Zheng family treated the people of Jizhou well, Zheng Fang was able to establish roots there and no longer fled after battles.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Huiyin was slightly worried, but she didn’t expect that another bride would also be traveling at the same time, heading from the capital to Wu Commandery. She was the daughter of a wealthy merchant, and her dowry was so extravagant that it couldn’t fit in her carriages.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Initially, one family would have been enough, but with two families traveling one after the other, Ma Kui, who had been somewhat deterred by the army of the Prince of Huaiyin, immediately sent his men to act. He fiercely declared, “If you succeed in the robbery, I will reward you handsomely. If you are caught, kill yourselves to avoid implicating your families.”</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Like attracts like, and Ma Kui’s men were all bold desperadoes. In these turbulent times, people would kill for food, let alone for such vast wealth and jewels.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Yuwendang’s group continued forward. The other bride, seeing their grand procession, had stopped under the trees to enjoy the coolness.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">However, as they moved further, they encountered a broken bridge ahead.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">The scout soldier said, “Commander, it seems we’ll have to take a small path.”</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">“No, not the small path. It’s densely forested, and people could be hiding inside. Have the Princess take shelter at the nearby Dizang Temple for now, and we’ll repair the bridge,” Yuwendang said with a smile.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">The rest of the wedding procession also volunteered to help. The other bride joined Huiyin in seeking shelter at the Dizang Temple. The temple’s abbot specially prepared a clean room for them. The two brides sat side by side, and their nannies soon started chatting.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">“Our young lady is the daughter of Boss Hu, who owns a wine shop in the capital. Our wine is only offered to the palace.”</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">“This year, when our marquis entered the palace, he was also rewarded with wine,” Nanny Nan replied.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">……</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">“Ahem, Miss Hu, my family name is Zheng. May I ask your age?” Huiyin initiated a conversation.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Miss Hu smiled. “I am sixteen.”</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">“Then I should call you sister. It seems we are quite fated,” Huiyin said.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">The two chatted quietly. When the nannies left, Miss Hu lifted her veil and said to Huiyin, “Sister Zheng, since no one is here, why don’t you remove your veil and relax a bit?”</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Miss Hu was quite a straightforward girl. Huiyin also removed her veil and looked at the other girl. She was a beauty, with a face like a full moon and eyes like stars, possessing both elegance and a hint of heroic spirit, which Huiyin couldn’t help but admire.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Miss Hu, seeing the daughter of Marquis Zheng, was equally struck. Huiyin’s face was like peach blossoms with dew, her eyes like autumn water, and her lips like cherries. She was a stunning beauty, and even her voice was enchanting. Miss Hu felt a bit weak in the knees, for Huiyin was truly a peerless beauty.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Huiyin took her hand and said, “Since you are younger than me, if you don’t mind, call me Sister Zheng. May I ask whom you are marrying? Have you met him before?”</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Hu Yanyan's expression darkened as she mentioned this, \"Certainly not. My family deals in tribute wine, and the better the grains, the finer the wine. The family I am marrying into is the largest rice merchant in Wu Commandery. This marriage was arranged to benefit our family's business. I heard he had a childhood sweetheart and was planning to propose, but he abandoned her to marry into my family for the alliance.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">\"Dear sister Hu, as the saying goes, it takes a century to share a boat ride, and a millennium to share a pillow. What we hear isn't always true. Perhaps you two are meant to be together? Besides, I see a unique heroic spirit in your eyes. His family holds you in high regard, and you might have a significant role to play there,\" Huiyin consoled her with a smile.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Hu Yanyan felt enlightened by these words, \"My mother died young, and my father is always occupied. He simply told me to get married and didn't discuss much with me. Sister, you are so kind. You always look on the bright side.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">\"Thinking positively makes life more joyful,\" Huiyin thought of her previous life, where she often remained optimistic, anticipating the dawn of victory and caring less about setbacks.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Hu Yanyan admired, \"Sister, you are the daughter of a duke and have married into a princely family. I've heard the Prince of Huaiyin is both scholarly and martial, extremely skilled in music. A perfect match of hero and beauty.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">\"Actually, I am just like you,\" Huiyin felt a little lonely.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Seeing Huiyin's loneliness, Hu Yanyan felt compassionate, \"Since we are so fated to meet, I am marrying into Wu Commandery, and you will likely settle in Jianye. We are not far from each other. Why don't we exchange tokens so we can stay in touch in the future?\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Initially cautious, Huiyin thought about how Hu Yanyan was marrying into a rice merchant family, which could be useful for forming a connection. She took a phoenix pendant from her waist and handed it to her, \"This is a dowry jade pendant. There is another one in my possession. If you ever need anything, just send someone with this token to seek me out.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Hu Yanyan also took out a jade token from her bosom, \"This was a betrothal gift from my fiancé's family. With this token, you can withdraw one hundred stones of rice from any Ruyi Rice Shop without needing to report it.\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">\"This is far too valuable,\" Huiyin declined. Though they connected instantly, their relationship was still new, and it was inappropriate to accept something so precious.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Hu Yanyan smiled, \"Sister, as the Princess of Huaiyin, if I told my father about this, he would definitely praise my abilities. Please don't refuse.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Only then did Huiyin nod and accept it. With this interlude, the two continued to chat and laugh, and time passed quickly.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Just after lunch, Yuwendang came to report, \"Earlier, several hundred bandits came to rob the dowry. Please rest assured, Princess, they have all been eliminated.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">\"General Yuwendang, you've worked hard.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">\"It is my duty, Your Highness.\"</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Huiyin asked again, \"Were there any casualties on our side?\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Yuwendang pondered for a moment before replying, \"Two were critically injured and are being treated, and another twenty have minor injuries.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Huiyin expressed concern, \"I have many medicinal herbs with me. They can ask Nanny Nan, who is by my side, for whatever they need. Additionally, the soldiers have truly been through a lot. I will provide ten thousand coins to compensate the injured soldiers. I will have to trouble General Yuwendang with this.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Yuwendang had initially held some prejudice against Zheng Fang, but hearing the Princess's articulate, generous, and considerate manner, he couldn't help but silently approve, \"Then I will thank Your Highness on behalf of the soldiers.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">\"It's nothing,\" Huiyin replied, comparing the gesture to the efforts they made to ensure her safety.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Yuwendang raised an eyebrow; ten thousand coins was a substantial amount. The fact that the Princess was willing to give so much to ordinary soldiers without hesitation made him think highly of her.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\"></p>\n</div>"
  },
  {
    "number": 7,
    "title": "Chapter 7",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 7</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Li Cheng◎ (Prince of Huaiyin)</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After passing through Qingzhou, it took only a few days to arrive at Xuzhou. Xuzhou has long been a strategic location for military contention. Originally, Lü Wei had briefly taken control of it. In his younger years, Lü Wei was fond of the lifestyle of a wandering hero. He often performed righteous deeds in places like Liangzhou and Suzhou, earning the admiration of the locals. Later, he achieved numerous military successes but was temporarily dismissed from his post. Fortunately, he received a recommendation from General Cui Xun of Boling, and with the opportunity, he quickly seized control of the court when the late emperor passed away and the current emperor fell ill.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">As Lü Wei entered the capital, he dispatched Wang Song to take control of Xuzhou. Wang Song was even more ruthless than the prefect of Qingzhou. He treated the military and civilians of Xuzhou like servants, built new terraces extensively, and abducted women, inciting public outrage.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Seizing the opportunity, the Prince of Wu sent the Prince of Huaiyin, Li Cheng, to capture Xuzhou. Though young, Li Cheng had grown up in the military and was skilled in warfare, often achieving victory through unconventional strategies. After driving Wang Song's army away, he garrisoned the area.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">He was twenty years old and had been stationed here for less than a year but already commanded great respect and authority.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">After setting up camp in Xuzhou, Li Cheng did not stay in Wang Song's mansion, finding it too luxurious and distracting. Instead, he chose the residence of the former Prince of Donghai County. The Prince of Donghai had been a brother of the late emperor, and his state was dissolved after his death due to the lack of an heir.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Huiyin was helped down from the horse by Nanny Nan and the servants, and she had to cover her head with a veil, preventing her from enjoying the scenery along the way. Everything here was unfamiliar to her, and Nanny Nan was not much more familiar with the place either. Although the mansion had assigned two elderly women to take care of them, they were not particularly close. One was Granny Chao, Li Cheng's wet nurse, and the other was Nanny Fan, who served the Empress Dowager Wu, the grandmother of Li Cheng.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Both women said, \"The young prince had been waiting here for the arrival of the princess for some time. However, an urgent matter arose in Xiapi, and the young prince led his troops there. He sent a message yesterday saying that it might be some time before he returns to finalize the wedding. In the meantime, please make yourself at home in the mansion, Your Highness.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Nanny Nan looked troubled, but since they were already on the prince's territory, everything had to follow the husband's arrangements.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin then settled in the mansion. The former Prince of Donghai had been fond of gardening, so the mansion was adorned with various flowers and plants in full bloom.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">She particularly loved the view outside the northern window. Not far away stood a large pear tree with pure white flowers that brought a sense of coolness in the hot summer. Next to the pear tree were a few green banana plants. To avoid monotony, vibrant crape myrtle flowers were planted under the window, dotted with elegant jade hairpins.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">These so-called neglects didn't matter much to her. Granny Chao and Nanny Fan were not particularly warm towards her, but they didn't show any deliberate hostility or bullying either. The daily provisions were ample, and her servants were well-arranged.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Nanny Nan, however, was quite anxious: \"Miss, is the groom still fighting in Xiapi? What if he doesn't come back? How can it be that a couple gets married but delays it? If things don't go smoothly from the start, the future may not go smoothly either.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">\"Mother, it's better not to rely too much on others. When my mother married Pei Shuo, they were deeply in love. She even rode to save someone while pregnant for him. But what happened later? How did Pei Shuo treat my mother? It ended in such a disaster. Too much love can lead to possessiveness, and that's when things go wrong.\" Huiyin, having experienced a past life, initially didn't know Li Heng's intentions and truly believed he had fallen for her at first sight. Later, she realized that all that sweetness was laced with poison, which led her to decisively plan her own course of action.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Nanny Nan sighed: \"Miss, you're still so young, but your thoughts are more insightful than many adults. However, you're just starting now; there might still be hope, right? Not every couple is the same, and not every man is like General Pei.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Huiyin smiled and shook her head, then reminded, \"In the future, you need to pay attention to the titles. In the land of Wei, the Prince of Wu is called Great King, and the Prince of Huaiyin is called Young Prince. You should no longer call me Miss or Young Lady; just call me Princess or Your Highness.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Titles are significant. Although she had not yet held the grand wedding or the ceremonial rite, they were already husband and wife in name.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">She didn't talk much with the people from the Prince of Huaiyin's mansion. Sometimes, maintaining a bit of mystery makes others wary of you. Once you start asking questions, you might reveal your impatience.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">No one is born knowing these things; only those who have made mistakes understand the need for change.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Before she knew it, ten days had passed. The servants who had come with her from the Zheng family were getting restless, but Huiyin remained calm and composed, reading a book while leaning on a couch. Today, it was Granny Chao who brought the meal, which was quite unusual.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Huiyin rose to greet her: \"Why are you the one bringing the meal today? My maids could have fetched it.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Granny Chao, who had been Li Cheng's wet nurse since his childhood, smiled and said, \"It's my duty to serve the master. I'm here today to inform you that our young prince has sent a message saying he will return in three days to complete the wedding.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">\"So the young prince is returning.\" Huiyin smiled but added, \"Granny Chao, you are the young prince's wet nurse. If he has any taboos, you must tell me so I don't accidentally offend him.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Granny Chao, with her kind and gentle demeanor, spoke in the soft tones of a southern woman, but her words carried a hidden sharpness: \"Princess, there's no need to worry. Our prince is a man of great tolerance and integrity, and he keeps his promises. Rest assured, I sincerely hope for a harmonious marriage between the young prince and you.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Huiyin didn't ask further, just said, \"Then I thank you for your kind words.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Granny Chao had expected Huiyin to ask more questions. After all, the young prince was quite the sensation among the girls and women in Wei. Some women would even go so far as to eat beans and fart just to get him to glance their way. But this princess of the Zheng family didn't seem as interested in the young prince as expected. Granny Chao thought perhaps it was because Huiyin hadn't met the young prince yet.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Once she meets him, she will surely be captivated.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Lunch was a local Xuzhou dish, and the Pengcheng fish ball soup was especially delicious. Huiyin, being a northerner, generally disliked river fish, finding them too fishy. Even with a dish like squirrel-shaped mandarin fish, she preferred it not too tender, fearing the fishy taste might remain.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">The fish balls were very refreshing to eat, made from silver pearl fish, with no fishy taste at all.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">She had an extra bowl, while Mama Chao was having her meal at the small table, secretly observing the etiquette of the young princess consort. Seeing that she ate without any pretension, enjoying her food with good posture, Mama Chao couldn't help but nod in approval.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">After Mama Chao brought this news, Nanny Nan and the others visibly relaxed.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Though it was said he would return in three days, Huiyin didn't actually expect Li Cheng to come back so punctually. However, Mama Chao and Nanny Fan began their preparations. They replaced the bed curtains with a new four-joy embroidered canopy featuring a qilin sending a child motif, adorned with pearls at the corners and long tassels. On the table, several ruyi scepters were placed, and next to it stood a peony-painted dressing table inlaid with gold. The armchairs and daybed were covered again with dragon-phoenix auspicious cloth.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">A pair of copper crane lampstands held two dragon-phoenix wedding candles as thick as a baby's arm. Even the wedding cakes had been bought.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"The young prince has returned, the young prince has returned...\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Huiyin was sitting nearby reading a book when she heard the servants in the mansion spreading the news. Before long, Mama Chao came in and said, \"Young princess consort, please freshen up and dress. This evening at dusk, the young prince will perform the wedding rites with you.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Nanny Nan had Le Yun and Fugui come over to help her with the hair and makeup. Perhaps because the wedding day had been delayed for too long, the Zheng family was determined to make sure Li Cheng saw their young lady, the most beautiful woman in Jizhou, in all her glory.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Her jet-black hair was neatly coiled up, with a pearl-inlaid golden mandarin duck hairpin with interwoven patterns in the center of the bun. On both sides were adorned with gold filigree gemstone hairpins, from which hung coral and jade tassels. Standing up, with the help of the servants, she changed into a double-layered crimson silk wide-sleeved jacket, the edges embroidered with gemstone pomegranates. Over it, she wore a hundred-birds-to-phoenix cape, paired with a twelve-panel hundred sons and hundred blessings skirt. The train of the skirt trailed five feet behind, embroidered with various colored beads, and her waist was adorned with a jade pendant that jingled softly as she walked.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">...</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">On the hot summer day, Li Cheng returned and, after a brief moment, handed over his duties to his subordinates. Only then did he remove his armor.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Ever since the campaign began, Li Cheng had always led from the front, charging ahead in battle. This time, he had taken an arrow to his right shoulder. Fortunately, the wound wasn't deep, but because he had galloped back, sweat had soaked the wound, causing some rot. Gritting his teeth, he had the military doctor come and change his bandages again.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">The military doctor, who had once been an imperial physician in the mansion, advised, \"Young prince, the wound must not come into contact with water. And please, don't wear such heavy armor anymore. Now that you've returned victorious, it's a good time to rest and recover.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Li Cheng pondered for a moment. \"I will remember what you said, Doctor.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Seeing the red decorations around, the military doctor lowered his voice further, \"Young prince, it's best to abstain from alcohol, and also... from marital relations. Wait until the wound has healed before...\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Li Cheng was taken aback.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">After the military doctor left, Mama Chao entered.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Clearly having overheard the doctor's advice, she quickly said, \"Young prince, should I speak to Princess Zheng? I'm sure she'll understand. Your health should be the priority. After all, this marriage was arranged by the Prince of Wei, and you didn't wish to marry her.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">In Mama Chao's eyes, after observing Princess Zheng these past few days, she seemed quiet and unintrusive. But still, Princess Zheng couldn't compare to the young prince she had nursed.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Unexpectedly, Li Cheng said, \"Mother, marriage is no trivial matter. In the future, I may have many women, but she will only have me as her husband. The wedding has already been delayed for several days. If we don't consummate the marriage now, how will others view her?\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">The author has something to say:</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Chao (second tone)</p><p id=\"paragraph-52\" data-paragraph-id=\"52\"></p>\n</div>"
  },
  {
    "number": 8,
    "title": "Chapter 8",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 8</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Newlywed Night Conversation◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The bridal chamber was adorned in a sea of red, and the quilt cover with a mandarin ducks playing in the water pattern was sprinkled with auspicious foods like longan, lotus seeds, and lily bulbs. Now, she was alone in the room.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huiyin really wanted to pull off the red veil herself, feeling rather bored.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Suddenly, she heard what sounded like kneeling outside, followed by a series of footsteps. The footsteps were steady, and Huiyin wondered if it could be Li Cheng.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Just as she thought so, she sensed someone approaching, and in an instant, the veil was lifted.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">The man opposite her wore a first-rank red brocade with python patterns and gold-thread embroidery wedding robe, with a gold-edged auspicious cloud belt around his waist. His ink-black hair was tied with a pure gold dragon crown, featuring flowing silk rosy auspicious cloud patterns, with two azure dragons encircling it. At the top was a precious gem, giving the impression of two dragons protecting the pearl, making him appear tall and noble.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Especially striking was his appearance, which was completely different from what Huiyin had imagined. He had peach blossom eyes, a handsome and somewhat rakish look, resembling those carefree playboys.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Thinking of this, Huiyin felt that one truly couldn’t judge a person by their appearance. This Li Cheng, who looked like this, was actually a devoted lover.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng looked at Huiyin with a different gaze. From afar, she was the epitome of a beauty from Yan and Zhao, tall, with an alluring figure, deep eyes, and a straight nose. Her small face and slender, long neck were as white as snow, like a flower of wealth and nobility. A single glance at her could make one’s mind go blank, temporarily forgetting everything.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">The two strangers exchanged a glance, and Huiyin stood up to perform a greeting: \"Little Prince.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Her voice was very coquettish, not forced but seemingly natural.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Li Cheng felt a bit uncomfortable upon hearing it: \"Princess.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Huiyin, who hadn’t seen him before, now found him even more handsome than Li Heng. At the very least, she felt a bit more at ease.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Just as they addressed each other, the lady of ceremonies came in to arrange for them to drink the nuptial cup wine. Huiyin rarely drank alcohol, as alcohol could easily deplete one’s health. Her father, who had indulged in concubines and alcohol over the past few years, had seen his vigor diminish.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Even for women, excessive indulgence could lead to physical weakness.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">She took a sip of the wine and placed it back on the table.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">After the lady left, they were alone again. Huiyin still didn’t know how Li Cheng felt. She feared that if she made the first move, she might be ridiculed for misinterpreting his feelings.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Fortunately, Li Cheng spoke up in time: \"I heard that there were bandits on your way here? Are you alright?\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"Oh, thank you for your concern, Little Prince. I’m fine. Thanks to General Yuwen’s meticulous arrangements, he first placed us in a temple. It rained at that time, and we hid from both the rain and the bandits. By the time we came out, the bandits had already been wiped out,\" Huiyin said with a smile.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Though her voice was coquettish, she spoke crisply and decisively. Li Cheng looked at her and nodded: \"I’m glad to hear that. These days I’ve been fighting in Xiapi, and it must have been tough for you.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Since he showed concern for her, Huiyin felt she should also show concern for him. Thus, she said: \"I’m fine, but Prince, you’ve been exerting yourself to the utmost. Have you been injured?\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Li Cheng pointed to his shoulder: \"I took an arrow here, but the wound is shallow, nothing serious.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Upon hearing that he was injured, Huiyin immediately said: \"Since you’re injured, why were you drinking just now?\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"Because it’s our wedding night,\" Li Cheng replied without thinking. Even though he might not be able to love her deeply, he still needed to respect her.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Huiyin looked at him seriously: \"Is it still bandaged now?\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Li Cheng nodded.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Huiyin looked at him: \"Since that’s the case, you can sleep on the bed tonight, and I’ll sleep on the cot beside it. Since you’re injured, you need to rest and recover properly.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Seeing her arrange things so quickly, one might think they were already very familiar with each other, but Li Cheng shook his head: \"No, you should sleep on the bed. I’ll sleep on the cot.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"That won’t do. If my parents found out, they would say I’m abusing you,\" Huiyin’s tender voice did not give in at all.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Most women who met him would be extremely respectful due to his status. However, Zheng was different. She was like a young girl, clearly pampered by her family but not spoiled. While he was away fighting, she showed no displeasure and didn't demand consummation. She quickly eased the awkwardness.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Li Cheng lowered his head. \"I can't let you sleep on the couch, can I?\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Huiyin smiled. \"Then we'll both sleep on the bed. It's big enough, and we won't touch each other.\" After that, she added, \"I'll go bathe and freshen up first.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">It seemed like she was relieved.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Strangely, Li Cheng had never met such a woman in his life. She had the knack for taking charge, even though it was Huaiyin Mansion, and he was the master.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Huiyin bathed and refreshed herself very quickly. She often felt that soaking too long made her skin swell like pork. So, after removing her hairpins and taking a bath, she came out. As she approached, Li Cheng glanced at her and then looked away.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Huiyin climbed over him and lay down on the bed, letting out a comfortable sigh. \"Finally, I can lie down. I'm so tired today.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">She really just wanted to sleep early that night. The issue of consummation wasn't a priority for her, especially since he was injured and needed to take care of his body.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">After saying that, she closed her eyes. But the fragrance from her body made Li Cheng's blood boil, keeping him awake.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Just as Huiyin was about to drift off, a shadow appeared over her. Li Cheng was on top of her, gently kissing her chin. This left her confused but also worried as she said in between breaths, \"Your injury...\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"It's fine. Tonight is our wedding night. If we don't consummate, what will people think?\" Li Cheng said, perhaps making an excuse.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">A princess from Jizhou who didn't consummate her marriage on the first night would become a laughing stock. Huiyin understood this well. The next day, specialized matrons would collect the ceremonial white cloth. If things didn't go well, the princess's authority would be compromised.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Li Cheng's hands moved gracefully, like butterflies in flight, sparing Huiyin much pain.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">After their first time, they called for water twice more. Worried his wound might reopen, Huiyin helped him change the bandage.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">As she tended to him, Li Cheng looked at her flushed face, extraordinarily beautiful, and cursed himself for being lustful. Thankfully, she believed him.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Huiyin was very skilled. She first cleaned the wound with strong alcohol, removing the blood and surrounding sweat and oils, before applying the medicine powder and swiftly tying the gauze.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Seeing her skill, Li Cheng couldn't help but ask, \"How are you so skilled at cleaning wounds?\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Huiyin, of course, couldn't tell the truth that she had often helped Li Heng, his nominal \"favorite concubine.\" Instead, she said, \"Naturally, because of my younger brother. He's a few years younger, and when he gets injured, I help him treat it.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">After finishing, Huiyin walked back to the bed but felt her legs weaken for a moment. Li Cheng saw this and couldn't help but smile.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">After they both lay down, Huiyin tactfully inquired, \"How many concubines do you have? That way, I can prepare appropriate gifts. I'm from Jizhou and not familiar with your family's rules.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Li Cheng quickly replied, \"I have no concubines. My parents have passed away, and I've been in mourning.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Huiyin was somewhat satisfied but asked again, \"Is there someone you care about deeply? I mean, a woman?\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">She was straightforward and didn't like beating around the bush. If Li Cheng didn't treat her well, she wouldn't hesitate to assert herself. She had no intention of pretending to be virtuous.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Li Cheng looked at Huiyin, surprised. \"Why would you ask that?\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Not receiving a direct answer was telling, so Huiyin playfully said, \"If you only want to be a nominal couple, we'll be polite and not interfere with each other. I'll be very considerate. But if you genuinely treat me well, you'll gain a beautiful and affectionate wife who will be devoted to you.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\"></p><p id=\"paragraph-56\" data-paragraph-id=\"56\"></p><p id=\"paragraph-57\" data-paragraph-id=\"57\"></p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p>\n</div>"
  },
  {
    "number": 9,
    "title": "Chapter 9",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 9</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Digging a Hole◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Granny Chao hadn’t slept all night, deeply worried. She spoke to Nanny Fan, \"The Little Prince is injured, and they called for water twice. I don’t know what to say.\"</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Originally, Granny Chao had no intention of informing everyone, because if Nanny Fan knew, then Grand Dowager Wu would know.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">The Grand Dowager is the grandmother of the Little Prince. Ever since the Prince of Wu and the Princess passed away, the Grand Dowager has been the only relative of the Little Prince. Now, she resides in Jianye and usually stays with the Empress Dowager of the Prince of Wei.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">But this new Princess Zheng has overstepped. If she didn’t know about the Little Prince’s shoulder injury initially, surely she must have noticed during their intimate moments? Granny Chao had thought she was a compassionate person, but it seems she’s more of an enchantress.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Nanny Fan, however, laughed and said, \"Granny Chao, the Little Prince's private matters are none of your concern. They are newlyweds; saying too much might backfire.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Hearing Nanny Fan say this, Granny Chao thought to herself that of course, this is what you'd wish for. If the Grand Dowager could catch some fault of the new Princess, she might be able to place the Grand Dowager’s niece, Xun Rou, by the Little Prince's side.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">This marriage of the Little Prince was a purely political union to ally with the Marquis of Jizhou. Otherwise, the Grand Dowager had wanted to marry her niece, Xun Rou, to him.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Xun Rou had been by the Grand Dowager’s side since she was seven. Back when the Princess of Wu was alive, she had wanted to marry her niece, Miss Cui, to him, but after the Princess passed away, the topic was never brought up again. If not for the Prince of Wei arranging this marriage with the Prince of Huaiyin, Li Cheng might have married Xun Rou.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">However, Granny Chao and the others were different. Their livelihoods were tied to the Little Prince, so they had to be more concerned.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Princess De Yin in the Eastern Palace was also quite pleased at this moment. The Crown Prince had bestowed silks and treasures upon her, while the Crown Princess received very little. Today, the Crown Prince said he would come to see her again, making her feel that she had made the right choice.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Lianzhi and Yunzhi were also happy. Lianzhi said, \"The kitchen has sent over your ginseng soup first, and Xiao Luzi said you can just tell the kitchen whatever you'd like to eat.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Yunzhi added, \"Miss, once you bear the Crown Prince’s first grandson, the Eastern Palace will truly be bustling.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">The first grandson—in her past life, her younger sister Huiyin became Empress Dowager by giving birth to a son. Speaking of Huiyin, she asked the servants, \"By this time, the second miss should have been married off to Xuzhou, right?\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Lianzhi nodded, \"Your servant estimates that she should have arrived by now.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">\"Miss, the Prince of Huaiyin was originally supposed to marry you, but the second miss took the chance,\" Yunzhi quickly added.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">De Yin smiled without saying a word. She would never forget how, in her past life, after marrying, she was neglected for many days and ridiculed everywhere. To make matters worse, Li Cheng returned injured, and Granny Chao secretly advised her not to consummate the marriage, as the Empress Dowager might scold her for being like Daji or Mo Xi, which would harm the Little Prince’s recovery. De Yin had listened.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">During Li Cheng's recovery, she began managing the mansion but was framed and could not defend herself. She was sent to Jianye.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">That place was like a den of dragons and tigers, and Li Cheng, a man who couldn’t distinguish right from wrong, had no feelings for her, unlike Li Heng, who doted on her exclusively. She would have to endure this marriage. No, she couldn’t think like that. Although Ji had committed many evil deeds, Huiyin had done nothing wrong.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Back in the bridal chamber, Li Cheng, hearing Princess Huiyin’s words, said, \"I naturally see you as my wife.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Huiyin knew they weren’t very familiar yet, so expecting vows of eternal love immediately was unrealistic, but she needed to express her stance. Seeing that Li Cheng’s response was just a formality, she didn’t press further and simply said, \"Then let’s rest early.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">The dragon and phoenix candles had to burn all night and couldn’t be extinguished, so Huiyin had trouble sleeping due to the light. But because she had been through so much that day, she was exhausted and, despite the light, fell asleep quickly.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">When she woke up the next morning, Li Cheng was no longer beside her. She rang the bell to summon the servants to assist her with her hair and makeup.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Unexpectedly, Granny Chao also entered, her expression unpleasant. Huiyin looked at her, unsure of what was happening, but she didn’t need to ask and simply pretended not to know. If she humbly sought advice, she might be manipulated.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Granny Chao saw the several maids surrounding Princess Zheng as they styled her hair and applied her makeup. Granny Chao still maintained some respect for the Princess. Once Huiyin’s makeup was nearly complete, Granny Chao finally said, \"Young Princess, I have something to discuss with you.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Huiyin pretended to understand and frowned slightly, \"I noticed you seemed hesitant to speak earlier. Do you have something to say?\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"Yes, Your Highness, I have an important matter to discuss with you,\" Granny Chao emphasized the word “important.”</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">\"Then please, do tell,\" Huiyin replied, dismissing the servants. Once they were alone, she said, \"What is it that you need, Granny? Please, have a seat.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Granny Chao smiled and said, \"The Young Princess has come from afar. Ideally, the wedding should have taken place in Jianye so you could meet the Grand Dowager Wu and the Prince of Wei and other relatives. However, the Little Prince is stationed in Xuzhou, so it has been quite an inconvenience for you.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"Mother, that's just a figure of speech. As the saying goes, 'a woman must follow her man, wherever he leads.' Don't worry, I don't feel wronged at all,\" Huiyin said with a smile, knowing that Granny Chao was being courteous before getting to the main issue.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">As expected, Granny Chao praised her, \"It's truly reassuring for us old servants of the Little Prince to have such an understanding princess.\" But then her tone shifted, \"However, the Little Prince is currently injured and needs quiet rest. We can't have both of you crowded in here, can we? This way, neither of you will sleep well.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Granny Chao thought she had already spoken quite tactfully.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Huiyin frowned and said, \"Indeed, I feel deeply sorry seeing the Little Prince's shoulder injury. Why don't you go and speak to the Little Prince? He can choose where he wants to stay. I have no objections. Actually, I told him yesterday that I would sleep on the pallet and let him sleep on the bed.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"How can I possibly say that to the Little Prince?\" Granny Chao immediately rejected the idea.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Huiyin thought to herself, if she's so good at talking, why doesn't she talk to Li Cheng directly? It's not that Li Cheng can't move on his own; why should his wife, who has only known him for one night, refuse him entry?</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Therefore, Huiyin directly threw the issue back to Granny Chao. Let her deal with the unpleasant task. Don't take me for a fool.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Granny Chao looked at Huiyin and realized this was a tricky situation. As a wet nurse, she shouldn’t meddle in the private affairs of the Little Prince and the young princess.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">What if the Little Prince wants to be intimate with his wife?</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Huiyin smiled and said, \"Granny Chao, let’s settle it this way. You go and speak to the Little Prince. By the way, the other day, since we weren’t officially wed, it wouldn’t have been appropriate for me to give you a reward. Today, I’ve specially prepared a generous gift for you.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Granny Chao looked at Huiyin and thought, this young princess is quite shrewd.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\"></p>\n</div>"
  },
  {
    "number": 10,
    "title": "Chapter 10",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 10</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Excessive Execution Power◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Little Princess, the Prince requests your presence in the main hall to introduce you to the court officials,\" Yun Hui said.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Yun Hui, daughter of Granny Chao, was different from her mother. She was very formal and precise. It was said that after her fiancé died, she chose to remain unmarried and bound her hair. She served as the head housekeeper, responsible for liaising between the inner and outer courts.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Huiyin glanced at Granny Chao, \"Mother, I will go then.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Granny Chao had unspeakable bitterness.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">At this moment, Li Cheng had changed into a dark blue robe embroidered with golden purple flowers, looking radiant and showing no trace of his injuries. He smiled as he looked at Huiyin, \"Princess, please come here, let me introduce you.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Huiyin nodded and bowed slightly before sitting down. Li Cheng introduced a man with a goatee beard, \"This is my military strategist, Jian Qin.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">\"Good day, Advisor Jian,\" Huiyin stood up and returned the greeting with a smile. Though Jian Qin looked like an ordinary, thin old man, being the first to be introduced by Li Cheng indicated that he was a trusted aide.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng then introduced Zhonglangjiang Yuwendang, General Guowei Zhao, among others. Yuwendang had a stern face and a tall figure, while Zhao was robust with a scar on his brow. There were also some civil officials, all of whom Huiyin met one by one.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin was very composed. She did not accept their courtesies with arrogance but instead only accepted half the courtesy in return. After meeting them, she did not steal the show but instead congratulated Li Cheng, \"Congratulations, Prince, on having such excellent and strong generals. You will surely have divine assistance in the future.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"Thank you for the auspicious words, Princess,\" Li Cheng smiled.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin said, \"I brought many specialties from Jizhou. Thanks to the Prince's grace, I have the opportunity to meet everyone today and have prepared some gifts for you. Please do not refuse them.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Li Cheng was unaware that Huiyin had prepared gifts. Of course, she had been preparing these gifts for several days, knowing well how her mother had managed her father's subordinates with great discretion.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">The gifts were not overly extravagant or unsettling but were specialties from Jizhou, including two boxes of walnut-patterned black dates, two boxes of donkey meat jerky, two jars of Congtai wine, a bundle of golden-thread noodles, six bolts of lock-stitch embroidered silk, and a piece of Dingzhou purple silk tapestry. The most eye-catching item was the filigree-inlaid golden guardian.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Though the guardian was only palm-sized, it was crafted using welding, filigree, and coiling techniques, modeled after a tiger with mythological variations, making it a lively and playful piece.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Li Cheng nodded secretly, acknowledging that although Princess Zheng was young, she was quite knowledgeable about etiquette.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">After the gifts were brought in, Huiyin took her leave, not really intending to stay and listen to their praises.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">The gift list was likely written by her personally, and her handwriting was also very good.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">By the time this was done, it was noon, and the food began to be served. One of Huiyin's good points was her appetite. Though she was from the north, she did not mind eating rice. Especially when the sauce of the crystal pork knuckle was poured over the rice grains, it was truly delicious.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">She was not as slender and delicate as the women of the Jiangnan region and appeared more plump. She did not diet intentionally but ate heartily.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Nanny Nan smiled, \"Miss has never been picky since she was young. Many of us can't get used to these southern dishes. They say the noodles have sugar, and the soy sauce is too much, but you eat them with relish.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Nanny, we shouldn't keep saying these things about the southerners. If the Little Prince hears, what will he think? North and south, aren't we all people of the same country? As for the dishes on the table, we eat more of what we like and less of what we don't. The Little Prince invited me to meet his subordinates today, showing that he respects me. In a few days, I will talk to him about adding another stove, and you can cook your own meals.\" Huiyin said.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Nanny Nan nodded hurriedly, \"We all have a better future following the Princess.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Huiyin lifted her chin, \"Of course, since we are married into Xuzhou, we must live a fulfilling and flavorful life.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">After the meal, she took a nap, and the room quieted down as the servants retreated.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Granny Chao was also somewhat troubled, \"Our new Princess is cunning. The Little Prince is injured, but she doesn't care at all. She just dismissed me.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Even sitting in a chair, Yun Hui maintained a straight posture, \"Mother, you should interfere less in the Little Prince's personal affairs. I understand you're concerned about his health, but if you talk too much, the Prince will become impatient.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">\"My child, I understand this reasoning, but our lives are tied to the Little Prince. If something happens to him, what will happen to us, a widow and an orphan?\" Granny Chao was worried both for herself and for Li Cheng.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">She blamed Huiyin in her heart. As a Princess, she indulged in pleasure and neglected the Little Prince. Granny Chao was determined to report this to the Dowager Princess.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Yun Hui comforted her, \"Don't overthink it. The Little Prince's injuries aren't serious. Moreover, I find that the young princess acts with integrity and propriety. Even the civil and military officials praise her.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">\"That's just flattery. Humph, I was truly concerned for her. If she were aligned with me, I wouldn't mind telling her some things. But she views her own kin as enemies. She may face dire consequences in the future.\" Granny Chao snorted.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Yun Hui was puzzled, \"What do you mean by that?\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Granny Chao looked at her daughter, \"Don’t you understand what I’m saying, or the Empress Dowager’s temperament?\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">The Empress Dowager Wu was originally a consort of the late emperor. After much hardship, she gave birth to Prince Wu, but Prince Wu was raised by the favored consort, Huang Zhaoyi, and was not close to his birth mother but to Consort Huang. Empress Dowager Wu deeply resented this situation. Later, when her daughter-in-law, Miss Cui, gave birth to a son, Li Cheng, the Empress Dowager wanted to raise him. But Miss Cui, from the prestigious Cui family of Boling and the daughter of General Cui Xun, refused to let Empress Dowager Wu take her only son.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">It was only after the deaths of Prince Wu and his wife that the Prince of Huaiyin and the Empress Dowager depended on each other, gradually forming a bond. The Empress Dowager hoped her niece, Xun Rou, would marry the Little Prince. Xun Rou could almost manage the household of the mansion in Jianye and even made efforts to remove any women who were slightly more presentable around the Little Prince.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">The Little Prince never rejected marrying Xun Rou, but as he was a filial son, he insisted on observing mourning before marriage, which led to his marriage with Princess Zheng.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">A sure thing had flown away. Naturally, the Empress Dowager wouldn't do anything to the Little Prince, but would she treat the young princess kindly?</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">……</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">The dinner brought was stewed quail, stir-fried chicken mushrooms, and deep-fried spring goose. As the meal was being set out, Li Cheng entered, and Huiyin hurriedly went forward to welcome him.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Li Cheng was somewhat curious, \"Which dish did you make?\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Huiyin was stunned for a moment. He was serious? She had only mentioned cooking casually. She said, \"I heard we’re supposed to sleep in separate rooms today, so I thought you wouldn't come over, and thus I...\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Separate rooms? Who said that?\" Li Cheng had no intention of sleeping separately on his wedding night. Today, his wife had generously rewarded his subordinates, so he had to come over.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Huiyin, of course, wouldn't mention Granny Chao. One shouldn’t create distance in close relationships. So she smiled, \"Then tomorrow I'll cook some soup for you. What do you like to eat?\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Li Cheng, thinking she had actually prepared something special today, joked, \"Do you think you can make whatever I like?\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"I can learn if I don't know how.\" Huiyin sat down with him, not finding it a difficult task.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Li Cheng nodded almost imperceptibly. Huiyin thought, no matter how ruthless a man is, there's a significant difference between having intimacy and not.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Additionally, she noticed something. Most people would delay tasks, but he wasn’t like that. He did what was expected during the wedding night, even with injuries. Yesterday, she casually mentioned cooking, and he immediately came over.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Well, she was the type to be decisive in big matters but procrastinate on small ones, even lazing in bed. Her new husband seemed to be someone with excessive execution.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\"></p><p id=\"paragraph-50\" data-paragraph-id=\"50\"></p>\n</div>"
  }
]