[
  {
    "number": 71,
    "title": "Chapter 71",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 71</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Second Part◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">When Huiyin learned that her father and younger brother had pledged their allegiance to Li Cheng and brought their families over, she summoned Xin Shi to discuss the arrangements for their accommodation.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">\"Ideally, I’d love to have my mother and the others stay at the mansion for company, but with Elder Madame Xu and Madam Xu also coming, it's a bit tricky. You know the situation at home; our Grand Dowager has never been satisfied with me, and if any trouble arises, it won't be good.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Xin Shi, having come from Jizhou to seek refuge under Huiyin's protection and benefiting greatly from her kindness, felt it her duty to help. Her daughter was also being educated under the care of her sister-in-law. Thus, she said, \"My husband is very filial. If he knew our parents were coming, he’d insist they stay here. But Elder Madame Xu has always been quite critical of us, and my neighbors, a widow and her family, live in a large estate. Just yesterday, they mentioned wanting to rent it out. I thought we might buy their house. I'll cover the cost.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin smiled and said, \"I can’t let you pay for this, Sister-in-law. As for the widow and her family, let's leave them be. It wouldn’t be right to ask them to move out; it could look like we’re taking advantage. I'll send Manager Qiao to find a five-courtyard residence with a garden. That way, they'll be comfortable and feel at home.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Since her father had handed over Jizhou to Li Cheng, even if she bought a residence for them, it wouldn't be an issue.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Xin Shi thought her sister-in-law was being overly cautious, not allowing any room for discussion. The widow and her family were probably eager to sell the property, but upon hearing it involved a widow, Huiyin preferred to look elsewhere rather than buy their house.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">However, it was precisely because of her sister-in-law's cautiousness and understanding of propriety that the prince held her in high regard. Not only did she keep peace within the household, but even when attending banquets outside, her husband mentioned that the prince only listened to the performers and gave them some money, never engaging in frivolous conversation with them.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"Since the princess consort has decided, let's proceed as planned,\" Xin Shi agreed, not wishing to say more.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">But she couldn't entirely shirk her responsibility to help her sister-in-law. Soon, Madame Cui, the wife of Zheng Wuheng, would arrive. She was Li Cheng's cousin, and since she was also the full sister of Huiyin's younger brother, their relationship was even closer. Xin Shi couldn't afford to be complacent.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">After finishing her tea, she smiled and said, \"Since Mother and the others are coming, it's best if Xianjie stays with me.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Upon returning, Xin Shi also sent some pear flower incense, which was a favorite in her mother's room. Huiyin understood this well. Xin Shi also included two sets of gold-woven silk clothes, likely intended for Madame Cui. As for Elder Madame Xu and Madam Xu, there wasn't much in the way of gifts.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Manager Qiao found a suitable residence in less than three days. When people heard it was for the princess consort's family, who wouldn't want to sell? Some were even eager to offer it, though a few tried to inflate the price.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Huiyin went out in a carriage to inspect the place and found one she liked, priced at 5,000 taels of silver. She added an extra 200 taels to keep the furnishings, purchasing the entire residence.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Nanny Nan couldn't understand, \"Princess Consort, even though you're concerned about Elder Madame Xu causing trouble, not receiving them at the mansion from the start—is that alright? You've even hosted Madam Pei at the mansion.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">\"You don't know. The Xu family of Donghai were originally affiliated with the Prince of Wei. After the prince passed away, they returned to Xuzhou. We don't know if they're genuinely here or if they’re here to gather information. If we let Elder Madame Xu and the Xu family stay at the mansion, they'll definitely visit, and we can't refuse them. If they planted any spies, it would be troublesome.\" Huiyin explained.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Nanny Nan hadn't considered this. She was mostly thinking about family dynamics.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Before the Qingming Festival, Madam Ji and the others arrived at the residence bestowed by Huiyin. Nanny Nan personally received them, \"The princess consort bought this residence in anticipation of your arrival. The best feature of this house is the well-tended flowers and trees in the garden. The main gate is centrally located, and the carved window frames in the main rooms are exquisite. The furnishings are all ready. After you’ve freshened up, there will be a welcoming banquet at the mansion.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"The princess consort still thinks of us despite her many responsibilities. How wonderful,\" Madam Ji said, reciting a Buddhist prayer. She thought her daughter was truly considerate. Now, living independently, she was still the head of the household, which made her feel much more at ease.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Nanny Nan warmly added, \"The princess consort specifically sent me to serve you. We'll go to the mansion together later.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">When they entered the residence, Elder Madame Xu, being of high seniority, was given the best courtyard in the east. The main courtyard had five small, delicate rooms with an additional three side rooms in the east and a back house. The steward of the residence smiled and said, \"The princess consort said this place is warm in winter and cool in summer, a perfect spot. The back house will be for Madam Xu, so you'll have someone to talk to.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">When Elder Madame Xu rested in the inner room, she found the bedding, furnishings, and clothes all ready, along with a huanghuali chest and a zitan wood bed. The curio cabinet was filled with various treasures, leaving her with no room for complaints. However, the back house where Madam Xu stayed had only three small rooms, furnished with red sandalwood that looked bright but wasn't of high quality.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">A servant girl named Qiuyan, known for her cunning ways, noticed Madam Xu's dissatisfaction and said, \"She’s not treating you with the respect you deserve. I just visited Madam Ji's courtyard, where there were beautiful flowers, rare animals, and trays of jade and pearl curtains. Your accommodations are only slightly better than Madam Ji's attendant.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"What can I do?\" Madam Xu wasn't foolish. Although she and Elder Madame Xu stirred up trouble, it was just to cause unease. If she had to confront Madam Ji directly, she knew Madam Ji wouldn't hold back.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Qiuyan secretly cursed under her breath before running out.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">As for Madam Ji, who loved lively gatherings and disliked solitude, she was delighted by the intricate flower basket placed on the flower stand—a woven grass basket filled with forsythia, weeping cherry, white peach blossoms, yellow roses, and dogwood, creating a beautiful and lively scene.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Nanny Nan, seeing Madam Ji's delight, smiled and said, \"The princess consort personally arranged this and sent it over.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">\"How is the princess consort?\" Madam Ji asked quietly, noticing the absence of others.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Nanny Nan sighed, \"The prince has been away at war for years, as you know. The Grand Dowager previously forced our princess consort to kneel. If only you were coming, the princess consort would have invited you into the mansion. But with Elder Madame Xu's temperament, if the Grand Dowager Wu found any fault, how could our princess consort maintain her standing in the mansion?\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Madam Ji slapped her thigh and exclaimed, \"You're right, I was so confused I didn't think of this. I don’t think Xu Shi needs to go. She has already left her husband's family, so why should she go? It would only give people something to gossip about.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Seeing that Madam Ji was on the same page, Nanny Nan nodded and quietly added, \"My biggest worry is that the Xu family of Donghai might be spying for someone. Elder Madame Xu and Xu Shi are both from the Xu family, and they might not be defensive towards them.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Madam Ji's expression turned serious.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Meanwhile, Huiyin had invited Xin Shi to accompany her and had also spoken to Grand Dowager Wu, asking her to come over. When Grand Dowager Wu heard that the Prince of Huaiyin had given Jizhou to Li Cheng, she prepared a few treasures to bestow upon others.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Originally, they had all relied on Prince Wei. If her grandson ever becomes emperor, this beautiful dream might come true, and she would become the empress dowager.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">The most revered woman in all of Da Ye, something she hadn't dared to imagine before.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">By the time Madam Ji and the others arrived, dusk had settled in. Miss Cui, wearing a pendant crown and a brocade robe, was supporting Madam Ji. When Madam Ji saw her daughter, she was momentarily taken aback.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Huiyin, however, started crying, \"Mother, I’m so glad you’re finally here.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Both Madam Ji and Miss Cui started crying as well. Madam Xin, holding her belly, came over to console them. Seeing her large belly, Madam Ji quickly asked, \"Guge’s mother, is it true that you're with child?\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"Yes, I'm just starting to show. Madam, have you seen my husband? He keeps saying he's unfilial, and there's nothing we can do,\" Madam Xin said while wiping her tears.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Madam Ji shook her head, \"No mother would ever blame her child.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Huiyin then spoke with Miss Cui and exchanged a few pleasantries with Elder Madame Xu so as not to appear cold towards anyone.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Let's go pay our respects to the dowager first, then we'll sit for the banquet.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Everyone went to pay their respects to Grand Dowager Wu, and then Elder Madame Xu, Madam Ji, and Miss Cui entered the main hall. They saw an old lady sitting in the upper seat, wearing a wide-sleeved ceremonial robe, with a jade pendant at the hem, a gold phoenix hairpin in her coiled hair, looking extremely dignified.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Grand Dowager Wu smiled and said, \"Please, don't stand on ceremony, relatives.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Elder Madame Xu bowed immediately and said, \"I have caused much disturbance by coming here, please don't take offense, Grand Dowager.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">After some polite exchanges, they took their seats as host and guest. Miss Cui, however, stood by her mother-in-law's side, unwilling to sit. Seeing this, Huiyin said, \"Today, you are a guest, there's no need to serve, please sit.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Only then did Miss Cui reluctantly sit down.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">The banquet had all kinds of delicacies, but Elder Madame Xu's thoughts were not on the food. Earlier, Madam Ji had decided that Xu Shi shouldn't come. She had chosen to remain silent because she couldn't afford to fall out with Madam Ji over such a trivial matter.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">If she privately asked Huiyin for help, she would definitely be turned down and would never agree. But if it were in front of Grand Dowager Wu, everything would be easier to handle.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">After the banquet, everyone rinsed their mouths, and Grand Dowager Wu spoke with the group.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Elder Madame Xu seemed eager to please Grand Dowager Wu. They were of similar age and both came from humble backgrounds, experiencing a sudden rise to wealth. From the capital to Xuzhou, they had a lot in common.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"The current performances in Shangjing are different from back then. The tunes are drawn out, and the ornamentations are gone...\" Elder Madame Xu said with a smile.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Grand Dowager Wu also sighed, \"I haven't been back to Shangjing for many years since my son was enfeoffed.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Seizing the opportunity when Grand Dowager Wu mentioned Shangjing, Elder Madame Xu subtly conveyed her intentions, \"You are truly blessed. Prince Wu is filial, and the Prince of Huaiyin is extraordinarily brave. Nowadays, everyone admires the Prince of Huaiyin. Even my granddaughter, who married the crown prince as a Liangdi, feels that the crown prince doesn't amount to much. If only we could bring her here, it would show the world that righteousness brings many supporters, while injustice brings few.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\"></p>\n</div>"
  },
  {
    "number": 72,
    "title": "Chapter 72",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 72</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Double Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">As soon as elder Madame Xu spoke, Hui Yin sneered. She thought to herself that there really was a kind of fate between people. Elder Madame Xu wasn’t even this attentive to her own son, let alone her granddaughter. If she were really thinking of Zheng Fang, she shouldn’t have said something like that at this moment.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">By saying these words in front of Grand Dowager Wu, she was clearly implying that Zheng Fang was hedging his bets.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Sure enough, Grand Dowager Wu was displeased and found elder Madame Xu absurd. Just as she was about to say something, Hui Yin continued, \"Elder Madame Xu, aren't you putting the prince in a difficult position? The prince is acting on behalf of the people of the world; how could he possibly take the Crown Prince's wife? If you're really worried that my elder sister will be tormented because her father has sided with our prince, we will do our best to find out in the future. But speaking like this now, how will people gossip about our prince?\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Elder Madame Xu often did inexplicable things for the sake of De Yin. After hearing everything, Grand Dowager Wu felt that all the heroes of the world were fighting for her grandson, but they were tarnishing their reputation over some woman.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Your Zheng family’s women are unwanted. There’s already a granddaughter-in-law with the surname Zheng, keeping her grandson away from the light of day. Now another Zheng woman is coming. Is there no way to live?\" Thus, she continued, following Hui Yin’s lead, \"Exactly, Elder Madame Xu, just wait for the future.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Elder Madame Xu didn’t expect Hui Yin to frame the rescue of her sister as if it were for De Yin’s sake, and that Li Cheng’s reputation would be tarnished. Hui Yin was deliberately using reputation as an excuse, which also showed that she knew De Yin had always been better than her. If De Yin were to leave the palace, she would be uneasy.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Just as she was about to say more, Madame Ji interrupted and quickly changed the subject. She deeply resented her mother-in-law. If you love De Yin so much and are willing to accompany her, why didn’t you go to the Eastern Palace with her? You left more quickly than anyone else, afraid they wouldn’t bring Xu Shi along.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Grand Dowager Wu, being elderly and lacking in spirit, sat for a while before showing signs of fatigue. Seeing this, Hui Yin had Nanny Fan arrange for her to be carried back in a sedan chair.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">She then sent someone to escort elder Madame Xu to the guest room and stayed behind to speak with Madame Ji and Madame Cui.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Madame Ji thought Hui Yin would speak ill of elder Madame Xu, but instead, she asked, \"How has Shi Chong become so powerful now?\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"Let’s not even discuss it. He even provoked your father, who took up the challenge and didn’t think much of him, only to be defeated. Afterward, he kept provoking, and your father also said that Shi Chong was behind the bandit troubles in Jizhou. He did it on purpose.\" Madame Ji was still somewhat angry as she spoke.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Hui Yin, however, remained calm. \"If you're not as skilled as someone, it's not about intentionality. I think Shi Chong alone doesn’t have that much capability; the Crown Prince must be supporting him behind the scenes. Now that Father and the brothers are preparing to follow the prince, they shouldn’t have second thoughts. Otherwise, even I won’t be able to help them.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">She understood her father’s character very well. If he truly had the strength to look down on the world, that would be one thing, but if not, and he wavered again, she wouldn’t be able to control what would happen to Li Cheng in the future.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Madame Ji was greatly alarmed and quickly said, \"Daughter, don’t worry, your father definitely won’t.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Cui Yuehua had always thought that Hui Yin was sharp and commanding, not one to be submissive. Seeing her now, having arranged everything properly and speaking with an air of authority, even speaking bluntly about her own parents, Yuehua didn’t dare to say a word more.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Seeing her mother agree, Hui Yin nodded. \"It’s late today. You can stay overnight at the mansion and have breakfast tomorrow before returning to organize things. I also have some items to send over.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"Thank you, Princess,\" Madame Ji quickly replied.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">After finishing the official matters, Hui Yin smiled and said, \"Mother, why call me Princess? Privately, just call me by my name. Just now, with the two elders present, we couldn’t relax. At this time, I’ve specially arranged for someone to prepare yogurt, melons, fruits, and pastries in the small hall. Let’s go and have some more, and we can have a good chat.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">They strolled through the garden, passing by fields of peonies, rose trellises, and fragrant wooden pavilions. The breeze brought the scent of flowers, and after passing a screen wall, they saw lush green bamboo, towering pines, pavilions, and buildings, a picture of wealth and prosperity.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Madame Ji noticed that after her daughter led them into the main courtyard, she had someone lock the gate and said, \"Why is it locked at night?\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Usually, a few old women would be enough to watch over it.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Hui Yin said, \"My husband has been away from home for a long time. If the doors aren’t secure, something might happen, and the servants will surely gossip. As they say, human words are to be feared.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Despite having two children, Li Cheng’s rising status meant many sought to find fault with her, offering themselves to him.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"I see, now that we’re here, you’ll have a helping hand,\" Madame Ji thought of how her daughter had married far away and had to be cautious because she lacked assistance.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Hui Yin led Madame Ji and her daughter-in-law to the steps and inside, where red candles were lit, as bright as day.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Cui Yuehua noticed the light and shadows moving on the walls and, upon closer inspection, saw two glass lanterns.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">On the table were six elegant silver platters, each holding a large bunch of purple grapes, yellow golden oranges with green leaves, egg-sized lychees with mist still rising from their red shells and white flesh, sliced white pears, two other fresh fruits, a platter of dried meat, another of dried fruits, and several fashionable pastries.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">They sat according to rank, having just eaten a greasy banquet, and now the fresh fruit dishes were very refreshing.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Huiyin asked Miss Cui, \"How is my nephew?\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Miss Cui immediately put down her chopsticks and replied, \"He’s doing well, thank you for asking, elder sister.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"Guge is studying, and your child is still young, so take good care of him for now. By the way, how is Erlang treating you?\" Huiyin asked with a smile.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">There was no need to elaborate on her close relationship with Zheng Wuheng; she simply said that her husband treated her well, especially in front of Huiyin's elder sister.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">After drinking a cup of yogurt, Huiyin said, \"Now that Erlang has gone to fight with your brother-in-law, you should stay at home and take good care of your mother-in-law. If you want to have some fun, just come over to my place.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">When she mentioned Miss Cui earlier, Xin Shi’s reaction was awkward, so Huiyin knew there was some discord between them. She didn’t suggest Miss Cui go to see Xin Shi but instead invited her to come here for fun. Xin Shi and Miss Cui were sisters-in-law, and it was normal for them to not get along. Otherwise, why would her brother have traveled so far to seek refuge with her? However, she and Zheng Wuheng got along very well. Relatives who lived apart often maintained a closer bond, but too much proximity could cause problems.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Hearing this, Miss Cui quickly agreed and offered some flattering words.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Madame Ji, having drunk a cup of wine, felt tired and instructed Huiyin, \"In a few days, when I’ve settled things, I’ll invite the princess and your children to come over for a visit.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"I will definitely go. With you and my sister-in-law here, I won’t feel lonely anymore. Let me first explain the situation with the officials' families in Xuzhou to you...\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">They talked for half an hour before resting.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">The next day, after arranging breakfast, Madame Ji, Elder Madame Xu, and Miss Cui went home together.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Elder Madame Xu had not slept well and, upon returning home, spoke to Xu Shi about it. \"I suggested bringing Deyin back, but the second girl disagreed and spoke quite harshly. I see that Grand Dowager Wu is not a manager. The entire Huaiyin Mansion is essentially run by the second girl.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Alas, it's truly 'when it rains, it pours,'\" Xu Shi replied helplessly.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Similarly, Xie Jiuyi, upon learning that Wei Duo’s forces had advanced without warning, also mobilized his troops. With the passing of the Guo brothers, some civil officials feared Wei Duo. Some suggested that the Prince of Yuzhang should surrender to Wei Duo since the Weis were related by marriage. Others proposed surrendering to the Prince of Huaiyin.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">As the discussion heated up, they heard that the brother of Xu Cifei had surrendered to Wei Duo, bringing the second son of the Prince of Wei with him.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">It was one disaster after another.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Upon seeing Xie Jiuyi return and prepare for another campaign, Yin Liyi said, \"My lord, the people in Jianye are uneasy. With our vast territory, why are they even considering surrender?\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">\"Alas, although I assist the Prince of Yuzhang, I am not the prince. If the master cannot command respect, I have no choice but to take on more burdens,\" Xie Jiuyi replied. He had previously rejected the Cao family’s money for his own reasons but ended up losing both his wife and the battle. Later, many heard that Li Cheng’s attack on Yanzhou was supported by the Cao family, who said he shouldn’t have lost his composure over a woman.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Yin Liyi didn’t think much of it; she believed that if Li Cheng could defeat Wei Duo, her husband should at least be able to hold him off. She began packing again.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">However, Wei Duo was well-prepared to attack Jianye. For now, he couldn’t move against Li Cheng, as Jizhou was now under his control, with many capable subordinates. The Prince of Yuzhang was just a child; if not now, when? He could also take Jingzhou in the process.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Once relatives, the Prince of Wei had now become an enemy after his death.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Although Yin Lifang had her brother-in-law’s help, she was still very afraid. Yin Liyi comforted her elder sister, \"Why are you so scared? With your brother-in-law here, he will drive Wei Duo away.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"War is very unpredictable. If we can’t hold this territory, I will have failed the Prince of Wei,\" Yin Lifang said, wiping her tears.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Her skills were limited to the inner chambers, and she knew nothing of war. Now, her only reliance was Xie Jiuyi. He was trustworthy, but if something were to happen, she wouldn’t know what to do.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">The two were like headless flies. Meanwhile, Li Cheng, along with Zheng Fang and Pei Shuo, confronted Shi Chong’s army. After an initial battle, Shi Chong realized that Li Cheng and Zheng Fang’s military discipline was very different from his own. Li Cheng commanded his father-in-law with ease. Under Li Cheng’s leadership, Zheng Fang became more organized. Shi Chong held a small territory and reported to the Crown Prince. Li Cheng didn’t prolong the battle and returned to Xuzhou with his father-in-law and others.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">A month later, when he returned, Huiyin had accepted an invitation from Madame Ji to visit the Zheng family for a drink and attended a wedding banquet at the Xue family.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">After Xue Huanhuan finished her mourning period, the Xue family found her a match. With a substantial dowry and her beautiful appearance, she married well.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">As long as a woman had some money, a good family background, and family support, life would generally be good.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">When Li Cheng returned, it was the height of summer. Huiyin had originally planned to send Grand Dowager Wu to a villa to escape the heat, but the Grand Dowager Wu was too lazy to move. Huiyin had a shaded pavilion built in front of the Grand Dowager Wu’s room, decorated with rose and grape vines, creating an interesting and pleasant atmosphere. The Grand Dowager Wu was delighted and began spending her evenings cooling off under the pavilion.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">However, Huiyin didn’t expect the old woman to speak well of her. Once Li Cheng returned, they would be in opposition again.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Upon hearing that Li Cheng was back, she hurriedly ordered the servants to prepare a banquet and changed into a new outfit to welcome him personally. This time, Li Cheng had managed to reclaim most of Jizhou without much difficulty.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">“Huiyin,” seeing her welcome him made him feel even more comforted.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Smiling, Huiyin walked alongside him and said, “I didn’t expect you to return so soon. My grandmother and mother have come over and bought a new house for them to settle down.”</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Li Cheng asked, “Is the house good? For your father-in-law and mother-in-law, it must be a fine residence.”</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">“Rest assured, it is a five-courtyard house with a garden. It was previously owned by a former governor, and I have renovated it,” Huiyin replied.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">The couple entered the house together, and Li Cheng took out several ledgers from his bosom. “These need to be brought in overnight. A large sum of money was spent from our internal treasury for the war in Yanzhou last time.”</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Though Li Cheng usually spoke in a bold manner, he was actually very meticulous.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Huiyin nodded, “Don’t worry, I will keep them safe.”</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">After changing his boots and clothes, Li Cheng spoke to Huiyin again, “Do you know who is behind Shi Chong? It’s the Crown Prince causing trouble. He supplied those bandits with good weapons, allowing them to loot the people. I disapprove of this, so I attacked a few of their hideouts. However, Shi Chong is clever; after occupying a small piece of land, he stopped fighting. I’ve been at war for many years, and you advised me to rest and recuperate, so I didn’t pursue him further.”</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">“I agree. As the saying goes, preserving our strength is key. We already control a large amount of land, and if we can govern it well, it will become impregnable in the future,” Huiyin said, glad that Li Cheng wouldn’t have to go out to battle recently.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">The couple’s harmonious relationship needed no further mention.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">The next day, Li Cheng attended a victory banquet at the military camp, introducing his father-in-law and brother-in-law to everyone. It was Zheng Fang’s first time at Li Cheng’s military camp, and although the others joked, they didn’t dare to be presumptuous.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">It was said that alcohol was only allowed during celebrations after a victory. Each person attended to their duties without disobeying orders. Zheng Wuheng had always been close to Li Cheng, and after this war to reclaim Jizhou, his admiration for his brother-in-law grew even more. He was able to fight side by side with his brother, and the two of them came together to toast Li Cheng.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Li Cheng drank a cup and said with a smile, “In the future, let’s all work together in the military.”</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Pei Shuo and Zheng Wuheng responded in unison, “Yes, sir.”</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">As for Zheng Fang, he got drunk and was helped home by his two sons. He had contributed significantly, but he was like a spent arrow, not taking care of himself. He had held out outside but collapsed once he returned home, falling asleep on Madame Ji’s bed.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">With a hot towel on his face, Madame Ji scolded him, “You drank until your face was red. Your son said he couldn’t even persuade you to stop.”</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">“Ah, I finally feel relieved. I don’t want to waste my energy thinking about whether to shamelessly ask my son-in-law to give me Jizhou,” Zheng Fang said, feeling a bit more sober after removing the hot towel.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">When Zheng Fang brought up his recurring thoughts, Madame Ji remembered Huiyin’s advice and quickly said, “Our daughter said that if you keep changing your mind, even she won’t be able to help you.”</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Zheng Fang, flustered, said, “When have I changed my mind?”</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">“One must accept aging. Since you can no longer be as active as before, relying on your son-in-law is not a bad thing. He is a distinguished figure, of royal lineage, a legitimate member of the Li family,” Madame Ji advised.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">If anyone didn’t want to stand independently, Madame Ji often talked about wanting to return to their hometown with Zheng Fang, but in reality, they couldn’t really leave their daughter’s side.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Zheng Fang understood, “Ever since I entrusted these matters to my son-in-law, I’ve felt much lighter. Before, I was so worried I couldn’t sleep. I thought it was due to drinking and indulgence, so I abstained for a few days, but it didn’t help. Now, I truly feel much lighter.”</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Madame Ji smiled, “We’re old, and it’s time to leave things to the younger generation. Rest well.”</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Seeing her husband become more alert after drinking the tea, Madame Ji said, “You don’t know, last month when we first arrived, your mother mentioned to the Empress Dowager about asking our son-in-law to save De Yin. I know De Yin is her favorite, but the Empress Dowager already has some reservations about Huiyin. If she finds out you’re playing both sides, what will happen in the future? Although our son-in-law treats our daughter well now, he will gain more power and have many beautiful women around him. Even small mistakes might be magnified. The other day, I invited De Yin over for a drink at our house. I know she is cautious and has prevented many disasters, saying that with us here, she has support.”</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">In fact, Huiyin had always been very insightful and opinionated. She could manage household affairs for Madame Ji and was capable of riding horses and composing poetry outside. She often hit the mark with her words.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Although Zheng Fang had sons, Zheng Wuheng had always been childish and wasn’t as steady and incisive as his sister.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Now that their entire family had turned to their son-in-law, it wasn’t a random decision. Naturally, they relied on their daughter, and there were benefits to it. Now hearing Madame Ji’s words, he asked, “Why did mother say that?”</p><p id=\"paragraph-88\" data-paragraph-id=\"88\"></p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">\"Mother only cares about De Yin. When this marriage proposal came, we hadn’t even said anything, but the elder Madame Xu had already taken the eldest miss there without hesitation. I didn’t expect that this time, it was the Crown Prince behind the mischief. We’re barely holding on ourselves, and now we’re relying on others. What right do we have to make demands? Even if you hadn’t offered Jizhou, Shi Chong might have taken it anyway. Rather than that, it’s better to give it to our righteous son-in-law.\" Madame Ji spoke frankly, expressing her thoughts directly.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">They had come to rely on others because they couldn’t manage on their own. What right did they have to control De Yin?</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Zheng Fang sighed, \"Even if we want to save De Yin, it will have to be in the future. I don’t have any methods now.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Madame Ji sneered, \"Your ears are always soft. Let me tell you, don’t be foolish now. We don’t have the ability to take people from the Crown Prince.\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">\"Alright, alright,\" Zheng Fang said.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">The next day, he went to pay his respects to elder Madame Xu again. He saw Xu Shi standing before the elder Madame Xu, serving her. Xu Shi wore a bluish-purple vest and had a bridge-style hairpin in her hair, with two jade bracelets loosely worn on her wrists. Zheng Fang, who had many wives and concubines, could easily see that Xu Shi had deliberately applied makeup. Yet, he sat there, unmoved.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">It wasn’t just because Xu Shi was older—though that was part of it. It was because seeing Xu Shi reminded him of Madame Ji. Madame Ji had once threatened to hang herself when he considered taking Xu Shi back at the elder Madame Xu’s behest.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Though she appeared calm now, Madame Ji had a fiery temper. She didn’t mind his other concubines but disliked Xu Shi, saying she wasn’t a good person.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">There was tension between elder Madame Xu and both Madame Ji and Huiyin, but she spoke frankly to her son.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">\"Your heart has no place for your eldest daughter. We’ve all left, yet we’ve abandoned her there alone. Is this how a father should act?\" Elder Madame Xu, as Madame Ji had predicted, brought up the old tune again.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Zheng Fang rubbed his temples and said, \"Mother, if I had the ability, would I be relying on my young son-in-law at my age? Begging for a living behind him?\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Elder Madame Xu’s eyes flickered with irritation. This was the old Zheng Fang—someone with ambition but raised in the marketplace, always honest. He had only started putting on airs after gaining power. Now, it seemed he had reverted to his former self. She was a strict mother. In the past, she would have scolded him for being useless. But now that she was old and had to rely on him, she could only gently advise, \"We haven’t reached such a point yet. You are still a local ruler.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">\"I’m not anymore, Mother,\" Zheng Fang said, and then took his leave.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">As soon as he left, Elder Madame Xu jumped in anger. \"Look at him, a spineless coward who’s afraid of his own wife!\"</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Xu Shi felt a pang in her heart. She was his wife, after all!</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">The aunt and niece were helpless.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">As for Zheng Fang, not wanting to return to the house and face Elder Madame Xu’s nagging, he went straight to Pei Shuo’s place. Seeing Zheng Fang arrive, Pei Shuo had Xin Shi invite two singers over and prepared a feast for the two men to dine together.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Zheng Fang, burdened with many worries, could only vent to Pei Shuo, who lived a simple life with his family. Pei Shuo, having come to rely on his sister, was wholeheartedly working for Li Cheng. Hearing Zheng Fang’s concerns, he said, \"Father, why bother with her? If the prince truly ascends the throne one day, my sister will be the empress. If our elder sister has the fortune, she will naturally be taken care of. If the prince fails, we’ll all be prisoners. It’s better to side with the Crown Prince then.\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">\"Good son, that’s truly enlightening,\" Zheng Fang said, feeling no guilt at all.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Compared to Zheng Fang, who would soon shake off any pangs of conscience and feel no psychological burden, most people were different. Li Cheng was a normal person. Though he had set up his own household, he was still worried when he heard that Xie Jiuyi’s messenger had been injured by Wei Duo.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">\"I’m worried that Xie Jiuyi won’t be able to hold his ground. It’s likely that the Prince of Yuzhang won’t live much longer,\" Li Cheng sighed deeply.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Huiyin handed him a pair of silver-white silk shoes embroidered with cranes and thought of Li Jing. \"It’s also pitiful. When the Prince of Wei was alive, he didn’t favor him much. If it weren’t for you saving him last time, he might have passed away. I believe those who survive great trials are destined for better things.\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">\"Yes,\" Li Cheng said. \"This time, I can only stand by.\" Though he had once been a retainer of the Prince of Wei, he now had no choice but to stay out of it. He also needed time to recover. His army couldn’t keep fighting endlessly.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Huiyin smiled, \"Though you look down on my father, sometimes we should learn from him. Not everything needs to be forced.\"</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">Hearing this, Li Cheng also laughed.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Recently, after hearing that Zheng Fang couldn’t stay at home due to Elder Madame Xu’s constant nagging, he went horseback riding to tour the scenery of Xuzhou, still living in great comfort, calling for attendants and servants. He even found Madame Ji’s six-square hat not beautiful enough and specially borrowed a gauze hat from Li Cheng.</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">The author has something to say:</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">Everyone may criticize Zheng Fang’s attitude, but they secretly admire how carefree he seems.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\"></p>\n</div>"
  },
  {
    "number": 73,
    "title": "Chapter 73",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 73</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Chapter◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Xie Jiuyi was indeed unable to hold on any longer. Xu Cifei had been very skilled at winning people's allegiance in the past. Her brother claimed to have a personal letter from the Prince of Wei, declaring support for the Prince of Wei’s second son, Li Zhi. At that time, some people who had been dissatisfied and hadn’t gained any benefits under Xie Jiuyi’s leadership once again defected to the Xu family. They even received many promises from Wei Duo. As long as they worked together from the inside, they would help Li Zhi become the heir.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Most ordinary people might find this hard to believe, but there were many who would take risks for official positions and wealth.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">This was why Xie Jiuyi lost this battle.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">There were too many traitors!</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Yin Liyi helped Xie Jiuyi apply medicine and was anxious. \"A bunch of ungrateful people. They think they’ll gain something by siding with Wei Duo, but they’re just being used.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"Why get angry, Liyi? I have a plan. Why don’t you go to Yangzhou with the Prince of Yu? If Jianye falls, we can retreat there.\" Xie Jiuyi had already begun planning.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Yin Liyi shook her head immediately. \"I won’t go. I’ll be wherever you are.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">She didn’t want to leave him, but Xie Jiuyi reminded her, \"You were captured before. What if it happens again and they use you against me?\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"That was an accident. I’ll be very careful this time,\" Yin Liyi pleaded.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Xie Jiuyi finally relented. \"Alright, but the Prince of Yu and your elder sister must leave.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Yin Liyi nodded, determined. \"I’ll go talk to them now.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">She conveyed Xie Jiuyi’s message to Yin Lifang, who hesitated for a moment but eventually agreed. She then said to Yin Liyi, \"Why don’t you come with us? Let’s leave together.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">\"Sister, what are you saying? I want to stay with my husband. I’ll entrust my children to you.\" Yin Liyi had always known she wasn’t very clever, but if Wei Duo really attacked, she would stay by her husband’s side. To her, it was a matter of honor and duty.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Yin Lifang stared at her in disbelief. \"You were captured before, and now you’re willing to risk it again? You can’t fight, and you’ll only get in the way. Please come with us.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Yin Liyi shook her head. \"Sister, I’ve never been as smart as you. If I go to Yangzhou, I’ll just worry for nothing. It’s better for me to stay in Jianye. My husband has promised to find a child around Jing’er’s age for me to raise in the Prince of Wei’s Mansion. That way, no one will know you’ve left.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Yin Lifang finally understood her younger sister’s thoughtful intentions and was deeply moved.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"Maybe we should all stay,\" Yin Lifang suggested, feeling guilty.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Yin Liyi shook her head firmly. \"Sister, you’ve always taken care of me. Now it’s my turn to take care of you.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">That night, Yin Lifang left with her son for Yangzhou.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Xie Jiuyi continued to fight, while others watched from the sidelines.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">After returning, Li Cheng wasn’t at ease either. With his expanded territory, he couldn’t manage everything personally anymore. He had to think about the bigger picture. Rewards for merits and punishments for crimes had to be balanced, but he couldn’t let small flaws discourage his deserving officials. He was kept extremely busy.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">He also recruited a group of advisors to handle specific matters. Liu Gongzi, who had been introduced to Miss Cao, was also recruited under Li Cheng.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">These advisors were paid directly by Li Cheng, and he was discussing the external accounts with Huiyin.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"Draft a list, and I’ll handle the seasonal provisions,\" Huiyin said.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Li Cheng nodded. \"I actually want to model it after the imperial court, using the Three Departments and Six Ministries system to manage this place. That way, even if I go on a campaign, things here can still be managed.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Huiyin agreed. \"That makes sense. The Three Departments and Six Ministries balance each other. Even if you’re not here, there will still be people to handle things.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">However, talented individuals were hard to find. Li Cheng personally prepared for civil and military examinations, not accepting any recommendations.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Knowing that Li Cheng was strict and unapproachable, many turned to Huiyin for help. Madam Mu, who had always been close to Huiyin, came to recommend her youngest son, Munián.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">At first, I didn’t want to come, but they insisted I speak to the princess. \"My youngest son may not be perfect, but he’s as loyal as they come.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">In such matters, Huiyin must remain in high alignment with Li Cheng. She said, \"I have long heard that young Master Miao is quite talented. This time, the prince is using a blind selection process, and he will surely appoint people based on their talents.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Madame Miao didn’t dare to blame Huiyin for not putting in a good word. Now that the prince’s territory was growing larger, many people couldn’t even get an audience, so she was lucky to have met with him.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">So, she quickly said, \"Yes, you are right.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Huiyin said, \"Don’t come over these days; it’s better to avoid any appearance of impropriety. Even if your son is truly talented, others might think you’re just trying to pull strings.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Since Huiyin has been turning away visitors, she even told the Zheng family that she would meet them after things settle down.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Madame Ji’s family had relatives who came to seek refuge from Gaoyang, including members of the Xin and Cui families. Especially since the Cui family is related to Li Cheng through his mother’s side, they expected to receive high positions and wealth. However, they soon learned that Li Cheng requires everyone to take exams.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Some people were so full of themselves that they felt insulted by Li Cheng’s exam requirement.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">For example, the uncle of the Xin family thought, \"I am already a well-known Confucian scholar in Jizhou, yet I have to take exams with the younger generation. It’s too humiliating.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Pei Shuo had to persuade him, \"I have already told the prince about your reputation, uncle. Please wait; the prince appoints people based on their talents, and he will surely recruit you.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"With your reassurance, I feel much better.\" Xin Daru was also eager to serve under a famous lord.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">However, Pei Shuo added, \"But I can’t guarantee anything. The prince values practical competence over lofty ideals. Uncle, you must be cautious in front of the prince.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">As a junior, Pei Shuo couldn’t directly criticize his elder, so after acknowledging Xin Daru, he immediately conveyed Li Cheng’s views, indirectly telling him that Li Cheng was different from Zheng Fang. Zheng Fang came from a humble background and, although talented, wasn’t very sharp or principled, often acting on a whim.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Pei Shuo could still pacify Xin Daru, but Cui Yuehua’s eldest brother sought refuge with Wei Duo, while her second brother came directly to Li Cheng. As a member of the Cui family, he was certainly knowledgeable and prepared at home. Since Zheng Wuheng was in the military, he was young and directly assigned by Li Cheng to the navy to learn naval warfare.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Cui Yuehua was worried but couldn’t say anything to her second brother. Madame Ji seemed to understand what she was thinking and said, \"Your second brother is also a famous scholar. The prince doesn’t engage in private meetings, and if he can stand out, it will prove he truly has real talent.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Although the Cui family was closely related to Li Cheng, Li Cheng was indifferent to them, leaving Cui Yuehua uncertain.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"Mother, I was thinking of going to the princess—\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Madame Ji clicked her tongue, \"You don’t understand the princess’s temperament; she’s not one to give face. Originally, she had two wet nurses, but one loved to steal and was eventually expelled because she went too far. No one could change her mind.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Her daughter had always been strong-willed since she was young, completely different from De Yin. De Yin, when she was young, enjoyed visiting relatives and friends with elder Madame Xu, but Huiyin would refuse to go anywhere, even if they tried to pull her by carriage. She was resolute and insisted on being herself, even if people called her eccentric.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Later, when her daughter started reading, her perspective on things far surpassed theirs, and Madame Ji found herself listening to her daughter instead.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Cui Yuehua had no choice but to stop talking and went back to talk to nanny Rong, feeling very worried.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Nanny Rong, however, comforted her, \"Second Miss, there’s no need to worry. Even if our second master doesn’t pass the exam this time, with our relationship, he will surely meet the prince’s expectations in the future. Blood is thicker than water.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"You’re right.\" Cui Yuehua felt relieved after hearing this.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">After the Cui and Xin families settled down, the Xu family also sought help from elder Madame Xu. Xu Shi’s younger brother originally served under Prince Wei and later returned to his hometown after Prince Wei passed away. The Xu family of Donghai was a large clan and naturally wanted to be re-employed.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Elder Madame Xu didn’t fully understand the external situation and naively agreed, \"I’ll just speak to the marquis.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">She actually did mention it to Zheng Fang, but he listened with one ear and out the other. He agreed but forgot as soon as he left. These days, the prince’s son-in-law had been sent as an imperial envoy to Yanzhou and Jizhou. His daughter quietly instructed him to gather any misconduct by the governors there and report back to the prince. If he handled this task well, the prince was prepared to grant him a two-thousand-household fief in Jizhou. With that in mind, how could he remember other people’s matters?</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Dressed in new clothes, Zheng Fang bid farewell to Li Cheng and headed to Yanzhou and Jizhou.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">As soon as he left, Huiyin punched Li Cheng, \"You’re really cunning, sending my father away like a rat into a rice jar. With good wine and beautiful women tempting him, how will he remember what he’s supposed to do?\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"That’s exactly the effect I want. If I had sent someone incorruptible, everyone involved would be implicated. Your father’s family has handed over such a large piece of land to me. I was already planning to grant them a fief. If I ever rule the world, there will be even more rewards for you.\" Li Cheng actually thought the current arrangement was still a bit lacking.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">If the fief were over a thousand households, the amount of grain collected would depend on the heavens. In a disaster year, if there was no harvest, there might be nothing. Now, with the Zheng family coming over, they were directly granted grain, the same as the governors of the same state. Zheng Fang was currently in a leisurely position, which didn’t draw attention, making it a very thoughtful arrangement.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Huiyin held his hand. \"Let's take it step by step. By the way, are you asking me to go tomorrow as well? That might not be appropriate.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Tomorrow would mark the first \"Talent Selection Ceremony\" in Li Cheng's territory, an event that had never before allowed women to participate. She was afraid of breaking the rules.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">But Li Cheng said, \"A wife is a partner. Huiyin, if it weren't for you delivering the supplies last time, our war efforts wouldn't have gone so smoothly. How could you not participate in such a grand event? Without you, it would lose much of its brilliance.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Huiyin felt a joy in her heart and looked at him. \"I will do as you wish, My Lord.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">For the first exam, Li Cheng personally created the questions on the spot, not revealing them until the candidates had entered. He would randomly point to one and use that as the topic.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Sitting next to Li Cheng, Huiyin was seeing her husband outside of their home for the first time. Not only was he strong in martial strategies, but his literary talent was also exceptional. Although she had studied, listening to him quoting classical texts made her realize how little she knew and how much more she had to learn.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">The room was filled with promising scholars and officials, each hoping to prove themselves worthy of serving a future emperor. Nowadays, with Prince Yuzhang still young and the Crown Prince weak, it was the powerful Prince of Huaiyin who really controlled the situation.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">After listening to Li Cheng, the candidates were led by officials to their respective examination rooms. It was the first time Huiyin had appeared in front of so many men. As a woman, she felt a bit shy, but also thought it would be shameful to show such timidity, so she steeled herself.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">\"Don't be afraid.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">She heard Li Cheng say to her, and Huiyin nodded seriously.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">A man who loves you doesn't just say sweet words or give you trinkets. True love means being willing to include you in his decisions and share his power with you.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">She didn't know why Li Cheng had made such a decision, but after the initial fear, she felt excitement.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">This was a stark contrast to her previous life, where even as Empress Dowager, her father still held the real power. Outside, there were enemies like Wei Duo, and even her father couldn't handle everything.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Li Cheng was sipping tea with a beauty by his side, not feeling tired at all. He wanted to showcase his full range of talents while making it look effortless.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Unfortunately, Huiyin didn't know what he was thinking.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">In contrast, De Yin's situation had become unbearable since her family defected to Li Cheng. One night, while attending to the Crown Prince, she was stripped and brutally whipped with a horsewhip.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Wei Liangdi mocked her, but it was Yunzhi who came to her aid, personally bringing her hot soup.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">\"Liangdi, fortunately, your title hasn't been stripped yet. Drink some hot soup and rest for a few days.\" In Yunzhi's view, as long as the title remained, it was best to stay out of the spotlight and focus on staying safe.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Looking at the ginseng soup Yunzhi handed her, De Yin couldn't help but think of how Yunzhi used to be at her beck and call, to the point where even Lu Xiao had to avoid her sharpness. Now, it was the former maid who was rescuing and pitying her. But she didn't show it on her face and said, \"I was wrong to treat you badly before.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Yunzhi shook her head. \"Liangdi, you're mistaken. I was also wrong to betray my master. But once we step into these palace walls, our only goal is to survive and find a way to live peacefully.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">\"Oh, thank you. Take care.\" De Yin looked at her.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Yunzhi quickly left, and the maid serving her said, \"Why did you come? You're pregnant. With the whole palace against her, you should have stayed far away.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">\"Don't talk nonsense.\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Hearing this, De Yin couldn't help but resent her family. Why did they all side with Li Cheng, even going so far as to hand over their lands to him? Why were they so biased?</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Growing up, she had always been better than her sister Huiyin in every way, but the family had always favored her. She didn't know what kind of torment awaited her, and for the first time, she hated her family so much.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">The exams ended nine days later. Some of the weaker candidates were carried out, while others went to pleasure houses to relax amidst the tension of the exams. Some even frantically prayed at temples and Taoist monasteries near Xuzhou, their incense smoke rising.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Even Cui Erlang, from a prestigious family, was anxious. Li Cheng's new system of anonymous marking meant that no one, not even the most well-connected, could influence the results. For those who had previously entered officialdom through patronage or recommendation, failing the exam would be a real disgrace.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Because of this, he even neglected his beloved concubine.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Just as Zheng Wuheng returned and saw his brother-in-law like this, he comforted him. \"Brother-in-law, there's no need to worry unnecessarily.\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">\"I'm not worrying without reason. This exam is incredibly rigorous, with the prince and princess personally overseeing every detail, even bathroom breaks. My seat is fine, but some candidates were placed next to the restrooms, which made things quite unpleasant.\" Cui Erlang knew clearly that this was a gathering of almost all the elites from the Prince of Huaiyin's territory.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Governor of Yuzhou, Guo Zhao, was the most iron-fisted, first organizing an examination in his province with the help of great scholars, selecting fifty candidates to send for further testing. The local administration of Xuzhou was no less strict, and the same went for Yanzhou and Qingzhou. However, the recently annexed Jizhou had not yet organized such a grand event. Cui Erlang had even rejoiced at this, but to his surprise, he saw his brother-in-law from the Zhang family of Jizhou also present.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">At the time, both had expressed their disdain for participating in the exam over drinks, but meeting face-to-face at the entrance of the examination hall was truly awkward.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">The most awkward scenario would be if his brother-in-law passed while he did not, which would be even more miserable.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Fortunately, neither he nor his brother-in-law passed. Looking up, they saw Li Cheng personally announcing the fifty successful candidates, and one examinee shouted, \"I feel like His Highness hasn't finished reading the names, please, Your Highness, read them again...\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">These people even knelt before Li Cheng, who silently shook his head, for sometimes the difference between success and failure is as thin as a hair.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Cui Erlang naturally maintained his dignity, but seeing many scholars weeping, he felt deeply distressed.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">For over a month, he could not recover from the failure of the exam. Still staying at the Zheng residence, he saw Zheng Fang return with a radiant face, having been well entertained by the Governor of Yuzhou and the Governor of Yanzhou, and received a fief of two thousand dan of grain from the Prince. He truly marveled at how different people's fortunes could be.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Unaware of Cui Erlang's feelings, Zheng Fang said, \"Nephew, I've brought back quite a few specialties. You must share them with me.\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">He then patted Cui Erlang on the shoulder, nearly causing him to stumble backward a few steps.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Leaving aside whether Zheng Fang and Cui Erlang drank together or remained somber, Huaiyin received a note saying that Yin Lifen and her party had arrived in Yangzhou. She immediately handed the note to Li Cheng.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Surprised, Li Cheng asked, \"How did you know? Who gave this to you?\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Huaiyin had originally intended to keep this a secret, as one must always have a backup plan. But now, seeing that Li Cheng was willing to share power with her, she decided it was better to reveal her secret now rather than risk being seen as hiding something later.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">\"I knew you loved the noodles I made, so I thought about opening a noodle shop where those who wanted to eat noodles could go. Later, I planned to use Old Zhang's Noodle Shop to hide grain, making it easier to transport grain to you without being noticed. After we established ourselves in Xuzhou, they occasionally helped me gather information,\" Huaiyin said, pursing her lips.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Li Cheng coughed heavily, \"You are far more capable than I imagined.\"</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">In truth, his heart was already in turmoil. Last time, when Huaiyin arranged for grain to be transported, she personally negotiated with the grain merchants and oversaw the entire process, not flinching at the cost of five hundred thousand taels. Despite not being fabulously wealthy, she never considered failure and was very clear-headed in important matters.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">\"But how does a regular noodle shop know such confidential stuff?\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Huiyin smiled. \"Don't think the lower classes know nothing. They went to Yangzhou and needed to buy people. Our Zhang Laosan's noodle shop is often in the busiest markets, with locations in every nook and cranny. People from all walks of life, including gossipers, are always in the loop.\"</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">\"You've got a point,\" Li Cheng replied, realizing that while he thought highly of himself, Huiyin was far more composed and had her own wisdom.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">She wasn't a know-it-all, but she always had her clever tricks.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Seeing him so serious, Huiyin couldn't help but say, \"We usually joke around, but now you sound so serious.\"</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">\"Hey, do you think Xie Jiuyi is losing his nerve?\" Li Cheng asked.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">\"I think so. You only took Wu County; you didn't touch any other territories of Prince Wei. With Zhao Hong's sudden death, Xie Jiuyi should have been feeling confident.\" Huiyin couldn't understand it.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Li Cheng said, \"Let's see how the situation develops. I heard the emperor's health is deteriorating.\"</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">In fact, in their previous life, the emperor had already passed away. It was strange that in this life, the emperor was still clinging to life. But Huiyin thought that even if she had killed Li Heng in her previous life, the world hadn't found peace.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">Taking things one step at a time felt more reliable.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">\"Honey, even if he becomes emperor, will people follow his orders?\" Huiyin asked.</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">\"It doesn't matter. I heard Wei Liangdi gave birth to a son. Wei Duo probably wants to control the emperor to command the vassals; he won't let Li Heng survive so easily.\"</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">\"That's true, but how do we get Wei Duo to make a decision?\" Huiyin didn't understand.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">Li Cheng smiled. \"In the past, Su Qin and Zhang Yi used their eloquence to persuade the King of Chu. How could I not have planted some influential figures? Don't worry, I've got this covered.\"</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">\"So you've already made plans, but Wei Duo is still at war with Xie Jiuyi?\" Huiyin still felt she couldn't see through it all.</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">The strategies of diplomacy and warfare between the warring states were something that Huiyin had read about in works like the *Zuo Zhuan*, but she still found some aspects confusing.</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">Li Cheng explained to her in detail: \"If I were to directly oppose Li Heng, he holds the legitimacy, and I would easily become the target of public criticism, called a usurper. Even a thousand years from now, the historical records would describe me that way. No matter how much I achieve, this kind of infamy would stick, and I would be attacked by all. But if Wei Duo makes the first move, and I then deal with him, no one can argue with that.\"</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">\"But what if Xie Jiuyi becomes too powerful?\" Huiyin asked.</p><p id=\"paragraph-123\" data-paragraph-id=\"123\">Li Cheng shook his head. \"That would be problematic. Wei is no longer under the control of the King of Wei. Consort Xu and others have rebelled, leaving Wei in chaos. Now, as they fight among themselves, I need to focus on rebuilding my strength, especially since we’ve only just regained Jizhou. When the time comes to advance from Jizhou to Shangjing, it will be easy for me.\"</p><p id=\"paragraph-124\" data-paragraph-id=\"124\">Huiyin listened, but only partially understood, and privately pondered the matter.</p><p id=\"paragraph-125\" data-paragraph-id=\"125\">About ten days later, Li Cheng returned to say that Wei Duo had sent men to capture Yin Liyi in order to force Xie Jiuyi to withdraw his troops.</p><p id=\"paragraph-126\" data-paragraph-id=\"126\">Huiyin was left speechless. Yin Liyi isn’t trained in warfare, so why would she be taken to the front lines? It was clearly the same old tactic.</p><p id=\"paragraph-127\" data-paragraph-id=\"127\"></p>\n</div>"
  },
  {
    "number": 74,
    "title": "Chapter 74",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 74</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">**Updated Chapter**</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Xie Jiuyi hadn’t expected Wei Duo to resort to such underhanded tactics. The couple had everything planned out. They arranged for Yin Liyi to move into the Prince of Wei’s Mansion with the child, pretending that everything was as it had been when Yin Lifang and the others were there, with heavy guards stationed for protection.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">The situation went awry because Yin Liyi believed she wasn’t really in any danger. After staying in the Prince of Wei’s Mansion for so long, she felt stifled. In the past, when she was in Jianye, she would often go to tea houses, watch plays, or buy street snacks. She had no class prejudice and simply loved street food.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">She wanted to go out, but Xie Jiuyi advised her not to. So, she called for a street vendor to come inside instead. Unbeknownst to her, the vendor was actually someone in disguise, and she was knocked out and taken away.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">This was Yin Liyi’s second time being captured, and she found it almost laughable. Her luck was truly terrible. She didn’t know what the old villain Wei Duo would use to threaten her, and she could only hope that Xie Jiuyi wouldn’t agree to anything.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">However, Xie Jiuyi was also in a difficult position. His troops weren’t entirely loyal to him. If he withdrew them for the sake of his wife, people would surely gossip about it in the future. But if he didn’t withdraw, his wife would likely be killed.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Unfortunately, those under him disagreed. Someone said, “Let’s secretly send people to rescue the lady while attacking on the surface, letting Wei Duo know you don’t care about your wife. That way, he won’t dare harm her.”</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">“Yes, I remember when the lady was captured in Yuzhou last time, Young Prince Li didn’t care either. The more you act indifferent, the more leeway you have.”</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Even now, people in Wei still referred to Li Cheng as Young Prince.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Xie Jiuyi used to blame Li Cheng for not caring about his wife’s life, but now he was in the same situation.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Wei Duo was well-versed in the art of deception in warfare. He had already discovered that Xie Jiuyi had defied his family to marry Yin Liyi, showing deep affection. This reminded him of the story of Shen Gong Wuchen and Xia Ji. Xia Ji had brought down several countries.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Naturally, Wei Duo had seen Yin Liyi once. She was indeed beautiful, but she had a strong will.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">However, he knew that if he kept Xie Jiuyi hanging like this, it would be fine, but if he really took her, it would become a deadly feud. He didn’t want to see a united Xie family army. Thinking of this, Wei Duo personally led his troops again, hoping that Xie Jiuyi would attack.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Xie Jiuyi and Wei Duo were fighting fiercely with no sign of stopping. When Yin Liyi found out, she didn’t blame Li Cheng as she used to. She understood clearly that if Xie Jiuyi abandoned the city for her, it would be an act of betrayal.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Her double standards were unknown to Li Cheng, who expected Xie Jiuyi to continue attacking without being affected by Yin Liyi.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Huiyin was upset: “That Yin woman stayed at my house for a few days after you rescued her. Although she didn’t show it in front of me, I could see that she still thought you weren’t doing enough. Why does Yin Liyi have particularly high expectations of you?”</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">If it were Yin Lifang, it would make sense. Li Cheng had indeed sent her generous gifts, saved her son, and even had a past marriage with her. But what did he have to do with Yin Liyi?</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">She really didn’t understand.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Li Cheng, being a thorough person, pondered for a long time before saying, “She came to my house when she was young. My mother treated the Yin sisters well because of Yin Lifang. Later, when the Prince of Wei asked me to manage his estate, I took care of them because of familiarity, thinking I would marry Yin Lifang. I guess she sees me as someone who gives unconditionally. In this world, people have high expectations of good people. If you do something slightly wrong, you’ll be blamed. But if you’re a bad person and do one good thing, many will remember your kindness.”</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Huiyin thought what he said made sense but couldn’t help but laugh: “There’s also a possibility that she thinks making you do things for her highlights her own charm.”</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Some women like to prove their charm by making men do things for them.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Although it’s not right to talk about people behind their backs, she couldn’t help but remember how Yin Liyi’s family had many complaints after Li Cheng rescued them. Huiyin had no kind words for them.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">But this kind of talk made Li Cheng feel nauseous. Seeing that he was unwell, Huiyin quickly poured him a cup of tea: “Are you feeling unwell? Should I get you some lychee drink, which you love?”</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">“I’m just disgusted. Don’t worry, I’m fine.” Li Cheng really felt like dying after thinking he was being used by a fool.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Huiyin gently patted his back: “Don’t say disgusting. Actually, she’s quite pitiful too. Forget it, let’s not talk about her anymore. Your cousin Cui Erlang has sent his visiting cards several times. Do you want to meet him?”</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Li Cheng hadn’t had time to deal with Cui Erlang. His relationship with his uncle’s family was generally distant, but since Huiyin asked, considering they were relatives, he said, “Alright, I’ll make time to invite him over.”</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">“Well, you handle that yourself. By the way, have the positions for the people selected through the imperial examinations been assigned?” Huiyin asked.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">She used to be very careful not to ask about outside matters, fearing Li Cheng would be wary, but now that they were open with each other as a couple, there was nothing to be cautious about.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Li Cheng laughed: “Don’t worry, I’ll have someone present a handbook specifically for you.”</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Naturally, Li Cheng had his own plans for these young men from influential families who came with their own resources. When he met Cui Erlang, he shared his intentions: \"After failing the imperial examination, what do you intend to do, Zhiqing (Cui Erlang's courtesy name)?\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Although Cui Erlang was his cousin, he dared not be presumptuous. He straightened himself and replied, \"I have been studying hard at home, preparing for next year's examination.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Li Cheng smiled and nodded, saying, \"The 'Qin Shi' says, seeing a worthy person but not recommending them, or recommending them but not employing them promptly, is a slight.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Cui Erlang's eyes lit up, realizing that Li Cheng intended to give him a significant role.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"I will follow your instructions, Prince,\" Cui Erlang said.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Li Cheng smiled and continued, \"Out of the fifty who passed the imperial examination, twenty will stay by my side, and thirty will be appointed to various prefectures. As far as I know, Taicang County already has a county magistrate but is in need of a deputy. Would you find that position unsuitable, Zhiqing?\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Cui Erlang thought for a moment. Taicang was part of Wu Commandery, a prosperous area, and it seemed like a good opportunity, so he rose to express his gratitude.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Li Cheng further instructed, \"I am assigning you there not only because I value your talent but also to see your capabilities. If you prove yourself, there will be no need for further examinations; I will employ you significantly.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Being a deputy is the best way to test one's character and resolve. The one who gets things done is often the deputy, whose efforts might be claimed by the superior or blamed if things go wrong. Li Cheng valued knowledge but placed even greater emphasis on personal ability. Young men from aristocratic families like Cui Erlang, who had been exposed to officialdom and the everyday conduct of elders, could become talents if properly honed.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Now that Cui Erlang's home in Jizhou had come under Li Cheng's control, he felt immediately ambitious upon hearing Li Cheng's candid words.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Similarly, there was the son of Miao Furen, who also failed the military examination, ending up just outside the top fifty. The first fifty were either assigned to various governors or military units, leaving him without a position. Therefore, Li Cheng arranged for Miao Xiao Lang to serve as a judicial magistrate in Hejian Prefecture of Jizhou.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">These young men from aristocratic families held relatively low positions. Cui Erlang, as a deputy magistrate, was of the eighth rank, and the judicial magistrate was of the ninth rank. Both came with family-provided advisors.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">At first, Miao Furen felt her son had missed out, but now that he was appointed to Hejian, she hurried to the mansion to express her gratitude. \"Amita Buddha, I can finally rest easy knowing my son has been given a position,\" she said.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Indeed, the Prince also found young Master Miao quite unfortunate, so when he learned of the vacancy in Hejian, he immediately sent him there. Jizhou is a new prefecture, and Hejian is one of the best among the nine commanderies. Let young Master Miao work hard there, and he will achieve success,\" Huiyin replied.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Now, all the former officials had to be replaced. Li Cheng preferred to employ young people and disliked using seasoned officials.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Miao Furen smiled and said, \"We owe this all to you. Otherwise, who would remember our young master?\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"Please don't say that. It is Master Miao's own ability,\" Huiyin replied.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">After securing his position, Cui Erlang lifted his spirits and regained his usual energy. Although Cui Yuehua found the position somewhat lowly, Cui Erlang had a better understanding.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Those who have never held office might dismiss eighth or ninth-rank positions as insignificant, but when you actually get a post, any official position is a blessing. This was no longer an era dominated by aristocratic families. If a family of high status lacked talent, they would decline within a few generations.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Just as someone who has never earned money might think a few hundred coins a month is small, but once they start earning it, they realize how difficult it is to make even a few hundred wen.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Thus, Cui Erlang said, \"Since I didn't pass, should I expect to be appointed as a governor?\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"Brother, our family has a special relationship with the Prince,\" Cui Yuehua replied, thinking of their dual familial connection and not wanting to benefit outsiders.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Cui Erlang explained, \"After our aunt passed away, my father could not come to assist the Prince. The Prince relied on himself to achieve his current status. I am not like our elder brother, who is renowned for his talent. Being able to serve in Taicang is already due to this relationship. Taicang was where the Wu Kingdom once stored grain in granaries; being assigned there is a significant opportunity, and I am delighted.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Cui Yuehua realized this and said, \"I see.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"Be careful with your words. When you were younger and living at home, and later after marrying into the family of the Marquis of Zhaojie in Jizhou, you were treated with great respect. But here, in the domain of the Princess of Huaiyin, a single wrong word could lead to resentment. Don't think that just because you speak cautiously, there won't be consequences. There's no such thing as a secret that doesn't eventually get out,\" Cui Erlang advised his sister.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">With no family nearby and being young, Cui Yuehua had a supportive husband and a mother-in-law who treated her like a daughter. Now, hearing her brother's words, it was as if a revelation had struck her.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Having family to guide and support you is invaluable. The same could be seen with Huiyin. Pei Shuo was now serving at the main camp in Xuzhou and had become a trusted person of Li Cheng. Whenever he came to the mansion to speak with Li Cheng, he would also visit the rear courtyard to exchange a few words with Huiyin.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Currently, Pei Shuo remarked, \"I noticed some swelling on your face and dark circles under your eyes, Sister. I imagine you're not sleeping well and are hungry. Your health is more important than anything else, so please take care, Sister.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">\"Brother, what are you saying?\" Huiyin was still feeling a mix of embarrassment and frustration.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">She was tall and strong, completely unlike the delicate women of Jiangnan, so she also wanted to lose some weight. But losing weight meant eating less, and if she ate less in the evening, she wouldn’t be able to sleep.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Back when she was at home, Huiyin and Elder Madame Xu would say she was robust, and Huiyin had secretly tried to lose weight, which Pei Shuo was also aware of.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Pei Shuo smiled and said, \"I really shouldn’t say this, as I am a man after all, but for someone like you, sister, to worry about such things is truly unnecessary.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">\"That’s because after I sprained my waist and spent those days lying on the couch, I started eating without restraint, and before I knew it, I started to gain weight. I can’t even fit into last year’s clothes anymore,\" Huiyin complained.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Pei Shuo then said, \"That’s exactly why you need more rest, so you’ll have more energy. If you don’t eat enough, your energy levels will drop, and you’ll crave food to compensate.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">After their conversation, Huiyin thanked Pei Shuo for his concern. Unexpectedly, a few days later, Pei Shuo specially sent a chef to help Huiyin with her diet.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"This way, you won’t go hungry, and you won’t gain weight. This chef is reliable and has been thoroughly vetted, so you can use him with confidence,\" Pei Shuo said.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Huiyin happily said, \"If it works, I will definitely thank you with a grand gift, brother.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Pei Shuo shook his head, \"I just hope you stay healthy, that’s all I wish for.\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">The chef he sent prepared a type of steamed bun made from coarse grains for breakfast, the size of a palm, with just two types of vegetables and a boiled egg. Lunch was half a bowl of rice, a portion of lean meat, two types of vegetables, and dinner was the same as lunch.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Li Cheng was gnawing on a lamb leg beside her and cut off a small piece with a dagger, asking, \"How about it? Want a piece?\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">\"No, I need to control my eating,\" Huiyin quickly shook her head, then added, \"Tomorrow, the kitchen will prepare stir-fried lamb with stuffed dumplings.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Li Cheng sighed, \"I’ve told you not to worry. It’s better to ride horses. Honestly, I eat more than you, but because I practice martial arts and horse archery daily, no one says I’m fat.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Huiyin didn’t know what to say. \"You’re not just not fat, you’re extremely lean.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">In fact, Li Cheng thought Huiyin was already stunningly beautiful, but considering there were many women who wanted to marry him, he guessed his wife might lack confidence. So he said, \"But what I love most is your body. If you were to lose weight, it would really not look good.\"</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">\"Don’t try to flatter me. I don’t care, I want to lose weight to how I was before.\" After eating those dishes for a month, she had made significant progress.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Seeing that her jawline had become sharper, she was about to call Li Cheng when he walked in and said, \"Guess what? Xie Jiuyi couldn’t beat Wei Duo. He barely won one battle. Wei Duo, like Zhang Song, put Yin Liyi in front of his horse, but Xie Jiuyi, being her husband, exposed a vulnerability...\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">The author has something to say:</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Let’s see if I have time tomorrow morning. If I do, I’ll post two updates. My back hurts badly, so please be patient with me.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\"></p>\n</div>"
  },
  {
    "number": 75,
    "title": "Chapter 75",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 75</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Second Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Finish what you were saying. What happened after Xie Jiuyi wavered?\" Huiyin asked.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Li Cheng said, \"Many of his followers were initially neutral. They were only loyal to him because of his position as an aide to the Prince of Yuzhang. Now, these people see him as King You of Zhou, a ruler known for his downfall due to his indulgence and poor leadership. Back when I was under the Prince of Wei, both of us served him. I had a royal identity, and the Prince of Wei seemed closer to me, but he trusted Xie Jiuyi more with important tasks. It seems that when someone is in power, those below always want to bring them down. I heard that their army mutinied, and Xie Jiuyi was unable to regain control, forcing him to retreat temporarily.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Huiyin didn’t understand. \"But what about Yin Liyi now that he’s retreated?\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Li Cheng shrugged. \"That, I don’t know.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Sigh, the situation is getting more chaotic. Wei Duo is using some truly unconventional tactics,\" Huiyin shook her head.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Li Cheng stood with his hands behind his back. \"Yes, actually, I can understand Xie Jiuyi’s actions. If someone else had captured Yin Liyi, I wouldn’t feel the need to intervene, but if they had captured you, I would definitely hesitate.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Huiyin hadn’t thought of that. Hearing Li Cheng mention it, she couldn’t help but ask, \"So, if I were captured and used to threaten you, what would you do?\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"I would definitely save you, without a doubt,\" Li Cheng said without thinking.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin was incredulous. \"Then… how can you act like that?\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"If he’s using you to threaten me, it shows that his strength is limited. Actually, Wei Duo’s actions aren’t a good example. In the future, others will capture his wife and daughters. It’s not a good thing,\" Li Cheng said.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin had originally hoped he would say something else, but she also felt it wasn’t right. \"In my heart, I hope a man would always put me first, but in terms of national warfare, it’s not good to act like that.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Li Cheng understood. \"I know it’s not right, but if I don’t save my own wife, who shares my bed, how can I be expected to save others? I understand the old saying that ‘brothers are like limbs, and women are like clothing,’ but I want them to know that if they so much as harm a single hair on you, I will make them pay double.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">\"But I don’t want you to do anything reckless because of me. Don’t worry, I can manage well wherever I am,\" Huiyin said, standing up to touch his face.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"Don’t say such things. You say that because you haven’t seen true evil. People who refuse to listen to reason and only seek to abuse and dominate women. It’s terrifying,\" Li Cheng said, holding Huiyin.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Huiyin said, \"You’re right. If someone captured you, I definitely wouldn’t just watch you die. I would give everything to save you, but we both need to work hard to protect ourselves and not give others any leverage.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">The couple shared their feelings, but little did they know that after this battle, Xie Jiuyi attacked Wei Duo again and lost. The people in the army deliberately spread rumors that Xie Jiuyi had deliberately lost to Wei Duo, painting him as King You of Zhou.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Even Li Cheng felt sympathetic because Xie Jiuyi had only hesitated for a moment, but he had fought as he should and was truly loyal to the Prince of Yuzhang. He hadn’t expected those people to act like this.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">In these few months, Wei Duo had only managed to break through one city. Xie Jiuyi had really done his best. He hadn’t slacked off just because someone had captured his wife; instead, he continued to attack.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"Xie Jiuyi’s position has been stripped, and he’s become a commoner now. What will he do in the future?\" Huiyin asked, biting into a pork knuckle (a type of pork leg dish).</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Li Cheng shuddered. \"He’s too naive, thinking that innocence would clear itself. By acting this way, he expected others to spare Yin Liyi.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">It was easy to imagine what fate awaited Yin Liyi, a beautiful woman in a time of chaos. Huiyin couldn’t help but feel sympathetic. \"What happened to Yin Liyi?\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Li Cheng said, \"I heard that she was given away as a concubine.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Later, it was said that the Prince of Yuzhang and his mother had also gone missing. Without Xie Jiuyi, those people acted independently, and they were already a scattered mess.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">**</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Yin Liyi hadn’t anticipated that this time she wouldn’t be so fortunate and was given away as a concubine. Dressed in red and green, her heart was as cold as dead ashes.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Perhaps they thought that as a woman, she wouldn’t run away, and even if she did, she couldn’t escape.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Someone knocked on the door, and Yin Liyi said irritably, \"I said, I don’t want that useless thing.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"It’s me.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Recognizing the voice, Yin Liyi quickly rose and opened the door. To her surprise, it was Xie Jiuyi.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Since they were still in Wei Duo's territory, Xie Jiuyi had disguised himself as a woman. In the past, when Yin Liyi used to share private conversations with him, she had said that Xie Jiuyi would definitely look good dressed as a woman.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Unexpectedly, now in this situation, she saw her husband in women's clothes. It was both absurd and heartwarming.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">...</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"Prime Minister, it seems that Xie Jiuyi has taken his wife away?\" a subordinate reported to Wei Duo.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Wei Duo, who was drinking wine, said carelessly, \"Xie Jiuyi is a useless man now. It's fortunate he still has some conscience, let him go. Pass my order: execute Prince Lujiang Li Zhi and his mother, Lady Xu, on the way, and intensify the search for Prince Yuzhang, he must be killed immediately.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">The subordinate left to carry out the orders.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Xie Jiuyi had stolen a soldier's token from Wei Duo and bribed the guards at the city gates. Once they returned to Wei territory, he said, \"My official position has been systematically undermined. I am tired of this life. I have found a rural estate, and I have sent someone to bring my mother and children there. From now on, we will no longer meddle in these affairs.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Yin Liyi had also grown up on a countryside estate and never liked the complicated etiquette. Hearing Xie Jiuyi's plan, she was naturally happy.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">But then she thought, \"What about my sister? Are they there too?\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Xie Jiuyi said seriously, \"Your sister seems to have run away with Prince Yuzhang. I don't know exactly where they went, but Liyi, we have already helped your sister a lot.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">He hadn't rescued Yin Liyi immediately, and later lost his command, but he believed he had done his duty to the Wei King. At that time, for the sake of Prince Yuzhang, he had even abandoned his wife.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"No, we can't ignore my sister. I want to get off the carriage, I want to get off the carriage...\" Yin Liyi said.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Xie Jiuyi looked at her in disbelief. \"Do you know that our son and daughter are waiting for you to return home? Do you know that my mother is old and just wants to live an ordinary life? Many of my soldiers have perished in this war, yet you are so reckless and unafraid of death. If you get off the carriage, our marriage is at an end.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Actually, once the Wei King died, he knew that the tides had turned. Wei territory was complicated, with various factions, and Prince Yuzhang was still a child, lacking any ability to unite people.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Yin Liyi collapsed onto the carriage floor, stunned by the intensity of her husband's anger, something she had never seen before.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Xie Jiuyi even accused, \"If you had listened to me earlier and left with your sister, they wouldn't have found an excuse to turn against me. I don't blame you for today's situation. If you still want to live a peaceful life, let's go, but if you want to find your sister, I'll leave the carriage for you, and we won't need to see each other again.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\"></p><p id=\"paragraph-48\" data-paragraph-id=\"48\"></p>\n</div>"
  },
  {
    "number": 76,
    "title": "Chapter 76",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 76</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Chapter◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Today is the birthday of Huiyin's second son, Zhan'er. Early in the morning, her natal family sent birthday gifts. Pei Shuo sent a basket of longevity peach pastries, two baskets of silver-thread noodles, two suckling pigs, two sets of brocade clothes, and a small, gentle mare. Zheng Wuheng sent premium stationery sets, six rolls of top-quality Shu brocade with longevity patterns, two gold-embroidered tortoise-shell patterned handkerchiefs, and a pair of socks and shoes through Cui Yuehua.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Madam Ji and Zheng Fang also sent a complete set of gold jewelry, including bracelets, necklaces, and anklets, along with other gifts.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Huiyin didn’t want to go overboard with the celebrations and only planned to invite close family for a few tables. The male guests were dining with Li Cheng in the front, while the female guests were chatting in Huiyin's flower hall.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"On a child's birthday, the family prefers a quiet celebration at home. I've heard that some families delay naming their children until they’re older, believing that revealing the name too soon could bring bad luck,\" Huiyin said, stroking Zhan'er's head with some concern.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Cui Yuehua chimed in, \"That's said about children with weak constitutions. I see our robust and lively Erlang here. Madam, you really shouldn't worry.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">With her brother's guidance, Cui Yuehua had become more tactful and quick-witted recently.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Xin Shi also chimed in, reflecting on how Cui Yuehua, once proud of her noble background, had now adapted to her new circumstances.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">But after those thoughts, Xin Shi wondered if her gift was enough, though she knew she couldn’t show favoritism between her nephews.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Hearing Cui Yuehua's words, Huiyin smiled and said, \"I was just mentioning it casually. I don't believe in ghosts and gods. By the way, is Madam Zhang coming?\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Madam Zhang, Cui Yuehua’s half-sister from a concubine, was married into the Qinghe Zhang family. She planned to bring her children as well.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"Yes, my brother-in-law is currently benefiting from the prince's favor and is about to become a teaching official in the prefecture. My sister plans to come with the children,\" Cui Yuehua said, though she wasn't very close to this sister but still mentioned her as family.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Huiyin said, \"If you need anything, just let me know.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Cui Yuehua took it as a polite gesture and responded with flattery, \"Thank you, Madam.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Huiyin was relieved that Yin Lifang wasn’t there; otherwise, the two of them would have looked almost identical standing together.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">With that thought, she invited everyone to start the feast and called for some musicians. The banquet was lavish with a variety of delicacies from all over. Cui Yuehua thought that when Madam Huiyin hosted, it was always a grand feast with rare and precious items.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Everyone left satisfied, except Ji Shi, who stayed to talk.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"Madam, take care of yourself. You seem like a willow branch that sways too much in the wind,\" Ji Shi said with concern.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Huiyin smiled and said, \"Mother, you exaggerate. I just feel too bulky and want to lose some weight. Now that I’ve regained my original figure, clothes from three years ago are too loose on me. But don't worry, I'm still drinking tonic soups, and the prince even massages me at night.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Ji Shi was pleased for her, \"My dear, I have no other wishes but to see you, the prince, and the heir doing well. That would make me happier than anything else.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"Actually, I have to thank my elder brother. If he hadn't found someone to help me, I wouldn't have lost weight,\" Huiyin said. She used to love fried bones, which caused pimples on her forehead and cheeks, or she would stay up late. Now, she had become so healthy and radiant.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Thinking of Pei Shuo, Ji Shi nodded, \"Your elder brother has always been close to me and is very capable. But because he's too capable, you should both advise him more.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Some people were trying to arrange a second marriage for Pei Shuo. Last time, they suggested a match with Xin Shi's uncle, a great scholar who hoped to be appointed by Li Cheng. However, Li Cheng preferred to employ younger people. Xin Shi's uncle wasn't given an important position, which angered Xin Shi, leading to an argument with Pei Shuo, and the couple had a cold war for a while.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Pei Shuo ended up drinking outside, and some people, aware of this, wanted to propose a second marriage for him, with a bride from a significant family.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">It was probably because Xin Shi asked Ji Shi for help, hoping Huiyin could persuade Pei Shuo.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">But Huiyin said, \"Mother, my brother is an adult now, not like when he was a child. There are some things I can't say.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Even as a high-ranking sister, she wouldn't interfere in her brother's personal matters. She could say that she and Li Cheng hoped for a lifelong monogamous relationship because Li Cheng shared the same desire. But she had never interfered with her husband's affairs, so how could she possibly intervene on Xin Shi's behalf?</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Moreover, Ji Shi couldn't even handle her own son, so how could she expect Huiyin to handle it?</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Ji Shi, hearing Huiyin's tone, could only say, \"If it's not about other matters, I won't mention them. But I've heard that your brother seems to be taking in someone. Do you know about this? I'm just worried that this person might cause trouble in the household, leading to unrest.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"I really don't know about that. But if Brother has a sense of propriety, mother, why don't you inquire about the woman's character? If she's really not good, go and talk to him. Wouldn't he listen?\" Actually, Huiyin sometimes found it strange that mothers, apart from Elder Madame Xu, hardly dared to offend their sons and always wanted others to play the bad guy.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Upon hearing her daughter's words, Madame Ji also said, \"I'm afraid that if I inquire too early, it'll startle the snake. Others might think that I want her to join the family, which wouldn't be good.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"If you can't do anything about it, then I can't help either.\" Huiyin wasn't willing to take the lead either.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Although she had a good relationship with her family, the closer they were, the more careful she had to be.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Seeing that her daughter didn't respond, Madame Ji had no choice but to leave, saying she had something to attend to. Once she left, Li Cheng came in. The two of them were happy to see each other and spoke joyfully about their son.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"Just now your mother came. What did she want?\" Li Cheng asked.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Huiyin smiled and said, \"What else? Just some family gossip. I heard rumors that my brother wants to take a concubine.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Li Cheng sat down and said, \"I heard it's the widow from the Yu family in East City?\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"Really? You know her?\" Huiyin's eyes widened slightly.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Li Cheng said, \"Yu Dalaoye was originally a pearl merchant for the imperial court. This lady was previously Lü Wei's concubine. After Lü Wei passed away, she took the money and ran. Later, she married Yu Dalaoye as his legitimate wife, and all the wealth of both the Yu and Lü families fell into her hands. She has no children. If she doesn't remarry, her wealth will likely fall to the younger brothers of the Yu family.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Without a son, a woman could easily be deprived of her inheritance. Huiyin deeply understood this.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">This was also why she had to have children. Of course, she loved her two sons very much.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"So, if what you're saying is true, she approached my brother. What does that mean for him?\" Huiyin was puzzled.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">She had thought it was some daughter of a noble family, which was why Madame Ji found it troublesome.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Li Cheng explained, \"Your brother is different from your brother-in-law, Heng'er. Heng'er is simple-hearted and sincere. He has his parents to support him, and his wife is related to me. This time, he brought 50,000 elite soldiers from Jizhou as his private army. Look at your brother; he only has about 300 soldiers. Although the Pei family has money to give him, it's just a drop in the bucket. If he marries the Lady Yu as a second wife, at least his assets will increase, and I heard that Lady Yu is quite insightful.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"I see. My mother is eager for me to help my sister-in-law dissuade the Yu lady, but I always feel that as his younger sister, it's not right for me to meddle in my brother's personal affairs.\" Huiyin said.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Li Cheng quickly waved his hand, \"You mustn't get involved in this. I reckon your brother is quite determined. He will certainly respect your sister-in-law, but when it comes to opportunities to strengthen his own influence, he probably won't let them slip by.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">To win battles, you need money to buy military supplies. Even Li Cheng, because he inherited a large legacy from the Prince of Wu, had private troops to fight in wars. Zheng Fang and others brought so many elite soldiers and land that their momentum instantly surpassed Pei Shuo. Naturally, Pei Shuo had his own considerations.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">They had no secrets from each other. Huiyin even told him about her family's private matters, which made Li Cheng happy. He couldn't help but say, \"Now that our two kids are older, maybe we should try for another one?\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"No, I've only just slimmed down. All you think about is this. Did you handle your duties properly today?\" Huiyin whispered gently.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">\"I handled my duties well, but that doesn't conflict with missing you. Never mind. If you don't want another child, let's soak that thing.\" Li Cheng quickly took out a box from the cabinet, opened it, and took out a nearly transparent object. He placed it in water, and it slowly expanded.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">As for the couple's affection, Madame Ji was full of worries. She couldn't discuss this with Zheng Fang. As a remarried couple, they could discuss household matters, but she couldn't discuss her eldest son's issues with him.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Moreover, Zheng Fang didn't think there was any issue.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Look, he’s not even coming home today.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"Madame, Elder Madame Xu invited the Xu family of Donghai over today for a performance and a feast. It was very lively, and the silver being spent was flowing like water.\" A servant reported.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Madame Ji said, \"I've already handed over the management to your mistress. Let her handle it.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Now, Madame Ji had stepped down from managing the household. She had handed it over to Cui Yuehuan, who was quite capable. However, as her daughter-in-law, Cui Yuehuan had to deal with Elder Madame Xu and Xu Shi, who were her elders. She couldn't disobey their demands, so they came to her.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Madame Ji had told Xin Shi about the widow and how she feared that her son might be enchanted by her. She wanted her younger daughter to help dissuade him, since she was a princess. But her daughter didn't want to get involved. Now, her daughter-in-law hoped she would step up and help her deal with Elder Madame Xu and her niece Xu Shi.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">If she were managing the household, she would have taken the lead. In fact, she had always done so before. But now, Zheng Fang had stepped back and taken a leisurely position. Zheng Wuheng had begun to take on significant responsibilities. As the heir's wife, her daughter-in-law had to establish herself.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Madame Ji's words soon reached Cui Yuehuan, who said to Nanny Rong, \"Our Elder Madame is really strong for her age. Not a single person from the Xu family of Donghai has passed the imperial exams.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Each generation has its own concerns. If Zheng Fang were in charge, they could approach him. But now it's the prince consort, your brother-in-law, who heads the household, while your brother is only a deputy county magistrate.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Nanny Rong said, \"It’s not like it’s a lot of money, so let it slide. As for Madame Xu, at her age, she should be serving the elder Madame Xu properly instead of always trying to put on airs. Our lady doesn't bother with her because she doesn't even see her as worthy of attention. But Madame Xu thinks we’re afraid of her.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">\"Exactly, my mother-in-law is now the mother-in-law of the Prince of Huaiyin. If it weren't for the elder Madame Xu's sake, Madame Xu would be nothing,\" Cui Yuehuan said with disdain.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Nanny Rong smiled and said, \"Exactly, don't be angry about it. I saw the princess consort earlier, and she seemed very composed. She doesn't let her worries show. You shouldn't let these things upset you. The elder Madame Xu is old and can't be attending banquets every day.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Cui Yuehuan thought it made sense. Given Madame Xu's age, how could she possibly indulge in abalone and sea cucumber at every meal and still host performances? Feeling a bit charitable, she said, \"I remember the princess consort gave me a piece of Shu brocade. Cut a few feet and have the seamstresses make two sets of clothes for the elder Madame Xu.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Nanny Rong nodded in agreement. She thought that both Madame Ji and Miss Cui in this household were good people. Although Madame Xu's status was awkward, they only complained verbally but still gave her the proper allowances and treated the Xu family well when they visited. After all, the winning side doesn't need to give her some dignity; it's about giving face.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Xin Shi also wanted face. Her family, the Xin family, was a prominent clan in Jizhou, but in Xuzhou, they were nobodies. She had been close to the princess consort, but Cui Yuehuan seemed to have matured. Xin Shi used to have her natal family to confide in, but now she didn’t even have anyone to talk to.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Pei Shuo originally had two concubines. One was her dowry, and the other had served Pei Shuo since childhood. These two stood for hours by the door, aching from the waist down, and as soon as they left, they started gossiping.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">In this household, Xin Shi was the main wife, and Pei Shuo wasn't the type to indulge in excessive pleasures. The two concubines didn't have much presence and only served Pei Shuo when Xin Shi was inconvenienced.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">But people, no matter how honest, always have their own hidden thoughts.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">\"If you ask me, if Master really promotes her, we won’t have a place here anymore.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">\"That's true, and when they, the lords and ladies, quarrel, we, the servants, will suffer.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">...</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Xin Shi's worries couldn't stop Pei Shuo's intentions. He personally had Xin Shi prepare a courtyard. The original surname of the new Madame Yu was Dong. This Madame Dong was indeed a sensible person. After entering the household, she didn’t put on any airs but was gentle and yielding to everyone.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Even when Madame Ji came to visit Huiyin, her clothes were quite distinctive. She said, \"This was given to me by Madame Dong. Your brother and sister-in-law brought her to meet me. She's a very kind person.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">\"Does she respect your sister-in-law as well?\" Huiyin put down her teacup and asked.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Madame Ji looked a bit awkward. \"She is very respectful to your sister-in-law, but your brother quite likes her, which will inevitably cause some complaints from your sister-in-law. However, this person is beyond reproach. The two concubines secretly mocked her, but she didn’t complain to your brother. If she were the type to stir up trouble, she would have caused discord in the household.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Huiyin smiled and said, \"You are too soft-hearted.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">\"That's because I can understand her. She was once Lü Wei’s concubine and later married Yu Dalaoye. She just wanted to settle into a stable life. Your brother is handsome and upright. If she can entrust her life to him and have children, her heart will be at peace. Women don’t ask for much.\" Madame Ji wasn’t exactly sympathizing with Madame Dong, but rather acknowledging that her large fortune would be lost if she didn’t marry someone.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Moreover, she had given a large sum of money to her son. Pei Shuo used this money to smooth out relationships and even set up a troop of private soldiers, recruiting two thousand personal troops.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">As a young girl, Huiyin didn’t like the idea of becoming a concubine, but sometimes she felt sympathy for those who did. Some had no choice, while others chose to be concubines and even pursued it, which was hard to understand.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">But she couldn’t control others. Her brother had his plans, Madame Dong was patient and gentle, and Xin Shi couldn’t find any fault, so there was even less reason for her to interfere.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Madame Ji took out a nanmu box. \"This is from Madame Dong as a token of respect for the princess consort. It’s not a rare item, just a string of beads made from agarwood, said to bring protection.\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">The most precious type of agarwood is called galen, which is rare and of high quality, making it extremely valuable.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Huiyin shook her head. \"Please take it back. If I accept this bracelet, she might think I support her, and it wouldn't be good if she later tries to challenge your sister-in-law.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Madame Ji realized her mistake and said, \"I was being hasty.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Huiyin thought that even her mother, who was extremely compassionate, couldn’t fully empathize with her daughter-in-law due to their different positions. She saw that Madame Dong respected Xin Shi, but she, in turn, favored Madame Dong more. To her, these women were all her son’s concubines.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">\"Mother, you shouldn’t get too close to Madame Dong. If your daughter-in-law sees it, it might not be good. After all, she is your son's first wife and the mother of Guge and Xianjie. As long as they are peaceful, that’s all that matters. Don't elevate anyone.\" Huiyin advised.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Madame Ji nodded repeatedly. \"My dear, please keep guiding me like you always did when you were at home. Otherwise, I might make mistakes.\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Actually, there is a reason why the members of the Zheng family listen to Huiyin. It is because while De Yin was often busy with poetry and tea gatherings, Huiyin was very concerned about her family. She frequently read books or sought advice on things she didn’t understand, and since she was a decisive person, she often came up with strategies.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Huiyin said, “It’s not as bad as you think. Our family is already in a good situation. As a mother-in-law, you’ve never sent women to your sons, nor do you require your daughters-in-law to follow strict rules. You’ve been considerate and helped with money, which already surpasses many others. In a few days, I’ll prepare a flower banquet, and you should go out and meet people your age. Once we have connections, things will improve.”</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Touched by her daughter’s kindness, Madame Ji didn’t mention any of the troubling matters at home.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">However, she looked at Huiyin and said, “Your brother and your younger brother have many people eager to be with them. Is it the same with Prince Wang? I remember Song Cishi from Yanzhou was like this.”</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">“Yes, I used to worry, but I don’t anymore. It’s not that I have confidence in men, but I have confidence in myself,” Huiyin shook her head.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">The mother and daughter exchanged some private words before Madame Ji left.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Now that both her parents had arrived, Huiyin felt much better. After her conversation with Madame Ji, she felt a pain in her waist and went inside to lie down on a couch to rest.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">A few days later, Madam Zhang came. She was brought over by Miss Cui to kowtow, and Huiyin rewarded her with several rolls of colorful silk, incense, and several boxes of snacks.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">“I didn’t expect the princess to be so courteous; I’m truly flustered,” Madam Zhang said. She hadn’t expected to meet Huiyin and was surprised by how friendly the princess was.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Huiyin looked at her and thought that she resembled Yin Liyi in appearance, but their behaviors were entirely different.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Although Yin Liyi came from a humble background, she had good luck and excellent circumstances. Her parents doted on her, and she was confident and unafraid of trouble. On the other hand, Madam Zhang, being a concubine’s daughter, had her birth mother pass away early. She was raised under her stepmother’s hand on an estate, so she was very restrained. Even though she appeared generous, she seemed very tense.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">However, Yin Liyi would probably never meet her in this lifetime, and Yin Lifang had also disappeared. The matter of the true and false daughters was not something they would casually talk about. After all, the Cui family didn’t acknowledge it, so why would Li Cheng expose it?</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">“We’re all family; there’s no need to speak as if we’re outsiders. Last time, my sister-in-law said you were coming, and I told her,” Huiyin smiled.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Since they weren’t close with Madam Zhang, they didn’t invite her to stay for a meal, but Madam Zhang was still very satisfied. After leaving the princess’s mansion, she thanked them repeatedly.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">“No need to thank us, we’re all family here,” Cui Yuehua said. She used to dislike this half-sister of hers, as it seemed like her mother had mistreated her. They had studied together, received similar dowries, and were married to respectable families. But if you mistreat your own sister in public, people won’t respect you.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Besides, she was living a good life now. Zheng Wuheng and I have been married since childhood, and we get along well. My mother-in-law is also nice, and the only difficult ones to deal with are elder Madame Xu and her daughter-in-law.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Why should we only entertain relatives from the Xu family and not the Cui family?</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Naturally, after Madam Zhang entered, Cui Yuehua entertained her with the same scale as the Xu family, including a performance, expensive fabric for clothes, and a grand banquet.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Elder Madame Xu was instead angered: “If it were just one day, that would be fine, but it’s been three days, and they’ve invited storytellers and acrobats.”</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">“She’s spending excessively. I heard she wants to match everything to our Xu family; how audacious,” Xu Shi said, seeing the money flowing like water.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">It should be known that coming from Jizhou, they had abandoned many trunks, and the money they received had to be used to tip servants. They also added a few more dishes on regular days, which cost quite a bit. Especially since Xu Shi has been searching for a high-quality golden nanmu coffin for elder Madame Xu, which will be quite expensive.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Elder Madame Xu snorted coldly: “I’ve seen it; this family can’t tolerate us anymore. However, we’ll soon rise.”</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">“Aunt, what do you mean by that?” Xu Shi was puzzled.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Elder Madame Xu said, “Your brother told me he met the widow of the late Prince Wei, the biological son of Prince Wei, and his mother, Yin Lifang. She told your brother that she was betrothed to Li Cheng, but Prince Wei forcibly took her. Now, she wants to seek refuge with Prince Wang. This mother and son are valuable assets. The prince will surely thank us. Once the Xu family rises, we won’t have to tolerate anyone else’s disrespect.”</p><p id=\"paragraph-114\" data-paragraph-id=\"114\"></p><p id=\"paragraph-115\" data-paragraph-id=\"115\"></p>\n</div>"
  },
  {
    "number": 77,
    "title": "Chapter 77",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 77</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Two Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Slow down, son, slow down.\" Yin Lifang felt quite upset seeing her son gobble down his food.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">After Xie Jiuyi was defeated and stripped of his power, Yin Lifang decisively fled with her son and guards. Life on the run was unbearable, and she lived in constant fear of being caught by Xu Cifei's or Wei Duo's men—if they found her, there would be no escape. So, she thought of Li Cheng. When Prince Wu passed away, it was Prince Wei who took in Li Cheng. Given their past connection, it was only right that Li Cheng should take them in now.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">But before they even reached Xuzhou, they ran into countless difficulties. Fortunately, her husband's former subordinates took them in, and for the first time, they had a hot meal.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Li Jing picked up a piece of wild rabbit meat. \"Mother, this rabbit meat is really fragrant.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Yin Lifang smiled. \"I'm glad you're enjoying it. There's also steamed pork. You used to find it too greasy and would blanch it in boiling water made from premium tea leaves to cut the richness. Now it tastes good, doesn't it? Look, there's dried plum vegetables underneath.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">...</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">What Yin Lifang and her son said reached Xu Shao, and he spoke to his wife. \"Remember when Prince Wei was still alive, and the Prince of Yuzhang was like a dragon-son, a phoenix-grandson? Now, he's like a beggar.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Madam Xu said, \"We should inform the prince as soon as possible. As a member of the same clan, he will surely value the connection.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"I'm afraid the prince might not agree. Many of Prince Huaiyin's subordinates were originally Prince Wei's men. If the Prince of Yuzhang comes, it will be hard for the old master and the new to coexist,\" Xu Shao replied, voicing his concerns.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Unlike Elder Madame Xu, the couple had some insight, so Xu Shao added, \"I plan to have my brother-in-law speak on our behalf. If something goes wrong, we won't be blamed. And if Prince Huaiyin is kind-hearted, he will certainly reward us.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Madam Xu smiled. \"Imperial Concubine Yin mentioned that she has a past connection with the prince. I've already had clothes and shoes prepared so she can rest for a few days before meeting him.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Zheng Fang had recently felt that he'd put on a little weight. After yawning one morning, he admitted that while he had no patience for fishing, he certainly had an appetite for eating fish. Thanks to being the father-in-law of Prince Huaiyin, he was constantly invited to banquets.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Hearing that a full fish banquet was being prepared for him, he got ready to go out after washing up. Madame Ji reminded him, \"Don't be greedy. Since ancient times, there's no such thing as a 'good banquet.' If people ask for your help, don't agree.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"Do you think I'm an idiot?\" Zheng Fang shot back.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">\"You're not foolish, just greedy,\" Madame Ji hit the nail on the head.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Zheng Fang was speechless. \"Alright, alright, I'll make a quick exit after eating, okay?\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"If you want to eat something, we have everything at home. There's no need to go out,\" Madame Ji replied, though she knew he wouldn't stay in. Still, she prepared a pouch for him.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Zheng Fang felt the small silver coins in the pouch, knowing they were for tipping people and appreciating Madame Ji's thoughtfulness. He smiled and said, \"Don't worry, I'll be back after I finish eating.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Knowing this old fox was brave in battle but lacked strategy and was as cunning as ever, Madame Ji decided not to press the issue.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">After Zheng Fang left, his daughter-in-law Cui Yuehuan and her sister came to pay their respects. Madame Ji quickly asked them to rise. \"Second Madam, just accompany your aunt and have some fun.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Cui Yuehuan smiled. \"My sister has already secured a house and is preparing to leave. I couldn't keep her, and she wanted to say goodbye to you, so I brought her over.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">It turned out that Sister Zhang's husband had found a house and was about to take Madam Zhang away. While the Zheng family was welcoming, Madam Zhang felt uneasy staying there as a guest.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Madame Ji tried to persuade her to stay and had another banquet prepared to see Madam Zhang off.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">As for Li Cheng, he had already heard that Yin's mother and son had arrived. He actually hoped they would find a chance to hide and live a peaceful life. Li Jing didn't have the ability to do much, and if they had come to him for refuge right after Prince Wei's death, he might have taken them in. But now, Yin's mother and son were at their wit's end and expected him to take them in and share his resources. How could that be possible?</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">When Prince Wei was alive, he treated Li Cheng like a steward, putting him in charge of the prince's mansion while all the best opportunities went to Prince Wei's relatives. It wasn't until Prince Wei's relatives fell out of favor that Li Cheng was sent to take Xuzhou, and later, he was forced into a marriage alliance with the Zheng family. Although he and Huiyin had hit it off by chance, according to Prince Wei's original plan, wasn't the idea to first use the marriage alliance with the Zheng family, knowing full well that Li Cheng disliked the Zheng family's character, anticipating that the couple would not get along in the future?</p><p id=\"paragraph-27\" data-paragraph-id=\"27\"></p><p id=\"paragraph-28\" data-paragraph-id=\"28\"></p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">He didn’t blame the late Wei King, knowing that if their positions were reversed, he too would have feared someone gaining too much power. Similarly, he didn’t want the Prince of Yuzhang to grow stronger now.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Just as this thought crossed his mind, he heard that Zheng Fang had arrived, and Li Cheng had someone invite him over.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Zheng Fang had just come from a banquet featuring a whole fish dish, his face still flushed with alcohol. He smiled and said, \"I heard a curious thing from the Xu family yesterday. I was going to tell you earlier, but I was afraid you’d still be resting, so I delayed until now.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"Oh, what curious thing? Father-in-law, please do tell. Make yourself comfortable,\" Li Cheng invited Zheng Fang to sit.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Zheng Fang glanced at Li Cheng and said with a smile, \"It’s strange, but Xu Shao found a child on the road who looks like the Prince of Yuzhang. He didn’t dare decide anything on his own and wants you to go identify the child.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Li Cheng was about to refuse when a plan formed in his mind, so he smiled and said, \"The Prince of Yuzhang? I last heard he went missing in Yangzhou. How did he end up in our Xuzhou?\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Seeing Li Cheng’s relaxed expression, Zheng Fang added, \"I don’t know. In my opinion, this child is probably frightened out of his wits by Wei Duo. You just need to send him back to Yangzhou.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Li Cheng understood Zheng Fang’s implication. It was an opportunity to take Yangzhou under the pretense of sending the Prince of Yuzhang back. The late Wei King had done the same thing.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">However, Li Cheng wanted more than just Yangzhou; he wanted the entire world.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"I understand. Thank you for informing me, Father-in-law,\" Li Cheng said, looking up.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Zheng Fang immediately took the opportunity to leave.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Soon after, Li Cheng went to see Huiyin and told her about the situation. \"What do you think?\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"If we just send him off, it could backfire on us. After all, Wei King once took you in. If you abandon his son, people will see you as ungrateful. Moreover, the Prince of Yuzhang is your cousin. If you stand by and do nothing, how can you expect your subordinates to fight for you?\" Huiyin replied.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Just like how she wouldn’t mistreat her servants, or they’d stop fighting for her. Now that Li Cheng’s territory had grown larger, with more people, it was natural for discord to arise. If anyone were to suggest that Li Cheng treated his kin as enemies, his subordinates would view him as ruthless and unfeeling.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Li Cheng said, \"You, who have never liked the Yin sisters, are surprisingly more generous than I expected.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"I know you came to ask me because you care about my feelings. In my opinion, it would be best for Yin Cifei and her son to stay in our mansion. However, they are the widow and son of Wei King, and the Prince of Yuzhang was never on our side. So, I suggest we invite them to stay at Shuixiu Villa. What do you think?\" Huiyin proposed.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">If they were to stay in Huaiyin Mansion, Yin Lifang wouldn’t be content to remain quiet. They weren’t ordinary relatives seeking refuge.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Li Cheng shook his head. \"No, there’s no need for that. I’ll handle this myself, but I’ll discuss it with only one person. Originally, I planned to use Wei Duo’s massacre of the crown prince to start a rebellion. But I can’t just wait to reap the benefits. I’m thinking of using the Prince of Yuzhang to challenge Wei Duo and take both Jianye City and Yangzhou.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"What do you plan to do?\" Huiyin actually thought Li Cheng’s plan was quite good.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Li Cheng continued, \"I’m also worried that if we keep the Prince of Yuzhang in our mansion, some might try to seize power while I’m away taking Jianye. So, I plan to bring Li Jing with me to the frontlines. This way, I’ll be at ease, and it will also prevent the people in Jianye from making any rash moves. As for Yin Lifang, why don’t we send her to keep the Dowager Company?\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Huiyin smiled after hearing this. \"You can be quite mischievous.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">She understood what Yin Lifang was planning, and so did Li Cheng. With Li Cheng not in the mansion, Yin Lifang’s schemes would be like throwing flirtatious glances at a blind man—pointless—and her contact with the outside world would be limited.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Li Cheng thought for a moment. \"I can’t just watch from the sidelines anymore. We’ve rested and gathered our strength long enough. This year, our granaries in these regions are full. I need to make a move. If we can take Yangzhou, then head south to capture Jingzhou, I might as well declare myself emperor.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"It’s good that you have such ambitions, but proceed with caution,\" Huiyin was slightly worried.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Li Cheng smiled. \"I always carry the heart-protecting mirror you gave me. Don’t worry.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">After staying idle for too long, both people and soldiers would grow rusty. Huiyin agreed.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">It was also on that day that Li Cheng had the Xu family send Yin Lifang and her son over. Yin Lifang looked at herself in the mirror, applied some decorative flowers, and changed into brand-new clothes. She then said to Li Jing, \"When you meet your cousin, try to be a little warmer.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Li Jing was no longer just a child. He felt that his mother’s attire was inappropriate and felt a sense of shame, but he couldn’t control his own life.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">The Xu family hadn’t expected anyone to show up so quickly after Zheng Fang’s message. Xu Shao and his wife, now seeing themselves in possession of a valuable bargaining chip, became even more affectionate and respectful towards Yin Lifang and her son.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">\"Madam Xu, please rest assured that as long as there is a day for us, there will be a day for you as well.\" Yin Lifang also promised the Xu family.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Now, the only people she could rely on were the Xu family. The Xu family wanted to hold onto her as a valuable asset, so she decided to give them that hope.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">With such a public display, Madame Ji also found out. She had just learned from Zheng Fang that Elder Madame Xu had mentioned something about a previous marriage arrangement between Li Cheng and Yin Lifang, which infuriated Madame Ji.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Xin Shi and Cui Yuehua were both sitting below. Cui Yuehua was genuinely worried, as their fates were tied to Huiyin. If her status was threatened, they would also suffer. However, Xin Shi, while showing sympathy on the surface, felt a sense of vindication in her heart. Previously, Madame Ji hadn't helped her with Dong Shi's matter, and now she was anxious about her own daughter. Wasn't this karma?</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">\"Madam, please don't worry, our Prince and Princess have a good relationship. I believe those rumors from the past were just idle talk.\" Xin Shi comforted.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Actually, Cui Yuehua had heard something about it years ago when the Princess of Wei mentioned it to her family. But how could she bring it up now? She only said, \"Madam, why don't we go to the mansion and see for ourselves?\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">\"The Princess values her reputation; we shouldn't go and make things worse.\" Madame Ji knew her daughter well; she had her methods and didn't like to show weakness to others.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Cui Yuehua quickly added, \"Yes, and that Yin Cifei is technically the elder of the Prince. Our Prince is a man of principle and wouldn't let anyone gossip about it.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">\"Yes, the Prince's character is truly impeccable, how virtuous he is.\" Madame Ji, feeling relieved, sighed, \"I've always known how strict he is, even with the imperial examinations. He wouldn't give an inch to relatives. Some of these rumors are just meant to throw us off; there's no need to take them too seriously.\" Madame Ji had thought it through and understood.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Cui Yuehua smiled, \"Yes, I feel the same way, Mother.\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">After the two daughters-in-law left, Cui Yuehua invited Xin Shi to sit with her. Xin Shi said, \"There are still many things at home, so I won't stay long, please forgive me, Sister-in-law.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">\"If you say that, you're distancing yourself from me.\" Cui Yuehua didn't really expect Xin Shi to come over.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">They exchanged pleasantries and returned to their rooms. Nanny Rong had someone bring tea, \"You've been talking upstairs for a while, your throat must be dry. Have some tea to moisten your throat.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Cui Yuehua took the tea and couldn't help but smile, \"I see Big Sister is still angry at Madam Dong? It's as if she's holding a grudge against Madam. In the past, when she asked Madam for favors, she was so affectionate. Now, just because things haven't been going her way, her attitude has cooled significantly.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">\"Exactly, actually Big Madam's life is quite comfortable. Madam Dong brought a large sum of money and didn't have any children, so it all went to Master's son. How could she complain?\" Nanny Rong couldn't understand it either.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Cui Yuehua said, \"Maybe Madam Dong was too good, not fighting or grabbing, just looking for support. If she had been more cunning or manipulative, it would have been different. I think she's genuinely an honest person. My husband is different from Big Master; he's sincere and passionate about everyone. He went to train the navy and didn't come back for half a year. I had a girl prepared at home for him, but he didn't take her.\"</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Nanny Rong added, \"But it's not Madam's fault. Madam even went to ask the Princess about it. The Princess is a rare sensible person; how could she meddle in her brother's household affairs?\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">\"Exactly, if she really objected, why didn't she talk to Big Master herself? Instead, she's inciting others to take the lead. It's really annoying to watch.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Nanny Rong handed over a piece of ginger plum, \"Why get worked up over her? Let her play smart, but the Princess might see through her.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Mentioning the Princess, Cui Yuehua said, \"Nanny, to be honest, why do you think the Prince is taking care of Yin Lifang and her son? Is it really because he's a good person?\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Nanny Rong knew the truth well; Yin Lifang and Li Cheng were indeed genuine cousins.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">But she couldn't say it out loud, only pretending to be unaware and claiming not to know.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">It was also said that Grand Dowager Wu had liked Yin Lifang back when she was in the Prince of Wei's mansion. Now, seeing Yin Lifang and Li Jing coming over, she personally had Nanny Fan help them up.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Huiyin noticed and said, \"The Prince didn't know you were in distress. It's quite a coincidence that the Xu family found you in such a situation.\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">\"Yes, it's truly providential that we encountered the Prince and Princess; now we have a place to stay.\" Yin Lifang had come to Huaiyin Mansion once before to persuade Li Cheng for the Prince of Wei, but she hadn't paid much attention to the mansion at that time. Now seeing it, it wasn't smaller than the Prince of Wei's mansion.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">It was already evening, but the place was lit up brightly, with servants standing in rows. The carved beams and painted rafters were magnificent, not to mention the jade glass lanterns, lotus candle holders, crystal curtains, white jade steps, fine gauze embroidered screens, and famous calligraphy and paintings...</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">She had once been accustomed to such luxury, but when she went to Yangzhou, it wasn't as grand as Jianye, and living at the Xu family's home was even more stifling. Not to mention the rush during the journey. Seeing such a splendid and rich place again, Yin Lifang felt as if it were a dream from yesterday.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Huiyin invited them to sit, and outside, they asked Li Jing to go out for dinner.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Li Jing instinctively looked at Yin Lifang, who said to him, \"Go ahead.\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">The table was filled with a feast of dishes from land and sea, and maids kept entering in a line to serve. The most interesting dish was crab-stuffed oranges, prepared with exquisite craftsmanship.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Even that night, the room where Yin Lifang was staying, prepared by Grand Dowager Wu, was meticulously arranged, with high beds, soft pillows, fragrant scents, and beautiful maids attending to her, all pleasing to the eye.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">\"Here, this is a reward for the two of you.\" Yin Lifang was quite generous in this regard, giving away two thick gold hairpins without hesitation.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">The two maids didn’t dare to accept them, but Qiaozhen, who was by Yin Lifang’s side, persuaded them, \"If the two sisters don’t take it, our lady will be upset.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Only then did they accept the gift.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Yin Lifang then said, \"There’s no need for you to stand guard tonight. I have Qiaozhen to attend to me.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">The two maids, very discerning, withdrew.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Once they had left, Qiaozhen said in a low voice, \"Our Prince of Yuzhang has settled in the front courtyard. Do you think there will be any issues, madam?\"</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">\"Whether there are issues or not, we’ve already arrived at the mansion. It’s a situation where they are the knife and we are the fish. What can we do? Jing’er still has a few years before he gets married. I think Li Cheng will handle him the same way the Prince of Wei once did.\" This thought gave Yin Lifang some comfort.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Li Cheng was someone she had known since childhood, so he couldn’t be all that bad—certainly better than someone like Wei Duo.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">However, Qiaozhen wondered to herself if Yin Cifei, despite her careful grooming, had even met the Prince of Huaiyin. She also noticed that Yin Cifei didn’t seem concerned about the Prince of Yuzhang. She even wondered if Yin Cifei was planning to offer herself to the Prince of Huaiyin.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Indeed, Yin Cifei was still young and fertile. The Prince of Huaiyin was excellent in war. If he were to rule the world in the future, it wouldn’t be a bad idea to follow him.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">But these thoughts she could only keep to herself.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">It was also the first time that Li Jing spoke to Li Cheng as if he were an adult. Li Cheng was telling him, \"Settle down here for now. You can read more often. Since you're older, you'll be moving to the outer courtyard. The Grand Dowager will send someone over.\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">\"Yes, I'll follow Elder Brother's advice.\" The Prince of Yuzhang felt more at ease, seeing that Li Cheng's household was more orderly than the Prince of Wei's residence.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Li Cheng smiled, \"I won’t disturb you then. Stay comfortably here. If you need anything, ask your sister-in-law.\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">After exchanging a few more words, Li Cheng promptly summoned his advisors.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">With Yin Lifang and her son safely settled, Huiyin treated them with the same provisions as herself, which caused Madame Ji to come over personally, stirred up by rumors.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">\"I've heard some idle talk, I don't know if it's true or false, but I was afraid you might be betrayed.\" Madame Ji was most worried about her daughter.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Huiyin said, \"Mother, Yin has other uses. I can’t tell you exactly what they are, but rest assured, I’m not so foolish. The prince treats me just as he always has.\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">The concern from her family warmed Huiyin’s heart, but some matters couldn’t be resolved by familial concern alone.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Just like Yin Lifang, if she were in Yin Lifang’s position, Huiyin didn’t know what she would do—hiding for fear of betrayal, seeking refuge and fearing death, the difficulties were endless. But she would never pin her hopes on someone else to restore her fortunes.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Yet, Yin Lifang still thought this way, appearing content with her support, believing it could give her justice.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Elder Madame Xu and her followers had been feeling particularly satisfied lately. Elder Madame Xu had always been a bit eccentric, and now with Xu Shi by her side, the aunt and niece stirred up trouble for no reason, hoping someone would challenge Huiyin, thus curbing Madame Ji's arrogance.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">At noon, the two were sharing pears to eat. Elder Madame Xu loved pears, but they were too cold, so she only ate a small piece each time. Fortunately, now Xu Shi could share them with her.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">\"These are jade pears. We only got this basket in the entire mansion, and it’s all here with me. It shows how filial the Duke is.\" Elder Madame Xu, eating the juicy pear, was in high spirits.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Xu Shi smiled, \"It’s because the Duke sees that Second Miss is incapable. He’s just trying to curry favor with our Xu family.\"</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">It was a bit of a hypocritical statement, but Xu Shi knew that Elder Madame Xu liked to hear it.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">\"Actually, I also hope our family does well, but if Huiyin gains power, she won’t help Deyin.\" Elder Madame Xu lamented.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">If Huiyin were willing to help, Elder Madame Xu wouldn’t feel so resentful.</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">The two women, their lips glistening with juice, wiped their mouths with several fine silk handkerchiefs when they saw someone requesting an audience outside. Elder Madame Xu was puzzled, \"What does she want at this time?\"</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">They came without sending a formal invitation or notifying us in advance, rushing over unexpectedly.</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">As soon as Lady Xu greeted elder Madame Xu, she immediately said, \"Aunt, just now the Prince of Huaiyin mobilized his troops, saying he wants to take back Jianye and Yangzhou. Not only that, but he also brought the Prince of Yu Zhang to the front lines. Our elder master, having once been an aide to Prince Wei and still connected with Prince Wei's former subordinates, went to inquire. Some of Prince Wei's former subordinates wondered if this place was being given to the Prince of Yu Zhang. At the time, the Prince of Huaiyin suppressed his anger, but today he found an excuse to have him whipped thirty times with a horsewhip and had General Pei, your eldest son, take over his position.\"</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">\"We fear that the Prince of Huaiyin may be using the Prince of Yu Zhang on the front lines with the intention of having him meet a mysterious end, in order to claim Prince Wei's territory.\"</p><p id=\"paragraph-123\" data-paragraph-id=\"123\">Elder Madame Xu and her niece were neither interested in nor understood such political machinations. At most, they just wanted to make Huiyin's life a bit more difficult, but they had no influence over such important matters.</p><p id=\"paragraph-124\" data-paragraph-id=\"124\">Just as the tension in the room thickened, Zheng Fang burst in and declared, \"You truly have not given up your treacherous intentions. As the father-in-law of the Prince of Huaiyin and a member of his inner circle, I cannot tolerate anyone undermining the Prince of Huaiyin on his own turf. Today, I must act for the greater good, even if it means turning against my own kin.\"</p><p id=\"paragraph-125\" data-paragraph-id=\"125\"></p>\n</div>"
  },
  {
    "number": 78,
    "title": "Chapter 78",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 78</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combining Two Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Zheng Fang personally reported that the Xu family had repeatedly incited the Prince of Yuzhang to secretly encroach on the Prince of Huaiyin's territory, distorting the Prince of Huaiyin's true intentions. He requested that Li Cheng impose punishment.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Li Cheng thought that last time, he hadn't made a strong enough example of them. Originally, he had taken in the Prince of Yuzhang, and if the prince were to truly ascend the throne in the future, granting some fiefdoms to Li Jing would be sufficient. However, his goodwill didn't mean he would treat him as a fool. Prince Wei hadn't become emperor yet, but already people were trying to force him to pledge loyalty.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">\"Someone, take Xu Shao to the water prison and place him under strict guard. No one is to come out without my orders. His son's position shall also be revoked.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">After giving the order, he felt that Zheng Fang was indeed quite insightful. No wonder Lü Wei had favored him in the past.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Despite being related by marriage, Zheng Fang didn't show any favoritism and even exposed the Xu family's actions. Li Cheng shook his head and continued to inspect the rations and military supplies.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Strangely enough, Yin Lifang had been fawning over Grand Dowager Wu, who had generally liked her. But today, when Yin Lifang came over, Grand Dowager Wu didn't give her a pleasant face. Not only that, but she also made sarcastic remarks, causing Yin Lifang great embarrassment.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Huiyin saw Yin Lifang come out dejectedly and didn't understand why. After entering to pay her respects, she heard Grand Dowager Wu say, \"I say that Yin Lifang is just a concubine; she's not even the principal wife of Prince Wei. When Prince Wei was alive, he didn't give extra favors to Cheng'er. This Xuzhou was taken by Cheng'er himself. Why should you treat Yin Lifang with such courtesy? You can be nice to people, but don't expect them to be nice back.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"What's going on?\" Huiyin didn't understand.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Grand Dowager Wu naturally wouldn't say it outright, and it wasn't until Madame Ji came over that Huiyin learned that Zheng Fang had passed the information to Grand Dowager Wu through someone close to her.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">The original words supposedly said that Yin Lifang had come with her son to deliberately seize territory. Grand Dowager Wu, being a widow raising her son, could tolerate many people liking her grandson, but she wouldn't allow anyone to encroach on his territory, hence her unfriendly attitude toward Yin Lifang.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin couldn't help but ask, \"Mother, even though that's the case, it took me a long time to gain the trust of those around Grand Dowager Wu. Where did Father find this person?\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"I heard that during a drinking session, someone introduced a fortuneteller who is very accurate and often interacts with Grand Dowager Wu. It's likely that person was entrusted.\" Madame Ji said.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Huiyin smiled, \"Grand Dowager Wu has always been quite superstitious. So that's how it is. Please thank Father on my behalf this time.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Madame Ji neither agreed nor disagreed, \"It's what should be done.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Her father could sometimes be unreliable, but at other times, he did things that were quite unexpected, making him hard to evaluate.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Yin Lifang, on the other hand, suspected that Huiyin was behind this. The lifeline she could now grasp was only Li Cheng. Grand Dowager Wu had clearly liked him before, and Li Cheng had also treated them mother and son with courtesy. Suddenly, he deliberately made things difficult for those who were good to Li Jing and threw the Xu family into the water prison. Even Grand Dowager Wu was unfriendly to her today.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">She didn't understand.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Qiaozhen had to comfort her, \"Your Highness, it's okay. We're only staying here for a few days. It's better not to flatter.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"That's true, but...\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Without the support of Grand Dowager Wu, Yin Lifang naturally found it difficult to navigate the inner household. Even though Huiyin wouldn't reduce her allowance or target her, everyone in the Prince of Huaiyin's mansion had eyes. If you weren't favored by the masters, the servants wouldn't respect you either.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">If it were Huiyin, she would remain silent, read more books to settle down, and wait for a better future. She might even find a temple to wait until the Prince of Yuzhang achieved something and then have her brought out.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">But clearly, Yin Lifang wasn't that kind of person. She had been able to hold her ground because she had given birth to the eldest son, and even Lady Huo had to rely on her son. Now, being anxious and out of touch with both internal and external matters made her uneasy, worrying that someone would harm her every day.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">That night, she even had a nightmare where Jianjia stood by her bed and shouted, \"Lady Yin, how could you leave by yourself? We are so miserable...\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Yin Lifang woke up drenched in sweat, her heart pounding.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">However, no one cared about this anymore. Huiyin was preparing Li Cheng's war supplies. Originally, she didn't understand these things, but now she was quite proficient.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"This is the longest time you've stayed at home. I've packed the breastplate, alum, poisons, antidotes, and some ready-made prescriptions for injuries. Stay focused on the battlefield and don't worry about home.\" Huiyin said.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Li Cheng nodded, pulled Huiyin into a tight embrace, and then strode out, ready for battle.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Yuwendang, who has always been by Li Cheng's side, will accompany him. Additionally, there were Pei Shuo and Zheng Wuheng's brothers, who were fierce in battle and utterly loyal to him. Besides them, there were the generals he had trained over the years.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">In the army, he didn’t play favorites; promotions were based solely on military merit, unlike Prince Wei, who made his preferences too obvious.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">The carriage behind held the Prince of Yuzhang. When Li Cheng took him to the battlefield, it wasn’t to send him to his death, but to prevent anyone from taking advantage of the situation and causing trouble. Although Li Cheng figured an eleven-year-old boy should already be skilled with a bow and horse, Li Jing was neither his child nor his brother, so he didn’t bother saying anything unpleasant.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">After Li Cheng and the others left, the women became more idle. Ji Shi often came over with Cui Yuehuan to play card games, and Xin Shi occasionally joined them. If she wasn’t feeling well, she would send either Madame Miao or another lady in her place.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">On this day, Xin Shi did come. As the weather turned cooler, she wore a brocade jacket with pearls sewn along the collar and lapel. Huiyin smiled and said, \"These pearls look nice.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Cui Yuehuan quickly added, \"My lady, these were given by Madame Dong.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"So it was her.\" Huiyin thought that if Xin Shi really disliked Madame Dong, she shouldn’t accept these things, just as Huiyin wouldn’t even look at the chests brought by Yin Shi.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">You hate people for stealing your husband, yet you still covet their gifts. Isn’t that hypocritical?</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Xin Shi couldn’t read Huiyin’s expression, and seeing her as usual, she thought that the princess probably didn’t even recognize Madame Dong. This put her at ease.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Huiyin wasn’t about to lecture Xin Shi over this. They were grown-ups, after all, and no one likes being lectured.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Everyone continued playing cards. Cui Yuehuan felt a little embarrassed for speaking out of turn, and Huiyin found it rather amusing. This brother and sister-in-law were both straightforward, wearing their likes and dislikes on their faces.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">But this could easily cause resentment. If she ran into someone with a big heart, it wouldn’t be an issue, but if someone with ill intentions noticed, it could lead to enmity.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Now, Xin Shi was seething with resentment toward Cui Yuehuan. The moment she got into the carriage, she vented to her trusted servant, \"Did you see how she went out of her way to embarrass me in front of the princess today?\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Just let it go, my lady. She’s only been married a few years and is still in the honeymoon phase, thinking she’s as extraordinary as Chang'e descended from the heavens.\" The servant could only comfort her this way.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Xin Shi smiled faintly. \"Forget it. Her good days will come to an end soon enough. With all that tongue-wagging, the princess will eventually grow tired of her.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"Indeed, you can see the princess keeps her cool and hides her true feelings. She probably doesn’t care about that Yin woman at all. It’s said she dislikes people like the Second Madam, who are noisy and flustered.\" The servant remarked with feeling.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Before, when the princess was still in her maiden home, people often compared her with the eldest young lady. They always said the eldest was suitable for the household, while the second young lady had a somewhat peculiar temperament.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">The so-called peculiarity didn’t refer to strange behavior, but rather that she was different from ordinary people. Her eyes were sharp, her actions decisive, and she always kept her word. Her way of dealing with people often went against the grain of society.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">However, she was indeed very beautiful. It was said that someone had committed suicide for her, and she didn’t feel guilty. Instead, she said that such a fragile person, if not loved by someone, would resort to suicide. In the future, whenever something displeased him, would he use these things to manipulate others?</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">At that time, they already felt the princess was extraordinary. However, since coming to Xuzhou, although she rarely saw the Prince of Huaiyin in the rear court, whenever they saw the couple together, they felt the princess had completely changed. She became gentle and charming, and with her outstanding appearance, sometimes tender like water, sometimes coquettish and lovely, it was clear she was living a good life, with a harmonious marriage.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">A prince without concubines or even a bedmate, completely devoted to her, was as rare as a precious gem.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Moreover, the princess was also quite capable. It was said that she was in charge of procuring military supplies in the rear. She wasn’t someone who particularly liked socializing, but she managed to bring together all the noble families in Xuzhou. No one knew exactly how she did it.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">After discussing for a while, Xin Shi and her servant could only advise themselves to let go and wait for another day, as there was nothing they could do about Cui Yuehuan.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">When she returned home, Madame Dong and the other two concubines came to serve her. Xin Shi was indifferent. She knew that if she really caused trouble for Madame Dong, Pei Shuo wouldn’t actually divorce her. But doing so would weaken the bond between the couple.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Moreover, within the borders of Xuzhou, the prince had once said that even servants' deaths must be examined by the authorities and not disposed of privately.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"Madam,\" Madame Dong was very obedient.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Xin Shi waved her hand. \"I’m tired too. Sisters, go and rest. Ziying, the princess sent several boxes of fruit-filled pastries for me to bring back. You all can share them.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Everyone received a share, even Madame Dong. The maid serving Madame Dong, Wunier, said, \"My lady, the fruit-filled pastries from the princess's small kitchen are famous in Xuzhou. Many high-ranking officials in Xuzhou consider it an honor to eat them.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Wunier, a maid given to Madame Dong by Pei Shuo, was the daughter of his wet nurse. She had previously served in the study, and later Pei Shuo unintentionally took her in, specifically assigning Wunier to serve Madame Dong. Madame Dong originally had two attendants and brought two young servants with her, but they didn’t know much about the Zheng family. Only Wunier was knowledgeable about these matters.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"In that case, you should put them away carefully and bring them out when guests come,\" Madame Dong said, cherishing them.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Wunier smiled and agreed.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Dong Shi had seen many valuable things while by Lü Wei's side, so she had quite a bit of standing with Yu Dalaoye. However, it was a different story in the Pei family. Pei Shuo held a high position, and his two younger sisters were both married into the royal family, talented and insightful. She admired him greatly.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">But now that Pei Shuo was gone, life felt much harder.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">It was said that after the card game today, Huiyin got up and went to lie on the daybed in the inner room. Playing cards could be tiring, and lying down felt more comfortable.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Of course, lying down also made one easily dizzy.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Fortunately, before long, Jing'er and Zhan'er came, and with the children around, having meals together was much more enjoyable. Today, there was Eight-Treasure Duck and Black Bean Duck on the table, both of which the children loved. Jing'er had just finished a riding and archery lesson and was famished.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">\"Mom, the duck meat isn't the best part of the Eight-Treasure Duck—it's the glutinous rice and shrimp that really stand out,\" Jing'er said as he scooped up a big bite of rice.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">This wasn't a banquet for guests, just the three of them eating, with dishes they each loved. Jing'er ate by himself without needing anyone to serve him.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Zhan'er said, \"I love chicken legs like Father.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">\"Then this big chicken leg is yours,\" Huiyin said, grateful that both her children were not picky eaters. Yesterday, she saw that Guge was very picky, refusing to eat anything with scallions, ginger, garlic, or even a bit of fat, and even disliked the crystal trotters.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Before they finished eating, Nanny Nan came in and said, \"Your Highness, it seems that Yin Lifang is unwell.\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">\"Get a doctor to see her and make sure to keep records of her condition,\" Huiyin said. It was no surprise that Yin Lifang was sick. After a long journey, the women were weak and not accustomed to the local water. It was normal, but records were needed in case someone tried to cause trouble.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">An hour later, Huiyin heard that Yin Lifang's illness was just many dreams and night sweats, and that she needed rest.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Huiyin nodded. \"Make sure she rests well.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">In the past, when she was in the Prince of Wei’s Mansion, Yin Lifang always felt she had to endure and wished to quickly support her son to become the future prince so she wouldn't have to compete with other concubines and her son would be safe.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Unexpectedly, after the Prince of Wei died, her troubles only worsened. Living under someone else's roof and constantly worrying about others' moods was something she had never experienced before.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Yes, Zheng Huiyin was indeed well-provided for, but she wasn't particularly close to anyone. The servants didn't dare to go too far because she managed the household well and dealt with matters fairly.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Qiaozhen brought the medicine and said, \"My lady, please drink some medicine and rest.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">The bitter smell made Yin Lifang uncomfortable. She said, \"Do you think Prince of Huaiyin will win this battle? I'm really worried about Jing'er.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">\"Don't worry, I'm sure he'll win,\" Qiaozhen said, trying to reassure her.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">If Li Cheng also lost, what would happen to them?</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Yin Lifang's unnecessary worries made her fall asleep after taking the medicine. She had come to Li Cheng with her son, leaving Dong Shi and her daughter behind, thinking that with the Dong family's support, they would be fine. But she didn't know why she dreamt of Jianjia.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">...</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">The constant stream of medicine for Yin Lifang annoyed Grand Dowager Wu. Being of advanced age, she disliked hearing words like \"illness\" or \"death\" and couldn't bear the smell of medicine.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Therefore, she insisted on moving Yin Lifang away, and Huiyin had no choice but to set aside a courtyard in the west for Yin Lifang to live in separately.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Fugui couldn't help but say, \"Previously, the Dowager always praised this Yin Fei. Now, it seems she is not that great.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">\"She was praised to make me look bad. After all, it doesn't cost anything to praise someone. But now that Yin Lifang is no longer useful, of course, they're turning against her,\" Huiyin said.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">After saying that, she couldn't help but think that if something happened to Li Cheng, it would be the same for her and her sons, even with her father and brothers. Truly controlling the world would still be difficult.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">The front lines were, of course, very tense. This time, Wei Duo had not only brought his own troops, but the Crown Prince had also come with Shi Chong. The Crown Prince knew that if Wei Duo won, he might be deposed, and if Li Cheng won, he might even usurp the throne.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">After all, Wei Duo was an outsider, while Li Cheng was the son of the King of Wu.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">When Li Cheng heard that the Crown Prince had arrived, he clapped his hands and laughed. \"This is perfect.\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">It’s best to take them all out at once.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">It was also said that the crown prince’s expedition delighted De Yin the most. The person who had oppressed her was gone, and Consort Wei had finally calmed down. Yunzhi had given birth to a son this time, and with her improved status, she wouldn’t bother her anymore.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Without the crown prince, the palace was very quiet.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">But the food wasn’t as good as it used to be. The palace maids were full of complaints, and De Yin thought to herself that even a tiger that has fallen from power could still be bullied by dogs.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">In the previous life, the crown prince had barely survived thanks to Zheng Wuheng. He had later managed to hold his own against Li Cheng. It was uncertain whether it would be the same this time.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Xu Huiyin also received a letter from Li Cheng. The handwriting was rushed, with loops and hooks, suggesting it was written quickly. In her previous life, Li Cheng had attacked Xuzhou, and Huiyin had been very surprised at how difficult it had been for him, so much so that even her younger brother had nearly perished there.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Now, the situation had completely reversed. Li Cheng was leading her brothers to fight the crown prince and Wei Duo.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">The vicissitudes of life were truly unpredictable.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Her elder sister believed that Huiyin became Empress in her previous life because she married the right man. However, she didn’t realize that one also needed to rely on their own efforts.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Meanwhile, Li Heng had also brought his troops. Wei Duo didn’t like the crown prince and felt that he was doing this deliberately. He had tried to drive him away several times, but he wouldn’t leave.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">\"What do you think the crown prince is coming for?\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">\"Probably to deal with Li Cheng. Last time, Shi Chong was defeated, and that petty man incited the crown prince to come.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Wei Duo stroked his beard and said, \"I think the crown prince wants to reap the benefits of our conflict. Look, we've been fighting for a month, and only now does he come.\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">The advisors around couldn’t help but find it amusing. Why try to profit from others’ conflicts when he could just focus on being a proper crown prince in the capital?</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Li Heng didn’t want to be a puppet crown prince anymore, so he had to seize power and intimidate those around him.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">The frontlines were tense, so Huiyin didn’t have time to prepare for flower banquets. However, Zheng Fang continued to eat and drink as usual.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">When he was in charge of Jizhou, he often couldn’t sleep. Now that the pressure was off, he had no stress. He took a nap at noon and yawned when he woke up.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Xu Shi was sent back to the nunnery. As for Elder Madame Xu, it was said that she had fallen ill from anger. Only then did he step forward to visit his mother.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Elder Madame Xu was on a hunger strike. With Li Cheng gone, she wanted Zheng Fang to release Xu Shi. If Zheng Fang refused, she wouldn’t drink a single drop of water.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">\"Is Elder Madame Xu still not eating?\" Zheng Fang asked outside his mother's door.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Nanny Luo cried and said, \"Yes, Marquis, I beg you, please agree to Elder Madame Xu's request.\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Zheng Fang was also in a difficult position. \"It was decided by the prince. As the saying goes, the state has its laws, and the family has its rules. How can I just go to the dungeon and release someone? Besides, I’ve just arrived and don’t even know where the dungeon is.\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Upon hearing this, Elder Madame Xu, who was on a hunger strike, felt even more desperate. Her son not only wouldn’t save his sister but also betrayed her family. He was truly heartless.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">At that moment, the tightly bolted door suddenly swung open. Elder Madame Xu, who hadn’t seen sunlight in days, lifted her head to see her ungrateful son walk in. She pointed at him and scolded, \"You beast! When I gave birth to you, your father said this child would bring disaster to the family. It seems he was right.\"</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">\"Mother, you used to praise me. Now you scold me.\" Zheng Fang knew it was pointless to talk to his mother. He didn’t want to waste his breath.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">He shouted to the servants outside, \"Bring the morning meal here. All the delicious food. I’ll eat with Elder Madame Xu.\"</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">Elder Madame Xu shouted that she wouldn’t eat.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">Zheng Fang smirked. If you won’t eat, I will. Let’s see if I can’t tempt you.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">Soon, one dish after another was brought to the table. Elder Madame Xu, who came from a humble background, loved braised pork the most. Zheng Fang shared her love for braised pork, so the first dish served was braised pork with quail eggs.</p><p id=\"paragraph-119\" data-paragraph-id=\"119\"></p><p id=\"paragraph-120\" data-paragraph-id=\"120\">The braised pork was fragrant and melted in your mouth. Zheng Fang held a square piece of braised pork and said to Elder Madame Xu, \"Mother, this braised pork is so authentic. We couldn't afford to eat it in the past. It was only after I became a registrar under Lu Ji that I could treat myself to a feast.\"</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">\"Wow, it’s so tender, and these quail eggs are perfectly seasoned.\"</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">\"No, I need to have a sip of wine, and with some side dishes, this squid is really delicious too.\"</p><p id=\"paragraph-123\" data-paragraph-id=\"123\">Elder Madame Xu was already hungry, and hearing Zheng Fang chew crisply made her stomach growl even more. She couldn't help but scold Zheng Fang for being inconsiderate.</p><p id=\"paragraph-124\" data-paragraph-id=\"124\">Zheng Fang seemed to understand what Elder Madame Xu was thinking and said, \"You're punishing yourself just to spite us, but I'm the only one who truly cares about you. While you're here, I still have some regard for the Xu family. If you're not here, I won't need to care anymore. Oh, there's also sweet and sour pork; its flavor is different from our braised pork.\"</p><p id=\"paragraph-125\" data-paragraph-id=\"125\">After finishing his meal, Zheng Fang bowed and left, clearly satisfied. Nanny Luo originally wanted to persuade Elder Madame Xu, thinking of asking someone to boil some rice porridge, but Elder Madame Xu sat up and said, \"I want to eat braised pork. Only while I’m here can the Xu family try to keep things running smoothly. I can’t just die like this.\"</p><p id=\"paragraph-126\" data-paragraph-id=\"126\">...</p><p id=\"paragraph-127\" data-paragraph-id=\"127\">Elder Madame Xu finally ended her hunger strike, and Madame Ji recounted the story to Huiyin with a laugh.</p><p id=\"paragraph-128\" data-paragraph-id=\"128\">\"Grandmother is getting up there in age but still likes to stir things up,\" Huiyin shook her head.</p><p id=\"paragraph-129\" data-paragraph-id=\"129\">Madame Ji laughed and said a few words, then naturally asked Huiyin about Pei Shuo and Zheng Wuheng again. Huiyin replied, \"I received a letter from the prince a month ago from the front, but I don’t know how things are going now.\"</p><p id=\"paragraph-130\" data-paragraph-id=\"130\">The conversation turned somber, as the outcome of the war was uncertain and depended on timing, location, and unity.</p><p id=\"paragraph-131\" data-paragraph-id=\"131\">Madame Ji left feeling disheartened.</p><p id=\"paragraph-132\" data-paragraph-id=\"132\">Three months later, Madame Ji visited Huiyin again, but the mother and daughter couldn’t muster any more jokes, unsure of what was happening at the front.</p><p id=\"paragraph-133\" data-paragraph-id=\"133\">Just then, Fugui hurried in and said, \"The prince has sent a letter, Your Highness.\"</p><p id=\"paragraph-134\" data-paragraph-id=\"134\"></p>\n</div>"
  },
  {
    "number": 79,
    "title": "Chapter 79",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 79</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Chapter◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Even sitting in the carriage, Huiyin still couldn't believe it. Crown Prince Li Heng had died, and Li Cheng had already taken a shortcut to the capital, because news had come that the Emperor had passed away.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Whether according to etiquette and laws or strength, Li Cheng was the undisputed choice.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">And she was soon to ascend from being a commandery princess in a fiefdom to becoming a queen.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"Mother, are we going to the capital? What’s it like there?\" Zhan'ger asked confusedly.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Jing'er, feeling more knowledgeable since he had been there as a child, explained to his younger brother, \"Dummy, the capital is the metropolis where the imperial city is. In the future, Father King will become Father Emperor, and Mother Princess will be Empress Mother. I won’t be your prince brother but your imperial brother.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">This long explanation confused Zhan'ger even more, and Huiyin recalled the chaos when she received that letter.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">In her previous life, after carefully plotting, she had risen from being a concubine to becoming Empress Dowager. Now, becoming empress seemed too easy. Those often battered by fate feel sudden happiness is too unexpected and undeserved.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Not just Huiyin, even Elder Madame Xu, who had gone on a hunger strike in the first half of the year, found it unbelievable. She said to Nanny Luo, \"I see that the second girl has a broken fate line, and she has such a sharp temper. How could someone like that have such good fortune?\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Nanny Luo reminded her, \"Elder Madame, although the investiture ceremony has not been prepared yet, the second Miss is about to become the empress. You must not say such things.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">People always fear true high-ranking individuals. Nanny Luo, even mentioning it, couldn’t help but look around, afraid someone might overhear.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Elder Madame Xu remained as before, \"I don’t need to be afraid. I am her grandmother, and the country values filial piety above all else. How could she do anything to me? And De Yin is her elder sister. No matter what, as empress, she can’t fail to save her own sister.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Nanny Luo was somewhat worried. \"Elder Madame, it’s better for Madame to speak with the princess about this.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">\"Yes, I’ll have Madame Ji speak. If she doesn’t mention it, I will. It’s just pitiful for De Yin’s mother, left in that nunnery. They were so cold-hearted, leaving her behind.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Mentioning Xu Shi, Elder Madame Xu actually knew some things were beyond her control. Was it because Zheng Fang loved Madame Ji too much that he refused?</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">No, it was because Madame Ji was opposed to Xu Shi, and Madame Ji had raised a good daughter.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Her son simply sided with Madame Ji because her side had more influence, thus leaning towards the Zheng family, and that was all.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">There were too many unfair things in the world. The eldest granddaughter, De Yin, was virtuous and beautiful, worthy of being a model for the six palaces, yet Huiyin took that place?</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Nanny Luo couldn’t bear to see Elder Madame Xu like this and reminded her, \"Elder Madame, it’s premature to talk about this. Think about it. This second son-in-law suddenly rushed to the capital for the funeral. With Wei Duo looming ahead and the Zhao brothers, Zhao Hong and Zhao Yong, behind. Moreover, as emperor, he might take many concubines. To say the least, our second girl isn’t exactly a young woman anymore, so who knows what will happen.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"Enough, enough, enough. I’m not that malicious to wish her ill,\" Elder Madame Xu said, but deep down, she agreed.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">De Yin’s final outcome was because the Zheng family didn’t help the Crown Prince, which disappointed him, and they weren’t good to their De Yin. Huiyin, on the other hand, had good brothers, which had nothing to do with her personally.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">In the end, it was all because of cunning Madame Ji.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Elder Madame Xu’s complaints didn’t leave her carriage, while the rest of the Zheng family following Huiyin were very happy, including Yin Lifang, who was traveling to the capital.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">She had been ill, but now she felt much better.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"When we reach the capital, we’ll ask the emperor to grant us a fiefdom. We’ll be out of reach, and no one will be able to control us,\" Yin Lifang thought.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">She didn’t want to stay in the capital. After relying on others for so long, she had had enough. In the capital, she wouldn’t fare well, whether in terms of status or how people treated her. She keenly sensed she wouldn’t get anything good.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">But no matter what, Li Cheng had won, which was better than if Wei Duo had won.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">However, compared to their complicated thoughts, Madame Ji, Cui Yuehua, and Xin Shi were overjoyed. As long as Huiyin became empress, they would all rise together.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">As the mother of the empress, Madame Ji would undoubtedly enjoy great future glory.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">On the carriage, she instructed her two daughters-in-law, \"The Empress Dowager is traveling with the two young princes, which must be quite inconvenient. When we arrive at the post station, make sure to serve them well.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Xin Shi and Cui Yuehuan were happy to comply and quickly agreed.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">When they finally arrived at the inn, the sisters-in-law hurried over, only to find that Huiyin's face showed no sign of joy. Instead, she asked them sharply, \"Has my elder brother and second brother sent any news about the situation? Is Wei Duo still in Yangzhou? How did the Crown Prince die?\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Xin Shi shook her head and glanced at Cui Yuehuan. Neither of them knew anything about it.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">In her past life, even though she had become Empress Dowager, the crisis hadn't been resolved when she was reborn. This life, she feared that Li Cheng would still not escape his fate.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"I don't need you here. You can leave now,\" Huiyin said.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Cui Yuehuan dared not argue and left, holding her breath. She was straightforward and, upon returning to her room, felt like expressing her frustration that the Empress seemed less courteous to her, but she held her tongue.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Nanny Rong quickly advised, \"Miss, have some tea. It's the freshly sent jasmine tea.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"Yes, I just took some unnecessary anger,\" Cui Yuehuan said, feeling uncomfortable.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Nanny Rong immediately added, \"Please don't say such things. As the saying goes, there is a distinction between sovereign and subject. Now, she is no longer just a princess. She will be the Empress in the future, and things will be different from now on.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">If she couldn't handle this little frustration, how could she handle future challenges?</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Cui Yuehuan expected that if Li Cheng became emperor, he would generously grant titles to the Cui family, given that they were his maternal family. She hadn't expected that Huiyin's attitude toward her would be so lukewarm. Being young, she couldn't hide her feelings and was somewhat upset.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">These actions soon reached Huiyin's ears, and she sneered, \"What a good uncle. Usually hiding like a coward, and now he wants to reap the benefits just as the fruits are ripe. We don't even know the situation in the capital yet, and these people are already showing their true colors. If I don't take some fierce measures, this journey won't be peaceful.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">In fact, Huiyin had become quite serene over the past few years, so much so that people now thought they could test her limits.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Nanny Nan and Fugui exchanged a glance. Of course, they knew that the Princess of Huaiyin wasn't really of a gentle nature. It was just that there were no significant conflicts of interest, and she didn't like to always suppress others. But this woman had defeated all the concubines and cousins around the Prince of Huaiyin, as well as his betrothed first love. She was not someone to trifle with.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">As a master, one must be able to manage the people under them. As the future Empress of the Zheng family, she must also be able to manage her natal family.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Otherwise, not everyone could withstand a sudden surge of power, and their personality might change drastically. They might cause trouble without realizing it, and who knows if they could protect themselves in the future?</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Moreover, before Li Cheng ascended, not many relatives genuinely helped. After his ascension, everyone wanted a piece of the pie. Those who got less would try to take from those who got more. And who got the most? The Zheng family and herself.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">This was the Qingzhou post house, just out of Xuzhou. The innkeeper had learned of Huiyin's identity and was extremely respectful, preparing a feast of beef and lamb with top-quality Jinhua wine, which was exceptionally considerate.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"Give these ten taels to the innkeeper as a tip, and select two bolts of cloth as a reward,\" Huiyin said, knowing that in some places, cloth was a hard currency more useful than money.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Fugui quickly followed the order and left.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Madame Ji, sitting at the table, quickly added, \"Your Highness is still so honest and upright.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"Mother, until the day I am officially declared Empress, please don't call me that,\" she said seriously, not responding to others' flattery.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Madame Ji, seeing that only her daughter and two daughters-in-law were at the table, couldn't help but say, \"We are all family. Why be so formal?\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Many people think they have self-control, but history shows that power often makes people arrogant. When it happens to them, they might become even more so. Huiyin noticed that Madame Ji, usually so composed, was now acting differently, and she disapproved.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"Mother, those who prepare will succeed, and those who do not will fail. I benefit the most from this situation. Why am I not showing it outwardly? It's not because I'm pretending, but because I understand too well that once we succeed, it's easy to become arrogant. As the saying goes, arrogant soldiers are bound to lose. This is not the road to success; it's just another beginning. One wrong move, and the whole game is lost. I don't care how you behaved before. If I do become Empress, you must remain humble and not become arrogant. Otherwise, if I hear about anyone causing trouble, the person who makes me unhappy will face serious consequences.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Which was more tempting, being the Princess of Huaiyin or the Empress?</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">The answer was obvious.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">The Zheng family, who had been extremely happy, even ecstatic, were suddenly deflated by Huiyin's words.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Cui Yuehuan was almost in tears, suddenly feeling fearful, and Xin Shi didn't dare to say anything more.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">The next day, Huiyin was all smiles as if nothing had changed, and they even began to wonder if Huiyin's outburst that day had been an illusion. But they didn't dare to get as close to her as before. Nanny Nan couldn't help but mention the change in Huiyin's demeanor.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">\"Why do we need friends? The higher you rise, the lonelier it becomes. It’s not just me; even the emperor must feel this loneliness.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">……</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Li Cheng rode through the night at top speed and had already arrived in the imperial city. The gatekeepers, upon seeing Shi Chong, hurriedly opened the gates. Shi Chong, originally a trusted confidant of the Crown Prince, had planned to take advantage of the situation and seize control. Unexpectedly, Li Cheng did not target Wei Duo but instead had the Crown Prince assassinated.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Li Cheng had Shi Chong captured alive and informed him that the Crown Prince was dead and the emperor had also passed away. Now, the first in line to the throne was Li Cheng himself.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">At this point, Shi Chong could see that although Li Cheng's intelligence might not surpass Wei Duo's, he was a legitimate royal descendant of the Da Ye dynasty, making him far more rightful than Wei Duo.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Meanwhile, in the capital, Empress He had initially decided to keep the emperor's death a secret, intending to wait for the Crown Prince to return and ascend the throne. However, upon hearing of the Crown Prince's death, she planned to install Yunzhi's son as the new Crown Prince.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">In this chaotic situation, no one paid attention to De Yin, who could only watch as everyone said that Yunzhi, a mere servant, would soon become Empress Dowager. De Yin was filled with jealousy and resentment.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">\"I wish I had never lived through this before,\" she thought.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">As if her thoughts had been heard, the palace was suddenly stormed, and they were all taken control of. Yunzhi, who had been promoted to Liangdi after giving birth to a prince, looked well-fed and informed but appeared uneasy.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">De Yin asked, puzzled, \"What's going on?\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Yunzhi, with a complex look, said to De Yin, \"I heard that the Prince of Huaiyin has ascended the throne under the emperor's edict.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">\"It's the Prince of Huaiyin,\" De Yin thought, feeling a surge of joy, but then a sense of injustice. \"Why was my husband, who was also the Prince of Huaiyin, killed in my previous life, leaving me a widow?\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Yunzhi also thought De Yin had some luck. Despite the Zheng family siding with the enemy and De Yin being beaten, the Crown Prince went on a campaign before anything else could happen. Now that the Crown Prince was dead, her greatest support had arrived.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">However, their days would not be as easy.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Yunzhi looked at De Yin and said, \"Liangdi, I beg you, for the sake of the help I've given you before, to please speak a few good words for me in front of the Prince and Princess of Huaiyin. My life is worthless, but I beg you to take care of my son's life.\"</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">With that, she knelt down.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">De Yin, unaware of the situation outside, simply nodded.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">It was also said that Li Cheng had cleared the inner court, made the Ministry of Rites officials acknowledge his status, and calmed the influential families in the capital. All the imperial concubines were placed under guard for the time being, to be punished later when Huiyin arrived. After all, as the empress, Huiyin should handle the matters of the inner court.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">The women of the inner court were inevitably anxious. Some feared being forcibly taken by soldiers in the future and secretly sought death. Others were restless, like Wei Liangdi, who was Wei Duo's daughter. With Wei Duo's enemy now on the throne, what kind of fate could she expect? Like Yunzhi, she also tried to appeal to De Yin.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">De Yin's feelings were complicated. This felt all too familiar, like a replay of her past life. Back then, she lived in a fiefdom, receiving a small allowance and living a life where she wouldn't starve alongside other women. Suddenly, her sister became the empress and wanted to bring her to the palace. At that time, people like Xun Rou also begged her.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">\"Why hasn't the empress arrived yet?\" Li Cheng, dressed in court attire, could hardly wait.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">**</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Though the war was still raging at the front, he wanted Huiyin and the children to arrive in a proper and dignified manner. Only then would his heart be at ease.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">No one understood the depth of her concerns, but Cui Yuehua muttered softly, \"It's such a great joy; why the somber mood?\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">After much anticipation, passing Jizhou, Jing'er and Zhan'er were also eagerly waiting.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">\"Mother, when will we see Father?\" Jing'er asked.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Huiyin smiled and said, \"There are still twenty miles, less than an hour's journey.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Hearing it would be so soon, the children were secretly happy. Just then, a rider approached, and Huiyin suspected it was a messenger from Li Cheng. As she lifted the curtain, there stood Li Cheng, waiting beside the carriage.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\"></p><p id=\"paragraph-91\" data-paragraph-id=\"91\">\"My husband.\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">\"Huiyin, I've come to welcome my Empress.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">\"When I heard you were coming, I deliberately rode over. Was the journey safe?\" Li Cheng asked, his eyes sparkling with excitement and a sense of reunion after so long apart.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Huiyin smiled. \"It was safe, but I can't help feeling like it's too good to be true. I was so worried about you.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Li Cheng understood completely, and as they rode together in the carriage, he explained everything. \"Originally, I planned to deal with Wei Duo. The Crown Prince was watching from the sidelines, hoping we would weaken each other so he could benefit. But within a month, we only fought a few minor skirmishes. Our forces were evenly matched, and neither of us dared to advance recklessly.\"</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">\"The Crown Prince knew the Emperor's health was failing and feared that if Wei Duo heard of the Emperor's death, it might endanger his own life. So, he moved to support Wei Duo's grandson. I saw this as a perfect opportunity. I pretended to attack Wei Duo but actually targeted the Crown Prince. Once the Crown Prince was eliminated, I wouldn't need to seize the throne—power would naturally fall into my hands.\"</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Traditionally, the throne passes from father to son, or if the emperor has no sons, to the next closest male relative. Prince Wu was the late Emperor's younger brother, making Li Cheng the closest relative by blood.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Huiyin listened, her heart pounding, and finally asked, \"How did the Crown Prince die?\"</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">\"He was shot dead. By the way, in Yangzhou, I met the widow and daughter of Prince Wei, Lady Huo. They were lost among the common folk and were almost violated, but fortunately, I found them. I've already sent them to the capital, where they will reside without any fiefdoms, fully reinstating the county system, all under my control.\" Li Cheng said with great ambition.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">\"In times of war, women suffer the most. What about Wei Duo? You just came back like this—what about him?\" Huiyin was most concerned about this.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Li Cheng whispered in her ear, \"We were racing to the capital, both eager to arrive first, but I set up an ambush along the way.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Sometimes, war is not just about troop deployment but also about momentum—whether the tide is in your favor.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">However, he added, \"I should have gone earlier, but I thought it would be better to wait until you arrived before leading the troops out to fight. The rear will depend on you.\"</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Throughout the journey, they continued to discuss their plans. After the official matters were settled, Huiyin nestled in his arms. \"I'm afraid this is all just a dream, and I worry that when we reach the capital, someone will frame you, or while you're out fighting, our base will be taken.\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">\"Everyone around me is celebrating, but only you truly understand what I'm going through,\" Li Cheng said, knowing her worries well.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Huiyin smiled. \"Because we are one as a couple. Others have a way out; they can switch to another master if needed, but we have none. But I am proud of my husband. With you, our Da Ye dynasty will surely not fall apart.\"</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Previously, the harem was in chaos, but now that Huiyin had arrived, Li Cheng first had the Ministry of Rites expedite the Queen's investiture ceremony and issued an imperial decree to name their son, Li Jing, as Crown Prince.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Huiyin led their two sons, step by step, following Li Cheng into the palace. This palace was both familiar and strange to her, entering for the second time after her rebirth.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">The first time she had been in the palace, she was just a Princess of Huaiyin, keeping a low profile for fear of attracting attention.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Now, she was about to become the mistress of the entire palace.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">She was someone who never let things wait. For instance, dealing with Empress Dowager He and the late Emperor's concubines, she decided that except for Empress He herself, any young concubines who wished to leave would be returned to their families if they had any. Those without families would be given twenty taels as travel expenses. If they were homeless, they could go and guard the imperial tombs.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">As for the Crown Prince's household, those with descendants would guard the imperial tombs, and those without descendants would be returned to their families. If they had no family, they were also given twenty taels as travel expenses.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Nothing from the palace, except personal belongings, was allowed to be taken out. She knew well that during such times, many would steal antiques and calligraphy from the palace to sell.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">...</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Huiyin had almost drafted the regulations and discussed them with Li Cheng at night, who agreed to everything. They stayed together in the Duanning Hall, which had once been the place where she poisoned Li Heng. Now, with Li Cheng there, it was warm, not cold.</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">\"Where do you plan to settle the family of Prince Wei?\" Huiyin asked.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">Li Cheng smiled. \"We will no longer establish fiefdoms for the princes; instead, they will reside in the capital with reduced ranks and titles. The Huaiyin Mansion that Prince Wu gave me had no horse grounds, fearing I would learn horse riding. Now, I will do the same, granting a modest estate.\"</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">\"I'm afraid the Huo family might incite Lady Huo to seize the palace.\" Huiyin was most worried about this.</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">Li Cheng waved his hand. \"Don't worry, it won't happen for now. The Huo family's power is in the Jiangnan region. When Wei Duo attacked Jianye, the Huo family was looted, leaving them with nothing but empty show. If they were truly powerful, how could Lady Huo and Jianjia have ended up among the common folk?\"</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">\"Still, we cannot let our guard down,\" Huiyin said, squeezing his hand.</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">Li Cheng replied, \"Don’t worry, I’ll leave the defense of the capital to your elder brother.\"</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">\"Why my elder brother?\" Huiyin smiled.</p><p id=\"paragraph-123\" data-paragraph-id=\"123\">Li Cheng spoke truthfully, \"Your brother is determined; no matter what I instruct, he will do everything in his power. Besides, you are his sister. To be honest, although they have come under my banner, it is only because of you that I would ever put them in important positions. Your brother could have been granted a title legitimately, but he will receive a rank lower than your younger brother's. I have already spoken to him and told him that if he can protect you, I will grant him the same title as your brother.\"</p><p id=\"paragraph-124\" data-paragraph-id=\"124\">In this world, family ties are always reliable, but when reinforced by mutual interests, they become even more so.</p><p id=\"paragraph-125\" data-paragraph-id=\"125\">\"Thank you for considering this for me, and thank you for giving my brother this opportunity. He has lived a hard life, often having to exert more effort than my younger brother to achieve his success.\" Huiyin shared her true feelings with him.</p><p id=\"paragraph-126\" data-paragraph-id=\"126\">Li Cheng, seeing that the palace attendants had tactfully left, couldn't help but tease, \"How will you thank me?\"</p><p id=\"paragraph-127\" data-paragraph-id=\"127\">\"However you want, I'll let you have your way with me today.\" Huiyin lightly tapped his broad chest.</p><p id=\"paragraph-128\" data-paragraph-id=\"128\">Leaving aside their intimate moments.</p><p id=\"paragraph-129\" data-paragraph-id=\"129\">In the morning, Huiyin returned to Linde Hall, which was still her residence. Linde Hall was the largest palace in the Great Ming Palace, and she lived in its central hall.</p><p id=\"paragraph-130\" data-paragraph-id=\"130\">Dressed in a phoenix robe adorned with pheasant patterns and wearing a headdress with twelve trees of jewelry flowers, she first issued an edict regarding the fate of the late emperor’s concubines and the former crown prince’s consorts.</p><p id=\"paragraph-131\" data-paragraph-id=\"131\">Afterward, she invited De Yin over.</p><p id=\"paragraph-132\" data-paragraph-id=\"132\">After all, De Yin was her elder sister, so it was only fitting to give her some gifts to take home.</p><p id=\"paragraph-133\" data-paragraph-id=\"133\">As the world changes, some things remain the same, like kneeling before the same person.</p><p id=\"paragraph-134\" data-paragraph-id=\"134\">Once a high-ranking palace eunuch, Qin An, was now humbly serving Huiyin. She looked at her sister, dressed in the queen's robes, appearing elegant and noble. Compared to her previous life, her complexion seemed even better now.</p><p id=\"paragraph-135\" data-paragraph-id=\"135\">Clenching her teeth in frustration, she knelt on the ground.</p><p id=\"paragraph-136\" data-paragraph-id=\"136\">Unlike in her past life, when Huiyin had been warm to her, this time, her sister spoke coolly, \"I have already spoken to the emperor. The concubines of the late emperor who have children will go to guard the imperial tombs, and those without children will be sent back to their families.\"</p><p id=\"paragraph-137\" data-paragraph-id=\"137\">De Yin didn’t know how to respond, while Qin An frowned. Allowing these concubines to return to their families was already an act of great kindness, especially with the provision of dowry silver.</p><p id=\"paragraph-138\" data-paragraph-id=\"138\">After a while, when Qin An was about to speak, he heard De Yin say, \"I thank the Empress for her gracious decree.\"</p><p id=\"paragraph-139\" data-paragraph-id=\"139\">Huiyin waved her hand, \"Leave now.\"</p><p id=\"paragraph-140\" data-paragraph-id=\"140\">...</p><p id=\"paragraph-141\" data-paragraph-id=\"141\">As De Yin left, a young palace eunuch followed behind her, carrying twelve bolts of colorful silk, a pair of white jade ruyi scepters, and a string of sandalwood beads. Huiyin had bestowed these gifts upon her, but she didn’t want to look at them, nor could she show any disagreement along the way.</p><p id=\"paragraph-142\" data-paragraph-id=\"142\">Only when she got into the carriage and saw elder Madame Xu did she finally break down in tears. \"Grandmother, I have done everything as you taught me, so why do I always fail while she always succeeds?\"</p><p id=\"paragraph-143\" data-paragraph-id=\"143\"></p>\n</div>"
  },
  {
    "number": 80,
    "title": "Chapter 80",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 80</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎First Watch◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The palace carriages transported the concubines out. Younger concubines without children took the money and left, while those with children were sent to guard the imperial tombs.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Li Cheng and Huiyin provided only basic provisions for them, no longer the extravagant expenses of the past.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">It was said that some could not bear this, especially Empress He. Since becoming empress, she had not worn coarse cloth or eaten ordinary food. Upon hearing this, it was said that she had hanged herself in despair because she could no longer tolerate pork due to its fishy smell and overcooked cabbage.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">When the news came back, Huiyin was busy inventorying the items of the various palaces. She had previously forbidden these people from taking palace-regulated items away, and now she had to categorize everything properly.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Fugui, now a senior palace girl, wore the attire of a female official and ordered people to first pack the paintings in boxes and carry them over. Huiyin personally checked each item, setting aside those that were damaged to be restored later.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"Go and call the head palace official,\" she said to Fugui, raising her eyes.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">In the past, when they were in Huaiyin Mansion, Nanny Nan and a few maids were enough to serve, but now that she was managing the entire palace, it could not be so simple.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Most of the head palace officials were confidants used by Empress He. Now that the new emperor had ascended the throne, Empress He had been sent to guard the tombs. The new empress was said to be the younger sister of the former Princess Zheng. With a new ruler, there were new subjects. It was unknown what her temperament would be.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">The six head palace officials entered Linde Hall, nervous and uncertain. Two female officials pulled aside the curtains, and they looked up to see a very young woman sitting on the phoenix seat. She wore a simple everyday jacket and a round bun, adorned with silver beaded hairpins. Though her attire was simple, her appearance was extraordinary. A slow, regal smile spread across her face, revealing her commanding presence.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"The emperor has been on the throne for over a month and has changed the era name to 'Shengning,' where 'Sheng' symbolizes the rising sun and 'Ning' represents peace. I do not care who your former masters were or who you once pledged loyalty to. From now on, I will treat everyone equally as long as you do your jobs well. However, if anyone eats my food while sabotaging my work, I will not let them off.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">The past was forgiven, and a new start was made.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Huiyin then asked these people about their origins, the time they entered the palace, what they used to do, and how many family members they had, as if having a casual chat.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">\"I am the head of the Imperial Wardrobe, forty-six years old, originally from Qinghe County, a civilian by birth. I have only one older sister who entered the palace after becoming a widow at twenty-four,\" said Head Palace Official Zhong.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Huiyin nodded. \"To rise to the highest rank in twenty-two years, you must indeed be very capable, Head Palace Official Zhong. Could you tell me where you served initially?\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">She was asking the other head palace officials.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">A short woman with an elongated face answered, \"I remember Head Palace Official Zhong previously served as a female official under Consort Shu.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"Wang, the head of the Palace Official Bureau, is indeed familiar with all these details. Consort Shu was the birth mother of the former crown prince, correct?\" Huiyin asked.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Head Palace Official Zhong replied promptly, \"Yes, I had just entered the palace to serve at that time. After two years, Consort Shu passed away, and I later went to serve the empress.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">It turned out this person had connections with the crown prince. Huiyin looked at her. \"You may not know, but Empress He died to accompany the previous emperor. It’s quite something, isn’t it? Empress He, despite her ordinary background, could no longer stomach non-imperial rice. There are still many regions where people, driven by desperation during famines, resort to cannibalism by exchanging children. She was truly ungrateful, wasn’t she, Head Palace Official Zhong?\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">It wasn’t that Huiyin wanted people to betray their former masters, but their attitude needed to be right.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Head Palace Official Zhong broke out in a cold sweat and hurriedly agreed.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">It would take time to uncover the backgrounds of these people, but she could always insert her own trusted people. Those who were skilled and loyal in the needlework room of the mansion were arranged into the Imperial Wardrobe.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">As for the other bureaus like the Imperial Kitchen, Huiyin chose not to dismiss anyone for now. Instead, she had their residences searched for poison or any suspicious behavior and forbade these people from leaving. The cleared palaces of the moved concubines were all locked up. By the time Li Cheng arrived at Linde Hall after finishing his official duties in Duanning Hall, he found the surroundings much cleaner.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"It’s fortunate to have such a capable wife,\" Li Cheng said as he had just ascended to the throne in the capital.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">There were many untrustworthy people, but he couldn’t dismiss everyone in the capital. He would have to weed them out slowly.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Huiyin stood up. \"Honestly, this approach might keep the bad apples around while driving away the good ones.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">The two smiled bitterly.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"This is the rice porridge I cooked in the small kitchen, and I also prepared dry rice and a few dishes,\" Huiyin said, fearing that the food prepared by others might not be appropriate. She had sent people out to purchase the ingredients.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Although it was said to be a few small dishes, they were almost all dishes that Li Cheng loved. There were four plates of dried fruits placed in front, including dried plums, Hebei pears, and Heyang hawthorns, along with two snacks, crispy honey cakes and carved candied fruits, and a small jar of warm plum blossom wine. The actual side dishes were stir-fried water bamboo shoots, sweet and sour eggplant, crispy boneless fish, dried bamboo shoots roasted with quail and beef, and braised pork ribs.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">It seemed as though nothing had changed from their time in Xuzhou. Li Cheng, in fact, was a very nostalgic person. He took a bite of the dish Huiyin made and sighed with relief, \"This is perfect, just the way I remember it.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Huiyin was about to stand and serve the dishes, but Li Cheng pulled her to sit down, \"We're a married couple, no need for all this formality.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"Try the sweet and sour eggplant; I put a lot of garlic on it,\" Huiyin said as she picked some with her chopsticks and gave it to him.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Since Li Cheng had lost his parents at a young age, he often appeared prickly, but his heart was soft. As he ate, he looked at Huiyin with a smile, \"In a few days, I will inspect the lands of Xizhou and then lead the troops to attack Wei Duo, making Zhao Hong and others surrender. You need to take care in the palace. If anyone seems suspicious, feel free to remove them.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">He trusted Huiyin completely to manage both the palace and the capital. Even if something were to happen to him, their son Jing'er, who has been officially named crown prince, will inherit the throne, and no one would dare to object.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"We've only been reunited for a few days, and you're leaving again. I really wish you could stay with me a little longer, eating at the same table and sleeping in the same bed,\" Huiyin said, missing the days in Xuzhou.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Li Cheng felt the same way, but the world was not yet stable, and everything was still in ruins. There was no time for him to take a break. Seeing his wife's frustration, he added, \"You know what? Your Zhang Laosan's noodle shop has been a great help. Some of the spies I sent out had nowhere to hide, so they went directly to your noodle shop. Or when it was difficult to pass messages, they would go to Zhang Laosan's noodle shop.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Huiyin smiled with relief, \"I'm glad I could help, but that noodle shop of mine has expanded so much, and the staff varies in reliability, so you can't trust all of them.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"I understand,\" Li Cheng said. He wasn't quite used to the palace. He had grown up in the south of the Yangtze River and had been fighting wars mostly in the south. Now that he was in the capital, it still felt unfamiliar, but when Huiyin returned, it felt like home again.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Huiyin didn't disturb him while he ate and accompanied him until the table was cleared.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Naturally, he stayed in Linde Hall that night. The couple then visited the side hall to check on their two sons. Jing'er's attendants were all people Huiyin trusted. Qiufeng was specially assigned to take care of him, along with his wet nurses and the maids who had followed them from the prince's mansion, almost always by his side day and night.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Zhan'er, being the younger one, saw his parents and insisted on sleeping with them.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Tomorrow, alright? I'll bring your brother along, and we'll all sleep together, okay?\" Huiyin said, hugging her younger son reluctantly.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Li Cheng knew that Huiyin always treated their two sons fairly. The eldest son was now the crown prince, and if they doted too much on the younger son, it would create an imbalance in the elder son's heart. As parents, the most important thing was to keep things fair between the children, or there would be sibling rivalry in the future.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">So, he also said, \"Tomorrow, Father will come early and bring you and your brother over.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">That night, the couple rested together but fell asleep quickly without any intimacy.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">That same night, the Zheng family was not at peace. Ever since the Zheng family returned to the capital with Huiyin, Li Cheng had bestowed upon them the former residence of the He family and granted Zheng Fang the title of Duke Shun, with Zheng Wuheng as the Duke Shun heir.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">This should have been a cause for celebration, but Cui Yuehuan's father had not received any title.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">She couldn't express her dissatisfaction to Madame Ji and others, but she spoke to Zheng Wuheng, \"Yuwendang was granted a dukedom, and Guo Zhao was made a marquis. These meritorious officials are understandable, but even the Xun family was granted a marquis title. Yet, our family...\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">The Xun family was the natal family of Consort Wu, who was now the Grand Dowager Wu. Most of the male members of her family had passed away, and now her nephew inherited the title. Currently, the Grand Dowager Wu was still alive, yet only her father, Cui Xun, had not been granted a title.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"The Grand Dowager Wu is still here, and the emperor has only issued an oral decree. There hasn't been an official investiture yet. Moreover, we still have a battle to fight. When we return, there will definitely be grand investitures, and your family will be greatly rewarded,\" Zheng Wuheng said.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">When Li Cheng rose to power, the Cui family had remained silent, and Cui Yuehuan's elder brother was under Wei Duo's command. Now that Wei Duo had almost retaken Yanzhou and even slaughtered an entire city while her brother-in-law was in the capital, it was clear that Li Cheng was already fed up. How could he possibly grant titles to the Cui family at this time?</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Another possibility was that he was deliberately targeting the Cui family and hadn't even thought of them.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">But he couldn't say this in front of his wife.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Hearing her husband's explanation, Cui Yuehuan also found it reasonable, \"Actually, if the empress could mention our family, it wouldn't be impossible.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">As soon as she said this, Zheng Wuheng's expression changed, \"You need to grow up a little. We were granted the title of duke because of the empress, and we are already on par with Yuwendang and Guo Zhao. The mansion we received is larger than even Prince Yuzhang's residence. The empress has repeatedly advised us to follow the emperor diligently and not to focus on petty gains. If you bring this up, it will only put the empress in a difficult position.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Cui Yuehuan was unhappy, \"What's so difficult about that? The empress has been very good to my second brother and my sister.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"Don't forget that you are now part of the Zheng family. The emperor will decide how to handle matters related to the Cui family. Since ancient times, the imperial harem has never been allowed to meddle in politics,\" Zheng Wuheng said, and with that, he left, his sleeves fluttering.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">He slept in the study for the first time, not sharing the bed with his wife.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Cui Yuehua cried for a while, and Nanny Rong consoled her, \"Second Miss, to be honest, the young master has only been titled Cavalry General, which is far inferior to our son-in-law. As for the matters of the Cui family, although I am a member of the Cui family, I must say that, since ancient times, a married woman should follow her husband's family. You shouldn’t mention your family too much in front of him.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Obviously, Nanny Rong was trying to comfort her and hoped that Cui Yuehua could endure the temporary grievances.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">She even used Huiyin as an example to persuade her, \"Look at how the emperor treats the Zheng family?\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">\"Well,\" Cui Yuehua certainly knew that the emperor treated the Zheng family quite well.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Nanny Rong smiled, \"The more impartial Empress Huiyin is to her natal family, the better the emperor treats her. Although you care about your natal family in your heart, you actually already see yourself as a member of the Zheng family, which is why you share your true feelings with your son-in-law. However, this might make him think that you don’t care about the Zheng family and only care about the Cui family.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Cui Yuehua had an epiphany. Yes, she had been foolish. Previously, she thought Empress Huiyin had changed her attitude too quickly. Everyone else was happy, but she was only worried about the emperor, which made him feel closer to the empress.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">She had a perfect role model in front of her, but she didn’t realize it.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Seeing that Cui Yuehua had come to her senses, Nanny Rong also breathed a sigh of relief. Her young miss, being the youngest daughter, although she appeared to be a lady of great virtue and refinement, sometimes couldn’t see things clearly. Fortunately, she was a listener.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">However, Nanny Rong asked, \"Is the prince’s mansion very small?\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Cui Yuehua nodded, \"Yes, it’s not very big and is still under renovation. Although the commandery prince is of royal lineage, I heard that after the emperor returned to Xuzhou following the death of Prince Wei, the commandery prince’s faction was quite disrespectful to the emperor. Later, a few of them came to surrender in ragged clothes and incited Wei's subordinates to rebel in Xuzhou. Given this, it was already an act of mercy for the emperor to settle them out of respect for the late Prince Wei.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">\"That’s true. It’s better than being sent to the imperial mausoleum. It seems that our current emperor is a nostalgic person,\" said Nanny Rong.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Cui Yuehua smiled, \"That’s right. You see, if someone else had ascended the throne, they would have exterminated all remnants of the previous regime. But the emperor only sent those people to guard the mausoleum, and those without children were allowed to return. Our eldest sister from the family was able to come back, wasn’t she? Even though Empress Huiyin scolded me a few times, I still prefer her.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">This statement surprised Nanny Rong, \"The eldest miss is gentle by nature, speaks softly, and the pair of pouches she gave were very much to your liking. Why do you prefer the empress instead?\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">To be honest, when they were in Xuzhou, the empress was still the commandery princess. Although they could be together, their auras didn’t match. The commandery princess didn’t always go along with the crowd.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">But whenever she was present, no one else could influence things.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Cui Yuehua often felt she couldn’t get a word in when she was with the empress.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">But upon hearing Nanny Rong’s question, Cui Yuehua replied, \"It’s not because she’s the empress that I like her more, but because she makes people feel at ease. She often makes decisions swiftly. Everyone says that the emperor listens to the empress’s suggestions and sent Empress He and the son of the crown prince to the mausoleum without exterminating them completely. But think about it, the living conditions at the mausoleum are similar to those of ordinary people, and the children are so young, some still breastfeeding. The empress didn’t allow them to take palace items with them, and the guards were strict. Children and those who were used to luxurious living would hardly survive. The empress managed to do a good deed while quietly eliminating any potential threats.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Hearing this, Nanny Rong was taken aback.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">The author has something to say:</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">There will be another update tomorrow morning.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\"></p>\n</div>"
  }
]