[
  {
    "number": 21,
    "title": "Chapter 21",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 21</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎The Unattainable White Moonlight◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Li Cheng enforced strict military discipline, and even during the training of the naval forces, he never drank alcohol. Being young and newly in charge of military affairs, he had to ensure that no one could criticize him.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">However, his wife was an exception. Sometimes, he looked forward to festival gifts because it meant Huiyin would write him a letter and send some delicious food. Her letters weren’t long, but each word conveyed her deep concern. At the same time, she was very considerate. If there was nothing important, she would never write to him, fearing that she might disturb him.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Today, he only received a family letter, without any gifts. After Li Cheng opened the letter, he was stunned.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">She was pregnant!</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Li Cheng finally felt the reality of starting a family. Before, the idea of marriage was just about having a wife, and he wasn’t sure if she was truly devoted to him. He always felt he wasn’t ready, but now, unexpectedly, he was going to have a child connected to him by blood.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">The letter mentioned that she suffered from severe morning sickness, but eating plum fruits had helped alleviate it. It also said that she might not be able to fully attend to Xun Rou…</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">After putting down the letter, Li Cheng thought of Xun Rou’s plea. She had begged him, saying that if she returned, the Grand Dowager would likely vent her anger on her. She mentioned how, although the Grand Dowager seemed kind to her, she was always testing her. He had refused to let her become a secondary consort, but it wasn’t right to send her away after just one month.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">So, he agreed to let Xun Rou stay in the mansion. After all, the mansion was managed by Huiyin, so it should be fine. He hadn’t expected that now, with his wife pregnant, it really wasn’t appropriate to keep Xun Rou anymore.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">These were secondary concerns. The most important thing was that he was going to be a father. His wife was quite beautiful, and he was quite handsome himself. Their child would surely be stunning!</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Veteran followers like Yuwendang congratulated Li Cheng. The birth of an heir would solidify the position of the Prince of Huaiyin’s lineage.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Compared to Li Cheng’s joy, the Huaiyin Mansion was less enthusiastic. Some of the servants were old retainers, either people from Grand Dowager Wu or the former servants of Princess Cui. Granny Chao was unhappy. She crossed her legs and said to Yun Hui, “If the young princess gives birth to an heir, we won’t even have a place to stand.”</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Currently, Nanny Nan, the mother of Princess Zheng, was helping manage the inner affairs of the second gate, directly liaising with Manager Zhong. The attendants she brought with her were gradually encroaching on the positions that these old servants had held.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Yun Hui advised, “Mother, don’t you think it’s good that the prince is nostalgic and hasn’t asked you to move out? He even lets me stay here as a manager. Isn’t that enough?”</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">At the end, she smiled slightly.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">“With you being so indifferent to fame and fortune, I don’t know what to say,” Granny Chao said helplessly.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Yun Hui shook her head. “Then you should say nothing, and I’ll handle it.”</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Granny Chao added, “That Miss Xun wanted to send you away before. Now, she’s practically under house arrest and can’t even leave the courtyard. It’s only fitting…”</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Yun Hui smiled without responding.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Although Xun Rou was making a fuss about leaving, she was delicate and frail, so how could she possibly venture out on her own? Without the insignia of Huaiyin Mansion or a travel permit, she couldn’t even leave the mansion, let alone the city of Xuzhou.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">However, that day, Huiyin, stroking her belly, smiled and said, “Send Miss Xun to Lady Miao’s residence. Today, the refuge for the displaced people is completed. She’s always capable. Oh, and send Yun Hui too. She’s very reliable.”</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Xun Rou, annoyed to see Yun Hui sitting with her in the carriage, wished even more that Meixiang could deliver the message. However, Meixiang was in another carriage and couldn’t get off.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">When they arrived at Lady Miao’s place, Yun Hui said, “Miss Xun, let me help you out of the carriage.”</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Xun Rou still harbored a glimmer of hope that she could secretly pass a message when she went to the restroom. However, as soon as she stepped out of the carriage, the displaced people who had been kneeling there rushed towards her, holding sacks.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">…</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">That morning, Huiyin had pigeon soup, which had been filtered several times to make it fresh and delicious. She asked Nanny Nan, “Did you send the letter to my mother? Has our person delivered it?”</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">“You can trust me. The letter has already been sent back,” Nanny Nan said with a smile.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Huiyin sighed with relief. “This is my first pregnancy, and the prince’s mother has passed away. There’s no one to consult about these matters of childbirth. If the pregnancy hadn’t stabilized by the third month, I wouldn’t have wanted to tell anyone.”</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">As the mistress and servant were talking, someone came in and said, “Young princess, something’s wrong. Miss Xun was taken away by the displaced people in a sack. Those were bandits from the woods, and it took a while before she was rescued. Incidentally, Yun Hui led the rescue and was injured in the process.”</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Huiyin pretended to be furious. \"I ordered you to follow her and take excellent care of her. How could this have happened? Someone, go get a doctor to attend to her. And make sure to send someone to check on Yun Hui as well.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">In reality, when Xun Rou was returned, she had no physical injuries. However, in broad daylight, she had been abducted by male civilians and came back in disarray, her clothes disheveled. Everyone feared the worst had befallen her.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">As she looked at Zheng Huiyin walking in, surrounded by servants, so radiant and majestic, Xun Rou glared, feeling as if she was blinded by Huiyin’s splendor.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Huiyin merely instructed those attending to Xun Rou, \"You two must ensure Miss Xun is well cared for. If she is abducted again, I will hold you responsible.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Then she looked at Xun Rou and said, \"The attendants who were supposed to protect you, including He Niangzi and Meixiang, failed in their duty. I have already punished them and sent them away. Rest assured, the Prince asked me to take care of you, and something like this will not happen again.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Xun Rou glared at her with venom, but Huiyin turned away without a second thought.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Late at night, when Xun Rou had no mood to sleep, she heard footsteps. To her surprise, it was Yun Hui. Yun Hui’s face still bore traces of a scrape. Xun Rou pointed at her and said, \"Are you here to laugh at me?\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"Hahahaha,\" Yun Hui laughed.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">The laughter echoed eerily in the quiet embroidery room.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"You, the noble Miss Xun, could have expelled me with just a hairpin, accusing me of having an affair. Now, you’ve become a joke in the entire Xuzhou city. Everyone says that you have been...\" Yun Hui’s eyes flashed with resentment.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">She had been by the Little Prince’s side for years, serving him since he was a child. He used to call her \"Sister Yun Hui\" all the time, as if she were family! She had watched him grow from a child to a handsome young man, and somewhere along the way, her heart had fallen for him. But she was falsely accused and expelled.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Her fiancé had also died, adding to her misfortune. She had been so kind to this new cousin, only to be framed by her. How could she accept this?</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">At that time, Xun Rou was so frail and unliked by the Grand Dowager Wu. It was Yun Hui who often told her what the Grand Dowager preferred, helping her gain favor.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Listening to Yun Hui, Xun Rou remembered a detail. When she told those men her identity, they let her go. But when Yun Hui \"rescued\" her, Xun Rou was pulling at her clothes, checking if anything was missing. In her panic, she hadn’t thought much of it, but now, she realized that the entire scene of being violated was staged by Yun Hui.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"It was you! You deliberately made others misunderstand me! I’m going to tell the Grand Dowager and my cousin!\" Xun Rou stood up.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Yun Hui covered her mouth and laughed. \"Go ahead and tell them. In everyone’s eyes, I’m the one who saved you, a great benefactor. As for you, you quarreled with the Prince, tried to frame the Princess, and now you have a tainted reputation. Xuzhou is not far from Jianye. When word of your reputation reaches the Grand Dowager Wu, how do you think she will view you?\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Xun Rou froze. She knew Yun Hui spoke the truth. The Grand Dowager liked her because she had been a constant companion, almost like a chief maid, managing the servants and taking care of tasks. But the Grand Dowager was also ruthless, as Xun Rou had witnessed.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Now, she had lost her influence. Li Cheng didn’t favor her, and Princess Zheng was smart enough to know what she had done. Even begging would be useless.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Seeing her like this, Yun Hui smiled and left. At the courtyard entrance, she stopped laughing and walked away with her back straight, just as she always had.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">That night, Huiyin slept soundly. She used to suffer from insomnia, but ever since she was reborn and married Li Cheng, he had provided her with a sense of security, even if he didn’t love her. He always fulfilled her needs, and now she was pregnant so quickly.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Even if it isn’t an heir, they were still young, and it would happen eventually.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">When she woke up in the morning, her favorite minced noodles were prepared in the kitchen. It was a pleasure for both body and mind. He Niangzi and He Guanshi had been sent away under a pretext, and now the kitchen was staffed by her own people, who knew what she liked to eat.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">As she was enjoying her meal, someone reported outside, \"Princess, Miss Xun is here.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Xun Rou wore a striking red dress, her dark hair contrasting sharply with the vibrant color, giving her an almost mad appearance.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"I’m here to say goodbye,\" she said to Huiyin.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Huiyin smiled. \"You just had an incident yesterday, and now you want to leave? How will I explain this to the Prince?\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Xun Rou snorted. \"Don’t worry, Cousin. I will write a letter to my cousin, saying that I miss my father and that I haven’t fulfilled my filial duties all these years.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">\"Very well, write it here. I can’t possibly stop you from fulfilling your filial duties. It would be best to write one to the Grand Dowager as well,\" Huiyin said.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Xun Rou sat down and wrote quickly. Huiyin reviewed both letters before saying, \"I’ll arrange for someone to help you with the preparations.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Xun Rou sneered. \"Cousin is truly thoughtful.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">\"As for who is truly thoughtful, we both know who that is,\" Huiyin said coldly.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Xun Rou didn’t dare to cause any trouble but looked at Huiyin and said, \"Cousin, I admit defeat this time. I have nothing to say. We are both skilled in using schemes, our hearts not pure. But my cousin admires those who are innocent and kind. That person may not have high status or remarkable beauty, but he cherishes her innocence above all.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Huiyin laughed loudly. \"He likes her so much, but he didn’t marry her. It’s not that impressive. You can’t provoke me. The strategies I use are not underhanded tricks but using the enemy’s own methods against them.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\"></p><p id=\"paragraph-64\" data-paragraph-id=\"64\"></p>\n</div>"
  },
  {
    "number": 22,
    "title": "Chapter 22",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 22</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎How Different from the Previous Life◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Since Xun Rou was heading to the capital, it wasn't as simple as just leaving; a team of guards had to be prepared to escort her. Huiyin, of course, wasn't keen on helping someone who had schemed against her, but since Xun Rou had already been taught a lesson, there was no need to kick her while she was down.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Yun Hui stood beside Huiyin, watching Xun Rou board the carriage. Knowing that Xun Rou's reputation was now in ruins, Yun Hui felt an indescribable sense of joy.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">After Xun Rou left, Huiyin received a reply from Li Cheng. True to form, Li Cheng didn't disappoint her. He had arranged for Xun Rou to return to Jianye and asked about her well-being, saying he would come back to see her after some time.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"Why so wordy? He gave me a lot of instructions,\" Huiyin said, feeling a bit shy due to the detailed nature of Li Cheng's letter.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Nanny Nan said, \"This is how the Little Prince shows his love for you.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Huiyin shook her head. She remembered what Xun Rou had told her—that Li Cheng had feelings for a girl who was pure and kind. But what did it matter? In a chaotic world, self-preservation was paramount. In the end, Li Cheng had married her. She wouldn't allow her husband to have any other woman in his heart.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">After all, it was impossible for a woman to say she didn't care at all about who her husband loved. But caring wouldn't change anything. Moreover, it was quite possible that Xun Rou had made it all up. She couldn't afford to get angry at her husband over someone who might not even exist.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">How to dispel such negative emotions? By reading books.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"Fugui, go buy some new books from the bookstore for me,\" Huiyin said with a smile.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">After buying the books, she picked out the ones she liked and became immersed in them, forgetting to reply to Li Cheng's letter.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Li Cheng waited for ten days without receiving a reply from his wife. He asked the guard who had delivered the letter, \"Did you hand-deliver it to my wife?\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"Yes, I handed it to Little Princess myself. She even gave me a generous reward. I waited for a few hours in the mansion, but since there was no reply, I left.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Li Cheng wondered if Huiyin was feeling unwell or upset. It was understandable; she was managing the household on her own while dealing with pregnancy.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Once the troops in Huai and Si completed their training, he planned to stay at Huaiyin Mansion in Xuzhou. Still, he couldn't afford to be too sentimental.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">As the weather in Xuzhou started to turn cold, Huiyin found it hard to get out of bed in the morning. Winters in the south were entirely different from those in the north. In the north, they used heated brick beds (kang) which made sleeping warm and comfortable. In the south, the rooms were also very cold, requiring a charcoal brazier. With her pregnancy, she couldn't expose herself to the cold wind, so she stayed indoors, reading books.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">By the Winter Solstice, her pregnancy was starting to show. The kitchen prepared tangyuan, glutinous rice balls filled with sweet fillings, which people in the south eat during the Winter Solstice. Huiyin adapted to the local customs and began to feel more at home.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"If I count the days, my mother should have received my letter by now,\" Huiyin said after finishing a tangyuan.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">As soon as she finished speaking, she looked up and saw Li Cheng.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"Husband,\" Huiyin said, trying to get up to put on her clothes.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">She was quite the morning sleeper, still in her nightgown, wrapped in a quilt, and eating in bed. She didn't expect Li Cheng to return at that moment, looking dusty from his journey.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Li Cheng saw her trying to get up and quickly came over to stop her. \"Don't get up. You can't make such big movements when you're pregnant.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Li Cheng was delighted to see Huiyin's radiant smile. He took off his outer armor and changed into casual clothes. He picked up the leftover tangyuan and ate them, then placed his hand on Huiyin's belly. \"You've worked hard. I'm not by your side.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"It's okay. Although I have to manage the household, it's much quieter now. By the way, your cousin Xun Rou has gone to the capital, saying she wants to pay filial respects there. I sent her letter to your grandmother. Since I received your letter saying you had already sent her away, I didn’t forward her message. Here it is for you.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Li Cheng waved his hand. \"It's good that she's gone. Forget about her. How about you? How are you?\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">\"At first, I felt nauseous and couldn't eat. After three months, it got much better. Now, when I place my hand on my belly, the baby even greets me,\" Huiyin said with a smile.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Li Cheng immediately wanted to try. He naturally placed his hand on Huiyin's belly, and Huiyin felt a slight tingle. She gently placed her hand over his, feeling the warmth of his touch.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Li Cheng seemed to feel something too and looked up to see Huiyin gazing at him.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"Is something on your mind?\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"Did you come back just for me?\" Huiyin asked.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Li Cheng had originally planned to return for the New Year, but as the Winter Solstice approached, he felt a twinge of compassion for Zheng Shi, who was alone and pregnant, and decided to come back early.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">He didn’t know how to respond to his wife’s eager gaze. She seemed to love him too much, her emotions completely revolving around him. But he couldn’t bring himself to respond to such intense affection right now, so he lowered his head and simply said, \"Mm.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">**</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Madame Ji had already received the letter and was preparing a variety of tonics to send to Xuzhou. Xin Shi, who had experience from raising her own son, sent over her son’s old pillow, some clothes he had worn, and even made a patchwork garment to add to the package.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"Madam, our younger sister has certainly done well for herself. She became pregnant shortly after her marriage. It seems the Prince of Huaiyin really dotes on her. Now you can finally rest easy,\" Xin Shi said with a smile.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Madame Ji was also very pleased. \"I originally planned to have Shuo'er deliver the items and take the opportunity to get to know his brother-in-law. But the Marquis assigned Shuo'er to meet with Wei Duo. So I had no choice but to send Heng'er instead. As you know, Heng'er has never traveled far before, and I’m quite worried about it.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">After listening to Madame Ji, Xin Shi secretly thought that she was being partial. This was a rare opportunity to meet the Prince of Huaiyin, yet she only sent her younger son.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">But Xin Shi kept her thoughts to herself. Instead, she went back and prepared more gifts. Her husband had a close relationship with Princess Zheng, and this time Huiyin had even written a letter to her husband specifically.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">While Madame Ji and others were thinking about the return gift, Elder Madame Xu was surprised and worried. She hadn’t expected Huiyin, who had married out a few months later, to get pregnant so quickly.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Zheng Deyin was equally shocked and exclaimed, \"That’s impossible!\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Elder Madame Xu said, \"She’s already been pregnant for three months. I heard that the Little Prince really dotes on her. After going to Xuzhou, he stayed there with her and even rushed back to accompany her during the Mid-Autumn Festival. She’s truly blessed.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Zheng Deyin hadn’t expected her younger sister to end up in such a situation after marrying. She remembered that in her previous life, she had spent the Mid-Autumn Festival with Grand Dowager Wu. Li Cheng only returned once a year, and she couldn’t conceive. A year later, Grand Dowager Wu arranged for Xun Rou to marry Li Cheng as a secondary consort. Xun Rou was very respectful to her. She thought that instead of having someone unfamiliar, a concubine granted by Prince Wei, it was better to have Xun Rou. At least Xun Rou would be easier to manage.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Who would have thought that Li Cheng would dote on the daughter of a low-ranking official rather than favor Xun Rou?</p><p id=\"paragraph-44\" data-paragraph-id=\"44\"></p>\n</div>"
  },
  {
    "number": 23,
    "title": "Chapter 23",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 23</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Game of Wits◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">As the first light of dawn broke, Huiyin opened her eyes and realized she was nestled in Li Cheng's arms, her whole body slick with sweat. He felt like a furnace, and though Huiyin wanted to kiss him, she held back, remembering she hadn't freshened up yet.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Li Cheng, having been in the military for many years, was a light sleeper. He sensed Huiyin had woken up and immediately looked at her.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">At that moment, Huiyin's raven-black hair cascaded smoothly over her shoulders. Her skin was fair and soft, like tofu, but dark circles under her eyes marred her complexion from sleeping late. Yet, this did not diminish her beauty; instead, it gave her a certain alluring, disheveled charm.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"I told you to read less last night, but you wouldn't listen. You even asked me to play the qin (a traditional Chinese stringed instrument) to entertain you. Look at those dark circles. You're so naughty,\" Li Cheng said, gently scraping her nose.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Huiyin rubbed her belly and replied, \"I still feel like a child myself, even though I've just gotten married. But now I'm a mother. To be honest, every morning when I wake up, I'm reminded that I'm carrying a child. I can't move much, can't catch a breeze, and I can't even wash my hair or bathe freely. I know all women go through this during pregnancy, but I just feel uncomfortable. It's frustrating.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Hearing this, Li Cheng became unexpectedly eloquent. \"How could you be the same as other women? You've always been pampered and are my wife, Li Cheng's wife. How could you be compared to others? I do keep you in my heart.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">\"Yunzhi (Li Cheng's courtesy name), even though you don't say it, I know you came back mostly for me,\" Huiyin said quietly.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng kissed her hand. \"Yes, I do miss you.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">With that thought, he quickly got up. \"I'll have someone bring breakfast over. We'll eat together.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"No, I should get up. Let's have our meal in the small hall. We can have the brazier (a portable heater) set up first,\" Huiyin said as she prepared to rise.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Li Cheng looked outside. \"It's too windy and snowy. Let's eat on the daybed. I'll carry you to the daybed and set up the table. We'll eat together.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Huiyin blushed. \"No, no. If you weren't here, I might be lazy, but now that you're back, people will talk if I act this way.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Even at home, although her mother doted on her, her upbringing was strict, and such indulgence wasn't allowed.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">But Li Cheng said, \"Why get up? It's too cold. If I don't say anything, who dares to say anything about you? Just stay here. I'll carry you to the daybed.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">He was very strong and easily lifted Huiyin, who wasn't particularly light. Nestled on the daybed, Huiyin felt both familiar and strange with him. He doted on her, though he rarely admitted it. He was straightforward in his speech and sometimes liked to debate, but he never argued with her.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">She had breakfast on the daybed—lamb broth with noodles. After finishing the bowl, she felt like she would gain several pounds (jin is a Chinese weight measure).</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Normally, she didn't deliberately eat less, but she only ate a small portion. After the first three months of pregnancy, her appetite had improved, but if the baby was over-nourished, it could lead to a difficult birth. Giving birth was important, but her own life mattered more.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Seeing her finish, Li Cheng seemed a bit troubled and asked, \"What's wrong? Was the food not to your liking? You told me yesterday that walnuts (considered nutritious for pregnant women) were good for you.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">He rarely showed concern for others because if you cared too much, people might think you were too invested and start acting superior.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"I ate too much this morning. I need to get up and move around a bit. Also, I have something to discuss with you. I forgot to mention it yesterday,\" Huiyin said, then rang the bell to call someone in to help her dress.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">She then mentioned that she had already written to her family about her pregnancy. \"My mother loves me dearly. I wonder if she'll send something over. Also, if my brother or younger brother comes, should I inform you?\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Li Cheng immediately replied, \"If your brothers come, send me a letter, and I'll take them to meet the Prince of Wei.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"That's great. But they might not come. By saying this, I know how to handle it,\" Huiyin said.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Li Cheng thought to himself that she really did keep him in her heart. She even discussed her brothers visiting with him, listening to his opinion on everything. This made him very happy.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">\"We should keep them for an extended stay,\" he said.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"Yes,\" Huiyin replied, equally pleased.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">At this stage, they were still being polite to each other, but Li Cheng's personality was starting to show. For example, during lunch, Huiyin casually mentioned a murder case in Xuzhou. It turned out that the only daughter of the local wealthy Xiao family had married the judicial officer of the prefecture, who came from a poor family. Their relationship was strained, and one day he slapped her. She then wanted to marry one of the judicial officer's friends, leading to their divorce. The divorce was finalized, and the young lady remarried. However, her new husband died, and his family accused her of causing his death.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">According to Huiyin's guess, it definitely wouldn't be Madame Xiao who committed the crime: \"As far as I know, Madame Xiao and her new husband, Wang Maocai, were deeply in love and only got together after much difficulty with their divorce. How could she have killed her new husband? I'm certain that the Wang family, who never approved of their son marrying a woman who had been married before, is now blaming the woman after their son died.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">However, Li Cheng said, \"That pair of contemptible people got what was coming to them.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"How can you say that? Although a woman is expected to remain faithful to one husband, if a couple has no affection for each other and the husband even beats his wife, divorce is not out of the question. I even heard that this military magistrate embezzled funds and made the Xiao family pay for it. As for Wang Maocai and his wife, they weren't really on the same path either; it's said that all his assets were given to his first wife before he married Madame Xiao, which shows that their love was quite strong.\" When Huiyin was young and studied \"Nü De\" (Women's Virtue) and \"Nü Jie\" (Women's Admonitions), she always felt that her teacher was subtly criticizing her mother, Madame Ji, which made her feel ashamed. Even hearing the term 'fickle' made her fear it might implicate her mother.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">But as she grew older, she realized how difficult life was for women. Marriages were blind, arranged by parents, and perhaps the person you married wasn't suitable at all. So why couldn't you choose someone else?</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">As she said this, seeing Li Cheng's face turn ashen, she wisely fell silent.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Li Cheng, however, was deeply shocked. He found that although Princess Zheng rarely left the mansion according to the servants, she was not easy to control and seemed different from other women. She didn't agree with the idea of being faithful to one husband and even scoffed at the traditional virtues of women.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Men liked a bit of a challenge. If you were too gentle and obedient, it wasn't as exciting. She wouldn't unconditionally obey just because you were her husband.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">After this conversation, the atmosphere between them became somewhat tense, despite previously getting along well.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Nanny Nan quietly said to Huiyin, \"Young princess, why talk about this? It's hard enough for the Little Prince to come back home; no man likes to hear his wife mention divorce.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"Mother, you don't understand. Men like a bit of a challenge. If you're too gentle and virtuous, it's not appealing. Don't worry, even though he's upset with me now, he'll eventually start to worry about me.\" Huiyin said with a slow smile.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Nanny Nan nodded inwardly but still felt a little worried.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Huiyin, however, had no such concerns. Because Li Cheng loved to get to the bottom of things and had strong execution, such a person was highly competitive.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">The couple used to often dine together, but tonight Li Cheng said he had matters outside and wouldn't be coming back. Since Huiyin had eaten a lot in the morning and had chestnuts and snacks in the afternoon, she was quite happy to eat less in the evening when he wasn't around.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Nanny Nan, who was devoted to Huiyin, couldn't help but say, \"Maybe you should skip the snacks tomorrow. If you eat too many, you won't want to eat your meals.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"I know, I just can't control my cravings. But I need to control myself, even if it's hard.\" Huiyin said with a smile.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">In the evening, she ate a small bowl of rice, a plate of vegetables, and a plate of lean meat, giving the rest of the dishes to the servants and maids. She also walked around the small hall ten times to help digestion, which made her feel much more comfortable.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Li Cheng deliberately came back late; he was upset but couldn't express it or say anything harsh to his wife. From his perspective, he naturally hoped his wife would be of one mind with him and remain utterly loyal. However, although she treated him well on the surface, unintentional remarks revealed her true thoughts.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">If she found her husband lacking, it was natural for her to leave, and she could even abandon her husband for someone she liked.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">With Huiyin's beauty and capabilities, she was a rare woman in the world, decisive and unconstrained in her actions. If such a woman were to remarry, she would likely thrive, just like her mother, Madame Zheng. Back then, Madame Zheng was the wife of Pei Ye, the Duke of Gaoping Commandery. When Pei Ye took a concubine, Madame Zheng decisively chose to divorce him and later married Zheng Fang.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">With a mother like hers, it was no surprise that Huiyin was different from other women.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">He must make Princess Zheng truly love and depend on him so much that she couldn't live without him. With this thought in mind, he lifted the curtain and entered.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Huiyin was an avid reader; she loved books as much as life itself. Hearing footsteps, she looked up and immediately stood up when she saw Li Cheng enter, saying, \"Have you eaten? I heard you had matters outside this evening, so I ate first.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Li Cheng sat down and said, with apparent \"understanding,\" \"Don't worry about me. Right now, the baby in your belly and you are far more important than I am.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"Why would you say that? You're very important to me too. I've always been concerned about you. I was worried you hadn't eaten well, so I had the kitchen prepare some food for you.\" Huiyin said with a smile.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Li Cheng had been thinking a lot about how to gain her obedience and loyalty, but this simple concern made him instantly happy: \"You've been thinking of me? Actually, I haven't eaten yet, I didn't want to trouble you.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Huiyin found it strange; it wasn't as if she was doing the cooking herself. It was just a matter of instructing the kitchen staff, so what trouble was there?</p><p id=\"paragraph-56\" data-paragraph-id=\"56\"></p>\n</div>"
  },
  {
    "number": 24,
    "title": "Chapter 24",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 24</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Lady Xie◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After the Winter Solstice, Li Cheng stayed for only one more day before he had to depart for Huai and Si to train the troops. Before leaving, he instructed Huiyin, “The other families in Xuzhou are fine, but the Grand Dowager of the Xue family is an exception. She was a daughter of the imperial clan, the daughter of the Prince of Xin, and honored as the County Lady of Linchuan. I received an invitation from the Xue family yesterday, so please go on my behalf and bring a generous gift.”</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">“Yes, I will. You take care as well, it's cold and the northern wind is fierce,” Huiyin replied, also reluctant to see him go.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Li Cheng gently touched her face, “You don’t need to wake up early every day, just rest well.”</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Though he came and went quickly, it was reassuring that he still made time to see her.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Speaking of the Xue family, Huiyin had met them once before at their mansion. They were extremely respectful toward her. This time, when Li Cheng returned, they visited again, showing an excessive level of respect, likely trying to curry favor with him.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">However, before the Grand Dowager Xue’s birthday, Xuzhou city had already started to buzz with excitement. Huaiyin Mansion also welcomed new guests—the wife of Xie Jiuyi, the Prefect of Huaihai, came to visit.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Chief Steward Guo Qishan introduced, “The Xie family, originally from Chen County, has been established here for many years. It was with their help that the Prince of Wei was able to successfully establish himself in the Jiangnan region. Lady Xie is also the younger sister of Lady Yin, the consort of the Prince of Wei.”</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Huiyin had previously reviewed the gift records and noted that the most generous gifts to Huaiyin Mansion over the years came from the Xie family and the Prince of Wei’s Mansion. Although Lady Yin was not the principal consort, she held a high position for giving birth to the Prince of Wei’s eldest son.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">As Huiyin was thinking about how to make small talk with Lady Xie, she didn’t notice the hesitant expression of Chief Steward Guo.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Since the master of Huaiyin Mansion was not present, Huiyin had the chief steward entertain the male guests while she personally received the female guests. Nanny Nan also advised, “Lady Xie is not only the prefect’s wife but also the full sister of Lady Yin, the consort of the Prince of Wei. We must not neglect her.”</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">“That’s exactly what I thought. It’s just that the Little Prince is not in the mansion, and I’m not very familiar with these relationships, so I’m really afraid of offending someone,” Huiyin said, feeling helpless.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">The challenge was that, without her husband around, she couldn’t consult him on important matters.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Huiyin hadn’t been back to Jianye yet, and she had already met fewer people. Once she returned to Jianye, there would be the Grand Dowager Wu of the Prince of Wei, the Princess of the Wei family, and many other imperial relatives and officials—truly a multitude.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Some people harbored grudges against the Zheng family, so Huiyin felt pressured to conceive quickly. She knew that next year would be turbulent, and having a child would strengthen her position.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Thinking of this, she instructed Dong Shun, “The fresh fruits stored in the ice cellar can be brought out—green plums, hard pears, cherries, ganzi, and grapes must be served. Also, prepare a platter with lychees, pomelos, loquats, and purple pears.”</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">The purple pears were precious and hard to come by, not to mention the lychees. Some of these fruits, Huiyin herself couldn’t bear to eat.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Fresh fruits in winter are especially precious, and rare delicacies like ice-preserved sturgeon and abalone should be used to honor our guests.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Fugui asked, “What kind of tea should we serve? We’ve just received premium dried fruits, melon seeds, and other fine dried goods in the mansion, which are excellent for brewing tea.”</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">“No, just use plain tea. Mixed tea is a commoner’s way of drinking tea. I personally enjoy it, but we can’t be so casual when we have guests,” Huiyin replied.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Upon hearing this, Fugui complied. These maids used to only need to serve their mistress when they were in the Marquis of Zhaojie’s residence. Now, in the prince’s mansion, they also had to help the young lady manage the household. Each of the four senior maids had specific duties, and their future roles would depend on how well they performed before marriage.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Fugui, in particular, had ambitions. She wanted to become the head stewardess, so she had to ensure everything was handled perfectly.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Huiyin felt as if she were preparing for a crucial battle. It wasn’t that she feared them, but she was concerned about inadvertently offending someone. After all, Li Cheng was still relying on the support of the Prince of Wei. She couldn’t afford to overlook anyone.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Soon, she met Lady Xie, who was completely different from what she had imagined. Lady Xie was about the same age as her, with a striking appearance—graceful and elegant, her hair styled high and adorned with elaborate hairpins, giving off an aura of humility while making others feel at ease.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">“Your Highness,” Lady Xie greeted respectfully.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">“Lady Xie, no need for such formality,” Huiyin replied with a smile.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Lady Xie was momentarily taken aback. She had only heard that Li Cheng had married but didn’t know that his wife was so beautiful. The only word she could think of to describe her was “peerless beauty,” like Daji—a phrase used to depict an enchanting and seductive appearance.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Her beauty was so striking that it could leave others speechless, yet Lady Zheng remained humble. Instead, she complimented Lady Xie, “I see that Lady Xie has an elegant demeanor and graceful movements, with a celestial appearance. It’s truly an honor to have you in our humble abode.”</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">“Your Highness is too kind. I’ve often heard that the beauties of Yan and Zhao are unparalleled, with jade-like beauty. Now that I’ve met Your Highness, I know this to be true,” Lady Xie complimented in return.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Huiyin waved her hand. \"Please, no need for formalities. Please, come with me to the small hall for a conversation.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">They were not very familiar with each other, but Lady Xie was quite candid. \"I am extremely close friends with the granddaughter of the Grand Lady Xue. Her grandmother had helped me a great deal in the past, and the Xue family has been a family friend of my husband's for generations, which is why we rushed over from Luanzhou.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"I see. My prince returned just a few days ago during the Winter Solstice and instructed me to attend the Grand Lady Xue's birthday celebration. However, I don't know them well. Now that you're here, I have someone to talk to. Why don't you and your family stay at our mansion for a while?\" Huiyin said with a smile.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">As they exchanged pleasantries, the maids filed in. Lady Xie glanced lightly around and saw the rare fruits and luxurious snacks, nodding to herself in approval. It was reassuring to see that there was a capable mistress managing the mansion. It seemed Li Cheng had moved on from his past and settled into his role, which was good for everyone.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Seeing that Lady Xie was straightforward, Huiyin began to probe for information. \"When did you and Lord Xie first meet my husband? I first married into this family, and the Prince was always away training troops. I'm always afraid that I might unknowingly offend someone due to my ignorance of these relationships.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Lady Xie shared quite a bit, mostly about how her maternal family, the Yin family, was in the fiefdom of the Prince of Wu, and that they had grown up together.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"When we were very young, we both studied under a famous scholar in Wu. Your prince was about three years older than me, and I was just three at the time. Cheng Brother was so picky. We all ate the scholar's meals, but he refused. We all took afternoon naps together, but he wouldn't sleep. He was always criticizing us. The first day he saw the characters I wrote, he told the scholar to expel me, saying that a person like me was a crow and could never become a phoenix. But I didn't give up. Can you imagine how harsh he could be? But now, I've heard that the two of you are a loving couple, and I suppose he has changed a lot because of you. You two must have a deep bond.\" Lady Xie genuinely hoped that her senior prince would be happy.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">However, her words weighed heavily on Huiyin's heart. Could it be that Lady Xie was the one Li Cheng truly loved?</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">If that was the case, then Lady Xie was like a more refined version of Lu Xiao. She was warm, kind, and capable—someone more difficult to deal with than a villain. Someone like Xun Rou, who often made mistakes, was easier to handle. But how does one handle a genuinely good-hearted person?</p><p id=\"paragraph-39\" data-paragraph-id=\"39\"></p>\n</div>"
  },
  {
    "number": 25,
    "title": "Chapter 25",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 25</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">Siblings Reunion (Including VIP Notice)</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Lord Xie and Lady Xie had separate accommodations, so they bid farewell to Huiyin. Huiyin also took the opportunity to meet this young Haihai Prefect. He was probably a couple of years older than Li Cheng and was a handsome man, appearing more mature. Li Cheng’s eyes always sparkled, unconsciously revealing a natural youthful aura. Lord Xie was much more composed.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">\"Manager Qiao, it's difficult to buy charcoal in Xuzhou during winter. Please send some to Lord Xie and his wife on my behalf,\" Huiyin said.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Manager Qiao quickly smiled and replied, \"Yes, I will arrange it right away.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">It was evident that Manager Qiao was also quite familiar with Lord Xie and his wife, as he behaved more casually with them.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Huiyin couldn't help but say, \"Wait, Manager Qiao, I want to ask you something.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Manager Qiao stood with his hands by his sides, waiting for Huiyin’s question, but after a moment of thought, she said, \"Never mind, go ahead and see if they need anything else.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Manager Qiao, although puzzled, left first.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Huiyin stroked her belly and wandered the corridor, lost in thought. Begging for love, or winning it through submission, was not true love. She absolutely did not acknowledge it.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">She had been slightly influenced by Xun Rou’s words, but she couldn’t let them make her suspicious of everyone. She must always believe in herself, Huiyin secretly resolved.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">After calming her mind for half a day, by the time of Lady Xue’s birthday banquet three days later, she was able to chat and laugh naturally. Lady Xue’s granddaughter was married to a former subordinate of Lord Xie, who now held the position of Tunqi Colonel.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Xue Huanhuan, the pet name of Lady Xue, was held by Elder Lady Xue as she said to Lady Xie, \"Liyi, Huanhuan has always been close to you, and I am relieved. I am old and may not be able to look after her for much longer.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Lady Xie’s maiden name was Yin, and her given name was Liyi. She was the daughter of a recorder under the Prince of Wei, later marrying Xie Miu. However, Huiyin found it strange that the recorder was only a low-ranking official of the seventh or eighth rank, and the Yin family was not a prominent clan. How did she manage to marry the son of a prefect?</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">As she pondered, she heard Yin Liyi say, \"Why would you say that, Elder Lady Xue? I was fortunate to have Lady Xue’s care, and she was my best friend. Before I came, my mother specially asked me to bring some of her favorite hazelnut cakes.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Upon hearing this, Xue Huanhuan was quite moved and even wiped away some tears. \"It's already been more than five years. I still remember when I was a lady-in-waiting by the side of the Wei Imperial Consort, and Liyi was only twelve or thirteen years old. I had never met a girl who was both so innocent and yet so driven. She was the hardest-working person I’ve ever known.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Huiyin thought to herself that Yin Liyi had been a lady-in-waiting in the Prince of Wei’s mansion, and exactly five years ago, Li Cheng’s parents had passed away, and he had come to rely on the Prince of Wei, certainly living in his mansion as well. Childhood friends reuniting after a long separation, who knows what had happened?</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Just as she was thinking this, Elder Lady Xue, noticing that Xue Huanhuan was talking non-stop and afraid of neglecting Huiyin, quickly added, \"You may not know this, Young Princess, but my granddaughter was a lady-in-waiting for the Wei Imperial Consort. I wanted her to learn proper etiquette. Back then, I often spoke with your great-grandmother as well. Young Prince Xie was not yet of age but was extremely skilled in martial arts. Whenever he led the Prince of Wei’s vanguard, his bravery and skill were unmatched.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Huiyin, appearing interested, smiled and said, \"In Jizhou, I often heard of the Prince of Huaiyin’s bravery.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Lady Miao, who had previously caused some damage to Xun Rou’s reputation due to the resettlement of refugees, noticed that the Young Princess did not blame her and still valued her. She quickly chimed in, \"Young Princess, it is said that your father was known as the Flying General and has now been enfeoffed as the Marquis of Zhaojie and the Grand Commander of Jizhou. Your younger brother will soon arrive in our Xuzhou. I wonder what kind of demeanor he will have? I’m sure the young ladies of Xuzhou are eager to see him.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Huiyin smiled and replied, \"My younger brother is still young. We originally thought my older brother would come, but we received a letter saying he will be the one coming instead. When he arrives, I will host a banquet for everyone.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Lady Miao quickly caught on, as did Lady Xue from the Xue family. Li Cheng now oversaw Xuzhou. They were treating Yin Liyi with great respect due to Lord Xie and the Prince of Wei, but they had forgotten that the local official is more relevant than a distant superior. Moreover, the father of Princess Zheng was the Marquis of Zhaoping, not from a prominent family but trusted by Prime Minister Lü Wei.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Huiyin did not wish to be the center of attention and quickly returned the focus to Elder Lady Xue. \"Our young prince specifically asked me to come and wish you a long life, as he said you were very close with his grandmother. Besides the birthday gifts, I have also personally copied the 'Heart Sutra of Prajna Paramita' to present to you.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">\"Thank you, Young Princess,\" said Elder Lady Xue, as she had someone receive it. Upon flipping through a few pages, she saw the elegant and flowing calligraphy and couldn't help but nod in approval.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">She then said, \"I am pregnant, so it is inconvenient for me to stay for the meal. Perhaps another time, I will invite everyone over.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Elder Lady Xue wanted to see her off, but Huiyin stopped her.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">After she left, Elder Lady Xue said to those around her, \"This Young Princess does not put on airs and possesses both beauty and grace. She is truly remarkable.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Yin Liyi, having interacted with many people as a lady-in-waiting in the Prince of Wei’s mansion, had seen many people, but she could not quite figure out Princess Zheng. Xue Huanhuan thought the same. She said, \"My mother told me that this Princess Zheng usually keeps to herself, but in just a few months, the Huaiyin Mansion is almost entirely under her command. Entering the mansion already pregnant and yet able to hold herself back. It is said that Xun Rou was...\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">The last few words were spoken almost imperceptibly.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Yin Liyi was startled. \"Her methods are indeed ruthless.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"That's right. Speaking of which, we have no connection to the Little Prince nowadays. Just think about the Prince of Huaiyin—known for his sharp tongue and ruthless nature. Yet, he actually rushes back during the Mid-Autumn Festival and Winter Solstice just to spend the holidays with her.\" When Xue Huanhuan was a lady-in-waiting at the Prince of Wei’s mansion, the Prince of Wei, fearing that the Prince of Huaiyin wouldn’t be able to manage his own estate, had him help manage the Wei Mansion instead. Xue Huanhuan had worked under Li Cheng, and while she admitted that Li Cheng was very capable, working under him was incredibly stressful.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Both Yin Liyi and her sister were daughters of officials in the Wei Mansion and had been acquaintances of Li Cheng. He hadn’t shown them much mercy either.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">It was only toward this woman from the Zheng family that he seemed to be an exception. Thinking of this, Yin Liyi glanced at Xue Huanhuan again and said, \"Never mind, I won’t mention others. Let me ask you, are you and your husband preparing to head north?\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">It should be known that Xie Jiuyi is not only a prefect but also one of the foremost loyal officials under the Prince of Wei. There is a children's song in the Jiangnan region that goes: \"Xie Jiuyi guards the roads, while Li Cheng commands the waters.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">This refers to Xie Jiuyi and Li Cheng. The Jiangnan region has always been rich in talented individuals. Moreover, Xie Jiuyi is quite close to the Prince of Wei and can be considered a strategist. Heading north must be for something important, Xue Huanhuan speculated privately.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Yin Liyi smiled and said, \"Your information is quite accurate, but before that, we still need to meet with the Prince of Huaiyin to discuss matters.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Xue Huanhuan, understanding the boundaries, didn’t ask further, as she knew clearly that the Prince of Wei wanted to take Qingzhou as soon as possible and that the marriage alliance with Zheng Fang of Jizhou was intended to keep Zheng Fang neutral.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">More than a month after Elder Madame Xu’s birthday celebration, Huiyin’s pregnancy was showing more. Every day, besides managing the household and reviewing accounts, she spent her days resting at home. Anyway, Li Cheng had said he would return by the New Year, which was only a few days away. The house was already adorned with lanterns and colorful decorations, filled with a festive atmosphere.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">However, before Li Cheng returned, Huiyin’s younger brother, Zheng Wuheng, arrived.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">He came from Jizhou, accompanied by his father’s advisor, Counselor Zhuang Huai, and brought several fine horses and a dozen carts of gifts intended for the Prince of Huaiyin and the Prince of Wei.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">The young man, on his first trip away from home, had been trying to appear composed and serious along the way, but upon seeing his elder sister, he ran over with a smile, just like always. \"Sister.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">\"Heng'er,\" Huiyin, who had spent half a year in Xuzhou, often felt lonely being alone in the mansion. After becoming pregnant, her emotions had become more sentimental. Now, seeing a family member, her joy was evident.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Zheng Wuheng noticed that his sister looked much healthier and more radiant after marrying into the family. Her clothes were elegant and luxurious, and she appeared much more at ease. There was none of that haggard look of someone who had been far from home and family, which put his mind slightly at ease.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Sister, where is Brother-in-law? Is he good to you?\" This was the question Zheng Wuheng was most concerned about.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Huiyin, not wanting to worry her younger brother, put things in a positive light: \"Your brother-in-law treats me well. Although we don’t spend much time together, he always rushes back during festivals to accompany me. He’ll be back in a few days, and then you two can meet.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Zheng Wuheng let out a sigh of relief. \"If Brother-in-law treats you well, I’m relieved. By the way, this time, I brought letters from our parents.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">The siblings entered the inner room, and Huiyin quickly scanned the letter. Madame Ji, of course, first expressed concern about her health and then mentioned that recently De Yin seemed to be persuading Elder Madame Xu to advise their father to turn against Lü Wei. As for their father, he was asking about the situation in Xuzhou, about Li Cheng, and about the Prince of Wei.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Huiyin looked at Zheng Wuheng and said, \"My dear brother, remember this: no matter who tries to convince our father to oppose Lü Wei, he must stay calm and not act rashly.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Zheng Wuheng was puzzled. \"Sister, Lü Wei holds the emperor under his control and shows much disrespect toward the Crown Prince. The people have long suffered under his tyranny. If our father were to rise, wouldn’t he become the leader?\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"You’re mistaken. Back when the incident with Lu Ji occurred, after our father killed Lu Ji, he had to flee. Who came to his aid then? If Lü Wei dies, our father will lose soldiers and resources, and others will likely reap the benefits. Our Zheng family has risen from humble beginnings and has only recently established a foothold in Jizhou. We cannot afford to make any missteps now. Even when it comes to what your brother-in-law says, our father doesn’t have to follow it blindly.\" Huiyin advised.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Zheng Wuheng, who had always followed his sister’s words, saw her write a reply letter and solemnly agreed.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">However, Huiyin was thinking about her previous life in the Eastern Palace. If she hadn’t discovered the matter of the contraceptive medicine and quietly became pregnant, she wouldn’t have persuaded her father to turn against Lü Wei. She poisoned Li Heng and seized power. But her brother took Li Heng’s place and died from a poisoned arrow, which was a pain she could hardly bear.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">At that time, she had truly believed that Li Heng genuinely loved her and that she would one day become empress legitimately, which was why she had asked her family to support her wholeheartedly. But things ended up differently, so how could she trust Li Cheng now?</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Moreover, there was Yin Liyi, who seemed to be Li Cheng’s 'first love' lingering in Xuzhou, seemingly waiting for him to return, often sending messengers to check on him. Although Huiyin knew that Yin Liyi and her husband seemed very happy and affectionate now, she always felt that this woman knew Li Cheng too well…</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">It was a feeling that even Xun Rou, who had grown up alongside her cousin Li Cheng, didn’t give her.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Just as she was thinking this, Manager Qiao said, \"Young Princess, the Little Prince has sent his soldiers and servants ahead.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Huiyin was startled.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">The author has something to say:</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">This story will be entering the VIP section on September 15th, with a triple update on that day.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p>\n</div>"
  },
  {
    "number": 26,
    "title": "Chapter 26",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 26</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combining Three Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Sister, is Lord Xie the same person as Xie Jiuyi?\" Zheng Wuheng asked curiously.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huiyin nodded. \"Yes, he is the Governor of Huai and Si. They’ve been staying here for a month or so, waiting for your brother-in-law, probably to discuss important matters with him.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Zheng Wuheng smiled. \"And what could be more important than taking Qingzhou? It's as clear as day, isn't it?\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin smiled gently. \"My brother is really smart. But just like before, don't ask too much about this. After all, this is still the Prince of Wei's territory. Even if your brother-in-law probes you about it, remember the old saying: don't say more than you need to.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">In her previous life, it was because the Prince of Wei wanted to take Qingzhou. The Governor of Qingzhou had appealed to the imperial court for help. Lü Wei, acting on behalf of the emperor, deliberately ordered the Crown Prince to lead the campaign. Li Heng first led the He family's troops into battle in Qingzhou, with the Zheng family also sending Pei Shuo to assist. Li Heng ended up defeating the Prince of Wei.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">And because of that victory, Li Heng became confident and decided to attack Xuzhou.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Now that she was married to Li Cheng, there was no way Pei Shuo would fight for the Eastern Palace anymore. If he did, De Yin would never think highly of him, and it would be a waste of effort.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">**</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Li Cheng hurried to Xie Jiuyi's residence. The two hadn't seen each other for over half a year, so when they met again, they were especially excited. \"Lord Xie, forgive me for coming late,\" Li Cheng said.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"Yunzhi, don't blame yourself. We thought you were here, so we came ahead of time. We have urgent matters to discuss with you,\" Xie Jiuyi said with a smile.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Li Cheng took his arm and they entered together. Yin Liyi personally came out to serve tea and said, \"I made sure to prepare your favorite Pu'er tea, knowing how much you love it.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Li Cheng pointed at them and said, \"You two, husband and wife, singing the same tune. What's the matter? You have to tell me first, or else I won't even be able to drink this tea.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">The three of them laughed heartily, with Yin Liyi laughing the hardest. She felt that it was wonderful how they were still the same as before.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Of course, Xie Jiuyi was talking about taking Qingzhou, and he needed Li Cheng to write a letter to Zheng Fang in Jizhou, asking him not to make any moves. The Prince of Wei had allied with Zheng Fang of Jizhou for this very reason.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">In reality, Li Cheng knew exactly why the Prince of Wei was doing this. Writing the letter would be simple, but whether it would be effective was another matter.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Helping the Prince of Wei achieve his great cause would also bring him power and solidify his position, allowing his followers and subordinates to live better lives. But why give the opportunity to take Qingzhou to Xie Jiuyi instead of him? If he had taken charge, the results would have been far more efficient.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">But he wouldn't say this out loud and simply agreed readily. \"It's a small matter. I'll write a letter.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Xie Jiuyi smiled. \"Thank you then.\" He also wanted to keep Li Cheng for a meal. \"Since we haven't seen each other for so long, I've asked the kitchen to prepare a feast. We can chat while eating.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"No need. My brother-in-law has come from Jizhou and is currently at my home. I need to host him. Don't worry, once the letter is written, I'll send it over,\" Li Cheng said.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Xie Jiuyi needed Xuzhou's support for the Qingzhou operation, so he also discussed some defensive strategies. Li Cheng said, \"The weather has turned cold and dry these days. I'm also preparing to return to Xuzhou. I've left Yuwendang in Huai and Si; he's capable enough to handle things there. Rest assured, I'll make all the necessary arrangements and fully support you.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Yunzhi, thank you,\" Xie Jiuyi said, touched by his broad-mindedness.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Thinking back, Li Cheng had met Yin Liyi first. Although he had been dismissive of her, he had also helped her gain a foothold in the Prince of Wei's mansion. Everyone could tell he had feelings for her. But due to a twist of fate, he had met Yin Liyi, and later, following the principle that 'a friend's wife is not to be trifled with,' he had distanced himself from her. It wasn't until they reunited and confessed their feelings that they finally got together after all the twists and turns.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Li Cheng smiled. \"It’s my duty, no need for thanks.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">As he was about to leave, Yin Liyi came out to see him off. Li Cheng glanced at her and continued on his way.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">When he returned, it was two hours later. Huiyin got up to welcome him. \"My prince, the wind and snow are fierce outside. Come inside and warm up.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">She then ordered hot soup to be served.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">On a winter day, a bowl of clear beef soup was incredibly comforting. Especially after riding back on horseback, Li Cheng was hungry, and those snacks wouldn't have been enough to fill him up.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Huiyin had observed Li Cheng closely. When he was home and not going out, he ate little and had a small appetite, often skipping meals. But after riding or practicing martial arts, he needed meat.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Sure enough, he ate heartily and then asked, \"Why aren't there any pot-sticker pancakes? The ones you had them make last time, with a crispy golden exterior and a chewy texture that could soak up the meat juices.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">\"Do you like eating that? I'll have them prepare it for dinner tonight.\" Huiyin smiled but still didn't ask him what he went to Lord Xie's residence for.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Li Cheng nodded heavily and then asked about Zheng Wuheng. \"I didn't see him when I came in earlier. I'll go find him after I finish my meal.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Huiyin pulled him back. \"He's a restless young man. I had Manager Qiao take him out to explore Xuzhou city. He'll be back for dinner, so you don't need to rush. Rest for a while after eating. You've been on the road for so long; aren't you tired?\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Li Cheng was comforted by his wife's gentle words. He was indeed very tired, but he still wrote a letter first, had his personal guard deliver it to the Xie family, and then rested.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">This sleep was incredibly sound. When he woke up, it was already dark outside. Under the flickering lamp shadows, a young woman was doing needlework. She was dressed in a pink-blue silk vest with multicolored floral patterns, looking very young and beautiful. That warmth enveloped him, making him feel warm all over.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"What time is it?\" Li Cheng's voice was hoarse when he spoke.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Huiyin smiled. \"It's just the hour of You. I've been keeping an eye on the time.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Li Cheng was quick; afraid of delaying, he immediately got up, combed his hair, changed his clothes, and the couple invited Zheng Wuheng over. It was the first time Zheng Wuheng met his brother-in-law, Li Cheng. He saw that Li Cheng was dressed in the dragon robe of a prince, with a pair of five-clawed dragons on his shoulders, tall and handsome, noble and dignified.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Zheng Wuheng was about to perform a formal greeting, but Li Cheng stopped him. \"You're my brother-in-law; there's no need for so many formalities. We're family; no need for all these rituals.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Although Zheng Wuheng was young, he had been trained as an heir and carried himself with the demeanor of a noble family's child.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">After the three of them sat down, Huiyin said to Zheng Wuheng, \"The prince doesn't expect you to perform a formal greeting, but you should still know the proper etiquette. Normally, you should perform the national ceremony before the family one; otherwise, it would be disorderly.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">At that moment, no one brought up these matters, but if there were to be a future conflict between the two sides, Li Cheng could immediately say that Zheng Wuheng was disrespectful to him.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Zheng Wuheng's face turned red, and he immediately apologized to Li Cheng, who said, \"Your sister can be a bit strict. When family members meet, if they perform formal greetings again, wouldn't that take away the fun?\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Huiyin smiled. \"The prince's advice is well-taken. However, Wuheng is still young and wild like an untamed horse. If I don't remind him, he might not take it seriously. After all, you are broad-minded and never care about these trivial details, but others might.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"The princess is right,\" Li Cheng nodded.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">For some reason, Zheng Wuheng felt that his sister and brother-in-law were being too polite. Though unmarried, he had observed how his parents and older siblings interacted, and it wasn't like this. The intimacy between a husband and wife should be apparent to outsiders and shouldn't feel like the relationship between a subordinate and a superior.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">In fact, Huiyin kept a clear distinction between bed and board, home and outside. She believed that intimacy between spouses should be loving to make each other feel comfortable. Her husband treated her with respect, and they were closer at home, but they couldn't be like that outside.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Perhaps subconsciously, Huiyin didn't want to be seen as merely a pampered wife. After all, there could be many pampered wives, but she was irreplaceable.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">The table was set with an array of dishes: appetizers, fresh fruits, dried fruits, hot dishes, and soups, all beautifully arranged. During the meal, Huiyin even arranged for song and dance performances to entertain them.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">However, the atmosphere at the table was dull. Huiyin was pregnant and had just scolded her brother, so she didn't say much. Zheng Wuheng, still a young boy, dared not speak much either. Seeing this, Li Cheng couldn't help but start a conversation. \"Heng'er, I heard from your sister that you practice martial arts regardless of the weather. What weapons are you proficient in?\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Zheng Wuheng and Li Cheng began chatting, one remark after another.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Seeing the atmosphere liven up, Huiyin smiled. \"You two chat slowly. My presence might make you feel uncomfortable.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">As a pregnant woman, she didn't like the smell of alcohol, and everything was currently for the sake of the baby.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Li Cheng saw the snowflakes outside and said to Fugui, \"Bring a warm sedan chair over so that your mistress doesn't catch a cold.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Fugui immediately complied, and Huiyin left after a bow.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Even in the warm sedan chair, it still felt chilly. It was much warmer inside the room. She then said to Nanny Nan, \"Please take extra care of the young master. He's still young, and with me being pregnant, I worry he might not tell me if anything goes wrong.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Nanny Nan smiled. \"Don't worry, my lady. This old servant understands.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Huiyin took off her hairpins and ornaments in front of the mirror, feeling much lighter. The servants brought hot water to help her wash up, and after a while, she felt like she had eaten too much and stood for a moment before lying down.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Just as she was about to close her eyes, she heard Li Cheng's footsteps. Huiyin opened her eyes, sat up from the bed, and had someone light the lamp.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">In the room, the couple was in a different mode. Huiyin nestled in his husband's arms, smiling. \"You seem to be in high spirits. What did you do at Lord Xie's place today? Lord and Lady Xie came to our Xuzhou last month and have been inquiring if you've returned.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Li Cheng hesitated about whether to tell Huiyin, but he thought that if he didn’t share such matters with her, she would find out sooner or later. When that happened, she would surely distance herself from him. He certainly didn’t want his rear to be unstable, so he smiled and explained, \"It's about the great affairs of the Prince of Wei, and it's fine to tell you. Last time, when Yuwendang was receiving you, you were ambushed. Those people were sent by Ma Kui, the Governor of Qingzhou. The Prince of Wei has endured him for a long time and naturally doesn’t wish to tolerate him anymore. They were waiting for me to return, hoping I could help mediate and avoid any accidental injuries by getting your family on board.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Huiyin had already guessed this, but she looked at Li Cheng and said, \"I have no opinion about Lord Xie, but since they want to keep my father in check, why didn’t the Prince of Wei send you? If you went, I could help you write a letter, and this way, you could also achieve merit.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Li Cheng, however, replied, \"Xuzhou can’t do without me. I’ve been training the navy for a long time. What will happen to Xuzhou if I leave?\" Although he said this, his heart might not have fully agreed, but in front of his wife, he had to prioritize the bigger picture.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Generals are always eager for battle. As long as there was a fight, one could achieve merit and get promoted.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Huiyin playfully said, \"In my heart, Clarity Lang is the best, and I wish you could contend for the world so that you would be worthy of such status. However, I support your noble integrity. You can write a letter to my father, but he probably won’t believe it. I’ll write another letter and have my brother take it back.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">\"Huiyin, why… why are you so good to me?\" Li Cheng was somewhat overwhelmed.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Huiyin was thinking of her family’s interests. She didn’t want to be a pawn for the Lu and He families. By giving this favor now, the Prince of Wei wouldn’t continue northward, and the He and Lu families could deal with the Prince of Wei themselves.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">But she feigned concern for Li Cheng and said, \"You’re my husband, so of course, I’ll be good to you. Besides, as a couple, we share the same fate. If the Prince of Wei gives you an opportunity in the future, I’ll also benefit from your success.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">After the passing of Li Cheng’s parents, he had been walking alone. Even though the Prince of Wei had recognized his talents, Li Cheng had to stand firm on his own, and only he knew the bitterness in his heart.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Fortunately, Huiyin was very good to him. Although it was affection for her husband and not for him as a person, even so, he felt it was good enough.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Moreover, what she said was very practical. Who wouldn’t want power and wealth in this world? In troubled times, even a dog in peace is better off than an ordinary person. When he was isolated and without aid, even the people below could rightfully withhold Lord Wu’s fiefdom’s stipend from him.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">As he was lost in thought, Huiyin took his hand and said, \"Rest now; it's getting late.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">She had planned to ask Li Cheng about Yin Liyi, but given their superficial relationship as a couple, if Li Cheng was hiding something, bringing it up would only alert him. If there was anything between the two of them, she needed to secure some leverage first.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Because she still wasn’t sure what kind of person Li Cheng really was. Just like Li Heng, who could pretend for three years only to turn out to be a wolf in sheep’s clothing—at least she had discovered and countered him. Lü Xiao and Dong Yuniang knew nothing.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">The next day, Li Cheng took Zheng Wuheng around Xuzhou city for a tour and even hosted a banquet at home, inviting prominent figures from Xuzhou to introduce Zheng Wuheng. He also told Zheng Wuheng that after the spring, he would take him to meet the Prince of Wei.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Since Li Cheng was an only child with no brothers, and Zheng Wuheng had a sincere personality with a noble demeanor, completely different from his father Zheng Fang, Li Cheng treated his brother-in-law as his own younger brother. After they became familiar, they even referred to each other as brothers.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">When Huiyin saw him return with a rattle, claiming it was for her unborn child, she couldn’t help but laugh. \"You, this isn’t for my baby in my belly; it’s clearly for you. I’ve seen you playing wildly these past few days. You should calm down, read more books, and practice martial arts more. That’s the proper path.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">\"Sister, I know,\" Zheng Wuheng, like young men everywhere, didn’t like to be nagged.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Huiyin also stopped herself from saying more. \"If you don’t want to study during the New Year, that’s fine, but at least observe how your brother-in-law handles things and learn to gauge situations. When you go to meet the Prince of Wei after the New Year, speak less and think things through yourself.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Zheng Wuheng nodded. \"Alright, I’ll listen to you, Sister.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Huiyin couldn’t help but shake her head with a smile and pushed the snacks on the table toward him. \"Look, I had these bought from Dehe Lou, your favorite snap pea pastries. Try them.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">The sister and brother chatted about the customs of Xuzhou for over half an hour before Zheng Wuheng took his leave.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">When Li Cheng returned from outside, he asked, \"Will the noblewomen of Xuzhou come to pay their respects to you later? Is everything prepared?\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">\"Don’t worry; everything is already prepared. Here’s the gift list; take a look,\" Huiyin handed him the gift list.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Li Cheng pointed at the Xue family. \"Add two more Ruyi scepters here.\" Then he pointed at the Wei family. \"You’ve given too much to the Wei family. A surrendered person has an innate rebellious nature. No matter how well you treat them, they will follow the trend. Remove these two items.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">He thought Huiyin would be angry because, in the past, when he had been this critical, others would tolerate him for a while.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Unexpectedly, Huiyin smiled and said, \"It’s my oversight. I’ll rewrite a new copy and have them prepare it quickly.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Huiyin believed that as long as someone wasn’t deliberately undermining her, she should humbly accept their guidance. Those who taught you were better than those who superficially flattered you while waiting to see you make a mistake.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Her memory was excellent, and except for one uncertain point, she rewrote the rest of the gift list for Li Cheng.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\"></p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Li Cheng took it and looked over it, praising, \"Not bad, this is exactly how it should be.\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Huiyin, fearing that the servants wouldn't arrange things properly, went to check everything herself. Only after ensuring everything was in order did she sit calmly on the high seat, waiting for the various titled ladies of Xuzhou to come and pay their respects.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Lady Miao, speaking quietly to Lady Xue, said, \"Though the young princess is young, she handles things with ease and has never made a mistake. It's truly remarkable.\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">In reality, it was ten years of practice behind the scenes for a moment on stage that lasted less than a cup of tea. No one is born knowing how to do many things; it's through hard work that one becomes capable.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">After seeing off the guests, she glanced at the gift list again and, seemingly casually, brought up Yin Cifu. She wanted to use Yin Cifu to test Li Cheng's feelings towards Yin Liyi.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">\"Oh, I noticed you gave similar gifts to both the Princess Consort of Wei and Yin Cifu. Although Yin Cifu has given birth to the eldest son, she remains a secondary consort. Who knows what the future holds?\" Huiyin said with a smile.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">As it happened, when Dong Yuniang was first pregnant, many people had exalted and demeaned her, but in the end, Dong Yuniang's child did not survive.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Li Cheng, upon hearing her mention this, explained, \"The Princess Consort of Wei is of noble birth and has a daughter. She once had the exclusive favor of the prince, but Yin Cifu is even more beloved now. Even if the Princess Consort of Wei were to have more children, they would still be ranked below Yin Cifu.\"</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">\"I didn't expect this secondary consort to be so favored. She must be a great beauty. I've met Lady Xie, and she is indeed a great beauty. Alright, since you say so, I won't mention it again.\" Huiyin, not hearing Li Cheng bring up his connection with the Yin sisters, felt somewhat certain and a little disappointed, though she forced herself not to show it.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Li Cheng, thinking she felt inferior because of Yin Cifu's beauty, couldn't help but comfort her, \"You are much more beautiful than her.\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Huiyin felt even less happy. A beautiful woman can easily win a man's heart, but for someone with an ordinary appearance to be widely admired, that speaks to her exceptional charm.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">It's easy for a not-so-familiar couple to misunderstand and get upset like this; it's unavoidable.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Pregnant and confined indoors, she feared catching a cold if she ventured outside. During this quiet and confined New Year season, Li Cheng brought her a horse lantern, and even such a small gift made her very happy.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">But she looked at Li Cheng and said, \"I still want to build a snowman. Can you help me build one, please?\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">In summer, seeing her in a bodice, he thought she was the epitome of voluptuous allure. But now, in a fur-lined jacket with her hair tied back with a simple pom-pom, she looked sweet and endearing, far from her usual seductive charm.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Li Cheng's heart suddenly stirred, and as if possessed, he agreed.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">A small snowman was placed on a gilded white porcelain plate, and Huiyin used her rouge to paint its little mouth red, resting her chin in her hands as she gazed at the little snowman.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">With the snow falling outside, and Li Cheng unable to go out, he stayed with her to watch the little snowman.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Gradually, his sarcastic nature revealed itself. \"You're not going to eat? Just to watch this little snowman? When the sun comes out, your little snowman will melt away.\"</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Huiyin pouted in dissatisfaction. \"My little snowman won't disappear. Besides, I really don't feel like eating. Yesterday, I ate too much again unexpectedly, and my face has swollen up. Looking in the mirror, I don't even recognize myself.\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Pregnancy can really make a woman feel less confident about her appearance. She didn't know about others, but someone as beautiful as her really felt the change. Formerly fitting clothes no longer fit, movement was inconvenient, and there were even spots on her face and leg cramps. It was truly uncomfortable.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">She thought Li Cheng might be impatient with her playful teasing. But pregnancy was indeed hard work. In the past, she could go outside to build a snowman, play until her hands were red, then return for a warm bowl of ginger soup and a good night's sleep.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">But now, she could only sit indoors and enjoy the snow.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">Unexpectedly, Li Cheng picked up the pom-pom from her hair accessory and unconsciously scratched her cheek. \"You've been through so much, but you're still incredibly beautiful. Don't doubt yourself.\"</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">He then leaned down and kissed her, as if to prove it with action.</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">Their lips and tongues entwined, and Huiyin, feeling a bit overwhelmed, gently pulled away.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">But Li Cheng took her in his arms and carried her to the bed.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">Afterward, both Huiyin and Li Cheng felt a bit surprised by how things had unfolded, as they had both lost control. She was very particular about people, but Li Cheng's scent was pleasantly fresh, and kissing him felt sweet. Everything about him made her want more.</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">\"It's safe. I asked the doctor before. Except for the first three and last three days, it's fine during the middle of the cycle.\" Li Cheng explained.</p><p id=\"paragraph-120\" data-paragraph-id=\"120\"></p><p id=\"paragraph-121\" data-paragraph-id=\"121\">Huiyin thought to herself that he was indeed a man of action, and at that moment, he had dispelled her biggest concern. She touched her face and said, \"I feel so hot.\"</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">Perhaps fearing they might lose control again, Li Cheng said the next day that he wanted to take Zheng Wuheng to Jianye to pay respects to the Prince of Wei. Huiyin also felt she needed to keep her desires in check, so she specially had the little prayer room cleaned up.</p><p id=\"paragraph-123\" data-paragraph-id=\"123\">\"Prince, please take care of Heng'er,\" Huiyin said, bowing afterward. She noticed that his lips were slightly swollen and his face was a little flushed, but he tried to remain composed.</p><p id=\"paragraph-124\" data-paragraph-id=\"124\">Li Cheng also turned his face and said seriously, \"Then the princess should take care of her health at the mansion.\"</p><p id=\"paragraph-125\" data-paragraph-id=\"125\">\"Yes,\" Huiyin nodded.</p><p id=\"paragraph-126\" data-paragraph-id=\"126\">Zheng Wuheng thought to himself that his sister and brother-in-law didn't seem very close. Otherwise, before the Lantern Festival was over, his sister was still pregnant, but her husband didn't want to stay by her side. From now on, he would work hard to learn martial arts so that in the future, he could support his sister, who had always planned everything for him.</p><p id=\"paragraph-127\" data-paragraph-id=\"127\">When it came to the emotions between a couple, Huiyin couldn't explain it to her brother. They had too little experience and didn't know how to understand many things. Naturally, it wasn't Zheng Wuheng's fault for not understanding these things, and Huiyin didn't know that her brother cared about them either.</p><p id=\"paragraph-128\" data-paragraph-id=\"128\">…</p><p id=\"paragraph-129\" data-paragraph-id=\"129\">However, Granny Chao knew the details. She said to her daughter Yun Hui, \"The young princess is still pregnant. Shouldn't she arrange for the maids around her to be introduced to men to help relieve the young prince a little? How can a young man in his prime go without for so long? And now that she's pregnant, she's still seducing her husband. Does she have no sense of shame?\"</p><p id=\"paragraph-130\" data-paragraph-id=\"130\">\"Mother, be careful with what you say,\" Yun Hui warned, very alert.</p><p id=\"paragraph-131\" data-paragraph-id=\"131\">Granny Chao smiled and said, \"I know. This is my room, and even the laundry maids have been sent away.\"</p><p id=\"paragraph-132\" data-paragraph-id=\"132\">As Li Cheng's wet nurse, Granny Chao was treated quite well. She had several young maids serving in her own home, but someone who had managed affairs suddenly had no power in her hands. Even when the young prince returned, she couldn't see him, which naturally left her feeling a little lost.</p><p id=\"paragraph-133\" data-paragraph-id=\"133\">Now, the ones managing the inner court were the young princess's mother and her dowry maids, and the ones serving the young prince were the senior maids by his side. The princess wasn't allowed to enter freely.</p><p id=\"paragraph-134\" data-paragraph-id=\"134\">Yun Hui had brought the New Year gifts and said, \"I've been busy lately and couldn't come over. These were rewards from above. I can't finish them all, so I'm leaving them here as a token of my filial piety.\"</p><p id=\"paragraph-135\" data-paragraph-id=\"135\">Granny Chao took a closer look and saw two pieces of blue-green cloud satin, a set of white silk jacket and skirt, two packages of pastries, half a pig, and two packages of tea.</p><p id=\"paragraph-136\" data-paragraph-id=\"136\">\"My girl, these pastries are from Deyun Tower. You don't like sweets, so it's my gain,\" Granny Chao said. At her age, if she had to buy these pastries that cost two taels per package, she certainly wouldn't, but since they were distributed by the prince's mansion, she didn't hold back. She opened them immediately and started eating eagerly, with some crumbs falling, which she casually wiped away with a handkerchief.</p><p id=\"paragraph-137\" data-paragraph-id=\"137\">Yun Hui patted her back and said, \"Slow down. If it's not enough, we can buy more.\"</p><p id=\"paragraph-138\" data-paragraph-id=\"138\">Granny Chao waved her hand and said, \"Do you think this money comes with the wind? You only earn one tael a month and have no extra benefits. During festivals, you rely on rewards from above to get a few clothes. You should save them for your dowry.\"</p><p id=\"paragraph-139\" data-paragraph-id=\"139\">\"Mother, I've already decided not to marry,\" Yun Hui said firmly.</p><p id=\"paragraph-140\" data-paragraph-id=\"140\">In reality, as a mother, she wasn't completely unaware of her daughter's thoughts. \"Or is it that you're staying at the prince's mansion for the young prince? Silly girl, it's not worth it. The young prince now has a young princess. That vixen is a domineering one; how could she tolerate you by his side? Besides, the young prince doesn't seem to care much about you either. Last time, you made a pair of shoes, and he gave them away as a reward to someone else.\"</p><p id=\"paragraph-141\" data-paragraph-id=\"141\">Granny Chao understood her daughter. She wasn't trying to climb the social ladder; she genuinely wanted to marry the person she loved.</p><p id=\"paragraph-142\" data-paragraph-id=\"142\">It was pitiful. After all these years of serving the young prince, in the entire prince's mansion and even in the entire Jiangnan region, there were few people whose appearance and status exceeded the young prince's. Once her standards were set so high, she naturally couldn't find anyone outside who measured up.</p><p id=\"paragraph-143\" data-paragraph-id=\"143\">But in the past, such a thing would have been fine. After all, she was the girl placed by the Prince of Wu next to his son. But now, it was difficult.</p><p id=\"paragraph-144\" data-paragraph-id=\"144\">Yun Hui shook her head and said, \"Mother, I don't aspire to be the young prince's woman. As long as I can stay by his side, I'm content. He doesn't like me, and that's understandable. I'm just a servant; how could I expect someone to like me?\"</p><p id=\"paragraph-145\" data-paragraph-id=\"145\">If she couldn't marry a good man, she'd rather not marry at all. Although Yun Hui was a servant, she didn't feel inferior to those young mistresses. The only difference was their status.</p><p id=\"paragraph-146\" data-paragraph-id=\"146\">What she has now is more than enough.</p><p id=\"paragraph-147\" data-paragraph-id=\"147\">Granny Chao walked into the room and took out two marinated crabs from a box to eat. \"You've put in so much for the prince's mansion and the young prince, and in the end, we don't know what the outcome will be. Look, now Princess Zheng won't value you.\"</p><p id=\"paragraph-148\" data-paragraph-id=\"148\">Yun Hui let out a slow sigh.</p><p id=\"paragraph-149\" data-paragraph-id=\"149\"></p><p id=\"paragraph-150\" data-paragraph-id=\"150\"></p><p id=\"paragraph-151\" data-paragraph-id=\"151\">Huiyin certainly wouldn't put Yunhui in a position of importance. To put it plainly, who wouldn't prefer to use their own people? Yunhui was Granny Chao's daughter, and Granny Chao had been scheming against Huiyin from the start.</p><p id=\"paragraph-152\" data-paragraph-id=\"152\">It was also said that after the New Year festivities were over, Zheng Wuheng returned to Jizhou with the gifts Huiyin had prepared, accompanied by Li Cheng.</p><p id=\"paragraph-153\" data-paragraph-id=\"153\">This time, it was heard that the Prince of Wei had bestowed many treasures upon Zheng Wuheng. He had also interacted with various lords and shed some of his youthful naivety, no longer being the young man who easily felt flustered when speaking to elders.</p><p id=\"paragraph-154\" data-paragraph-id=\"154\">In front of Li Cheng, Huiyin personally handed over the letter she had written to her father. Seeing this, Li Cheng was naturally very moved—this was what it meant to be of one heart as a couple!</p><p id=\"paragraph-155\" data-paragraph-id=\"155\">\"Heng'er, go back and tell Father and Mother that I am doing well and your brother-in-law treats me well. They need not worry. In a few months, after I give birth to the child, I will write home again,\" Huiyin said, her hand on her belly, uttering some pleasantries.</p><p id=\"paragraph-156\" data-paragraph-id=\"156\">This time, while traveling with his brother-in-law, Zheng Wuheng noticed that the advisors and soldiers around him treated him with great respect. Even the Prince of Wei showed much appreciation for him, which pleased him greatly. Although he felt reluctant to leave, thinking of his parents and his sister's instructions, he bid his sister a proper farewell before mounting his horse and leaving.</p><p id=\"paragraph-157\" data-paragraph-id=\"157\">After his younger brother left, Li Cheng decided not to go to Huai and Si for training. Instead, he focused on defense deployment in Xuzhou and thus stayed put. His ability to remain at the Wang Mansion made Huiyin the happiest, for with her husband by her side, they could discuss matters and spend more time together.</p><p id=\"paragraph-158\" data-paragraph-id=\"158\">\"Are you really not leaving?\" Huiyin asked, her arm wrapped around his.</p><p id=\"paragraph-159\" data-paragraph-id=\"159\">Seeing her so happy, Li Cheng couldn't help but smile. \"I'll be in Xuzhou for these days.\"</p><p id=\"paragraph-160\" data-paragraph-id=\"160\">After the polite phase passed, Huiyin realized that Li Cheng was no longer speaking like a normal person. If he had said something like, 'I’ll stay and be with you for the birth,' she would have been touched. But instead, he said he would be in Xuzhou for these days.</p><p id=\"paragraph-161\" data-paragraph-id=\"161\">After a moment of inward frustration, she released his arm and pulled him to sit at the desk, smiling as she said, \"To help us get to know each other better, let’s each write down our hobbies and interests on a piece of paper. Here, fill this out like I did.\"</p><p id=\"paragraph-162\" data-paragraph-id=\"162\">Li Cheng, having nothing else to do, indulged her in the game.</p><p id=\"paragraph-163\" data-paragraph-id=\"163\">After a short while, Huiyin took the paper and looked through the list. Everything else was fine, but under the section for skills, there was a long list: archery, calligraphy, qin playing, swimming, brewing wine, cuju...</p><p id=\"paragraph-164\" data-paragraph-id=\"164\">\"You know so many things!\" Huiyin exclaimed in admiration.</p><p id=\"paragraph-165\" data-paragraph-id=\"165\">Li Cheng actually disdained writing so much, but he didn't want Huiyin to think lightly of him, so he listed many skills. Seeing her looking at him with admiration, he felt a bit pleased but also thought it was somewhat childish.</p><p id=\"paragraph-166\" data-paragraph-id=\"166\">Thus, he maintained a calm demeanor and said, \"There are many more things I haven't written down.\"</p><p id=\"paragraph-167\" data-paragraph-id=\"167\">Huiyin felt her stomach hurt from laughing but cooperated by saying, \"You know why I did this? I wanted to learn more about you, and it turns out you’re even more impressive than I thought.\"</p><p id=\"paragraph-168\" data-paragraph-id=\"168\">\"Since you're unable to move much now due to your condition, after you give birth, I'll mix you a drink that you've never had before,\" Li Cheng said with a smirk.</p><p id=\"paragraph-169\" data-paragraph-id=\"169\">Huiyin didn't praise him blindly but looked at him sideways and asked, \"As they say, 'Eat the sovereign's salary, and loyally serve him.' You're mixing me a drink, so how should I repay you?\"</p><p id=\"paragraph-170\" data-paragraph-id=\"170\">Li Cheng, seeing her ambiguous expression, leaned in and whispered two sentences into her ear. Huiyin blushed and said, \"Why are you always thinking about such things?\"</p><p id=\"paragraph-171\" data-paragraph-id=\"171\">\"As a married couple, it’s only natural for us to be intimate. Why should I be shy?\" Li Cheng replied, not seeing anything wrong with it.</p><p id=\"paragraph-172\" data-paragraph-id=\"172\">As the couple was talking, news arrived that the Prince of Wei had officially appointed Xie Jiuyi as the General of the Northern Expedition to take down the usurper Ma Kui, the governor of Qingzhou. At the same time, Zheng Wuheng had returned home and handed over Huiyin's letter to their parents, conveying his sister's messages.</p><p id=\"paragraph-173\" data-paragraph-id=\"173\">Zheng Fang knew that among his three children, his eldest daughter De Yin was excellent in literary skills and had a reputation as a talented woman. People often praised her the most. His youngest son was pure-hearted and young but diligent. However, his second daughter, Huiyin, was different from the rest. As a child, she had been a careless and absent-minded little girl, but as she grew older, she became very capable. Almost every problem had a quick solution when she was around.</p><p id=\"paragraph-174\" data-paragraph-id=\"174\">He often sought her advice on military matters, finding her decisive and thorough—far from ordinary.</p><p id=\"paragraph-175\" data-paragraph-id=\"175\">Zheng Wuheng said, \"Father, Sister said that your current role is to be a knife by Prime Minister Lü Wei's side. If that knife were to kill Prime Minister Lü Wei immediately, your value would be gone. It's not easy for us to hold onto Jizhou. Now that the Prince of Wei is attacking Qingzhou, we should remain neutral and grant the Prince of Wei a favor. Prime Minister Lü Wei will certainly not tolerate the Prince of Wei's growing influence. When the two tigers fight, we can reap the benefits.\"</p><p id=\"paragraph-176\" data-paragraph-id=\"176\">Zheng Fang stood up and couldn't help but smile at Madame Ji. \"Huiyin is indeed intelligent. Moreover, since De Yin hasn’t had any children, helping the Crown Prince might not guarantee who benefits in the end.\"</p><p id=\"paragraph-177\" data-paragraph-id=\"177\">Madame Ji said, \"My lord has his counselors to consult. Huiyin is still young, but her insights are valuable. What should be done still requires discussion with your advisors.\"</p><p id=\"paragraph-178\" data-paragraph-id=\"178\">Zheng Fang waved his hand. \"There's no need. It's hard to guarantee that some of these people haven't been bought and are deliberately influencing me with their words.\"</p><p id=\"paragraph-179\" data-paragraph-id=\"179\">\"Since my lord says so, let's first listen to Huiyin's suggestion. If something goes wrong, we can make a decision immediately,\" Madame Ji said. As a female general, she also had considerable strategy.</p><p id=\"paragraph-180\" data-paragraph-id=\"180\">Zheng Fang nodded.</p><p id=\"paragraph-181\" data-paragraph-id=\"181\">Xie Jiuyi had long been preparing his troops and making thorough preparations. The attack on Qingzhou's Ma Kui proceeded very smoothly. One reason was that the Prince of Wei had planned meticulously in advance. Another was that Ma Kui, fond of luxury and indulgence, had let his army devolve into little more than a band of marauders, more interested in plundering than fulfilling their duties.</p><p id=\"paragraph-182\" data-paragraph-id=\"182\">Ma Kui was a man of Lü Wei. When Lü Wei sent a letter requesting Zheng Fang's assistance, Zheng Fang declined, citing that spring had just passed and the grain supplies were insufficient, making it unwise to mobilize the troops. Lü Wei knew that Zheng Fang had a strained relationship with Ma Kui and wasn't surprised by his refusal, so he didn't press the matter.</p><p id=\"paragraph-183\" data-paragraph-id=\"183\">Within days of occupying Qingzhou, the Prince of Wei humbly explained that Ma Kui had caused unrest in Qingzhou, leaving him no choice but to relieve the Emperor of his worries.</p><p id=\"paragraph-184\" data-paragraph-id=\"184\">The Emperor was weak and unable to attend to state affairs. Naturally, Empress He wished for her brother to continue controlling Qingzhou, so she issued an edict ordering the Prince of Wei to return Qingzhou.</p><p id=\"paragraph-185\" data-paragraph-id=\"185\">How could the Prince of Wei agree to that? He wasn't about to give up what he had already taken.</p><p id=\"paragraph-186\" data-paragraph-id=\"186\">Lü Wei suggested that Crown Prince Li Heng lead a campaign on behalf of the Emperor to retake Qingzhou for the imperial court. Thus, Crown Prince Li Heng prepared to march south with the He family's forces.</p><p id=\"paragraph-187\" data-paragraph-id=\"187\">His belongings, however, were entrusted to De Yin to manage, which, in the context of the inner household, indicated which concubine was most favored.</p><p id=\"paragraph-188\" data-paragraph-id=\"188\">De Yin felt a warm sense of honor at being chosen for this task. She had been arranging flowers with Lu Xiao but apologetically excused herself to follow the palace maids.</p><p id=\"paragraph-189\" data-paragraph-id=\"189\">In De Yin's eyes, the Crown Prince saw her as his wife. Even though he hadn't said it outright, his actions spoke volumes.</p><p id=\"paragraph-190\" data-paragraph-id=\"190\">For instance, right now, Li Heng told her not to trouble herself and shared his inner concerns: \"The Empress has commanded me to lead the campaign, but the He family doesn't listen to me at all. If I go, I fear I will only be walking into certain death.\"</p><p id=\"paragraph-191\" data-paragraph-id=\"191\">De Yin, well aware of the Prince of Wei's ambitions, hurriedly said, \"What can we do about this?\"</p><p id=\"paragraph-192\" data-paragraph-id=\"192\">Li Heng smiled and said, \"Don't worry. If something really happens to me, I will write a letter requesting the Empress to grant you permission to return home, and you may remarry.\"</p><p id=\"paragraph-193\" data-paragraph-id=\"193\">\"No, I only regret that I can't help you,\" De Yin said with guilt.</p><p id=\"paragraph-194\" data-paragraph-id=\"194\">Li Heng shook his head and replied, \"I know you've done your best. You're just a woman in the palace; what more can you do to help me?\"</p><p id=\"paragraph-195\" data-paragraph-id=\"195\">De Yin looked at him and said, \"I may not be able to help you, but my father and brothers can. You know that Jizhou is adjacent to Qingzhou. If my father sends troops, everything will be fine.\"</p><p id=\"paragraph-196\" data-paragraph-id=\"196\">Li Heng's eyes lit up. \"If Marquis of Zhaojie assists, I will have a much greater chance of success. As you know, I'm not the Empress's biological son, so the He family won't give their all for me.\"</p><p id=\"paragraph-197\" data-paragraph-id=\"197\">De Yin had already discussed with her grandmother the possibility of asking her father to help Li Heng. Her grandmother had said that her father hadn't agreed. Now that she, his own daughter, was personally asking, he would surely agree. If he refused, she would kneel and plead until he agreed.</p><p id=\"paragraph-198\" data-paragraph-id=\"198\">The author has something to say:</p><p id=\"paragraph-199\" data-paragraph-id=\"199\">The website experienced technical difficulties, making the upload process challenging.</p><p id=\"paragraph-200\" data-paragraph-id=\"200\">Leave a comment for a chance to receive a red envelope!</p><p id=\"paragraph-201\" data-paragraph-id=\"201\"></p>\n</div>"
  },
  {
    "number": 27,
    "title": "Chapter 27",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 27</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Chapter◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After occupying Qingzhou, the imperial court decided to send the Crown Prince to lead a personal expedition. Xie Jiuyi was in an urgent meeting with Li Cheng, while Yin Liyi sat talking with Huiyin. Huiyin's pregnancy was seven to eight months along, and she waddled when she walked. As she sipped a cup of milk, she couldn't help but express her envy upon seeing Yin Liyi's slender waist.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">\"I really wish the baby in my womb would come out soon, so I wouldn't have to suffer like this.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Yin Liyi smiled and replied, \"Just endure it for another two or three months. Unlike me, even with a child, I can't be with her. It's hard being separated from my daughter.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin had heard that Yin Liyi had given birth to a daughter after marriage and that the couple was always together, deeply in love. Huiyin rubbed her belly and said, \"In the future, I don't want to be separated from my child either. I always feel that no one can take care of them as well as I can.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Huiyin then probed, \"When Lord Xie was away, were you always by his side?\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Yin Liyi shook her head. \"No, I wasn't.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">This time, she had insisted on coming to Xuzhou because she knew Li Cheng was not easy to deal with, so she deliberately accompanied her husband. However, saying these things might cause misunderstandings.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Huiyin, being very intelligent, could already guess from Yin Liyi's expression that something was off. But she didn't point it out and instead said, \"I don't know much about the outside matters. I only heard that the Eastern Palace is about to lead a personal expedition, and there might be a fierce battle soon. It would be safer for Lady Xie to stay in Xuzhou.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"Ah, my husband also advised me to stay. I'll keep the young princess company then,\" Yin Liyi said with a smile.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">In the territory of Xuzhou, one couldn't let a powerful outsider suppress the local forces. It was important to maintain good relations with the Prince of Huaiyin. Originally, the territory of the Prince of Wu was also here, which was why Li Cheng could operate so smoothly in Xuzhou.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin said happily, \"That's wonderful. I married into this place from Jizhou, and to be honest, I'm completely in the dark here. Since we are of similar age and temperament, we will definitely get along well.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">In reality, Yin Liyi found Huiyin to be someone who was warm on the outside but cold on the inside. She seemed chatty and thoughtful, but she wasn't someone easy to get close to and actually gave off a sense of detachment.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Therefore, the two of them didn't speak from the heart and just exchanged pleasantries.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Huiyin had no intention of becoming close friends with her. Although she didn't understand the political situation, she could make comparisons. It was clear that the person who should have been married to Li Cheng was from Jizhou, and it should have been Li Cheng who attacked Qingzhou. But the Prince of Wei sent Xie Jiuyi to capture Qingzhou, creating a situation where Xie's and Li Cheng's territories interlocked, using Xie to keep Li Cheng in check.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Perhaps for now, everyone was working for the Prince of Wei, and there was no distinction between them, but often in the end, those who are overly loyal often end up losing everything.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">After Xie Jiuyi finished discussing matters, Yin Liyi took her leave, but on her way out, she saw Yun Hui, who looked very happy. Yun Hui also smiled and approached. \"Good to see you, Lady Yin.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Yin Liyi quickly helped her up. \"Dear sister, why are you greeting me like this? Back when I was studying at the Prince of Wu's Mansion, we used to eat and sleep together.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Yun Hui also remembered the old days. At that time, the Prince and Princess of Wu were still alive. Yin Liyi's uncle was a companion lecturer at the Prince of Wu's Mansion and was appreciated by the Prince of Wu for his good looks and knowledge. The Princess of Wu liked children, but unfortunately, she only had one son, Li Cheng. So during festivals, they would bring the children to the mansion.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">At that time, Yin Liyi's mother was an eloquent woman, and Yin Liyi and her sisters were lovely and cherished. The Princess of Wu had them study together.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Yin Liyi was too young at the time, so she was assigned a maid to look after her, and the two developed a close bond.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Later, Yin Liyi's father was introduced by the Prince of Wu to become a recorder at the Prince of Wei's Mansion, and they parted ways.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Recalling those times, Yun Hui said with a smile, \"I'm happy to see that you've married well.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"Sister Yun Hui, how have you been faring?\" Yin Liyi looked up at Yun Hui, noticing that her attire was a bit too plain.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Yun Hui said, \"Oh, just the usual.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Seeing Yun Hui's unhappiness, Yin Liyi said anxiously, \"Sister, you and I have a deep relationship. There's no need to hide anything from me. If things aren't going well, I'll talk to Cheng Brother myself.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Yun Hui might not open up to others, and there were even things she couldn't confide in Granny Chao. But she had no conflicts of interest with Yin Liyi, and she knew Yin Liyi's character well—warm, straightforward, and simple, not someone with ulterior motives.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">They agreed to meet again in two days. As soon as they sat down, Yun Hui smiled and said, \"I managed to slip out. Normally, the young princess requires a pass for anyone to leave.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"It’s just like a prince’s mansion—so strictly regulated. Come, Sister Yun Hui, have some braised fish with lamb, which this tavern makes the most authentic way.\" Yun Hui was very enthusiastic and caring towards Yin Liyi.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">They were originally from Wu Zhong, and *stuffed fish* is quite common there. In Xuzhou, it's rare to find a place that makes it authentically.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Yun Hui was somewhat moved: \"Actually, I didn’t take care of you much before, yet you treat me so well.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">After a couple of drinks, though they weren’t yet fully drunk, they had opened up. Yun Hui said, \"Ever since Princess Zheng came into the household, there’s been a major overhaul in the mansion. Half of the old servants were driven out. Some were dismissed due to embezzlement, which is fair enough, but others were let go simply because they weren’t her people. She assigned all the lucrative positions to her own people. With the Prince of Huaiyin not at home, even my own mother has become idle. Compared to others, I’m still in a better position, still holding the title of head housekeeper and enjoying some leisure.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">But leisure isn’t always a blessing. Now that Yin Liyi was the lady of a household, the more useful a person was, the busier they would be, unable to spare any time.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">But she couldn’t interfere in someone else’s family matters, so she said, \"Sister Yun Hui, ever since new people replace the old, she would naturally use those who are handy for her. You’ve always been diligent in your work; they could never find fault in you.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Yun Hui took a sip of wine, tasting the bittersweet flavors within: \"Yes, that’s what I thought too. But things don’t always go as planned. In the past, it was fine, but now that the Little Princess is about to give birth, she has demands, and the Prince of Huaiyin grants her every wish. I heard someone reported me to her, saying that I was once placed by the Prince of Wu to watch over the Prince of Huaiyin. I don’t know how many more days I can stay in the mansion.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Yin Liyi frowned: \"Sister, you’re a long-serving servant there; she wouldn’t just drive you out for no reason.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"I don’t have much to hope for; just seeing you makes me happy.\" Yun Hui didn’t expect Princess Zheng to be so ruthless, first clearing out the old servants of the Prince of Wu’s household, and now even Manager Zhong had been asked to leave.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Manager Zhong had left on his own accord, but it was said that there was an extra bag of silver in his belongings, all bestowed by Princess Zheng, intending for him to leave. Thinking of this, the innkeeper brought over another dish of dried squid. Yin Liyi personally poured her wine. Yun Hui thought that among everyone, only Yin Liangniang had no pretensions about family status.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Yin Liyi sympathized with her: \"By excluding those who differ from her, won’t the entire mansion fall into chaos? That doesn’t seem right.\" She didn’t want to meddle in other people’s family affairs, but merely commented on the situation. New people replacing the old wasn’t unacceptable, but replacing many long-serving servants might cause trouble in the mansion later on.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Yun Hui tore a piece of squid: \"We were the ones who followed the Prince of Huaiyin to join the Prince of Wei, fully committed. Never did we expect such an outcome. But well, one dynasty follows another, and with every new ruler, there are new favorites!\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">\"This is a bit too much.\" Yin Liyi had a habit she couldn’t shake. Her mood had been peaceful, but the more she listened, the angrier she became.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Yun Hui, on the other hand, consoled her: \"This is an internal matter of the mansion, so it’s best not to get involved. If you say something, how will the Prince of Huaiyin see you in the future?\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Yin Liyi sighed softly.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">When she returned home, she saw Xie Jiuyi packing his belongings and couldn’t help but ask, \"Are you leaving for Qingzhou so soon?\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"Yes, speed is crucial in warfare. The person who laid the foundation for Qingzhou can’t be absent. But it’s alright; the Prince of Huaiyin in Xuzhou will provide support.\" After taking Qingzhou, fully controlling it wouldn’t be easy.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Seeing her husband’s stubble grow, Yin Liyi remembered how he used to be meticulous about cleanliness, and smiled: \"You look travel-worn; take care of your health.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Xie Jiuyi nodded. He remembered that the Prince of Wei had always acted under the pretense of governing the people for the emperor, gathering various individuals in the Jiangnan region. This time, the court had deliberately sent the emperor’s son to lead a campaign, which, in a way, undermined the legitimacy of the Prince of Wei.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Directly opposing the court might lead to the Prince of Wei being attacked by all sides.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Xie Jiuyi was somewhat troubled, fearing that this move might be a misstep, leading to the downfall of the Prince of Wei’s faction. But when he discussed it with Li Cheng, Li Cheng said that they should have asked the Prince of Wei to request an official be stationed in Qingzhou, preserving the court’s face while allowing the Prince of Wei to continue biding his time.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">But the court wouldn’t allow the Prince of Wei’s people to occupy Qingzhou, especially the He family. Now, with the emperor’s son leading the campaign, it was even more unlikely.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">But he wouldn’t tell his wife all of this; he simply said, \"After I leave, you stay in Xuzhou. If anything happens, just go to Yunzhi.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Yin Liyi nodded inwardly, patting her chest, assuring him that everything would be fine.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Meanwhile, Huiyin was sitting on the bed, with Li Cheng’s hand on her belly. Feeling a movement, he exclaimed excitedly, \"Truly amazing! Though small, the five internal organs are all there. It must be his little foot kicking me. This kid has a lot of strength.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"My prince, what if it’s a daughter? You shouldn’t say that; we wouldn’t want our child to hear.\" Huiyin smiled.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Ever since Li Cheng had returned, he was only home at night, spending his days either discussing matters in the study or inspecting the city’s defenses. But the couple consulted each other, which was a good thing. For instance, regarding the ‘mice’ in the mansion, Huiyin would first gather evidence without removing anyone, discussing it with Li Cheng first to see what he thought. If he was willing to give the person a chance to reform, she would keep them, observing closely. But if Li Cheng couldn’t stand it, she would have him tell Manager Qiao to transfer or dismiss the person.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">For those who were sensible, they knew that not being held accountable for embezzlement was already a great fortune. If they caused more trouble, they would be handed over to the authorities for punishment.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Li Cheng was swift and decisive. When he wasn’t at the mansion, embezzlement ran rampant, with the ‘mice’ crying poverty. He wouldn’t tolerate it.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Seeing Huiyin’s charming smile and her sharp methods, always leaving room for things and parting on good terms, he couldn’t help but hold her hand: \"Whether it’s a boy or a girl, I’ll be happy either way. If she looks like you, it’ll be even better.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">\"But I’ve heard that daughters resemble their fathers, and sons resemble their mothers.\" Huiyin looked at Li Cheng’s appearance, eagerly awaiting the birth of their child.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Li Cheng smiled faintly.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Huiyin picked up the book beside her again. Previously, Li Cheng used to think how lonely it would be to have no friends, but seeing Huiyin like this, he found it quite nice as well. Every morning, she would rise early to manage the household chores, and after lunch, she would read books and do needlework. She was skilled in many refined arts, such as poetry, calligraphy, and music.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">For example, she would write poems on large banana leaves, use the leaves to serve dishes, or when she saw fallen flowers, she would pick them up and string them together with a needle to hang by the bedside. She was full of poetic charm.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">At times like this, when she sat there reading, the wind outside the window would blow in, making her clothes flutter, as if she were an immortal.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Whenever Li Cheng was by her side, he would feel the peace of time. His mood would calm down significantly.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">\"Huiyin, talk to me,\" Li Cheng sought a bit of her attention.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Huiyin folded the corner of the book before closing it and looked at him. \"What is it? Do you want to say something? Are you bored? Let's go for a walk.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"Alright.\" Li Cheng stood up and helped Huiyin up to go out together.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Just as they were about to leave, Yun Hui returned. Being pregnant, she was sensitive to smells. As Yun Hui approached to greet them, Huiyin covered her nose. \"I smell alcohol.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Li Cheng frowned. \"In the future, after drinking, don't come to serve me.\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Yun Hui didn't expect Li Cheng to show no regard for their past relationship and speak so bluntly in front of Princess Zheng. She endured the discomfort and left.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">\"Are you okay?\" Li Cheng asked Huiyin, knowing she couldn't stand the smell of alcohol. Even after drinking, he would rinse his mouth and bathe before entering the room; otherwise, his wife would feel uncomfortable.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Huiyin shook her head. \"It's fine because I covered my nose immediately.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Li Cheng found her manner of speaking incredibly endearing. He took her hand and led her to the garden. It was April, and the garden was filled with peach blossoms, cherry blossoms, orchids, peonies, lilies, azaleas, magnolias, pansies, begonias, and narcissus. The sight of the fresh flowers always lifted his spirits.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">\"Hey, how about we have a poetry recitation competition with the flowers in the garden?\" Huiyin said with a little smugness, lifting her chin.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Li Cheng pointed to the peonies and recited Xu Ning's \"Peonies\": \"Who doesn't love peonies, occupying the best of the city's splendor. They seem to be the work of the goddess of the Luo River, with a thousand graceful forms breaking the dawn.\"</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Huiyin pointed to the peach blossoms with her hand behind her back and slowly said, \"Layers of peach and plum blossoms cover the mountains, while smoke rising from the clouds suggests human dwellings.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">This was Liu Yuxi's poem. Although she liked flowers, she preferred the earthly charm rather than vague praise.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Unexpectedly, Li Cheng said, \"This poem is good, but it barely counts as a poem about peach blossoms.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Huiyin just wanted to find something to do together, but Li Cheng cared about winning or losing and insisted on relevance. However, she didn't see anything wrong with it. Sometimes, she benefited from his strong execution. This was his character.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">But instead of correcting him with discipline or lectures, she pointed to a begonia. \"Since you're taller, could you pick one for me to wear in my hair?\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Li Cheng was happy to do such intimate things. The last time they were intimate, she would always pull away whenever he got too emotional, worried they might lose control.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">\"Which one?\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">\"There, the one at the top, not 'one,' but a whole flower,\" Huiyin said with a laugh.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Li Cheng effortlessly plucked the flower and studied Huiyin for a while before putting it in her hair. As he got close to her, they both shivered when he brushed against her chest.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Huiyin stepped to the side, her face slightly red, and Li Cheng silently followed her. He swore it wasn't intentional; it was an accident. Their bodies were just too compatible, desiring each other immensely, wanting to hug and even do more intimate things upon seeing each other.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Turning to look at Li Cheng, seeing him with his head down as if he had done something wrong, Huiyin smiled and reached out. Li Cheng hesitated for a moment before coming over to hold her hand.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">As they walked, Huiyin said, \"I heard that Lord Xie is about to lead a campaign, and the Crown Prince is also preparing to lead one himself. You know, my sister is a Lady-in-Waiting in the Eastern Palace. I don't know if my father will send troops. You might think I'm being selfish, but if you were the one going to war, I'd definitely write to my father and brothers for help. Especially since my brothers are from the same mother, I could still convince them. But since it's not you going this time, I haven't paid attention.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Li Cheng certainly hoped for the best for Prince of Wei and was very loyal. Even in Xuzhou, he never made connections in his own name. But hearing Huiyin mention this, he looked at his wife. \"Why are you always so good to me?\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">\"Because you're not just my husband, but someone who's always so kind to me.\" Regardless, Li Cheng had no other women during her pregnancy, which put him far above other men. Not to mention, he also spent time joking with her.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Li Cheng was actually a bit nervous when she mentioned the latter sentence, but he smiled with relief after hearing her out.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">He both hoped and feared what she might say. Huiyin also felt that everything was happening too quickly, and though she couldn’t say it outright, she needed to express her stance. She had to position herself as acting for Li Cheng’s good; otherwise, if her father didn’t listen to her and decided to help the Crown Prince, she would be all alone in the Prince of Wei’s territory, becoming a target for everyone.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">So, this was why she spoke this way now. It wasn’t that she was scheming, but one must look out for themselves, or heaven will punish them.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">The current happiness they shared might become illusory in the future. Until she was certain that Li Cheng was fully devoted to her, she didn’t want to put herself at risk.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Li Cheng couldn’t foresee all this; he simply thought his wife was indeed a good wife. Even without a life-and-death promise between them, she treated him very well.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">He echoed, “You’re not just my wife, but also someone who treats me very well.”</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Huiyin and he exchanged a glance and both laughed.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">After Zheng Deyin and Crown Prince Li Heng consulted, they decided to prepare for her return to Jizhou. Li Heng requested Empress He, and the two went to Jizhou under the pretext of visiting family. Nominally, it was said that the Crown Prince was visiting his father-in-law before going into battle.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">There were only three daughters in the Eastern Palace now: Crown Princess Lu Xiao, Zheng Liangdi, and a lower-ranking imperial consort, Dong Yuniang. When Crown Princess Lu Xiao heard that the Crown Prince had specially accompanied Zheng Liangdi back home to visit her family, she felt somewhat disheartened for reasons she couldn’t quite understand.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Her servant, Grape, carried a bowl of lamb noodle soup over and said with a smile, “Crown Princess, usually when the Crown Prince is in the palace, he dislikes the smell of lamb, so the kitchen never prepares it. Now that the Crown Prince is gone, you can finally have lamb noodle soup.”</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Lu Xiao, who had been feeling down, broke into a sweat after eating the bowl of lamb noodle soup, feeling an indescribable comfort.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Grape was also delighted to see the Crown Princess finish eating, “I haven’t seen you smile for days, but now you’re smiling after eating this.”</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">“I was just thinking about why I don’t seem like a proper Crown Princess? No wonder the Crown Prince is partial to others,” Lu Xiao shook her head and didn’t say much more.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">But Grape added, “In my humble opinion, Zheng Liangdi has overstepped her bounds. She manages the Eastern Palace in your place and even comes here pretending to be your good sister. It’s only because you’re kind and don’t say much. Didn’t you see how a few days ago, Empress Dowager scolded her for being too self-willed? That was venting for you!”</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Lu Xiao looked at the pastries on the table, which were sent by Zheng Deyin. She said, “Grape, please don’t say things like that anymore.”</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Grape muttered, “It’s just that you’re too soft-hearted. How much affection has she stolen from you over time?”</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">When Zheng Fang saw the Crown Prince and his daughter coming together, he hurriedly led everyone to kneel and pay respects. Madame Ji knelt behind elder Madame Xu, fully aware of why Zheng Deyin had come, though she disdained it internally.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Li Heng personally helped Zheng Fang up, saying, “We’re all family; there’s no need for such grand formalities.”</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">This made him appear affable and respectful of his subordinates. However, Zheng Deyin felt that the Crown Prince was being kind to her father because of her. She first arranged for rewards to be prepared for Madame Ji and others, and then said to Zheng Fang, “The Crown Prince will be going into battle soon, so he’s accompanying me home to visit family and enjoy familial love. Let’s all be at ease.”</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Zheng Fang repeatedly agreed and invited Li Heng to be seated. Li Heng appeared gentle and refined, observing proper decorum.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Zheng Deyin then took the opportunity to ask Zheng Fang to go inside for a private father-daughter conversation.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">“Father, this time the Crown Prince is going into battle in Qingzhou, and I’m afraid he might meet with danger, so I want to ask you to send troops to help. Rest assured, if the Crown Prince wins, I’ll gain favor in the Eastern Palace, which will be a great benefit to our family. I know you’re not in good health, but if my elder brother and younger brother accompany the Crown Prince into battle and succeed, they’ll be promoted. Even you, Father, will be able to suppress Lü Wei,” Zheng Deyin explained.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">She thought this was very persuasive—promotions and increased rank were the best incentives.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Zheng Fang was somewhat tempted but waved his hand, “Will Qingzhou be given to us?”</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">Nothing mattered more than territory.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Zheng Deyin gave an awkward laugh, “Father, this is a matter of the court; it’s hard to grant it to you.”</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">Zheng Fang said, “We already have plenty of gold and silver treasures at home. We’re doing well in Jizhou now. If we help the Crown Prince, daughter, don’t blame me for saying this, but if the Prince of Wei attacks us in the future, what will we do? Besides, isn’t it because of your face that I’ve allowed the He family’s army to pass through our territory?”</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">He still trusted his younger daughter’s words. Now that Lü Wei hadn’t made a move, if he helped the court retake Qingzhou, and the land was taken by the He family, he would suffer losses without gaining anything.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">Moreover, his daughter had been in the Eastern Palace for over a year without bearing any children. With no heirs in the entire Eastern Palace, the Crown Prince’s position seemed increasingly unstable. Furthermore, asking him to help without even mentioning who would supply the provisions—wasn’t that letting the He family get something for nothing?</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">In short, he disagreed.</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">Unexpectedly, with a thud, Zheng Deyin knelt down, startling Zheng Fang.</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">“If Father doesn’t agree, I won’t get up,” Zheng Deyin said firmly. Shen Baoxu once wept outside the Qin court, and wasn’t it through such persistence that he succeeded? She could do the same.</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">Zheng Fang felt even more that his eldest daughter was siding with outsiders and wasn’t as considerate of the family as his second daughter. He became even more resolute in refusing, knowing that helping them would only strengthen others at his own expense.</p><p id=\"paragraph-123\" data-paragraph-id=\"123\"></p><p id=\"paragraph-124\" data-paragraph-id=\"124\"></p>\n</div>"
  },
  {
    "number": 28,
    "title": "Chapter 28",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 28</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Pei Shuo and Zheng Wuheng were also accompanying Li Heng in conversation. Pei Shuo, now one of Zheng Fang's most valiant and fierce generals, was young and spoke of the difficulties in Jizhou: \"Our Zheng family army has to both listen to the Chancellor's order to garrison half of our troops to protect the capital and defend against the Prince of Wei's forces. Moreover, Lord Zheng's health has not been good lately. It seems like misfortunes never come singly.\"</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">In such occasions, Zheng Wuheng, being quite young, only served a ceremonial role. He had actually met the Prince of Wei, who, despite being around the same age as the Crown Prince, seemed more mature and treated him with respect. Unlike the Crown Prince, who always seems so self-assured.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">In Zheng Wuheng's own judgment, his elder sister had married a vassal king. Even the Prince of Huaiyin and his sister were not as affectionate as the Crown Prince and his elder sister. However, when it came to attire, my elder sister, though only a commandery princess, is adorned with pearls and jade, wears silk robes and fur coats, and steps in gold-threaded cloud shoes.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">But the gifts were secondary; what mattered most was that she was his own flesh and blood. Previously, his elder sister had treated her poorly and even demanded to bring back her mother, Xu Shi. If he helped her now, wouldn't it be aiding tyranny? Moreover, the Crown Prince himself relied on the He family and had nothing to offer the Zheng family.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">The Little Prince, his brother-in-law, personally taught him martial arts and guided him in archery. Even Xuzhou was rich in resources, and the Jiangnan region was even more prosperous. His sister had quietly told him that Xuzhou was successfully subdued because much of it was once the fiefdom of the Prince of Wu. The Little Prince's army included many of his former troops and had since recruited more soldiers. They are undoubtedly powerful.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Pei Shuo thought similarly but went a step further in his thinking. Despite what Li Heng said about the interdependence of lips and teeth, Lü Wei had not made a move yet, and it would be foolish to lose so many men for the sake of Li Heng and the Prince of Wei. It was better to remain neutral.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Li Heng reiterated, \"The Prince of Wei has a wolf's ambition. Although he is the emperor's own younger brother and has been deputized to govern the Jiangnan region, his influence is growing. It's not just Qingzhou that's at stake; he might soon set his sights on Jizhou.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"Yes, although the Prince of Wei is also related to our family through marriage, our hearts in Jizhou are with the imperial court,\" Pei Shuo was adept at speaking, and after finishing, he glanced at his younger brother Zheng Wuheng.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Zheng Wuheng also quickly stepped forward to express his stance.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Li Heng realized his miscalculation. He had originally thought that marrying the eldest daughter of the Zheng family would bring many benefits, as the eldest daughter holds a different status in every family. However, it seemed that Zheng Deyin did not hold much sway in her own family.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">As the Eastern Palace, he had already hinted as much, yet they remained unmoved. Were they not afraid of retaliation once he ascended the throne? Or had the Zheng family already aligned with someone else?</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">He had chosen the Zheng family's daughter because he saw Zheng Fang as a fierce and brave warrior, unmatched in the army. Only he could defeat Lü Wei, whose power weighed heavily on the imperial family. It now seemed that the Zheng family was no longer an option.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Pei Shuo, said to be Zheng Fang's adopted son, was highly valued by him. To some extent, Pei Shuo could represent Zheng Fang, and it was likely that Liangdi Zheng would also be unhelpful.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Sure enough, Zheng Fang said to Zheng Deyin, \"Liangdi, what are you doing? You are a woman of the imperial family; how can you kneel before me?\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Zheng Deyin looked at Zheng Fang and said, \"Father, please help me just this once. Helping the Crown Prince is the right path. When the Crown Prince ascends the throne, won't you become royalty?\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Zheng Fang, who relied solely on his bravery to stand firm, was somewhat moved but waved his sleeve and left, saying, \"Why are you forcing me?\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Zheng Deyin, being a weak woman, could not stop Zheng Fang and could only watch helplessly as he left, falling to the ground. She couldn't understand why her father wouldn't listen to her and disregarded her completely.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Li Heng, realizing that he hadn't gained the Zheng family's support, understood that his efforts to favor Zheng Deyin over the past days had been in vain.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">With war imminent, Li Cheng received battle reports from the frontlines at home, saying that Crown Prince Li Heng was leading the He family's army, which somewhat eased his mind. Taking Qingzhou would be difficult with only the He family's support, since neither the Lü family nor the Zheng family had joined forces.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Because of this, Li Cheng was in a good mood and his demeanor towards Huiyin was much lighter.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Huiyin, why didn't you go out for a walk today?\" He noticed that his wife usually went out for a walk around this time but was still at home.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Huiyin smiled and said, \"You are truly a busy person. Today is the day when the wet nurses enter the estate. I have already spoken to them and had the doctor check their pulses. They are free of any contagious diseases, so I can confidently employ them.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Li Cheng slapped his forehead and said, \"I completely forgot!\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"Since everything is done, I thought we could have a meal under the flower pergola. There's a gentle breeze, and the weather is pleasantly cool, better than staying indoors.\" Huiyin stood up and held onto his arm, afraid he would disagree.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Of course, Li Cheng indulged her. He was always willing to pamper his wife in such small matters.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Ever since removing those parasitic individuals, they had saved two to three thousand taels over half a year. Huiyin used a thousand taels to craft her own jewelry and have clothes made. She wasn’t about to live frugally just so another woman could benefit from it later—that would be foolish.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\"></p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Some men pretend to love you more when you don’t seem interested in their money, acting generous while secretly calculating every move.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Thankfully, Li Cheng is not this kind of person. He didn’t even bat an eye when Huiyin had jewelry made, clothes tailored, or even bought ornaments. This only deepened her affection for him.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Today, she stepped out in a new outfit, perfect for spring. She wore a light green upper garment paired with a bluish-green pleated long skirt, the colors blending seamlessly. Around her waist was a pale yellow pearl sash, and hanging from it was a phoenix-shaped jade pendant. The front of the jade featured a single phoenix cloud pattern, while the back had an auspicious cloud pattern. As she moved, the jade ornaments clinked softly.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Originally, she loved to wear a cloak but gave it up, fearing it might trip her. She wasn’t focused on beauty; instead, she saw her attire as a way to assert her status.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"What’s for dinner today?\" Li Cheng asked as he helped her sit down, quite curious.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Every day, the menu was different, with at least one dish that caught his attention.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Huiyin thought for a moment. \"Today, it’s a full lotus banquet. Lotus leaf chicken, lotus flower pastries, lotus leaf glutinous rice ribs, and steamed pork with lotus leaves. Oh, and there’s also lotus root soup and lotus leaf rice. After our meal, we’ll have a lotus seed soup to clear your inner heat. Your inner heat is quite strong.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">She chuckled at the end.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Li Cheng naturally knew what she was referring to. That morning, he had asked her for help and now felt a bit shy, wanting to tickle her.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Huiyin was usually afraid of being tickled and of ghosts. When she saw him about to tickle her, she pulled away. Li Cheng then hugged her. \"I won’t tease you anymore. Don’t trip over yourself.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">The two laughed and teased each other, while Yun Hui’s expression darkened slightly in the distance.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">The servants started bringing in the dishes. When there were no guests, Huiyin usually ate whatever she felt like, without putting on a grand display.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">However, just as they were enjoying their meal, someone outside submitted a calling card for Li Cheng. He took it and placed it face down on the table, asking Yun Hui to invite the person in.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Whose card is it?\" Now that Huiyin and Li Cheng were more familiar, she could ask casually.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Li Cheng hesitated for a moment but replied, \"It’s from a woman.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">In fact, Li Cheng has always respected women; he even believed that women were not inferior to men and deserved more respect.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Huiyin looked at him. \"Is she facing any difficulties?\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Li Cheng explained, \"This woman, surnamed Jiang, is the only daughter of a salt merchant from Taizhou. Her parents have passed away, and her family's business was almost lost. When I was fighting in the war and lacked military supplies, I helped her secure the inheritance of her family's business, and in return, she arranged for the military supplies I needed.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"A fair deal, that’s a reasonable arrangement,\" Huiyin replied, not inclined to think ill of the woman from the start.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Li Cheng shook his head. \"What you don't know is that she has been targeted by the brother-in-law of the Prince of Wei. She is seeking my protection.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">The Prince of Wei's primary consort was surnamed Huo, also from a prominent family in the Jiangnan region. Though the Prince of Wei appears to treat Li Cheng well, he had actually allocated most of his strategic territories to his cousins or brother-in-law. The only exception was Xuzhou, which Li Cheng had conquered himself.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Huiyin looked at Li Cheng. \"A young woman managing a household is like a child carrying a treasure in plain sight; it's no wonder she has caught someone's eye.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Li Cheng nodded. \"Yes.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">He was mainly concerned that Huiyin might feel uncomfortable. At that time, trusted advisors like Guo, the Chief Secretary, had naturally urged him to take Jiang as a concubine, which would not only provide her protection but also ensure the continuity of his military supplies—a win-win situation. After all, it was common for a man of status to have multiple wives and concubines.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">But Li Cheng was not fond of such arrangements. Yes, taking a concubine would address two issues simultaneously, but a true man should stand on his own merits.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">However, Jiang was in a precarious situation, and she only sought a nominal title for protection, not an actual marriage.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Outside the Huaiyin Mansion</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">In the black canopied carriage sat a young woman dressed in dark green. She sighed softly. \"My parents, having only me as their daughter, have both passed away. Now, General Huo is demanding that I become his concubine. I can only seek help from the Little Prince.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">The woman was young and beautiful, wearing a gold bracelet. She half-lifted the carriage curtain, looking as if she were about to step into an uncertain future.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">The old nanny sitting beside her said, \"Miss, once you enter the marquis's mansion, it’s like entering a labyrinth with no clear exit. Though the Little Prince is honorable and handsome, I’ve heard that he has already married Princess Zheng, the daughter of the Marquis of Zhaojie, Zheng Fang. If you really become a concubine, you’ll find yourself between a rock and a hard place.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">\"I know all that. In the past, I wouldn’t have given it a second thought. But what if the Little Prince stands up for me this time, only for Huo Qi to harass me again in the future? What should I do then? Nurse Lin, why are women's lives so difficult?\" Jiang Bipbo was truly at the end of her rope.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">The clan members were eyeing her family's vast fortune, and outside, the brother-in-law of the Prince of Wei was also coveting her. She had no idea what to do.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Nurse Lin thought about how the young lady was originally supposed to marry into her family, but when the time came, no one dared to arrange it for her. The clan members practically wished her dead, forcing her to marry only relatives of the elder clansmen, otherwise the family wealth would fall into the hands of outsiders.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">When her parents were alive, she had lived a carefree life. She had even dressed as a man and gone with her father to Lin'an Prefecture, and even to the capital city.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">As she hesitated, she saw a stewardess from the Huaiyin Mansion approach. The stewardess smiled and said, \"Miss Jiang, our prince invites you to rest in the small hall for a moment.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Jiang Bipbo, feeling uneasy, followed Yun Hui inside. Yun Hui thought about how much effort it had taken to get rid of Xun Rou with Princess Zheng, and now here was Jiang Bipbo.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">This was Jiang Bipbo's first time at the Huaiyin Mansion in Xuzhou. The only time she had been to a prince's mansion in Jianye was to deliver a congratulatory gift to Grand Dowager Wu.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"Thank you,\" Jiang Bipbo said, handing a pouch to Yun Hui.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Yun Hui smiled and said, \"How can I accept your pouch? It's really unnecessary.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Jiang Bipbo said, \"I am troubling the stewardess; please do accept it.\" This was a matter of social etiquette, and as a merchant's daughter, Jiang Bipbo understood these things well.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">With that, Yun Hui accepted it.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">After accepting it, Jiang Bipbo asked, \"Is the Little Prince occupied at the moment?\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Yun Hui said, \"The Little Prince is having a meal with the princess right now.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">\"Then it is my fault,\" Jiang Bipbo immediately said.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Coincidentally, Yin Liyi arrived just then. She had come to inquire about the frontline situation from Li Cheng, but she didn’t expect to meet Jiang Bipbo here.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">The two had met once at Grand Dowager Wu's birthday celebration in Jianye. Yin Liyi knew that Jiang Bipbo was a wealthy woman and even admired her, as she wasn’t very good at business herself.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">\"Oh, why do I meet you here?\" Yin Liyi was actually on familiar terms, and in the past, she would have just gone in. But now, since she wasn’t familiar with Princess Zheng, she sat in the flower hall and started a conversation with Jiang Bipbo.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Jiang Bipbo quickly stood up and bowed. \"Common woman Jiang Bipbo greets Lady Xie.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Yin Liyi hurriedly said, \"Please rise quickly. I also have business to discuss with the Little Prince. Are you here to see him as well?\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Jiang Bipbo nodded.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">While tea was being served, Yun Hui quietly whispered the reason to Yin Liyi, who immediately became angry upon hearing it. \"Huo Qi again? That man may have the title of a general, but he is actually a greedy and profit-seeking individual. It is said that a medicinal shop on North Street in Jianye was extorted by him because their business was doing well.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Yin Liyi's elder sister, the Second Princess, often told her many things. She said that the primary wife of the Prince of Wei had a lot of money and that when the Prince of Wei visited her, he was treated with expensive food, which he enjoyed. However, these funds mostly came from the people's livelihood.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Hearing Yin Liyi's words made Jiang Bipbo's face turn even paler.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">\"Lady Xie, what should I do now?\" Jiang Bipbo asked.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Yin Liyi smiled and said, \"You’ve already come to the Huaiyin Mansion for help, haven’t you? Since you’ve come to the mansion, there’s nothing to fear. Now, the only person who can rein in the Huo family is the Prince of Huaiyin. His status is quite special since he is the nephew of the Prince of Wei.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Yun Hui felt something was off with Yin Liyi's words. Wasn’t she bringing more trouble to the Little Prince? No matter what, the Prince of Wei respected his primary wife. The Little Prince had his own small territory, and if they offended the Huo family, there might be future repercussions. Even something as important as marriage was decided directly by the Prince of Wei.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Though she also wanted to see Princess Zheng gain a rival, it shouldn’t harm the Little Prince.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Meanwhile, Huiyin was listening to Li Cheng, waiting for him to finish.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">\"I feel like you’re holding something back,\" Huiyin smiled.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Li Cheng glanced at Huiyin's belly and still fell silent.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Huiyin deliberately went over and sat next to him, shaking his arm back and forth. \"Tell me. Don't hold anything back. You and I are husband and wife. I've shared all my secrets with you, but you're keeping things from me. Do you want me to stop being close to you?\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Seeing that he wasn't saying anything, Huiyin pretended to be angry.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Li Cheng spoke directly, \"Miss Jiang wants me to give her a title. Please don't misunderstand—just a title. She's a merchant's daughter, and her status won't be high. The Chancellor suggested I grant her a title to protect her, so this weak woman won't be harmed by Hu Qi. But I definitely won't agree, which is why I didn't bring it up.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">\"How could the Chancellor ask you to take a merchant's daughter as a concubine?\" Huiyin, who actually understood, decided to tease him.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Li Cheng, a seven-foot man who usually spoke decisively, was still somewhat shy for his age. Hearing Huiyin's question, he stammered, \"It's for military supplies.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Sometimes winning battles depends on well-fed soldiers and horses, and all of that requires money.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Prince Wei had married many women from prominent clans to gain support from various factions.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">He hurriedly added, \"But rest assured, I will never compromise myself for a woman's sake. I'm not that kind of person. My territory needs to be won by my own efforts.\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Seeing Li Cheng's anxious expression, Huiyin handed him a handkerchief. \"Wipe your sweat. I understand your intentions.\"</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">\"Aren't you jealous?\" Li Cheng asked, noticing Huiyin's calm demeanor.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Wiping his sweat with the handkerchief, Huiyin said, \"If I were to get jealous, it would make my entire pregnancy stressful. There are so many women in your life—concubines, cousins, and others—that I'd never be able to keep up with all the jealousy. Tell me, is there any woman who would willingly share her husband? Would you be happy if someone coveted me? Would you be okay with sharing me with others?\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Li Cheng blurted out, \"Of course not.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">He couldn't bear the thought of any man, even in name only, being connected to Huiyin. The idea made him furious.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">But...</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">\"But you're not angry at all.\" Li Cheng, like a child, always lacked a sense of security.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Huiyin touched her belly. \"Then you need to do something to make me devoted to you forever. Right now, I'm your love, and you need to give me confidence in you.\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Seeing her bowed head, Li Cheng felt a slight pang in his heart. \"It's my fault.\"</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">In his mind, although this marriage was arranged by Prince Wei, he didn't reject the person he married. Instead, he always let her suffer, either leaving her alone at home or dealing with his cousins and various other people, yet she was the one who treated him wholeheartedly.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Huiyin smiled to herself, thinking how easily she had distracted him. She hugged his arm. \"Don't worry, I won't let you be the Cow Demon King and let Miss Jiang be the Jade-faced Fox.\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">\"What do you mean?\" Li Cheng didn't react immediately.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Huiyin playfully tapped his nose. \"You silly, haven't you read 'Journey to the West'? The Jade-faced Fox's father was the King of Ten Thousand Years, a fox king. After he died, he left behind a daughter called the Jade-faced Princess. The princess had millions in wealth but no one to manage it, so she sought out the mighty Bull Demon King and was willing to marry him and provide a dowry. Later, when Sun Wukong pretended to be Iron Fan Princess and invited the Bull Demon King to return from the Jade-faced Princess, she was scolded for giving Iron Fan Princess jewels, gold, silver, silk, firewood every year, and rice every month. Think about it—how could we let that happen? In the future, both you and I might end up having to deal with people looking down on us.\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Li Cheng thought about the story of the Bull Demon King and realized his wife was indeed well-read.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">But how could they find a way out of this predicament?</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">\"Actually, I can help her once in my name, but I can't protect her every time. After all, you know Hu Qi has a wolfish nature, and he's also the brother-in-law of the Princess of Wei. He's still considered my elder.\" Li Cheng didn't want to fall out with the Princess of Wei's faction over Jiang. He didn't have the capital for that.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">If the Jiang family were based in Xuzhou, it wouldn’t be an issue, but since they’re in Jianye, it’s harder for him to intervene.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Huiyin patted his hand. \"I have a clever plan.\"</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">\"Oh? Princess, what's your clever plan?\" Li Cheng, who had previously seen Huiyin always seeking his opinion and showing him great respect, now looked at her with admiration.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">\"Then let's invite her over. We've just finished eating, so let's take a walk to the main hall to help with digestion.\" Huiyin said.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">……</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">Jiang Bipbo entered the main hall of Princess Zheng at Huaiyin Mansion, her heart heavy with worry. The instructing nursemaid led her, and the servants along the way were silent, appearing extremely solemn.</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">After entering the main hall, she saw two people seated. On the left was Little Prince Li Cheng, dressed in casual attire, his eyes focused on tea tasting. On the right sat a young woman who, despite her youth, exuded an aura that matched the Little Prince's. She looked at Jiang Bipbo and smiled.</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">Feeling uneasy, Jiang Bipbo bowed respectfully. \"I pay my respects to the Little Prince and young princess.\"</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">She heard the young woman's delicate voice say, \"Bipbo? Is it from Li Bai's line, 'Desiring to shake the golden scepter of the Five Pavilions, floating on the green waves of the Three Xiang rivers?'\"</p><p id=\"paragraph-123\" data-paragraph-id=\"123\">Jiang Bipbo nodded hurriedly. \"Yes, my father gave me this name when he toured Mount Heng, and I was born at that time.\"</p><p id=\"paragraph-124\" data-paragraph-id=\"124\">\"What a beautiful name. Then let me wish you with Wang Wei's line, 'The boat floats on the blue waves, people wandering through a painted landscape,' that your future days will be leisurely and peaceful, and your heart will be free and untroubled. How about that?\" Huiyin said, looking at her.</p><p id=\"paragraph-125\" data-paragraph-id=\"125\">Jiang Bipbo understood that these were kind words, but she wasn't entirely sure what they meant.</p><p id=\"paragraph-126\" data-paragraph-id=\"126\">It was Nanny Nan who stepped forward and said, \"Miss Jiang, our young princess likes you very much and wishes to recognize you as an adopted sister. Would you be willing?\"</p><p id=\"paragraph-127\" data-paragraph-id=\"127\">Jiang Bipbo hadn't expected the young princess to offer such a gesture, a surprising turn that left her feeling a mix of embarrassment and complex emotions.</p><p id=\"paragraph-128\" data-paragraph-id=\"128\">Huiyin smiled. \"You know, the Little Prince is the nephew of Prince Wei, and Hu Qi is the brother-in-law of Prince Wei. You are such a wonderful woman; you should have a bright life, not become a concubine to someone else. Though I may not be much, my father is the Marquis of Zhaojie. You can confidently use the connections from our Zheng family. I will assign ten personal soldiers to protect you; they are trusted people from our family in the military. I don't think Hu Qi would dare to challenge us.\"</p><p id=\"paragraph-129\" data-paragraph-id=\"129\">Currently, Zheng Fang remains neutral but is allied with Prince Wei. If Hu Qi were to offend the Zheng family over something trivial, Prince Wei would not stand for it.</p><p id=\"paragraph-130\" data-paragraph-id=\"130\">Jiang Bipbo, filled with gratitude, bowed deeply. \"I thank the young princess. For the kindness you've shown me, I will repay you even in my next life, no matter what it takes.\" She still hoped for a bright future, where she could run her business and find someone she truly loved.</p><p id=\"paragraph-131\" data-paragraph-id=\"131\"></p>\n</div>"
  },
  {
    "number": 29,
    "title": "Chapter 29",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 29</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Double Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After Jiang Bipbo's matter was settled, Huiyin arranged for her to stay in the Huaiyin Mansion for a day before making further arrangements. Jiang Bipbo, who had experienced a rollercoaster of emotions that day, followed the maid down.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">As soon as she left, it was announced that Yin Liyi had arrived.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Huiyin rubbed her waist. \"What could she want? Could she be here to ask about Lord Xie? But these military matters cannot be discussed right now. Prince, I'm a bit tired, I'll take my leave first. Please entertain her.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"No, a man and a woman cannot be alone together.\" Li Cheng quickly stood up and bowed to Huiyin. \"I must trouble my wife.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Only then was Yin Liyi invited in. She had indeed come to inquire about Xie Jiuyi’s situation.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Li Cheng pondered for a moment. \"These military matters cannot be discussed. Rest assured, if there are any major changes, I will definitely inform you.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Yin Liyi was quite understanding. \"It's my fault. I must also thank the little prince and the young princess.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Hearing this, Huiyin thought Yin Liyi would leave immediately, but instead, she brought up Jiang Bipbo's situation. \"Little prince, I think Miss Jiang's matter is of great importance. If that lecher Huo Qi gets his hands on her, it would be like a sheep falling into the mouth of a tiger. Only you have the power to help her in this world.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Of course, Yin Liyi did not know that Jiang Bipbo's matter had already been resolved. She just wanted to speak up for the poor girl. Women were indeed not easy, and if Xie Jiuyi were here, she would definitely try to find a way with her husband. But now, with her husband away, if she could persuade Li Cheng to help Jiang Bipbo, it would be the best outcome.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Li Cheng smiled. \"How can I help her? This matter still relies on the princess.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin felt that this wasn’t really Yin Liyi’s business to meddle in. What she said was somewhat generous at Huiyin's expense.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Upon hearing that it was Huiyin who helped, Yin Liyi asked how she did it. Huiyin, feeling that Yin Liyi was overstepping, merely smiled and said, \"I thought it would not be good for the little prince to confront the Huo family directly, so I decided to recognize her as my foster sister. This is a better solution.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Yin Liyi was taken aback and quickly admitted her mistake. \"It's my fault.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"You meant well.\" Huiyin shook her head, indicating it was fine.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">The conversation between the two women wasn’t entirely genuine. Ever since Yin Liyi learned that Huiyin had dismissed the old servants of the Huaiyin Mansion and was now meddling in its affairs, she felt that Huiyin lacked human touch. The old servants of the Huaiyin Mansion had once risked their lives for Li Cheng, and it seemed too heartless.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Seeing that there was nothing left to talk about, Yin Liyi, feeling a bit awkward, took her leave first.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">As soon as Yin Liyi left, Huiyin stretched out her hand for someone to help her back to her room. Li Cheng followed behind and personally helped her massage her waist. His hands were neither too light nor too heavy, just enough to hit the sore spots, causing Huiyin to sigh in relief.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"Feels good, right?\" Li Cheng said.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Huiyin nodded. \"Yes, by the way, the Dragon Boat Festival is coming up soon. I've prepared gifts for everyone, even your wet nurse, Granny Chao. Please help me check and give me some pointers.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">At first, everything needed Li Cheng's approval, and he did provide some guidance. But after realizing that Huiyin's preparations were more appropriate, he quickly said, \"Just prepare everything. Hand it over to Manager Qiao. You should stress less. You're due next month, so you need to take care of your health.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Of course, I'll take care of myself.\" Huiyin touched her belly, pushing away any negative thoughts.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">The next day, she personally assigned ten personal guards to Jiang Bipbo and wrote a personal letter to the Prince of Wei, sending Jiang Bipbo off.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Nanny Nan was puzzled. \"Young princess, you have done a great favor for her. Why didn't you see her off yourself?\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"When you do a good deed, don’t expect anything in return. Those who are grateful will remember even a small favor with great appreciation. Besides, helping her was also for my own sake.\" Huiyin believed that if she did something good, she shouldn't expect anything in return. Otherwise, it would be a waste of emotional effort to help someone.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Nanny Nan brought some bird's nest porridge and couldn't help but say, \"Your heart is too kind.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Huiyin smiled. \"You don't understand.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">The Jiang family needed Li Cheng's protection for military support, and sometimes Li Cheng needed the Jiang family's money. When it came to interests, you couldn't talk about feelings.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Nanny Nan really didn't understand these things. She felt that her young mistress overthought everything. People who thought too much needed someone with extreme emotions to complement them. But how could someone in such a high position, like the little prince, afford to be overly emotional?</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Jiang Bibo, holding the letter given by Huiyin and accompanied by the ten soldiers provided by the Zheng family, finally felt a sense of security. However, the old nanny Lin beside her said, \"Miss, you said the young princess has helped us so much, but she doesn’t seem to have the attitude of bestowing a favor, nor does she take credit for it.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Jiang Bibo replied, \"It’s no wonder people say that marrying into a family of equal social standing is important. Zheng is of noble birth, the daughter of the Grand Commander of Jizhou, and has the confidence to act this way. It seems we should cultivate a closer relationship with her in the future.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Lin nodded and said, \"People with real ability act quietly without making a fuss. With a simple gesture, they can help. Anyway, the Huaiyin Mansion is now under her control. In the future, when we have gifts to give, we should present them to the young princess.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"I was thinking the same. Moreover, she is nominally my foster sister,\" Jiang Bibo added. She was good at business and had a keen eye. Despite the fact that Lady Xie threw a fit, if she really wanted to help, why didn’t she ask her sister, the secondary consort Yin, to speak? Instead, she kept telling Jiang Bibo to seek help from Li Cheng.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">After Jiang Bibo returned to Jianye, Huo Qi came to visit her. Seeing that she was accompanied by soldiers from Jizhou and that Jiang Bibo had even sent a letter to the Prince of Wei, Huo Qi finally backed off.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">This is a story for another time. After more than a month, Huiyin received fine silks and a tiger-head hat, along with gold and silver utensils, all sent by the Jiang family via boat. She stored them in the warehouse, planning to organize everything properly after the child was born.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Xie Jiuyi and Li Heng have been fighting in Qingzhou for more than a month now. The southern soldiers had previously handled Ma Kui well, but they found it difficult to deal with the cavalry brought by Li Heng.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">In the midst of the stalemate, Lü Xiao from the Eastern Palace received a gift sent from the frontlines. The young eunuch was quite tactful as he said, \"Crown Princess, this is specially sent by the Crown Prince for you.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Lü Xiao glanced at Deyin. She thought the gift was for Deyin, but it turned out to be for her. Zheng Deyin’s face turned pale for a moment, and she could only awkwardly smile to hide her embarrassment.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">This reminded her of the time when she returned from Jizhou. Although Li Heng comforted her with words, he was actually disappointed. It was all because her father wouldn’t help her. If he had, how could she have ended up in this situation? In her previous life, she remembered that when Li Heng attacked Qingzhou, Pei Shuo, her elder brother, accompanied him. Not to mention later, when Xuzhou was attacked, Zheng Wuheng was shot by a volley of arrows. Why didn’t they help her? Her father was clearly partial.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">She gave gifts on every holiday and never mistreated her natal family. Didn’t she plan to promote her father and brothers once she rose to power?</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Seeing the joy in the Eastern Palace, Zheng Deyin touched her belly and wondered why, despite being so favored, her belly was not cooperating. Was there a problem with her belly? It was unfair. In her previous life, Huiyin, who had been a concubine to the Crown Prince, conceived a child, and even after marrying Li Cheng, she conceived again. Why couldn’t she?</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Recalling her time at home, Huiyin often stayed up late and craved cold drinks. Her menstruation was prolonged and irregular, unlike her own, which came every month without any pain. How could she conceive now?</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Seeing Deyin’s distress, Lianzhi, her maid, advised, \"Liangdi, the Crown Princess is only given face because she is the empress. The ornaments on your dressing table are almost all personally given by the Crown Prince.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"But I have let the Crown Prince down,\" Deyin said with deep remorse.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Lianzhi pursed her lips and said, \"Actually, I think you should wait until you are pregnant before making any plans. If you give birth to a grandson, Marquis and the others will definitely help.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Deyin nodded. She then looked out the window and said, \"By now, my second younger sister is probably about to give birth. But as a liangdi, I cannot send anything to Xuzhou. I wonder if my second younger sister will have a boy or a girl. If it’s a boy, he will be better off than me.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">\"Liangdi, giving birth is such a gamble. Moreover, whether the child can be raised successfully is another matter. Xuzhou is not as good as the capital,\" Lianzhi thought to herself.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Deyin looked at her maid and said, \"Don’t talk nonsense. How can you speak like that? Huiyin is my sister.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Lianzhi fell silent.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Meanwhile, Huiyin was indeed about to give birth. Her due date had passed, and she was getting a bit anxious. After taking a walk outside, her labor suddenly started, and Li Cheng, without pausing to catch his breath, carried her into the main room.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">The midwife quickly entered and, seeing Li Cheng there, was startled. \"Young Prince, men shouldn’t be here. We are enough to handle this.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Seeing Huiyin in pain on the bed, Li Cheng said, \"I’ll stay here for peace of mind. The young princess has no family here. Only I can give her peace of mind.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Especially in the last month of pregnancy, he had even seen Huiyin having nightmares.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">The midwife couldn’t persuade Li Cheng, and it was Huiyin who told the midwife, \"Don’t worry about the young prince. Just focus on my baby’s position. He is here to protect me.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">The midwife was also helpless with this couple. They were too inseparable.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Huiyin didn’t expect Li Cheng to come in and accompany her. Though she felt a bit grateful in her heart, she could only keep that gratitude in her heart for now.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">…</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">The main room was in chaos. Granny Chao was fiercely cracking melon seeds, and when Yun Hui came in, seeing the floor covered in seed shells, she quickly said, \"Mother, don’t crack these melon seeds into the gift baskets.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">After the Princess Zheng gave birth, although they, as servants, couldn’t offer any expensive gifts, they still needed to show their sincerity.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Granny Chao said unhappily, \"She wouldn't care about our gift, would she? She'll just give it to the people around her. This is just a formality.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">\"But what if they inspect it? We can't let them find any weak points. Mother, you should know that once the young prince is born, her position will be even more secure,\" said Yun Hui.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Granny Chao sneered, \"New king, new rules. Of course, I know that. By the way, you said those silks were sent by Lady Xie, a full eight pieces of figured satin. Her gesture is quite grand.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Yun Hui smiled, \"She’s afraid that I might also be sent away by Zheng, so she sent me gifts. As you know, she’s always been kind-hearted.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">\"That's true. Back then, Princess Zheng liked her too, but her status was too low at the time. A recorder's daughter—if not for our Princess taking pity on her, how could they have come to study at the mansion?\" Granny Chao remarked.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">The servants in this large household all carried a sense of superiority, treating the titles and glory of their masters as if they were their own. Even though she was just a servant, Granny Chao still criticized others' family backgrounds.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Yun Hui added, \"But she’s also trying to get on our good side, probably to gather more information in the future. After all, Lord Xie is at the frontlines now.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">\"I don't understand these war matters, but that Ma Kui in Qingzhou often plunders here and there; he had it coming,\" Granny Chao opined, thinking she knew better.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Yun Hui stopped her mother from continuing, thinking that if Zheng gave birth to a daughter, Grand Dowager Wu would definitely send a woman over. It wasn't out of concern for the offspring, but because she saw an opportunity.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">This was the perfect chance. She could even use it to her advantage with Wei Imperial Consort and the Prince of Wei.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">The sun had set.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Li Cheng had been sitting in the birthing chamber for half an hour. He watched as Huiyin was helped up. The once radiant wife was now unrecognizable. Her hair ornaments had been removed, and her formerly finest silk sleeping gown was now wrinkled. She was drenched in sweat.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Behind his wife stood a maid named Fugui, supporting her.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Li Cheng, however, said, \"I've seen others give birth lying down. Why does the princess have to stand? Is this right?\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">The midwife, busy as she was, took a moment to reply, \"My lord, giving birth in an upright position makes it easier for the child to be born and reduces the risk of infection. The princess's pregnancy has been good; her water hasn't broken yet, and the baby's position is correct, suitable for this kind of delivery. If the baby's position were wrong or the delivery too fast, there could be severe bleeding.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Li Cheng found it painful just listening; this childbirth was truly a trial.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">\"Huiyin, I'm here, don't worry—just focus on giving birth.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">\"Just shut up,\" Huiyin shot back.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Huiyin clung to the ropes, knowing why the midwife insisted on her giving birth standing up. This method could speed up the delivery, but it also increased the risk of severe bleeding if the midwife was too rough or the delivery too fast.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Childbirth was a matter of life and death.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">She had heard stories of women giving birth in the fields and getting right back to work. Those who spoke of it so lightly clearly didn't see women as human beings.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">\"Ginseng slice, bring a ginseng slice for the princess to suck on,\" the midwife called out.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Li Cheng saw Nanny Nan appear out of nowhere with the ginseng slice. Huiyin took it in her mouth, holding the ropes tightly at both ends. Fugui seemed to be losing strength, so Li Cheng quickly went to help support her.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">The people around were silent...</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">The midwife wiped the sweat from her forehead, relieved that men, with their greater strength, were there. Still, there were no male midwives, so she boldly directed Li Cheng, \"Please keep the princess steady, my lord. If she slips, all our efforts could be wasted.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">\"Alright, alright,\" Li Cheng quickly stood behind Huiyin.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Huiyin suddenly felt stable, as if a mountain was behind her. She could lean back slightly without any issue.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">\"Ah...\" Huiyin tried to sink her weight downward, but her legs had gone numb, and she was losing focus. The ginseng slice she had been sucking on was spat out.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Li Cheng thought battle wasn't this slow or painful; he empathized deeply. His wife was so strong. When she had cut her hand on a book page, she stopped the bleeding and applied medicine without blinking an eye, even though she was in so much pain she could barely hold herself up. He couldn’t bear to see her suffer like this.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">The experienced midwife said to Li Cheng, \"Young Prince, please give her more encouragement.\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Give her more encouragement? The words he usually spoke were hard to say at the moment, so he could only say, \"Huiyin, your eighteenth birthday is right around the corner. Just give it one more push, and then it will be the three of us celebrating your birthday.\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Huiyin didn’t really consider this place her home, but upon hearing Li Cheng's words, she began to long for it. Her legs felt wet, and the midwife immediately said, \"Her water has broken, quickly bring the ginseng soup.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">This was a soup prepared by stewing an old ginseng root for three hours. Huiyin drank it all in one go.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Following the midwife's instructions on breathing and how to push, she did everything as directed.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Fortunately, Li Cheng was by her side the whole time. With one final push, it felt like something slipped out. The midwife quickly cut the umbilical cord and patted the baby, who let out a cry that shook the heavens.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Huiyin leaned on Li Cheng, who carried her to the bed. In her previous life in the Eastern Palace, there had been immense pressure to give birth to a son. She had even prepared a backup plan: if she couldn’t deliver, a male baby would be brought in to secure the Zheng family’s status.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Now, married to Li Cheng, there was no such immediate pressure, so it didn’t matter what she gave birth to, because Li Cheng was with her through the childbirth.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">\"Congratulations, Young Prince, the princess has given birth to a son,\" the midwife said.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Li Cheng glanced at Huiyin on the bed. Seeing her sweat and tears congealed together, her hair in strands, he thought she was incredibly beautiful, truly a mother now. He whispered in her ear, \"Did you hear that? We have a son.\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">\"Yes,\" Huiyin felt relieved.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">……</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">The entire mansion sprang into action. The Huaiyin Mansion had a new heir, born to the legitimate wife, which held special significance. Li Cheng gave double rewards to everyone in the mansion. Granny Chao also came over specially to congratulate them.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">\"Congratulations, Young Prince, on the joyous occasion of having a son,\" Granny Chao said.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Li Cheng quickly helped Granny Chao up. \"Yes, the princess has really gone through a lot. A woman giving birth is truly the most painful thing in the world.\" He spoke from the heart, having experienced it firsthand.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Granny Chao thought that all women giving birth went through the same ordeal, but she didn’t dare say that. She just smiled awkwardly and said, \"Yes, I remember when Princess Wu gave birth to you, there was severe bleeding. It was not easy. And you cried so much. It was me who held you day after day until things settled.\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">\"Yes, you've worked hard, Granny,\" Li Cheng truly felt grateful to his wet nurse Granny Chao. Otherwise, he wouldn’t have kept Yun Hui, a woman who was supposed to marry into another family, as the housekeeper. He even let Granny Chao manage the household affairs before. Even after Princess Zheng married into the family, he reviewed the gift lists for the four seasons and major festivals, giving very generous gifts.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Granny Chao wanted to talk more, but seeing Nanny Nan coming over, she stopped. Nanny Nan had never liked Granny Chao. Ever since her young lady married into the family, the servants were never scolded or beaten, and there was no leftover food forced upon them like Granny Chao used to do.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">\"Young Prince, the doctor has arrived. The princess asked me to request your presence,\" Nanny Nan said.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Li Cheng nodded. \"Alright, I'll go there now.\"</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Seeing Li Cheng leave in a hurry, Granny Chao pouted and muttered as she left.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Now, in the inner courtyard, she had no status at all. Without the Young Prince's word, she couldn’t even enter the main room.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">The maids guarding the courtyard gate saw Granny Chao leave, and one said to the other, \"That old hag is finally gone. When I was under her, I suffered a lot. During the festivals, I ate an extra piece of fried cake, and she had me stripped and beaten with twenty strokes. Thankfully, I survived. If she were still in charge, we would have been tortured to death.\"</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">\"You can’t say that. Aunt Yun Hui is really quite kind. Ever since the young princess married into the family, has she ever beaten or scolded the servants? Last time, when my father was critically ill, the young princess happened to see it during her walk and had a doctor called for him. No one could be kinder than her. Even Fugui and Dongshun sisters in the courtyard always speak kindly. Who in the household doesn’t respect the young princess? Only Granny Chao seems unwilling to accept it.\"</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">The two maids, although they only guarded the courtyard gate and earned five hundred coins a month, found peace in the quiet and the kindness of their master. Aunt Yun Hui was indeed fair, often helping and assisting others.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">The two maids thought that perhaps it was because the young princess was kind and charitable that she gave birth to a boy on her first try.</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">Meanwhile, Li Cheng led the doctor inside. The doctor felt the pulse through the curtain and said, \"The new mother is a bit weak from the birth. After three days, start taking Shenghua Decoction, a traditional postpartum herbal remedy, but don’t use wine to prepare it as the medicinal properties are too strong. Take one dose a day for five days. Also, focus on regulating the spleen and stomach. Only when they are properly regulated can other tonics be absorbed. Codonopsis, astragalus, poria, or dried Job’s tears can be used with pig stomach or ribs to make a clear soup. After two weeks postpartum, use the restorative soup, which can strengthen bones and waist.\"</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">Li Cheng, with his good memory, noted everything down and had the steward give the doctor his fee.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">After seeing the doctor out, he had the curtain lifted and went to hold Huiyin's hand. \"The doctor said you’re mostly fine. You must rest well during your confinement. Tell me what you need, and I’ll make sure you get it.\"</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">Because she had just given birth, Huiyin was sweating all over. As Li Cheng spoke, he took out a handkerchief to wipe her sweat.</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">For some reason, Huiyin, perhaps because Li Cheng had been with her throughout the childbirth, looked at him with tears in her eyes, as if she were seeing him for the first time. \"I think... I might be starting to care for you.\"</p><p id=\"paragraph-121\" data-paragraph-id=\"121\"></p>\n</div>"
  },
  {
    "number": 30,
    "title": "Chapter 30",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 30</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Sitting the month can be quite draining, but Huiyin knows how to prioritize. While she loves her child deeply, she doesn’t hold the baby all the time like most women do. She understands that only by taking care of her own body can she better protect her child.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">The baby currently stays in the annex room next to the main bedroom. When the baby is quiet and not fussy, he is brought into the birthing room to sleep in a cradle.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Huiyin’s quarters are very quiet. When she is not sleeping, she is lost in thought, and she doesn’t like to see outsiders, as meeting people is the most tiring for her.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Of course, Yin Liyi was also kept outside. Nanny Nan smiled and said, \"I understand your good intentions in coming to visit, but it's enough that your thoughtfulness was shown. Our Princess went through a lot to give birth to the young heir. She cannot be exposed to any wind.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">In fact, Nanny Nan knew that guests might not genuinely wish to visit the postpartum woman; it was usually just a formality.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">However, Yin Liyi was unusually enthusiastic. She asked again, \"Nanny Nan, is the princess wrapped with postpartum bandages?\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">\"Yes, our Princess is recovering well, so the doctors and female physicians said it’s fine to bind her.\" Nanny Nan said this as if it were obvious.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Yin Liyi, of course, had no real intention of visiting the postpartum woman. Older folks believe it’s bad luck to visit a woman sitting the month because the period is considered sensitive, and if someone bumped into her, they would be unlucky. But she wasn’t superstitious about these things; her main concern was avoiding catching a chill during the postpartum period.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Therefore, Yin Liyi just smiled and said, \"I had someone weave a silk quilt. It’s just right for the young heir to use. Don’t be fooled by how light it is, like a cicada’s wing; it’s very warm.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"Oh, then this old servant must thank you on behalf of the princess.\" Nanny Nan had never really liked Yin Liyi. It wasn’t for any particular reason, but she felt that Yin Liyi lacked boundaries, calling the \"young prince\" \"Cheng Brother\" in front of the Princess.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Of course, Lady Xie wasn’t a bad person. She seemed quite enthusiastic, but still, no matter how good she was, it had nothing to do with their family.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Yin Liyi didn’t think she had any issues herself. She believed she had already been very careful to avoid suspicion. In the past, she, her elder sister, and Xue Huanhuan were friends with the young prince. Although their statuses were different, they treated each other as friends. Later, when she learned that Li Cheng was married, she only met with Princess Zheng whenever she visited, even though her relationship with Princess Zheng was quite average.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">After inviting Yin Liyi inside, Nanny Nan called Yun Hui to keep her company. She wasn’t familiar with Yin Liyi and didn’t want to interact too much with her.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">In fact, Yun Hui didn’t want to reveal her relationship with Yin Liyi. But once, when Princess Zheng was chatting with Yin Liyi about her, she mentioned their relationship. It seemed that Yin Liyi’s intention was to make Huiyin afraid to touch her because of Yun Hui’s connection. But for Yun Hui, she didn’t like that.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">However, she was very clear that Yin Liyi didn’t have any malicious intent. Yun Hui quickly came to serve tea and snacks. To avoid being overheard, they went to a side room next to a small pavilion to talk.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">\"Yun Hui, you are often by the prince’s side. Do you know how things are at the frontlines?\" Yin Liyi was most concerned about her husband’s situation.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Yun Hui shook her head. \"Those matters, the young prince would only discuss with the Princess. As servants, we wouldn’t know anything. We can’t inquire about external matters, but if there’s even a word, I won’t tell others; I will definitely tell you.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Yin Liyi put her palms together and said, \"Thank you so much. By the way, I prepared a basket of honey oranges, a basket of pomegranates, and half a basket of lychees. The lychees are rare, so you must try them.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Lychees weren’t really rare. When Yun Hui was managing Li Cheng’s quarters, since Li Cheng didn’t like sweets, she either ate them herself or distributed them.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Now, as the chief servant, she didn’t have such good treatment. Seeing Yin Liyi give them to her, she was very happy.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Due to the ongoing war at the frontlines, Huiyin proactively requested that the third-day and full-month ceremonies be simplified, or even not held. They could have a grand celebration when the child turned one year old.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Li Cheng didn’t understand. \"Even though there’s a war front, our son was born. Isn’t that a huge celebration? Why can’t we have a grand celebration?\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Huiyin smiled. \"I was fortunate to give birth safely and to have delivered the heir. That is already a great blessing. As for those formalities, why should we care about them? It’s the substance that matters. Besides, children are not easy to raise. We can’t let others have their eyes on him.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"Alright, but do we really need to do this?\" Li Cheng still wanted to have a grand celebration. He had even thought about where to arrange the banquet.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Huiyin nodded. \"Just listen to me. We can have a grand celebration for the first birthday. Don’t we, as parents, love our child? The more we love him, the more we hope he will be safe and sound. You don’t know, when my sister-in-law was in confinement, people came to visit her every day, so she couldn’t get proper rest. Look at me; I don’t move unless necessary, and the female physicians said I’m recovering quickly.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Li Cheng nodded. \"Alright, I’ll listen to you.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Huiyin held his hand. \"How have things been at the frontlines these past few days? Has there been any need for you to go support?\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"It’s only been a short while. The armies need to arrive first, then they’ll set up their forces. The Crown Prince passed through Jizhou, bringing He family soldiers. I heard that the Crown Prince brought the Crown Princess to the frontlines, and the Lü family also sent the left wing to support.\" Li Cheng had originally thought that Lü Wei wouldn’t get involved.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Huiyin thought to herself that in the previous life, it was the Zheng family who helped, allowing Li Heng to advance with great momentum. Now, since Li Heng couldn't persuade the Zheng family, he was trying to make a deal with the devil, deliberately favoring the Crown Princess to get the Lü family to send troops.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Lü Wei was cunning and ruthless. It was probably because Lü Xiao was pregnant that he was willing to make a move. Only if Lü Xiao had a son could they truly control the emperor and command the vassals.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">These were all speculations. The key issue was whether Li Cheng would choose to confront the situation head-on.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Thus, Huiyin asked, \"Can Lord Xie succeed? If not, wouldn't it mean our Xuzhou has to send troops? Little Prince, I'm not trying to stir up trouble, but I see you training the navy day and night and often patrolling the city. If Lord Xie can't hold out, you might find yourself facing the Crown Prince and the Lü family. Perhaps even my family might turn against you.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"As the saying goes, 'He who does not plan for the future will find trouble at his door.' You're so smart; why would you need my reminder? But as a couple, we're in this together. Who could be closer to us? So, don't think I'm nagging.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Hearing this, Li Cheng felt only warmth and certainly wouldn't think she was nagging. He said, \"Some of those advisors are close to me, but there are few capable ones. Some people are simply not worth discussing matters with. It's you, Huiyin, with your intelligence and quick wit, who complements my shortcomings. I'm delighted about that.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Huiyin made her point and stopped: \"If that's the case, why did it take you half a month to come see me after I said I liked you a little? Just because I like you, does that mean you can ignore me?\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Li Cheng thought she would talk about something else and had even sat up straighter, but when he heard Huiyin's words, he immediately looked away.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"No, I didn't.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"You did, you just did that...\" Huiyin was very dissatisfied.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Li Cheng smiled: \"Sometimes I'm just teasing you.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Seeing that he didn't say much, Huiyin didn't ask further, yawned, and felt like sleeping again. She had never slept so much in her life.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Coming out of the main room, Li Cheng went outside for some fresh air and suddenly felt a bit relieved that there was no need for a celebration. He stood with his hands behind his back and saw Yin Liyi gracefully approaching.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Cheng Brother.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"Lady Xie.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Yin Liyi was just about to leave when she saw Li Cheng. She immediately came over and said, \"I came specially to deliver a silk quilt for the young prince. I won't disturb the young princess for long.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Since Li Cheng witnessed Huiyin giving birth in the delivery room, he had looked through many medical books and couldn't help but say, \"Yes, she's currently weak, and if you go in to pay respects, she'll have to get up, which is quite troublesome.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Yin Liyi was surprised to hear Li Cheng talking about such domestic matters.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"Little Prince, if Qingzhou can't hold out, Xuzhou will definitely have to help, right?\" This was her biggest concern.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">How could she not worry when her husband was on the front lines?</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Li Cheng said, \"We have to follow Prince of Wei's orders. But don't worry, if Xuzhou is asked to support, I will go all out to help.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"That's wonderful.\" Yin Liyi finally felt relieved. She was afraid that Li Cheng wouldn't give his full effort. She wasn't someone who maliciously speculated about others, but who would want to suffer losses to save someone else? When the time came, it would depend on whether the Prince of Wei's orders were truly followed.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Yin Liyi then mentioned that she would come to give a grand gift when the child turned a full month.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Unexpectedly, Li Cheng waved his hand: \"The princess said that since the front lines are still at war, there's no need for a celebration. You should just stay home and wait. If anything happens, your husband will surely write to you.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Thinking of her husband, Yin Liyi felt a sweetness in her heart and left.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Actually, Yun Hui was not far away. Although she had a decent relationship with Yin Liyi, hearing Yin Liyi ask Li Cheng to send troops made her think Yin Liyi was quite inconsiderate. Who does she think she is, asking others to risk their lives for her?</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">She was anxious and decided not to associate with Yin Liyi anymore.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Suddenly, she went back and told Granny Chao, \"In the future, don't accept things sent by the Xie family. She's the wife of the governor and the general. We're just servants. She might want things from us that we can't even give. In the future, she might even use this to threaten us.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">In reality, she knew Yin Liyi wasn't that kind of person. At most, she just wanted to inquire about her husband, mainly to know if he was injured. Yin Liyi was usually quite careless and didn't have much else on her mind. But she was jealous that Yin Liyi casually asked, and Li Cheng agreed without hesitation.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Granny Chao always listened to her daughter on important matters. Seeing Yun Hui like this, she also said, \"Alright, I understand. I'm just worried that the young princess might find something to use against us.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Yun Hui nodded.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Although the full moon celebration was not held in the mansion, the aristocratic families from Xuzhou had still sent many gifts. Huiyin was reviewing the gift list, and from the types of gifts, one could gauge the closeness of each family’s relationship with the Huaiyin Mansion.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Two young maids were combing her hair, as they couldn’t wash it, and her scalp was itchy. They had to relieve the itch by combing.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Among them, the Miao clan, though on good terms with her, had limited talent. The Xue family, after dividing the inheritance, no longer had the same vigor as before.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Life can change so unpredictably in just a year.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">It seemed that her future return gifts would also need to be reduced accordingly.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">The wet nurse entered from outside, carrying the baby. Huiyin saw that the baby had shed its red skin, revealing smooth and fair skin, with chubby cheeks.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">The wet nurses flattered, “The heir is very strong when he nurses. He will surely be powerful and vigorous in the future. We all say he has the demeanor of the prince.”</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">“All I want is for him to be safe,” Huiyin said softly, her voice carrying no grand expectations. As they say, every child has their own destiny.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">As they were talking and laughing, they heard that both Grand Dowager Wu and Wei Imperial Consort from Jianye had sent gifts for the three-day purification ritual. Grand Dowager Wu also sent a message saying that she missed her heir and asked Huiyin to bring the child to Jianye after one hundred days.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">To Jianye?</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Huiyin thought, what had to come finally did. Grand Dowager Wu had held back for so long, and this time, she even persuaded Wei Imperial Consort to make Huiyin return with the child.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Nanny Nan couldn’t help but say, “The child is only three months old. How can he endure such a grueling journey?”</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">“I know, but the weight of filial piety presses down on us. We have to go,” Huiyin sighed.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">If she didn’t go now, and if Xie Jiuyi from Qingzhou won, it would be fine. But if he lost, and Xuzhou had to join the war, it wouldn’t be safe here anymore. They would still have to go eventually, and it would be more passive then.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Everyone fell silent, their moods heavy as they considered Huiyin’s words.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">After finally settling everything in Xuzhou, now they had to go to Jianye. As they say, one mountain cannot have two tigers, and besides, Grand Dowager Wu was certainly not someone easy to deal with.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">However, Huiyin thought that even if she went to Jianye, she would still have to return to Xuzhou eventually. In the future, Li Cheng would come to fetch her back.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">If she didn’t go now, it would give people something to gossip about. Moreover, in the future, Li Cheng might not necessarily stand by her side.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">This news was shared with Li Cheng three days later when he came to visit. Huiyin said, “It will be hard on the child to go back to Jianye after one hundred days. But his great-grandmother wants to see her heir. How can I not go? Besides, since I married you, I haven’t returned to pay my respects to my grandmother. I’ve neglected my filial duties.”</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">“This… no, the child is too young. Absolutely not,” Li Cheng said, looking at the tiny bundle in the cradle, unable to let go of his worries.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Huiyin pursed her lips, “I feel the same. The child is too young. Even adults get seasick on a boat, let alone a small child.”</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Since losing his parents, Li Cheng had grown closer to his grandmother. But with Xun Rou and now the child, he looked at Huiyin and said, “You’ve suffered.”</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Huiyin shook her head, “What suffering? It’s nothing. I’m still by your side, aren’t I? But as her grandson, some things might not look good if they reach Prince of Wei’s ears.”</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Li Cheng pulled Huiyin into his arms, “I understand.”</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">“But what if I miss you so much in Jianye that I can’t stop crying?” Huiyin sniffled.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Li Cheng couldn’t bear to part with his wife, “Then don’t go.”</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Huiyin let out a soft laugh, though her eyes remained misty.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Li Cheng caressed her face, “Don’t worry, I’ll come to fetch you as soon as possible, and then we’ll be reunited as a couple.”</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">“Mm,” Huiyin sighed in relief, seeing his furrowed brows, she gently pressed her hand to smooth them out, “We haven’t even left yet.”</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Just as their relationship was growing closer, the couple had to part, and Li Cheng felt a pang of sadness.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">After finishing her confinement, Huiyin's health was not what it used to be. She wouldn’t force herself to drink tonics but tried to worry less about the things that used to trouble her.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Their son had been named Jing, a single character meaning \"the brilliance of jade.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Manager Qiao brought the ledgers over. There were internal and external accounts for the household; the external accounts were managed by several stewards from the former Wu Mansion, while the internal accounts were mostly controlled by Huiyin's four main maids.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">While she didn’t need to review every ledger herself, she made sure to have a general understanding of them.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Huiyin wasn’t one to nitpick over every detail or hold grudges, but if something was written in an overly obvious or blatant way, or if it treated her like a fool, she would definitely address it.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Reviewing these accounts required effort. Huiyin spent two hours every morning handling household affairs, visited her son around noon, reviewed the ledgers in the afternoon, and went to bed as soon as it got dark.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Over the past few days, with Li Cheng away, she was able to get some much-needed rest.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">The mansion, however, was far from peaceful. Granny Chao was so excited about Huiyin’s trip to Jianye that she nearly leaped out of bed. She thought that once Princess Zheng left, she would have control over the mansion.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Strangely, they hadn’t seen Yin Liyi since Huiyin’s confinement ended.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">After this busy period, half a month had already passed. When Li Cheng returned from outside, he mentioned that the fight in Qingzhou was intense. Xie Jiuyi, of course, was no ordinary person. Otherwise, he wouldn’t be so trusted by the Prince of Wei, who even gave his sister-in-law to him in marriage as a way to win him over.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Both the He and Lü families were helping Li Heng, but Xie Jiuyi, leading his own troops and the army given by the Prince of Wei, actually had more men.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">In fact, Huiyin found it somewhat amusing. Whenever men used women, it was considered a strategy. But if a woman used a man, it was as if she was relying on someone else to rise in status.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">\"My prince, let's have our meal first,\" Huiyin said, pulling him to sit down.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Li Cheng smiled. \"Look at me, I was so focused on talking about things outside that I forgot to ask how our little Jing is doing?\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Huiyin served him a bowl of soup. \"He's doing very well. He's the most obedient child I've ever seen, not crying or causing much trouble. I have to manage the household, so I can only visit him for a limited time each day. As parents, we really feel sorry for him. In another two weeks, we’ll have to take him to Jianye, and I’m really worried...\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">\"If it were before, I could have delayed it for you, but now the battlefield in Qingzhou might spread to Xuzhou. I think it will be safer for you to go to Jianye. As for the dowry you brought, there's no need to bring the bulkier items. Just leave them in the warehouse. But you should pack your cherished items. I'll prepare a few boats to send you there. Once it's safe, I'll come to fetch you,\" Li Cheng smiled.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Huiyin took a bite of the tender chicken strips and looked at Li Cheng. \"You need to be careful yourself. As the saying goes, as long as the green hills are there, firewood will always be available. Don't be so headstrong at a young age. Always remember, you have a wife and child. If things really don't work out here, we can go to Jizhou and stay with my family.\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Li Cheng laughed and shook his head. How could he possibly end up in such a dire situation?</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">\"Just take care of yourself. I’ll make sure to protect both of you,\" he said.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Since they had decided to go to Jianye, arrangements had to be made in advance for the personnel who would be taken and those who would stay. Huiyin said, \"Your wet nurse, Granny Chao, is willing to stay. I want Yun Hui to stay as well, so we can't separate the mother and child. The rest, like Manager Qiao, are experienced hands...\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Li Cheng didn’t have much of an opinion on this. To him, these matters were naturally managed by his wife, so he simply waved his chopsticks. \"You decide.\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">After the meal, the couple went to visit their son and then went to the riding grounds for a horse ride together.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">There was an open space in Huaiyin Mansion. Huiyin, supported by Li Cheng, mounted the horse. She smiled slightly. \"Back in Jizhou, I used to go horseback riding whenever I was feeling down, and it always cheered me up.\"</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">Li Cheng, curious, asked, \"What made you unhappy?\"</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">\"Actually, it's rare for me to be in a bad mood, but there's one thing that made me very angry. My cousin was a well-behaved and dutiful person who never did anything out of line and was very good to us. Unfortunately, because of this, she was targeted by a wealthy family. The man from that family was also quite handsome. He had a liking for a widow, but his family didn't agree. So, the adulterous couple came up with a bad idea. The man would first marry another woman, then divorce her to become a widower, making it seem natural for him to marry the widow. My cousin could only grieve in silence and later married out of state. What angered me the most was that the adulterous couple is still living happily together. If anyone were to ruin my life, I would make sure they beg for death,\" Huiyin narrowed her eyes.</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">In truth, she didn’t have such a cousin or this incident. She had only heard of such things happening to others, where the wronged woman ended up depressed and misunderstood for life.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">If she were wronged and her enemies were still living happily, even as a ghost, she would not let them go.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">Li Cheng had been listening attentively, but when he heard the last part, his heart skipped a beat, startled.</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">Seeing his reaction, Huiyin wasn’t sure if it was her contrasting demeanor that scared him or if he had a 'white moonlight' of his own. If it was the former, it was fine. But if it was the latter and he didn’t cut ties, she wouldn’t hold back in the future.</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">There is a veiled warning in these words.</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">Unexpectedly, Li Cheng was even more furious than Huiyin. \"Can you believe there are men who act like this? They make all men look bad. If I like someone, even if she’s from a humble background or is a widow, I’d do everything I can to marry her. Even if I can’t marry her, I’d never hurt another woman. People like that are no better than animals.\"</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">\"Oh, so who’s the lucky lady?\" Huiyin asked, holding the reins of her horse, looking down at the man who was about to help her dismount.</p><p id=\"paragraph-123\" data-paragraph-id=\"123\">In truth, Huiyin wasn’t one to make a scene, but she had a razor-sharp wit. Her words always hit the mark, leaving no room for escape.</p><p id=\"paragraph-124\" data-paragraph-id=\"124\">Li Cheng sighed, looking at her. \"My dear, just keeping up with you is enough to wear me out. How could I have room for anyone else in my heart? Sure, you only like me a little, but I’m completely head over heels for you.\"</p><p id=\"paragraph-125\" data-paragraph-id=\"125\">Huiyin smiled brightly and wrapped her arms around his neck as he lifted her down from the horse. \"Glad you understand. And don’t forget to keep loving me like this, okay?\"</p><p id=\"paragraph-126\" data-paragraph-id=\"126\">Originally, Li Cheng had been most worried that Huiyin would be bullied by Grand Dowager Wu. Now, it seemed that Grand Dowager Wu might not even be a match for her. She handled him with ease, like it was second nature to her.</p><p id=\"paragraph-127\" data-paragraph-id=\"127\"></p>\n</div>"
  }
]