[
  {
    "number": 11,
    "title": "Chapter 11",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 11</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Cooking◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After dinner, Huiyin stood up and joined Li Cheng in the inner chamber. She glanced at him and asked, \"What do you usually do for fun when you're not busy? You can't just sit around all day, right?\"</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">She seemed like a refreshingly straightforward person.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Li Cheng smiled and replied, \"When I have free time, I play the qin or read. Lately, I've been diving into the *Lunheng*.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"You mean *Lunheng* by Wang Chong?\" Huiyin asked.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Li Cheng nodded. \"Yes, have you read it as well?\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Huiyin shook her head. \"I prefer reading folk tales, but I'm terrified of ghosts, so it's a bit of a contradiction. Deep philosophical books just give me a headache.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">\"Folk tales? Like the *zhiguai* ghost stories?\" Li Cheng asked casually.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Huiyin was pleasantly surprised that he knew about them and nodded eagerly. \"Exactly! And sometimes I enjoy reading short stories. Mostly, though, I spend my time doing embroidery at home.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin was only a few years younger than him, making them almost the same age. She spoke in a way that made people feel at ease, and her actions were always thoughtful. \"I have a gift for you too, but it's not convenient to bring it out right now,\" she added.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"Oh, I have a gift for you too. I wonder what it could be?\" Li Cheng wondered if it might be something like jewelry.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin blushed slightly. \"Actually, I'm just passing along a gift. My father knew I was marrying far from home, so he gave me a Dawan horse. But I'm not much of a rider or archer. You, on the other hand, are a true warrior—brave, skilled, and well-versed in both literature and martial arts. As they say, a fine horse deserves a hero. Would you be interested?\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"A Dawan horse? I have to see it!\" Li Cheng jumped up, eager to check it out.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Huiyin chuckled. \"You're such an impatient one. It's too dark outside now, and you won't be able to see anything.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Actually, the horse was part of her dowry, intended for Li Cheng. If she had given it to him directly, it would have felt like a formal offering. By giving it to him in her own name, she hoped he would value it even more.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Li Cheng sat back down, smiling with bright, twinkling eyes.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Meanwhile, Huiyin returned to her book and soon pulled out her needlework. She was crafting a lotus-pink sachet, her hands moving deftly as she sewed with practiced skill.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">As night fell, she got up to prepare for her bath and rest. Li Cheng appreciated how she struck the perfect balance—not too lively or noisy, yet not too quiet or boring either.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">However, he added, \"In a few days, I'll have to head to the main camp for training, which means I'll be leaving you here alone. If you'd like, I can send you back to Jianye. That way, you can keep my grandmother company, and Jianye is much more lively. This place can get pretty quiet and boring.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Soldiers on campaign can't bring their families along. Even though this is my residence, I'm usually busy with training. If not for the marriage, I'd probably still be focused on organizing the army.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Huiyin realized that consummating the marriage had been the right decision. With him often away, having children would be like trying to cook without ingredients. Besides, Li Cheng, like Li Heng, didn't live long in his previous life.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">But returning to Jianye wasn't an option. Not only was Jianye unfamiliar, but as Li Cheng's wife, she was in charge of the household when he was away. If she went back, she'd have to deal with his great-grandmother, which would complicate things.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">So, Huiyin shook her head. \"No, I do want to serve grandmother, but...\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"Why not?\" Li Cheng asked, puzzled.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Huiyin looked a bit hesitant. \"I only know you. We're husband and wife, so it feels right. But I'm scared of meeting other people. Since I arrived, you're the only one I've spoken to in formal language.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Li Cheng hadn't considered that. He was a bit troubled. \"But if you stay here, I'm hardly ever home.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"Even if you're not home often, you're still here sometimes. Otherwise, when you go back to Jianye, I'll go with you. I wouldn't dare to stay alone.\" Huiyin tugged at his sleeve, still a little nervous.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Li Cheng realized that she was only seventeen, having traveled from Jizhou to marry him. She must feel lonely here, with only him to speak to in formal language and probably no one else to talk to. He felt a pang of sympathy.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"Alright.\" He gently placed his hands on her shoulders, nodding in agreement.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Huiyin smiled and said, \"Then let's get some rest early.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">That night, the two of them went straight to bed without asking for water. Hearing the quiet, Granny Chao clasped her hands and murmured, \"Amituofo, Amituofo.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Yun Hui adjusted the wick, brightening the room. \"Mom, now that you're feeling better, why don't you get some rest? Don't worry so much,\" she said gently.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Noticing her daughter was still diligently working on a shoe sole even in her nightgown, Granny Chao asked, \"Why are you still making shoes this late? Is it for the Little Prince?\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"The Little Prince’s feet tend to sweat, and he prefers not to wear shoes from outside. The seamstresses can’t keep up, so I have to make them myself. As a widow, I’m grateful for the Little Prince’s kindness in taking me in and giving me this position. It’s the least I can do to repay him,\" Yun Hui smiled.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Granny Chao felt heartache for her daughter. \"If only Miss Xun weren’t so difficult and showed a little more generosity, you would have been the Little Prince’s woman long ago, instead of being forced to marry someone else.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Yun Hui paused her needlework. \"Mom, why bring that up? Now that the Princess is here, if anyone hears about this, how could I possibly face people?\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"Alright, I won’t say anything more,\" Granny Chao quickly closed her mouth.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">The next morning, Huiyin, dressed in slightly worn but presentable clothes, headed to the kitchen. The kitchen staff were taken aback, worried that she really intended to cook.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Huiyin smiled and said, \"Don’t worry. The Little Prince asked me to cook for him personally, and I want to show him how much I care.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">She was preparing hand-pulled noodles, the kind that gets thinner as you stretch it. First, she kneaded the dough and let it rest. Since she wasn’t making braised ribs, she had someone chop the ribs and stir-fried them in a wok with a bit of miso, along with ginger, garlic, and green onions. Then, she mixed honey, chili sauce, soy sauce, sugar, and white sesame seeds with half a bowl of water to create the sauce.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">As the ribs simmered, she skillfully began pulling the rested dough, turning it into long, thin noodles as if by magic. The kitchen staff watched in amazement, as they had never seen anyone pull noodles before.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Once the ribs were nearly done, she added rice cakes and fetched the beef bone broth that had been simmering in the kitchen. She cooked the noodles in the broth, then added a soft-boiled egg, some vegetables, and silver fish balls.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">The dish came together quickly and looked absolutely delicious.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">But Nanny Nan was concerned. \"My lady, I’m not sure if the Little Prince will like it.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"Don’t worry, with this seasoning, even shoe soles would taste good, let alone with all these delicious ingredients. The Little Prince and I are both young; if he doesn’t like it, I’ll eat it all myself,\" Huiyin said, wrinkling her nose playfully.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Nanny Nan laughed. \"That’s just how Second Miss is—she wouldn’t take it personally if you didn’t like something she made; she’d just think you didn’t appreciate good food. If it were Elder Miss, she’d probably be anxious and worried all the time.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\"></p>\n</div>"
  },
  {
    "number": 12,
    "title": "Chapter 12",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 12</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Conspiracy◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Li Cheng grew up in the south, so the New Year's cakes he was familiar with were either desserts, stir-fried with vegetables, or sliced and fried before being dipped in honey. Sometimes they were boiled in a soup. But this method of cooking the cake with ribs, not braised but stewed, was a first for him.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Even more novel was this type of hand-pulled noodle.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">\"These noodles are from the north. They are whiter and more elastic than the ones down south. I didn't cut them; I pulled them by hand, snapping them on the board as I pulled,\" Huiyin said, sitting down and speaking with enthusiasm.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">The noodles were smooth and chewy. Li Cheng finished one bowl and still wanted more. \"I didn't expect you to be so skilled.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Huiyin smiled. \"It's just that you're being very supportive. Since the prince has finished eating, how about we go take a look at the Dawan horse? It'll help with digestion. What do you say?\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Li Cheng readily agreed.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Granny Chao couldn't find a way to intervene, and seeing that Nanny Fan remained unmoved, she forced herself to suppress her eagerness.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">According to the *Records of the Grand Historian*, the Dawan horse, also known as \"the heavenly horse,\" would gradually swell at the shoulder after a gallop and sweat what appeared to be blood, hence its name, \"sweating blood treasure horse.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Men's love for horses is akin to women's love for jewelry. Even Li Cheng, upon seeing the white horse with a jujube-red streak on its head and a precious Khitan saddle, felt an irresistible urge to ride it.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">It was Huiyin who spoke up. \"My prince, your shoulder is injured. If riding the horse causes the wound to reopen, I will take the horse back.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"No, don't, my princess. I'll do as you say,\" Li Cheng replied, unable to let go of the horse but understanding that Huiyin had his best interests at heart. He wouldn't really let her take it back.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Huiyin chuckled to herself. \"My prince, if people heard this, they might laugh at us. Once your shoulder is fully healed, I'd love to see you in your heroic form on horseback. To be honest, although I grew up in the north, I've never been good at riding.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Li Cheng, finding Huiyin plump and charming, couldn't help but say, \"With your delicate nature, it's only natural you're not good at horse riding. If you're free in the future, I'll take you riding.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"Then I'll thank the prince in advance,\" Huiyin said with a smile.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">As they walked side by side, Huiyin couldn't help but discuss some matters with Li Cheng. \"I'm not sure who is in charge of this residence, Granny Chao or Nanny Fan. I brought many people with me as part of my dowry, and some of them don't know the rules of the household. Who should I ask?\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Li Cheng slapped his forehead, realizing he had forgotten. \"Of course, you are in charge of this prince's residence. Nanny Fan is a trusted aide of my grandmother, so you don't need to command her. Next month, she'll return to Jianye. Granny Chao is my wet nurse, but she's getting on in years. Yun Hui manages this residence. She was once my maid and was betrothed but ended up a childless widow. If you have any reservations about her, just assign her to tasks in the back.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"There's no need to talk about reservations. It's not like she chose this fate. She's a woman with a hard life. In the short time I've been here, I've observed her to be a woman of few words but quite capable. I'm someone without talent or skill; how can I manage a household? It's better if the prince decides who is suitable.\" Huiyin wanted to see who Li Cheng trusted in the residence.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Li Cheng found her charming and articulate, her words flawless. It was clear she had more wit and strategy than a girl of her age should. Zheng Fang was known for his bravery but lacked strategy. Unexpectedly, his daughter was quite sharp in speech and action.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Thus, it was fitting for her to manage the household. \"Princess, this prince's household will be managed by you. You are the main wife.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Huiyin thought that Li Cheng was entirely different from Li Heng. In reality, her situation was quite similar to Lü Xiao's. The Prince of Wei wanted Li Cheng to marry her to use her father to eliminate Lü Wei and pacify her father. After all, killing her father was necessary since Hebei was the Prince of Wei's northern passage. This was also why people like Yuwendang didn't consider Qingzhou important.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">However, the approaches of the two men were entirely different. Li Cheng, upon marrying her, treated her as his wife. Although he might not love her, he certainly respected her. On the other hand, Li Heng coldly neglected Lü Xiao, deliberately favoring another, causing the women to fight while he reaped the benefits.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">The critical point was that Li Heng didn't just not love Lü Xiao; he deeply loved her, which was utterly nonsensical.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Li Cheng was polite to her and treated her with respect, but love? Men like him, surrounded by people who flattered him, would naturally rush to be good to him. Given time, love might develop.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"Since my husband trusts me, I'll take on the responsibility without hesitation. However, I'm still young, so if there are any mistakes, please bear with me,\" Huiyin said.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">In the afternoon, they discussed the matter of the household tokens, and by the evening, Li Cheng had sent them over. Managing a household required clearing up previous matters first and then following established practices before making gradual changes.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Nanny Nan happily said, \"The prince was quick to send over the household tokens. That's wonderful.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">\"This is one of the things I appreciate about the prince. When he says something, he acts on it promptly instead of dragging his feet. It's impressive that someone so young can govern a region,\" Huiyin remarked.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">As the saying goes, seeing the big from the small—this was a perfect example.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">The mansion has six stewards, three of whom are women. Yun Hui, however, doesn't hold a high rank among them. These individuals were summoned to Huiyin's quarters the next day. They didn't know the new princess's temperament, but it was clear that the young prince had been spending several days in her company. They had even been seen riding together. Before three days had passed, the household seal was given to the young princess, putting her in charge of the mansion's management. This clearly demonstrated that Princess Zheng was quite capable.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">The servants are like this: if you show them pity, they won't sympathize with you. Instead, they'll see you as someone easy to bully, and even those around you will start to admire you. However, if you're favored, as in her previous life, even if the favor is superficial, many people will still try to curry favor with you.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"Everyone, the young prince has entrusted me with managing the household affairs, as it has always been the custom for men to manage external affairs and women to manage internal affairs. I wasn't here before, so I can't comment on the previous management of the mansion. First, you need to register and create an inventory, then hand over the account books to me for verification. After the verification, we'll use new account books for future transactions. The rules will remain the same as before, so you have nothing to worry about. I will follow the previous practices,\" Huiyin said with a smile.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">The stewards were pleased to hear this. Each of them had some discrepancies in their records and feared that they would be blamed if the new princess found out.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Unexpectedly, she decided not to investigate further and even gave them three days to prepare the accounts. They were, of course, very happy to have retained their positions.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Yun Hui, being straightforward, found this hard to accept and hesitated to speak up.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Huiyin, understanding that Yun Hui was different from her mother, decided to keep her behind after the stewards had left. \"Yun Hui, is there something you'd like to discuss with me?\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Yun Hui nodded. \"I know it may seem presumptuous, but you shouldn't let these people get away with their schemes. What if the accounts show less money, and we can't cover the necessary expenses for festivals and holidays?\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Huiyin was moved. \"Yun Hui, you're truly looking out for me. But I'm new here and can't match their established influence. The young prince has entrusted me with managing the mansion, so I couldn't refuse.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"I understand the difficulties the young princess faces,\" Yun Hui said, but she was also at a loss for a solution.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Huiyin didn't think Li Cheng would run out of money. After all, Xuzhou is his territory, and the internal accounts wouldn't require that much silver. Maintaining an appearance of grandeur is essential. In the past, Huiyin had also thought her mother, Madame Ji, was sometimes too extravagant. But her mother had explained that if people saw any weakness or decline, their hearts would start to waver. If other lords discovered your supplies were low, they might strike first.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Moreover, there could be spies in the Huaiyin Mansion, so people need to be replaced discreetly.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Naturally, she kept these thoughts to herself. However, those around Huiyin were delighted that she was now managing the household. Even Nanny Fan came specifically to pay her respects. She was more tactful than Granny Chao and waited until after the first three days of the wedding to visit.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"I've come on behalf of the Empress Dowager to present you with a gift. This was a gift from the Grand Empress Dowager to our Empress Dowager when she was in the palace,\" Nanny Fan said, opening a box and presenting it to Huiyin.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Huiyin saw a hairpin adorned with the Seven Treasures. The silver tip of the pin held a glass bead, surrounded by five petals made of gold, coral, giant clam shell, red pearl, and agate.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">It was indeed exquisite and precious. Huiyin quickly said, \"Please thank the Empress Dowager on my behalf. Such a precious gift is too much for me. In the future, I will certainly join the young prince in honoring her.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"I will certainly deliver your words. The young prince mentioned that you're staying here to take care of him, which isn't easy,\" Nanny Fan said.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">\"Originally, I wanted to return to my grandmother, but I can't leave the young prince here while I enjoy myself in Jianye,\" Huiyin said, appearing as if she put Li Cheng before anyone else.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Nanny Fan merely nodded and added, \"Baolian Temple is a major temple in Xuzhou with many devotees. You can wear this hairpin during the ceremony.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Huiyin smiled. \"Indeed, the Empress Dowager thinks very thoughtfully. I have never participated in Buddhist ceremonies at home, so I am not familiar with these matters.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">\"The Empress Dowager thought that since you are young, you might not be familiar with these customs, which is why she sent me to deliver this,\" Nanny Fan said.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">After Nanny Fan left, Nanny Nan said, \"I didn't expect the Empress Dowager to be so considerate. Princess, you have truly married the right person.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"It's too early to say that. I heard Nanny Fan rarely goes out.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"Yes, she is very dignified.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Unbeknownst to them, Nanny Fan was writing a letter stating that Princess Zheng wasn't investigating the accounts, and the plan to undermine her had failed.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Huiyin shook her head. \"It's too early to draw any conclusions.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Just like the Eastern Palace in her past life, you never know if these people are friends or foes until the very end.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Late at night, Li Cheng returned from outside. He hadn't been intimate with Huiyin for the past two days. That night, seeing her in a water-green bodice, her arms smooth as milk poured from green porcelain, and her gaze shimmering, Li Cheng felt his blood stir.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Huiyin stepped forward, stood on her tiptoes, and wrapped her arms around the back of his head. She thought, whether he had someone else in his heart or whether he truly liked her, he still needed to be affectionate with her.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p>\n</div>"
  },
  {
    "number": 13,
    "title": "Chapter 13",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 13</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎With the Support of the Little Prince◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"You're incredible! We've done this three times already, and thankfully, I'm in great shape,\" Huiyin said, still trembling slightly as she leaned against Li Cheng's chest.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">She embraced her enjoyment and didn't like putting on an act of innocence or shyness. Why shouldn't a woman be allowed to feel pleasure?</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">During the day, Li Cheng found that he and Huiyin were formal with each other, but at night, in bed, it was like they were navigating a vast, unrestricted sea, free from all reservations. She was beautiful and lovely, generous yet tactful. If she were truly sincere with him, it would be perfect.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"Princess...\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"My personal name is Huiyin. You can call me Huiyin or Huiyin.\" Huiyin didn't want to be so formal with him.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Li Cheng was a bit taken aback and tried calling her, \"Hui'er.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">\"You just have to say it differently, don't you?\" Huiyin bantered.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng had been lively in his youth, but after the successive deaths of his parents, he gradually became more reserved. Hearing Huiyin's playful tone, he couldn't help but laugh. \"Were you always this mischievous at home?\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin nodded with a smile. \"Of course! They always said I was fun and lively. Back when my brother wasn't married, we used to climb trees together. Once, there was a caterpillar on the tree that bit me, making my body ache and itch.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Li Cheng also laughed. \"I was naughty too when I was young, but my mischief was pretending to be sick to skip school, applying ink around my eyes. I thought I was foolproof, but my father had already caught on. My mother, who doted on me, let me sleep in and covered for me.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">It seemed he had been raised with love, as he always smiled when talking about his parents.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"In the blink of an eye, we've grown up and started our own family. In the future, we might have our own children. I never thought my marriage would lead me to you, and that we would be so compatible.\" Huiyin spoke earnestly.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">At Li Cheng's age, most people were already married. He had married Princess Zheng through a political alliance, intending just to go through the motions. But she had surprised him greatly.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Princess Zheng was stunning, with a beauty that could captivate nations, and she was both witty and charming. She was upright, generous, and seemed determined to live a good life with him. She looked up at him and asked, \"If we have children, do you think they'll look more like you or me?\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">\"I've heard that men with feminine features are destined for wealth, and women with masculine features tend to work harder. So, whether we have a boy or a girl, it's best if they look like you,\" Li Cheng said with a smile.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Huiyin hadn't expected him to say that and immediately imagined a beautiful future...</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">The next day, Manager Qiao brought over various account books, with several managers sitting below. Huiyin first flipped through the gift records, which clearly showed where Li Cheng had the closest interactions.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">The most significant gifts Li Cheng sent were to the Prince of Wei. Huiyin looked up and asked, \"Why is the gift for the Dragon Boat Festival twice as large as the one for the Cold Food Festival? Is there a specific reason?\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Manager Qiao had expected Huiyin to start with the storeroom, but she began by reviewing the gift records. He explained, \"May is the birth month of the Prince of Wei's wife.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"I see. It's appropriate to give a more substantial gift to an elder.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Huiyin then examined the local interactions in Xuzhou. There were numerous rewards for Yuwendang. She made a mental note and flipped through the pages, realizing it was impossible to remember everything at once.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">After reviewing the gift records, there were the household accounts, detailing monthly allowances, food, clothing, and small items for the entire household. She saw that eggs were listed at two qian each and remarked, \"Are eggs in Xuzhou so expensive? In Jizhou, an egg costs just three wen.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">The kitchen manager, He Guanshi, stood up and smiled. \"Princess, these eggs are special because they are fed with the finest medicinal herbs, making them more valuable.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"The Little Prince mentioned he'll be training troops and won't be back for a while. Since I'm the only legitimate master here, we can buy regular eggs. I don't need to eat so extravagantly.\" Huiyin smiled.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">But He Guanshi couldn't help but say, \"Everything follows established rules...\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"Even in the palace, the hierarchy among concubines is determined by silk, not eggs. Besides, if I don't mind, why should you?\" Huiyin didn't expose him but knew these nuances. An egg costing two qian, which is 200 wen, was like treating people as fools.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Seeing the new princess speak so sharply, He Guanshi didn't dare to say more and stammered in agreement.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Huiyin then pointed to the salt. \"Xuzhou is renowned for its salt production, with 90% coming from well mines and 10% from sea salt. Yet, your salt costs one tael of silver per dou. The Little Prince told me it should cost just ten wen per dou. Are the salt sellers related to you?\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"There were no shouts or threats of violence, just a direct call for improvements. He Guanshi immediately knelt and swore by the heavens, 'Young Princess, I made a mistake, but I’ll definitely correct it moving forward.'\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Huiyin smiled and said, \"I’m new here, so I’ll need everyone’s help. He Guanshi, you have more experience than I do. Take a look at these accounts and check the market prices, so we don’t get swindled by dishonest merchants.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">He Guanshi visibly relaxed, relieved that the young princess wasn’t going to replace him. Seeing that she had handled the situation calmly, he quickly kowtowed in gratitude, understanding that she didn’t want to create unnecessary drama.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">As Huiyin flipped through the accounts, she didn’t nitpick every detail but highlighted the key areas that needed improvement. Her quick assessments showed that she knew exactly what she was doing.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"Alright, you’ve handed over the account books to me today, and it’s getting late. I’ll keep the books and take over from here. Starting tomorrow, we’ll implement a new accounting system. As for the storeroom, I’ll inspect it personally after lunch.\" Huiyin waved them off.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">At lunch, she changed into fresh clothes and invited Li Cheng over. She explained, \"I didn’t realize you were paying two qian per egg. If it were up to me, three wen eggs would be fine. I think we can cut back on some of these expenses.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">This was a subtle way of pointing out that things had gotten out of hand in his absence.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Li Cheng put down his chopsticks and replied, \"Two qian per egg isn’t cheap. The household is mostly run by my late mother’s attendants or the Empress Dowager’s people. I’ve been away, so I wasn’t aware of this.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Huiyin smiled and said, \"I haven’t noticed any difference after eating these eggs for a few days. Back in Jizhou, eggs cost three wen each, and if you buy in bulk, the sellers even deliver them. Even when I eat egg custard at the palace or the princess’s mansion, I don’t notice any difference. Since you’ll be away, there’s no need for me to eat such expensive eggs.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"What about the price of grain outside the mansion?\" Li Cheng asked.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"Back home, Huiyin often helped her mother, Madame Ji, with the household accounts. She kept a close eye on the prices in Jizhou and remembered them well.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">This wasn’t the time for false modesty. She needed to demonstrate her competence to earn Li Cheng’s trust. While people can like you instantly, a strong working relationship built on mutual interests and shared goals lasts much longer.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Li Cheng wasn’t unaware of these matters. As a general, he had to plan the army’s supplies and rations in advance. He wanted to see if Huiyin truly understood these things. Her confident explanation showed that she wasn’t just a sheltered noblewoman. Moreover, she wasn’t stingy—she hadn’t cut the servants’ monthly allowances.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"You seem like a sheltered noblewoman. How do you know so much about these things?\" Li Cheng probed.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Huiyin smiled and said, \"Even though I’m a noblewoman, I still need to understand household management. My mother often had me help with the accounts, so I learned a lot. I hope I’m not coming across as too showy, Young Prince.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"Not at all. I see that you’re truly capable. You can handle this household without needing to consult me on every little thing.\" Li Cheng nodded approvingly.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">This was exactly what Huiyin wanted to hear. She gave him a thumbs up and said, \"Young Prince, it’s true what they say—trust the person you appoint and don’t second-guess them.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">With Li Cheng’s support, Huiyin felt more confident during the afternoon inspection of the storeroom. The servants noticed that she personally checked each item and clearly knew what she was doing. She understood how to care for porcelain vases and properly place screens, so they didn’t dare try to deceive her.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Nanny Fan was talking to He Guanshi’s wife and said, \"She pointed out some of your husband’s mistakes but didn’t fire him. What did he say?\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">He’s wife replied, \"What could he say? He was as meek as a quail, terrified that the young princess might fire him for the slightest mistake.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Nanny Fan inwardly cursed, thinking what a coward He Guanshi had become. He usually had a short fuse when managing the kitchen, but this time, he didn’t react at all to the criticism.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Nanny Fan added, \"For now, he’s just being tested, but who knows if he’ll survive in the long run.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">He’s wife pursed her lips and said, \"Nanny Fan, we understand what you’re saying, but the young prince fully supports the young princess. This afternoon, he even accompanied her to inspect the storeroom, and everyone saw it. As servants, we can’t go against the young prince.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">This was the reality. In Huaiyin Mansion, the Prince of Huaiyin’s word was law. Even though He Guanshi was loyal to the Empress Dowager, she was no longer in power. With the young prince’s favor and support, who would dare oppose the new mistress?</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">While Nanny Fan was still worried, a few days later, she received a letter and was overjoyed. Miss Xun was finally arriving!</p><p id=\"paragraph-55\" data-paragraph-id=\"55\"></p><p id=\"paragraph-56\" data-paragraph-id=\"56\"></p><p id=\"paragraph-57\" data-paragraph-id=\"57\"></p>\n</div>"
  },
  {
    "number": 14,
    "title": "Chapter 14",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 14</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Xun Rou◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Li Cheng's wounds were almost fully healed, but he had to leave for the Huai River to train the navy immediately.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">In the past, he could leave without a second thought, but now, gazing at Huiyin's sleeping face, he felt an unexpected twinge of reluctance. Huiyin preferred to keep the bed curtains drawn tightly when she slept, so she wouldn’t know whether it was day or night, allowing her to sleep soundly without any worries.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">She sensed Li Cheng stir slightly and opened her eyes, letting out a small yawn. \"You're leaving today, right?\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"Yes, after breakfast,\" Li Cheng said, gently touching her smooth cheek.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">The previous day, they had visited Baolian Temple for a ceremony. Li Cheng had observed Huiyin’s dignified demeanor during their outing. When a little girl fell on the road, Huiyin personally got out of the carriage, lifted the child, and returned her to her parents. It was all very commendable.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">However, there were far too many men who lingered to admire his wife’s beauty, including a young monk who blushed when he saw her.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">As a result, Li Cheng was still uneasy. \"Don't go out while I'm away. With constant battles happening, I’m worried that enemies might come looking for trouble.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">It was a lie, but Huiyin didn’t catch it. Unfamiliar with Xuzhou, she nodded obediently. \"Don’t worry, I’ll stay in the mansion and wait for you.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Li Cheng felt a flutter in his heart as Huiyin got up, raised three fingers, and swore innocently and obediently not to leave. \"Huiyin...\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">But Huiyin smiled and said, \"A true man shouldn’t be overly emotional. When you return, we can spend time together as a couple.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">She wore an emerald green bodice and a pale yellow undergarment, with her raven-black hair cascading over her shoulders. Unlike fragile women, she exuded a vibrant and robust beauty.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Li Cheng used all his willpower to control himself and stood up. Knowing he was leaving today, Huiyin had prepared a special beef noodle dish for him.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">“This time, I used beef bone broth and added some of my best spices. The chili oil is from Jizhou—it looks spicy, but it’s actually fragrant and not too hot.”</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">As Li Cheng picked up his chopsticks to eat, he noticed Huiyin wasn’t eating. \"Aren’t you joining me?\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">“I’ll eat slowly after you’re gone. I’ve already checked with your personal guards about your travel gear and packed everything for you. I just want to spend a little more time with you. Who knows when we’ll see each other again?”</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Li Cheng was deeply moved by her words and, before leaving, sternly instructed Manager Qiao, “I’m going to Huai and Si to train the navy. While I’m away, you must all obey the young princess. If I hear of any disrespect, I’ll come back and punish you myself.”</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Manager Qiao and the others realized that the new princess must have won the young prince’s heart, or he wouldn’t have warned them so sternly.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">After Li Cheng left, Huiyin’s expression remained calm and composed, showing no visible attachment. They hadn’t faced hardships or life-and-death situations together, so it was premature for her to pledge her life to him. If he were home, Huiyin could nurture their relationship, but since he was leaving so soon, she had to focus on managing the Huaiyin Mansion first.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">When Nanny Fan received the letter confirming Miss Xun’s arrival, she knew her previous message had succeeded and felt relieved. If she had to scheme, it would only involve some subtle manipulation. These methods were useful, but unfortunately, Princess Zheng was favored and pregnant. When you’re in a favorable position, people don’t dare to challenge you directly.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Fortunately, Xun Rou was coming. Miss Xun was the Empress Dowager’s favorite and had been in charge of the entire Huaiyin Mansion in Jianye. The current staff had been handpicked and sent by her. Even He Guanshi’s daughter, who married two years ago, received generous rewards from Miss Xun. This girl had grown up in the mansion since the age of seven and shared a special bond with the young prince, having spent their childhood together.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Most importantly, she was highly capable. At the age of seven, when her father remarried, her stepmother reportedly treated her poorly, so she secretly stowed away in a carriage delivering gifts to the Prince of Wu’s mansion. At such a young age, she had shown remarkable determination. Initially, the wife of the Prince of Wu paid her no special attention, but when the wife later fell seriously ill, Xun Rou bled herself to copy scriptures, which deeply moved the wife of the Prince of Wu. With her arrival, things were sure to get interesting.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Huiyin was gradually organizing the Huaiyin Mansion, and now she was the legitimate head of the household. For those who defied or disobeyed her, she had Nanny Nan take notes.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">“These people are hypocrites and will likely turn against me in the future. Keep an eye out for their mistakes. Here are fifty taels, Nanny. Only by uncovering their weaknesses can I truly understand them.”</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">**</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">It’s easy to twist the truth, but it’s hard to hide it completely.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Nanny Nan immediately bowed and replied, “Yes.”</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Nanny Nan also had four main maids under her. Le Yun was skilled at reviewing accounts, so Huiyin had her examine the account books first, flagging any obvious discrepancies or falsified entries for Huiyin to review again. Fu Gui was responsible for overseeing the needlework and tea rooms. If any issues arose, they would be documented, and the responsible individuals would either be dismissed or reassigned.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\"></p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Qiufeng and Dongshun each have their own duties.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">The people in the prince's mansion had no idea that Huiyin was so thorough, almost to the point of drilling into every detail. They assumed she would just skim through things and not uncover anything significant.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">About ten days after Li Cheng left, Yun Hui suddenly came in and said, \"Young princess, Miss Xun's carriage has arrived.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"Miss Xun? Who is she?\" Huiyin was somewhat puzzled.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">She noticed Yun Hui's expression became slightly unnatural, as if she was preparing for an enemy, but she only said, \"Miss Xun is the young prince's cousin, raised in the mansion since childhood.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">So, they grew up together?</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Could it be that Li Cheng's ideal match is her? Huiyin wondered, but she kept her expression calm and asked, \"Did she come alone? Why would a young lady travel all the way from Jianye to Xuzhou?\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">The roads aren't safe these days, and what brings her here now?</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Yet Yun Hui shook her head, clearly unwilling to say too much.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Nanny Nan looked at Huiyin with concern, but Huiyin said, \"Since she's already at the door, please bring her in. Yun Hui, you've been here for a long time; could you go and receive her for me?\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Yun Hui, however, hesitated unusually. \"Young princess, it's not that I don't want to receive Miss Xun, but she didn't get along with me in Jianye, which is why I requested to come to Xuzhou.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Oh, so there's history between you two. Then let Granny Chao go and welcome her. I'll see what Miss Xun wants,\" Huiyin said, her tone slightly displeased.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Yun Hui quickly went to invite her.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Nanny Nan said, \"This Miss Xun seems quite difficult to deal with. From what I've observed these days, Yun Hui is meticulous and never oversteps.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"Nanny, you're a kind person, but not everyone is,\" Huiyin smiled.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Nanny Nan, however, replied, \"You're being too suspicious.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">It wasn't entirely Huiyin's fault. In the Zheng family, they were under the protection of Madame Ji. Their only concern was the occasional hostility from Elder Madame Xu. However, with Zheng Wuheng growing stronger and Pei Shuo's formidable presence, they had long since lost their influence.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">They likely had no idea how treacherous the outside world could be.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">A moment later, Granny Chao carefully escorted a young lady inside. She was dressed in a light purple gown, adorned with jade combs and gold flying swallow hairpins, creating an elegant balance of gold and jade. Even with her critical eye, Huiyin could see that this was a graceful and beautiful young lady.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">The seemingly simple light purple dress shimmered with intricate patterns in the light. Clearly, Miss Xun was well-dressed and lived a comfortable life.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Granny Chao introduced, \"Young princess, this is Miss Xun, the young prince's cousin.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"Cousin? Are you the daughter of the late princess?\" Huiyin greeted her with a smile.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Granny Chao explained, \"Miss Xun is the great-niece of our Empress Dowager and the daughter of the head of Shanglin Garden.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Xun Rou bowed and greeted, \"Cousin-in-law.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"Cousin, no need to be so formal. I've just arrived, and the young prince has already left for Huai and Si to train the troops. I wasn't aware of your visit, so I apologize if I've neglected you. Please don't take it personally,\" Huiyin said, taking her hand and adding, \"You're so beautiful—rare not just in Xuzhou, but even in Jizhou and the capital. Come, let's talk inside.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">The two entered the inner room. Xun Rou noticed the calligraphy on the walls and the numerous books arranged in the main hall. The walls shouldn't be too plain, but they also don't need to be overly luxurious. Hanging calligraphy can sway in the wind, but when pasted on the wall, it creates a certain artistic ambiance. The corners of the parlor were painted with colorful flowers and lush trees, and birdcages hung from them, housing thrushes and parrots, adding a touch of elegance.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Xun Rou nodded to herself, \"I came to Xuzhou with the Empress Dowager two years ago, and this place was just bare walls. Did you arrange all this, cousin?\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"Yes, since I'm staying here, I had to arrange it properly. Not just here, but even in my small study, I had wooden partitions installed and papered.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">The two entered the inner room, and Huiyin had Nanny Nan bring a chair for Xun Rou to sit. She also had someone serve tea.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Xun Rou took a sip of the tea and then set it down, saying, \"Cousin, you're probably curious about why I came.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">\"It's not that I'm curious about why you've come; I was just wondering what brings you all the way here to see the Little Prince. He’s out in Huai and Si for military training and likely won’t be back anytime soon, so it wouldn’t be convenient to disturb him about this.\" Madame Ji said this without a trace of emotion.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Xun Rou smiled and replied, “Don’t worry about it, sister-in-law. I’ve already written to my cousin. To be honest, I turned down the request multiple times, but the Empress Dowager insisted. She misses her grandson and remembered that I had helped manage the household at Huaiyin Mansion before, so she asked me to come and assist you.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Assistance? As they say, how can you let someone else sleep soundly right next to your own bed?</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">The household has always been under my management, so why would the Empress Dowager send someone else? However, given that the country is governed by principles of filial piety, even Madame Ji has to put up with snide remarks from elder Madame Xu, so what chance do I have?</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">With the Empress Dowager’s instructions, Madame Ji smiled and said, “In that case, I’m more than happy to have you here. To be honest, it’s been rather lonely here. Now that you’re here to keep me company, I’m genuinely happy. Nanny Nan, please have the kitchen prepare a fine feast. Let everyone know that the Empress Dowager specifically sent Miss Xun to help manage the household, so we mustn’t neglect her.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Xun Rou was taken aback, sensing that something wasn’t quite right about those words.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\"></p>\n</div>"
  },
  {
    "number": 15,
    "title": "Chapter 15",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 15</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎First Strategy (Second Update)◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Is this the place?\" Nanny Fan asked, covering her mouth and nose with a handkerchief as she entered the main courtyard via the narrow path.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">This was a separate courtyard in the southeastern corner of the prince's residence, assigned to the newly arrived Miss Xun by Princess Zheng. As she entered, she noticed the smell of fresh incense mixed with a musty odor, and the furnishings were sparse. Not even a purple sandalwood screen had been provided.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">She distinctly remembered that Princess Zheng's main hall featured an ivory-carved \"Three Rams Bring Good Fortune\" screen, and her rooms had screens inlaid with various precious stones. Yet, for Miss Xun, they had only provided a pink famille-rose landscape screen.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">While it wasn't terrible, Miss Xun had been sent here as a representative of the Empress Dowager.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Miss Xun's servants were helping her arrange the bedding while she sat by the window, lost in thought. Princess Zheng's tactics were too obvious, directly placing her in such a residence, giving her a ready-made reason to complain.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Seeing Nanny Fan approach, she quickly stood up. \"Why have you come, Nanny Fan? I haven't finished settling in yet. I was planning to invite you over once everything was in order.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Nanny Fan smiled. \"I came to check on you. Forgive my presumption, but I watched you grow up, Miss Xun.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Seeking an alliance was the priority, and Nanny Fan's words were clearly a gesture of goodwill.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Xun Rou invited her to sit and, resting her chin on her hand, said, \"To be honest, I didn't want to come. My cousin's wife seems to manage everything well here. But my grandmother insisted I come. You know, I really don't want to deal with these troublesome matters.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"While the young prince was away, leading people to join the Prince of Wei, you were the one managing things behind the scenes. In my humble opinion, this current young princess is far inferior to you,\" Nanny Fan said frankly.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Xun Rou raised an eyebrow and smiled. \"That's true.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">There was an old general under the Prince of Wei who often caused trouble for her cousin, yet her cousin never complained and remained unperturbed, showing great magnanimity.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Nanny Fan hinted just enough and had someone bring a bowl of ginseng soup. \"You must be tired from your journey, Miss Xun. This is red ginseng soup I had prepared for you. Please drink it to restore your energy.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"Thank you then,\" Xun Rou said.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">That night, Xun Rou tossed and turned, unable to sleep well. She had never slept in such a place before, having always used silk coverlets at the Empress Dowager's side. Yet, Princess Zheng lived in extreme luxury.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">\"Miss, are you having trouble sleeping?\" Xun Rou's maid, Meixiang, asked.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Xun Rou turned over and nodded. \"Yes, I'm not sleeping well. But what can I do? The Empress Dowager told me to come. Could I refuse?\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Meixiang pursed her lips. \"Actually, if the Empress Dowager had truly asked the young prince to grant you the title of secondary consort, it wouldn't be impossible. You're already seventeen and have been in the prince's residence for ten years. You can't wait any longer.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"Meixiang, if I became a secondary consort, I would remain one for life. If the primary princess died, my cousin would marry again. Have I waited all these years just to be the secondary consort of the Prince of Huaiyin?\" Xun Rou was truly resentful.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Meixiang feared all their efforts would come to nothing, but thinking of how long her mistress had waited, it was infuriating to see the almost certain outcome slip away.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">If Princess Zheng were gentle, kind, and honest, it would be one thing, but upon arrival, she was placed in such a residence.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">With the Empress Dowager far away and the young prince not present, she had to rely on herself.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">She observed Princess Zheng closely. The woman didn't rise early but handled matters swiftly, enforcing the household rules strictly. She was also preparing Mid-Autumn festival gifts, appearing quite competent. However, she never sought Xun Rou's advice, even though Xun Rou had mentioned being sent by the Empress Dowager.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Nanny Nan was slightly uneasy. \"Princess, Miss Xun was sent by the Empress Dowager. On your side...\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">\"That's why the Empress Dowager only reached the rank of Jieyu in the palace and was lucky to give birth to the Prince of Wu. She doesn't appreciate her blessings. Who does Xun Rou think she is? She's not even as significant as Nanny Fan, who is rightfully a disciplinary nanny by the Empress Dowager's side to teach me propriety. Xun Rou is merely the young prince's cousin, yet she's here to manage the household without proper standing. No matter what she says, it doesn't make sense. Moreover, I am the primary princess requested by the Prince of Wei for the Prince of Huaiyin. Why should I, the legitimate primary princess, be criticized by a dependent cousin?\" Princess Zheng was not one to be easily bullied.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\"></p><p id=\"paragraph-28\" data-paragraph-id=\"28\"></p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Back when Li Heng openly favored her, her status was already quite high. Now that she's a princess, why should she fear some distant relative?</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">If she started currying favor, the servants would assume she’s intimidated by her.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Moreover, it’s still unclear whether Xun Rou is here to establish herself or to catch her in a mistake.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"Princess, I got Granny Chao tipsy yesterday and learned something from her,\" Qiū Fēng said as she approached.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Huiyin smiled. \"Well, whether she revealed it intentionally or not, go ahead and tell me.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Qiū Fēng continued, \"Miss Xun has been with the Empress Dowager since she was seven. She always claimed to be the young prince’s intended and helped the Empress Dowager manage the household. Both the Empress Dowager and the Princess of Wu adored her. When the Princess of Wu fell ill, Xun Rou even copied scriptures using her own blood. Later, the Prince of Wei suddenly arranged a marriage for the young prince.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"So, they didn’t send her here to become a secondary princess, right?\" Nanny Nan asked anxiously.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Huiyin shook her head. \"If she wanted to be a secondary princess, she would have tried to win my favor. But after I wrote to the young prince, he replied today saying that the Empress Dowager wants him to help find a suitable match for Xun Rou and ensure she isn’t wronged.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Clearly, it was an attempt to lull her into complacency, so she wouldn’t even realize how she was being undermined.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Just as she finished speaking, a voice from outside called out, \"Young Princess, Miss Xun has suddenly fainted. Nanny Fan has sent Manager Qiao to fetch a doctor.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"How could she have fainted so suddenly? With this heat, I specifically arranged for her to stay in a quiet place. Never mind, I’ll go check on her.\" Huiyin quickly led a group to the courtyard where Xun Rou was staying, and quite a few people had already gathered there.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Upon entering, Huiyin saw Xun Rou lying on the bed, her face deathly pale, and asked Meixiang, \"What happened to your cousin?\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Meixiang sobbed, \"I’m not sure. Lady Xun has been complaining about poor sleep these past few days, and she suddenly fainted after standing up from a meal.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Poor thing, traveling six hundred miles alone and now having to worry about the prince’s affairs. It’s no wonder she’s exhausted. Once the doctor examines her today, I’ll find a more suitable place for her to stay. The Empress Dowager dotes on our young prince so much that even though he’s already the governor of Xuzhou, she still treats him like a child, sending his cousin to look after him.\" Huiyin sighed, feigning helplessness.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Nanny Fan and Meixiang were furious. They had deliberately exaggerated the situation, hoping the doctor would confirm that Huiyin was mistreating the cousin. But Princess Zheng was an expert at twisting the truth.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">After all, Xun Rou had kept the windows open for a full day and night, deliberately exhausting herself until she fainted. If no one took it seriously, wouldn’t all her efforts be for nothing?</p><p id=\"paragraph-46\" data-paragraph-id=\"46\"></p>\n</div>"
  },
  {
    "number": 16,
    "title": "Chapter 16",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 16</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Duel of Wits◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Half an hour later, the doctor arrived. After examining her pulse, he diagnosed it as wind evil affecting her body, which required rest and careful nourishment. Huiyin, however, added, \"My cousin made the long journey from Jianye alone recently, which must have been exhausting for her. Doctor, could you also prescribe some medicine to protect her heart and calm her spirit? We’ll cover any cost.\"</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">The doctor hesitated but agreed. Fugui quickly escorted him out, adding, \"Our young princess has been incredibly kind to Miss Xun. She’s arranged a new courtyard, selected all the furnishings from the storeroom, and assigned several servants. If Miss Xun needs anything, even expensive medicines like deer antler or ginseng, our young princess will provide it without hesitation.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Manager Qiao, standing guard at the second gate, overheard Fugui and the doctor. She couldn’t help but admire the young princess’s generosity. Despite Miss Xun clearly being there to become a secondary consort, she was treated with great kindness instead of being ostracized.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Fugui also told Manager Zhong, \"Miss Xun’s maid mentioned that the southeast courtyard had too many mosquitoes, so the princess suggested moving her to the northern embroidery tower, which has fewer trees. When Miss Xun said the landscape screen you chose wasn’t suitable, our princess, concerned about any inconvenience, offered to use a screen from her dowry instead.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Nearby, He Niangzi observed this and remarked to Yun Hui, \"Our new princess is quite the performer. Miss Xun’s plan has backfired. But if Miss Xun complains to the Little Prince, who knows which side he’ll take?\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Yun Hui, expressionless, replied, \"We should focus on our duties as servants. It’s not our place to get involved.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">He Niangzi, realizing she wasn’t getting anywhere, left in frustration.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">When Xun Rou woke up, she found herself in the embroidery tower, still disoriented. Meixiang explained everything that had happened after she fainted.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"The young princess said you were too frail to stay there, so she had the maids carry you here...\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"What?!\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Xun Rou slammed her hand on the bed. \"Princess Zheng is impossible!\" She had already asked the Empress Dowager to spread a rumor that she had come to Xuzhou to marry someone outside the royal household, hoping to make Princess Zheng let her guard down.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Unexpectedly, Princess Zheng was highly vigilant. Xun Rou had planned to use her fainting to expose the princess’s mistreatment, but instead, it only enhanced Princess Zheng’s reputation.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Meixiang worriedly asked, \"Miss, what should we do next?\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Xun Rou took a deep breath. \"We’ll act when the time is right.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">For now, Xun Rou kept a low profile, but Nanny Fan was originally planning to depart at the start of the eighth month but stayed a few extra days because of Xun Rou. Once Nanny Fan left, Xun Rou became more reclusive, and Huiyin didn’t relax her surveillance.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">As the Mid-Autumn Festival approached, Huiyin wrote to Li Cheng, expressing her longing and asking whether they should prepare festival gifts for his subordinates’ families and where the funds should come from.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Unexpectedly, Li Cheng only replied with two words: “Wait until I return.”</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">This man! Who asked him when he’s coming back? Huiyin had no choice but to refer to last year’s example, though Li Cheng had only been in Xuzhou for a short time, so no festival gifts had been prepared.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Le Yun couldn’t help but ask, \"Should we prepare something anyway?\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Huiyin rubbed her head. \"This unreliable Li Cheng!\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Young princess, you shouldn’t say that,\" Nanny Nan quickly interjected.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Thinking it over, she came up with an idea. She called for He Guanshi and asked, \"Are you good at making mooncakes?\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">He Guanshi nodded. \"I’m skilled in both pastry and main dishes. Here in Xuzhou, we mostly eat flaky skin mooncakes. Would you like the kitchen to make them?\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"Yes, I’ve already sent people to buy some delicious local mooncakes in Xuzhou. Once I’ve tasted them, if any are good, I want you to make two boxes and send them to the Little Prince.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">In reality, her cook could also make a type of milk skin mooncake, which would be prepared in her private kitchen.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">He Guanshi thought to himself that she wasn’t choosing based on the Little Prince’s preferences but her own.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Huiyin quickly selected three types of mooncakes—milk skin, flaky walnut, and black sesame—each packed into two boxes to be sent. These were her favorites, and she wanted him to try them. In her letter, she mentioned that whichever type he preferred, they would prepare more at home. If he didn’t like any, they would simply give them away as rewards.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">After the letter and mooncakes were sent out, Consort He quietly went to Lady Xun Rong and said, \"Rest assured, from beginning to end, we never disclosed that the young prince doesn't like mooncakes.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Lady Xun Rong smiled and said, \"This is the consequence of her own cleverness. My cousin has never liked eating mooncakes during the Mid-Autumn Festival.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">No matter how smart she thinks she is, it can't match the bond they grew up with.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">However, what she didn't expect was that when Li Cheng received the mooncakes sent by Huinyin, he found some milk skin mooncakes. Having never tasted this flavor before, he bit into one and found the outer layer to be crispy while the inside was like milk tofu. Surprisingly, it was quite delicious. Even the walnut mooncakes, which he usually detested for their overly sweet and greasy taste, now only had the rich aroma of walnuts.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">But he still didn't particularly enjoy these sweet and greasy treats. He kept half a box for himself and gave the rest as rewards.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">These were given to his personal guards, who, despite not being particularly valuable items, were very pleased to receive them. Li Cheng turned to find the letter Huinyin had written, realizing that she had previously asked whether he wanted to give rewards and how to proceed with the formalities. But because he truly disliked eating mooncakes and didn't want to dampen his wife's spirits, he simply said he would return home.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">It's not always about rewarding with gold and silver; sometimes a touch of human warmth is enough.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">He instructed the kitchen to add extra meals on the Mid-Autumn Festival and to give each soldier a mooncake. As for his personal guards and officers, he quickly wrote to Huinyin to ask for advice.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Seeing this, Huinyin couldn't help but smile and said, \"Let Manager Qiao handle this. Have him order top-tier mooncake boxes from Dingxing Tower; two hundred taels should suffice.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Li Cheng had occupied Xuzhou not long ago. Due to his prolonged training in Huai and Si, or being out practicing with his troops, most of the gifts from the household managers were sent to Jianye. She had seen the gift list, and local prominent families like the Lius, Xues, and Mius had all sent generous gifts, but there were almost no returns.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">One cannot merely be a passerby here. If he truly intends to establish a foothold, he must build good relations with the local gentry. In times of shortage of provisions or troops, he could recruit locally.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Avoiding risks without avoiding suspicions, occupying a territory now means having strength.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">All the prominent families in the region received Mid-Autumn Festival gifts from the Huaiyin Prince's residence: a box of milk skin mooncakes, a box of Dingxing Tower mooncakes, a basket of seasonal fruits, ten bolts each of silk, satin, and brocade, and two jars of premium osmanthus wine.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Huinyin also gradually received lavish return gifts from these families, including many treasures such as jade flower platters, white glass plates, glass vases, prayer beads, ancient artifacts, paintings, and Ru kiln vases.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Even the Mius sent twenty bolts of golden brocade, one hundred bolts of patterned silk, and one hundred bolts of plain silk.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Huiyin meticulously recorded and cataloged everything, looking quite pleased with herself.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Xun Rou felt frustrated seeing that Huiyin wasn’t embarrassed by the situation and instead acted like a model of virtue. She wanted to go out for a walk and visit some of the Empress Dowager’s old friends, but the gatekeeper at the second gate refused to let her leave.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Meixiang snapped, “What gives you the right to stop our young miss from going out? Do you have a death wish?”</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">The gatekeeper replied apologetically, “Miss Xun, it’s not that we don’t want to let you out, but the Princess has ordered that anyone leaving the estate must have a pass. If I let you out without one and she finds out, I’ll be in big trouble.”</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">With no other option, Xun Rou went to see Huiyin, who was busy at the moment. She was discussing with Yun Hui, “Once the Little Prince’s fief is delivered, I’ll inspect it first. After the Mid-Autumn Festival, it’s time to harvest the grain. This year, we’ll use the old rice from previous years and save the new rice. With the changing seasons, we need to clean both the inner and outer courtyards thoroughly and make everything look fresh and new.”</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Yun Hui reassured her, “Don’t worry, I’ll make sure they’re informed.”</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">“Thank you for your hard work.” Yun Hui was indeed a dedicated and tireless worker.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">As she looked up, she saw Xun Rou approaching. Huiyin greeted her, “Is there something you need, Cousin Xun?”</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Xun Rou replied, “Cousin-in-law, I have a few close friends from when I stayed with the Xu family before. I’d like to go out and visit them, but I need a pass to leave.”</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">“Cousin Xun, I’m afraid I can’t give you the pass. If you want to invite people over, I can have Zhong Guanshi or He Guanshi handle the arrangements. But with the Mid-Autumn Festival coming up, the streets are crowded, and your health isn’t great. As a young lady, I can’t take the risk if something happens to you,” Huiyin explained calmly.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Xun Rou frowned, “Cousin-in-law, I traveled all the way from Jianye to Xuzhou on my own. What’s there to worry about?”</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Huiyin smiled, “That’s different. You came from Jianye to Xuzhou at the Empress Dowager’s request, so any issues wouldn’t be my responsibility. But now, with both your cousin and the Empress Dowager away, I can’t take the risk. Once the Mid-Autumn Festival is over, your cousin will return. If he agrees, I won’t object.”</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Xun Rou glanced at Meixiang, who smiled and said, “No wonder people say the young princess is kind. You’re just looking out for our young miss. She did come here to help manage the household, and Nanny Fan mentioned that she’s feeling a bit bored now that she’s settled in.”</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">It seemed they were angling for control of the household. Huiyin chuckled, “You’re quite the smooth talker, but as long as I’m here, there’s no need for the young miss to manage the household. Besides, with her wedding approaching, she hardly has time for such tasks.”</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Xun Rou’s heart sank. She had come under the pretense of discussing marriage, but she had no intention of actually getting married. From Huiyin’s words, it seemed like someone was trying to arrange a match for her.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">No, this couldn’t be her cousin’s doing. He was training troops in Huai and Si, so how could he have arranged anything so quickly? Could it be Princess Zheng trying to marry her off?</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">But this was overstepping. Only the Empress Dowager had the authority to decide her marriage.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Xun Rou left with a troubled mind. Nanny Nan asked Huiyin, puzzled, “Princess, did the Little Prince already arrange a marriage for Miss Xun?”</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">“No, I was just bluffing. Otherwise, she keeps trying to rush out. If she wants to go out in Jianye, that’s her business, but here, if something happens after she leaves without permission, I can’t take the responsibility.” Huiyin smiled faintly.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\"></p>\n</div>"
  },
  {
    "number": 17,
    "title": "Chapter 17",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 17</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Men Actually Know Everything Clearly◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">As the Mid-Autumn Festival drew near, the heat intensified, especially at night, unlike in Jizhou where, despite the daytime heat, evenings were refreshingly cool.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Four ice basins were placed around the room, and Huiyin only felt slightly cooler after sipping a bowl of chilled dairy treat.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">The Huaiyin Mansion had a dedicated ice cellar. She spent most days at home, only venturing out to the garden for an evening stroll after dinner. Life was indeed comfortable.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"Make sure Miss Xun gets plenty of ice, and her rations should be ample. I don't want people talking behind my back,\" Huiyin smiled.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Fugui replied, \"Rest assured, we’ve been sending her more than enough. Honestly, you’ve been incredibly kind to her. Does she really think she’s royalty? Her maid is ungrateful, insisting an outsider manage the household.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Huiyin sighed, \"Regardless of what Grand Dowager Wu promised her, I can’t allow her to move in. I don’t have any children yet, and it wouldn’t make sense to introduce a secondary wife or concubine. That would be illogical.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">After saying that, she turned to Fugui and the other maids, \"Is the ice supply in your rooms sufficient?\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Dongshun and the others chuckled, \"Thanks to the ice, we’ve been sleeping much better.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"Good,\" Huiyin said as she prepared to freshen up.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">It was the 13th of August, and with night falling, Huiyin expected Li Cheng to return the next day. However, the guards unexpectedly announced his return.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin rushed to the door and saw Li Cheng standing before her in his armor. Her eyes filled with emotion as she greeted him, \"Welcome back, Little Prince.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Li Cheng rarely returned home; being alone, it didn’t feel worth it. But now, seeing Huiyin rush towards him like a sparrow, he quickly caught her, \"I planned to return tomorrow, but I couldn’t wait to see you, so I came back early.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">\"You’ve never been this smooth before. Are you hungry? Should I have the kitchen prepare something for you?\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Her words warmed Li Cheng’s heart. Since his parents passed, his grandmother had been kind to him, but her kindness always came with strings attached. Every favor had to be repaid; nothing was given freely.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">But his wife was different. She genuinely treated him as her husband.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">\"I’m a bit hungry. Just have the kitchen prepare a few light dishes. I can’t handle heavy meats right now,\" Li Cheng smiled.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"Got it!\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Two red candles stood on the high table, accompanied by four small dishes and a bowl of soup. Li Cheng picked up a bowl and a large chicken leg, listening intently as Huiyin recounted the past month’s events.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">When she mentioned Xun Rou, he listened even more closely.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"She came here on her own, and I was worried about her safety. Then she started asking to go out. I thought it best to wait for you to return and arrange for someone to accompany her. After all, she’s of marriageable age, and it wouldn’t be proper for her to wander freely without invitations.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Regarding Xun Rou, Li Cheng said, \"You did the right thing. She’s a young lady now and shouldn’t act as she used to. She’s always been unconventional. When she was younger, she once argued with her father and secretly hid in a box, sneaking into our house on the carriage her father sent to deliver gifts. She’s quite daring.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Huiyin smiled, \"I’m just a cousin-in-law, not like your childhood friend. If she comes to you with anything, you should speak to her seriously. Besides, she’s of marriageable age, and the Empress Dowager asked you to find her a good match. You should take it seriously.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Li Cheng put down his chopsticks, \"This is your responsibility. I’m busy training troops every day and don’t have time to find a husband. Besides, even my youngest officer, Yuwendang, already has a family.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"Me? She couldn’t find a suitable match in Jianye, where all the elites gather. Xuzhou can’t compare, and I don’t know anyone here. I’m not keen on playing matchmaker, especially since I can tell Xun Rou isn’t genuinely interested in marrying out.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Li Cheng agreed and took another bite of rice, finishing with a bowl of soup. Huiyin personally handed him a cup of tea to rinse his mouth.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Huiyin had more to say, but Li Cheng scooped her up, \"Let’s take a couple’s bath.\" She couldn’t resist and had to give in.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">After their brief separation, Li Cheng lingered over Huiyin, and after they were done, she couldn’t help but remark, \"You know, our deepest conversations happen in bed.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Li Cheng buried his face in her, feeling a sense of comfort, \"I didn’t realize how much I’d miss you.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"So it's a good thing I stuck around, right? You even tried to get rid of me at first!\" Huiyin teased with a playful scowl.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Li Cheng realized he had been clouded by desire; there was no other way to explain it. Although Princess Zheng was certainly beautiful, he had encountered women who were even more so.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">He found himself drawn to the easy, down-to-earth comfort she provided, a warmth that felt familiar without being ordinary.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"Alright, I was wrong,\" Li Cheng admitted with a sheepish smile.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">It was unusual to see him so relaxed, and it brightened Huiyin's mood as well.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Xun Rou didn’t learn about her cousin’s return until the next day. She had feared that Huiyin wouldn’t allow her to meet him, but to her surprise, Huiyin sent word that they would all dine together that evening.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Meixiang immediately opened the dressing case. \"Miss, you should take the time to dress nicely. It's rare for her to be so considerate; usually, she barely acknowledges you.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Xun Rou glanced at the white jade hairpin and sighed. \"It’s not out of kindness. She’s just doing it for my cousin’s sake.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">With Li Cheng’s return, visitors flooded in one after another, leaving him with no time to rest.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">The local gentry came to forge ties with the Prince of Huaiyin. Initially, Li Cheng had only planned to establish a base here, but now that everyone treated him like a regional lord, he started to feel more in control. Naturally, some families offered their daughters to him, but he politely turned them down.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">He refused because his legitimate wife was Princess Zheng, the daughter of the Marquis of Zhaojie in Jizhou. Besides, taking another wife at this point wouldn’t serve much purpose and would only make him a pawn for others.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Huiyin had also witnessed many noblewomen bringing their daughters to visit, praising their daughters’ obedience. She understood their motives all too well. Her own mother frequently dealt with such people, like Hu, her father’s latest favored concubine, who was sent by the influential Zhang family in Jizhou.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">She was still trying to figure out how to handle the situation, but Li Cheng had already turned everyone down without even mentioning it to her.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">While helping him change, Huiyin asked bluntly, \"Today, Madam Miao brought her daughter over and kept praising how obedient she is. What do you think she was getting at?\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Li Cheng was taken aback. \"How would I know?\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"Don’t act like you don’t know what I’m talking about.\" Sometimes, Huiyin felt a deep sadness for women. Would she have to beg him not to take concubines in the future? It seemed that any man with power could easily surround himself with beautiful women.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">This was the first time Huiyin had shown any signs of displeasure, her eyes cold. Li Cheng was momentarily speechless. Even his father, the Prince of Wu, despite being harmonious with his mother, Miss Cui, had taken concubines to strengthen his position.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">But seeing Huiyin’s expression, he couldn’t help but speak honestly. \"These people just want to send their daughters to me, hoping I’ll protect their families. But I’ve already secured this place. The people here are already under my control. There’s no need for that.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"I thought you were doing it for me. Never mind, let’s not talk about this anymore. I’ve finished changing your clothes, and there’s a special welcome dinner for you later. I’ve also invited your cousin Xun to join us.\" Huiyin forced a small smile and said no more.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">As she turned to leave, Li Cheng gently pulled her back. \"I’m sorry.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Huiyin shook her head. \"You don’t need to apologize. I’m just glad you’re being honest with me.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">At the dinner that evening, Xun Rou appeared, wearing a peacock-blue diagonal-collared gown and a silver-gilt hairpin inlaid with gemstones and beryl. She looked both elegant and opulent.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">She chatted casually with Li Cheng and teasingly remarked, \"Look at you, cousin. As soon as you got back, you were off meeting all those people instead of spending time with your wife.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Li Cheng, still feeling guilty for upsetting Huiyin, assumed the two women were close since Xun Rou was teasing him. He laughed and said, \"I couldn’t turn them down. You should spend more time with your cousin’s wife too.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Huiyin wasn’t really upset. After all, their marriage was a political alliance, and Li Cheng hadn’t taken a concubine before their wedding, despite her inquiries. He had entrusted the household to her, and this time, he had come back specifically, possibly for her.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">But she hadn’t mentioned being close to Xun Rou, and he hadn’t picked up on that at all.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">She didn’t buy into the idea that men and women thought differently. It simply meant that Li Cheng didn’t care enough about her.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">\"Alright, I’ll do as my cousin says. Oh, cousin, do you remember Sang Zao? She had a beautiful puppy last year, and I made a little house for it…\" Xun Rou continued to reminisce about her shared memories with Li Cheng, from the puppy to Jianye, and even threw in a few dialect phrases when she got excited.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">She felt she had finally found her leverage against Huiyin—her long-standing relationship with Li Cheng. After all, it had been ten years, and no one could easily undo that. How could she not feel anxious when someone tried to barge in at the last minute?</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">By the end, Xun Rou was still going on, clearly not ready to let it go.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">However, Li Cheng suddenly interrupted, \"Cousin, over the years, you've been incredibly devoted to taking care of my grandmother. But we can't keep you here indefinitely. I've already discussed this with your sister-in-law, and we've decided to help you find a suitable match. From now on, just think of me and your sister-in-law as your own brother and sister-in-law. We'll always be family.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Xun Rou was taken aback, her smile frozen on her face, and she felt like crying but couldn't bring herself to do so.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Huiyin thought to herself, see, men actually know everything clearly.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">The author has something to say:</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Bonus update this weekend!</p><p id=\"paragraph-67\" data-paragraph-id=\"67\"></p>\n</div>"
  },
  {
    "number": 18,
    "title": "Chapter 18",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 18</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Mid-Autumn Festival◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"It's late, aren't you going to rest?\" Li Cheng leaned against the bed, hinting with his words.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Tomorrow was Mid-Autumn Festival, and after that, he would have to go to Huai-Sui to train the navy, leaving no time for them. The couple naturally wanted to make the most of their time together.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Although Huiyin had repelled Xun Rou, she did not feel particularly happy. She turned her head to look at him: \"Hasn't Cousin Xun been staying in your household for many years, prepared to be your fiancée? It’s a pity when I think about it.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Li Cheng hadn’t expected her to be so sentimental. He originally thought she would be pleased with his actions. No one likes to be seen as heartless or unfeeling. He looked at Huiyin and said, \"I don’t want to lie to you. If I really wanted to marry someone, it wouldn’t matter if she were the daughter of an official or an orphan; I would still want to marry her.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Do you mean you don’t like her?\" Huiyin asked.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"As a sister and family member, I do like her. After all, we grew up together. Later, when I joined Uncle Wei Wang, they followed me without hesitation, and I am very grateful for that. But when it comes to marriage, I haven’t considered her. She is good, being my grandmother’s great-niece, but just because someone is good doesn’t mean I like them.\" Li Cheng made his point clear.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">In fact, Li Cheng was being quite tactful. When Xun Rou was younger, she had often shown affection towards him. That was why he specifically built a residence in Xuzhou, preferring not to return to Jianye.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Even Grand Dowager Wu had sent him nourishing soups, thrown handkerchiefs, and deliberately made eye contact, using every possible means.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin was satisfied by his explanation: \"I’m really glad you think this way. There was once a man who claimed to be smitten with me at first sight, threatening to die if I didn’t marry him. My father was almost moved, saying he was a fine young man with a good family background, but I just couldn’t stand the idea of marrying someone I didn’t like, no matter how much they threatened me.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Li Cheng hadn’t expected that two people who hated being coerced into arrangements would end up married, and even in a blind marriage. The more he thought about it, the more incredible it seemed.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">With the misunderstanding cleared, the slight irritation in Huiyin’s heart dissipated. She offered a way out: \"This year is my first as a bride, and I haven’t sent any gifts to my natal home for the festival. I’ll prepare them along with the New Year’s gifts.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Li Cheng smiled: \"Good, send a gift to your sister in the Eastern Palace as well, and to your brother.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">As the saying goes, lovebirds entwined, how blissful.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">On the other side, Zheng Deyin had just received the emperor's favor. This time, the Crown Prince entrusted her with organizing the Mid-Autumn Festival banquet at the Eastern Palace, and she was determined to showcase her best skills, unwilling to be looked down upon.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">However, she felt guilty towards Crown Princess Lu Xiao, so while lying in bed with Li Hang, she could not help but say, \"Today, the embroidery bureau made a beautiful rose-colored dress. I thought it would suit the Crown Princess well, so I sent it to her. Tomorrow, although I will be in charge of the arrangements, I am also serving the Crown Princess. I only wish for the Crown Prince and the Crown Princess to have a grandchild soon, which would make me very happy.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">These words were, of course, insincere. Li Hang, who grew up in the palace, understood these tactics well. Zheng Deyin often used this approach to gain power while still appearing virtuous.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">But Li Hang still praised her, saying, \"Your thoughts are commendable, but I only want to have children with you.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Zheng Deyin blushed coyly, \"Your Highness, if others heard such words, it wouldn't be proper.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"What did they hear?\" Li Hang teased, but he found Zheng Deyin too stiff in bed, losing his interest. However, thinking about the need to incite conflict between the Zheng family and the Lu family, he decided to continue. He spoke about the frustrations in court, and when Zheng Deyin heard that the Crown Prince was being controlled by Lu Wei, she felt secretly saddened.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">The next day, when Elder Madame Xu came to pay respects, Zheng Deyin confided in her, \"The Crown Prince is now feeling frustrated and unfulfilled, but he treats me very well. Grandmother, could you ask Father to help the Crown Prince?\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Elder Madame Xu stroked her hand, \"Does the Crown Prince really treat you well?\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">\"Yes, the Crown Prince has visited the harem for over twenty days in the past month, and twenty of those days were spent here with me. He treats the Crown Princess indifferently, and even because of Lu Wei, he once hit the Crown Princess. But the Crown Princess is fierce and slapped the Crown Prince back.\" Zheng Deyin shuddered at the memory.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Hearing this, Elder Madame Xu hesitated for a moment before nodding, \"Alright, I will try to persuade your father, but Lu Wei's influence is deeply rooted and not easy to deal with.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Zheng Deyin sighed, \"If I had a mother and younger brother, I wouldn't have to trouble you, Grandmother, at your advanced age. This is my filial impiety.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Elder Madame Xu shared the same thoughts. Zheng Fang had no brothers and came from a humble background. His most trusted person was Pei Shuo, the eldest son of Madame Ji, but would he be willing to risk everything for her?</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">While Zheng Deyin was privately worried, Huizhen was happily preparing for the festival. No matter what, she needed to have a child first. Whether a daughter or a son, she needed to have one, otherwise, her family would not be foolish. If her father were to use so many troops to help her, he would first need to feel that it was worth it.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">How could it be worth it? For example, if she had no sons, helping her husband would be in vain, as her husband might favor another woman's son.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Her father, after all, was a powerful lord, commanding troops in Ji Province. How could he easily mobilize his forces?</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">The table was filled with snacks, dried fruits, fresh fruits, mooncakes, and more. Huiyin raised her cup and offered a toast to Li Cheng. \"As the saying goes, 'When the flowers are in full bloom and the moon is round, people come together.' We've finally been reunited as a couple, and it's definitely worth celebrating.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Li Cheng raised his cup and clinked it against hers. \"Princess, please.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">They drank their wine in one gulp. Today, Li Cheng had specifically invited all his subordinates who hadn't returned home yet. Understanding the situation, Huiyin politely excused herself. \"I'll take my leave now.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Li Cheng was very satisfied with her for this. She had no excessive curiosity and handled situations with great propriety.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">He continued to entertain the various generals. These men were brothers who had gone through life and death with him. To put it bluntly, they were people who would lay down their lives for him. As the saying goes, brothers are like limbs, women are like clothes. He naturally had to keep them on his side.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">But despite thinking this way, he felt a twinge of guilt when he thought of his wife.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">After a few rounds of drinks, the soldiers tactfully excused themselves, as they needed to set off early the next day.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Li Cheng was slightly tipsy. As he walked inside the second gate, the young servants dispersed. Men were not allowed to move around freely inside the second gate, so Li Cheng walked ahead by himself.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">As he passed the rock garden, he was surprised to see someone emerge from the shadows. Under the bright moonlight, he squinted and recognized Xun Rou.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Xun Rou had been waiting there for a long time. The lingering summer heat was still warm, but the night air had grown cool after a while.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"Cousin...\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">\"What are you doing here, cousin?\" Li Cheng asked, turning to face her.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Xun Rou was on the verge of tears. \"Are you sending me away because of what your wife said? Think about it—how have I treated you all these years, cousin? My grandmother has already betrothed me to you. I consider you my husband. Everyone in Jianye knows this, so I traveled hundreds of miles to be with you. Are you really going to turn your back on me? I am willing to be a secondary consort and serve you and your wife.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">She realized that becoming the primary consort was no longer an option. Though she arrived later, her seductive charm and cunning made her a formidable opponent. </p><p id=\"paragraph-44\" data-paragraph-id=\"44\">She had actually arranged some auspicious carp in the lake today to create an auspicious sign, but it was ruined by her. This woman was far from ordinary.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Given the circumstances, she might as well ask for the position of secondary consort.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Li Cheng lowered his gaze. \"Cousin, how can I let you be a secondary consort...\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">\"Why not? The whole world knows I am already your woman. What face do I have to marry someone else?\" Xun Rou wiped her tears with a handkerchief.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Li Cheng stepped back and pointed at her. \"Make yourself clear. You were only taken in because you sought refuge at my home. My grandmother pitied you and decided to keep you. What do you mean by saying the whole world knows you are my woman? For the past few years, I've been either in mourning or at war. When have we ever had any real interaction?\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Xun Rou was taken aback and then said, \"Before the princess passed away, I copied scriptures with my blood and used my flesh as medicine. Surely you can't deny that, cousin?\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">\"Your father's official position, your mother's tomb, and the debts your Xun family owes, weren't these all repaid by me? Moreover, I never asked you to copy scriptures with your blood or use your flesh as medicine. No proper doctor would say such things. I even advised you not to do these things as they are completely useless. If you had really listened to me, why didn't you try to stop my grandmother from inviting those charlatans?\" Li Cheng was the type to argue until he won, even if it took all day and night.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">He loved Wang Chong, who was a well-known atheist.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">He didn't believe in any of this.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Xun Rou had never known that this was what Li Cheng truly thought. She tilted her head in disbelief. \"Cousin, how can you say this about me? I did it all for your mother. I even managed your estate...\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"Don't even talk about managing my estate. The people you sent over charged me sixty times the market price for eggs and inflated the cost of salt by tenfold. That's not managing an estate—that's being a leech. I am the only legitimate master of our commandery prince's mansion. How is it that the more money was used, the more there seemed to be?\" Li Cheng's temper also flared up.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Xun Rou had followed the habits of when the Princess of Wu was alive. When the Princess of Wu was alive, she didn't expose them. Moreover, since she was managing the estate, she also needed to keep the people under the Princess of Wu's command happy and give them some benefits so that they would praise her.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">But she couldn't change things on her own, especially since she wasn't the legitimate princess.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">But Li Cheng seemed ungrateful, and it made her angry. \"Cousin, I did it all for you. How can you say this to me?\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">...</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Just as Huiyin finished bathing and changing, she heard someone outside shout, \"Young Princess, something's wrong! The Little Prince and Miss Xun are arguing.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">What the heck? Who knew a man and a woman could argue so intensely?</p><p id=\"paragraph-61\" data-paragraph-id=\"61\"></p>\n</div>"
  },
  {
    "number": 19,
    "title": "Chapter 19",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 19</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Advancing by Retreating◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Huiyin quickly wrapped herself in a jade-colored long vest and rushed over. Even from this distance, she could hear Li Cheng saying, \"I never realized you were so eloquent. Why does everything you do end up being our responsibility?\"</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">\"My lord, the night is chilly. Why are you still out here? We need to leave for Huai and Si early tomorrow morning,\" Huiyin called from a distance.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Li Cheng hurried over and, seeing that Huiyin had let her hair down and was lightly dressed, immediately wrapped his arms around her. \"Let’s go back inside,\" he said.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Uncharacteristically, she didn’t ask any more questions, while Li Cheng was lost in thought. People often praised him for his grace and broad-mindedness, but in truth, he wasn’t always like that. He had originally intended to assist the court after inheriting the throne, but after witnessing Lü Wei’s treacherous behavior, he realized Lü wasn’t someone who could achieve anything significant. So, he joined the Prince of Wei. Despite his youth, he had already earned considerable merit. The Prince of Wei had his trusted generals and a close circle of confidants, including his maternal uncles and brothers. Li Cheng could only bide his time and endure.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Today’s argument with Xun Rou made him realize that his youthful impatience hadn’t changed.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Through the thin gauze of her garment, he could feel the softness of her shoulders.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Back in the room, Huiyin yawned and, noticing he was still lost in thought, said, \"You’ll leave tomorrow and leave me to deal with her. You know I’m not exactly tactful.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">When it came to social skills, she admitted her sister De Yin was far better. De Yin was the type to be thorough and considerate, effortlessly blending in with others. Her ability to make friends seemed almost innate. On the other hand, Huiyin had always believed that mastering skills required solitude.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Those so-called social connections were like illusions. If you fell from grace, those who were once close would avoid you, fearing association.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">She never made grand promises or spoke of sisterhood to those who came with her as part of her dowry. Instead, she gave them real power, status, and generous rewards.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Li Cheng looked at Huiyin. \"You’re afraid of this? You seem quite talkative to me.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"That’s because you’re my husband, and I don’t hold anything back with you. But every time I meet a stranger, I have to mentally prepare myself,\" Huiyin admitted. She hadn’t always been so calculating; life had shaped her into this person.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">\"Fool. There’s nothing to deal with. Her heart is set on becoming the Princess of Huaiyin. Can’t you see that?\" Li Cheng suddenly poked her forehead.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">He only now realized that his wife was actually a paper tiger, having deceived him completely.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Huiyin generally didn’t want to truly harm her rivals. For example, in her past life, she and Lu Xiao didn’t have any deep-seated animosity. After Lu Xiao’s father died, Huiyin didn’t mock her; she only hoped that Lu Xiao would kill Li Heng to avenge him. If Huiyin became Empress Dowager in the future, she would certainly let Lu Xiao leave the palace to start a new life.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">As for Xun Rou, Huiyin looked at Li Cheng and said, \"She’s your cousin and has been staying at the mansion. I’ve heard that the Empress Dowager likes her very much. How could I not show her extra respect?\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">\"You understand me so well, able to clarify things with just a few words. Actually, I could have handled the situation yesterday, but I was just tired of it.\" Li Cheng knew that if he hadn’t spoken so harshly, Xun Rou would have continued to linger. Yes, it was common for him to casually take in a woman, but it was troublesome. A woman who uses premeditated notions of gratitude to emotionally manipulate you would bring endless trouble.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">It seemed that no matter what he said, Huiyin understood him. It wasn’t just superficial wifely obedience; she genuinely put herself in his shoes and thought from his perspective.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">That night, they didn’t share their usual intimacy. Instead, they slept separately, as if they had grown closer in a different way.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">The next morning, when the door opened, Xun Rou stood there gently and courteously. Her attitude toward Huiyin had become more respectful. \"Cousin, I’m here to apologize. Yesterday, I was too impatient and had a bit too much to drink, which led to a drunken outburst.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">In truth, Xun Rou’s methods weren’t particularly sophisticated, but she was someone who could be ruthless with herself. Yesterday, she was practically scolded by Li Cheng, yet here she was, early in the morning, softening her stance.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">People who make harsh threats in anger are common, but those who can humble themselves after a fit of rage are truly formidable individuals.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Clearly, Li Cheng accepted her sincere apology. As the Prince of Huaiyin, although he usually treated people kindly, it didn’t mean he was entirely under anyone’s control.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Still, there wasn’t any deep-seated hatred between them. \"I’m leaving for Huai and Si today. While I’m away, follow your cousin's wife’s arrangements in everything.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Xun Rou smiled and said, \"As you wish, cousin. I will definitely listen to your wife.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Li Cheng couldn’t tell if she was being sincere, but his mouth felt bland, so he said to Huiyin, \"I feel like eating noodles.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">\"Why didn’t you say that yesterday? It’s too late to start kneading the dough now,\" Huiyin complained.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Li Cheng seemed to be in a better mood now that someone else was upset. \"I’ll wait a little longer. Go ahead.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Huiyin reluctantly asked someone to start preparing the dough, feeling somewhat annoyed by his behavior.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">As Huiyin left, Xun Rou quickly stepped in. The main hall was full of Huiyin’s attendants, and when they saw Xun Rou enter, they all thought she was boldly intruding.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Li Cheng hadn’t expected her to come in and furrowed his brow. Xun Rou quickly added, \"Cousin, please don’t misunderstand. I know you’ve never had feelings for me. But I was raised by Grand Dowager Wu, and you know how she is. If I don’t do this, I won’t have peace of mind in the future.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Grand Dowager Wu had never been favored, even in her youth. She followed her son to his fiefdom, but they were never close. Her chambers were often filled with green-eyed black cats. When Li Cheng was a child, seven or eight of these cats would swarm around him, which he found unsettling.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">To make matters worse, her temper was unpredictable, prone to sudden outbursts of hysteria.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Li Cheng understood how difficult her life had been and suggested what he thought was the best solution. \"If you want to leave the prince’s residence and return to the capital, I can help. After all, I was the one who recommended your father for his position, so he wouldn’t dare cross me.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Compared to Grand Dowager Wu, Xun Rou’s father was the rightful authority to decide her marriage.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Xun Rou shook her head. \"If my father were any good, I wouldn’t have run away. Cousin, all I ask is for a place to stay here. I won’t interfere with your relationship with Huiyin. I’ll just be a harmless figurehead, with no improper intentions toward you. All I need is the title of a secondary consort. I promise to stay out of your way. What do you say?\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\"></p>\n</div>"
  },
  {
    "number": 20,
    "title": "Chapter 20",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 20</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎A Step Ahead◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Fugui and Qiūfēng, who were both in the room, exchanged exasperated glances when they overheard Xun Rou and Li Cheng. Now she claims she only wants the title of secondary consort, but once she gets her foot in the door, she'll likely ask for much more.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">As women, we all know how these games are played.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Huiyin was in the kitchen, carefully making pulled noodles. She realized that Li Cheng was different from most people. He wasn’t easily swayed by moral pressure and could be quite stubborn, even competitive, when it came to proving a point. He was principled, youthful, and full of life—so genuine, so real.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">She realized she didn’t really know him as well as she thought.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">After cutting the dough into portions and folding several strands together, she began stretching the noodles, completely absorbed in her task. Over the past hour and a half, she thought about Xun Rou. To her, Xun Rou seemed vague, like the other women she had encountered who sought to climb the social ladder. But after reflecting on Xun Rou’s actions, she realized that Xun Rou wasn’t one to give up easily.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Even now, she hadn’t given up. Her persistence was such that a less resolute man would have likely succumbed to her advances by now.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">But Li Cheng had refused her not for personal reasons, but because he genuinely disliked her and the idea of being tied down in such a restrictive relationship.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">She personally brought the tray over, but Xun Rou was nowhere to be found.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"You’re such a troublemaker, making me go through all this just to make pulled noodles for you. I’m all hot and sweaty now,\" Huiyin sat down. She believed in returning favors. Over the past month in Xuzhou, Li Cheng had been responsive to almost all her requests.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Li Cheng showed her how much he enjoyed the noodles by finishing every last drop of the soup.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"The noodles are delicious, and the soup is amazing,\" he said.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Huiyin started, \"About Xun Rou...\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">But before she could continue, a personal guard came to urge him to leave. Li Cheng hurried off, not even able to say another word.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Fugui, looking a bit embarrassed, said, \"I only overheard Miss Xun say that she only wanted the title of secondary consort and nothing else. After that, they went into the inner room, and I couldn’t hear what they said.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">\"It’s fine. I understand,\" Huiyin nodded.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">She continued to treat Xun Rou the same as always.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">A few days after the Mid-Autumn Festival, she received gifts from Jianye, with the Prince of Wei sending the most generous ones. Not only did he send festival gifts, but he also sent gold and clothing.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">The Prince of Wei clearly held his nephew in high regard. This time, he even sent her gifts, including exquisite kingfisher feather jewelry, pearls, gold, and jade. The mansion had specialized craftsmen for making jewelry, so Huiyin took half of the materials and had them craft accessories. These gold and jade items, which she had once found vulgar as a child, now delighted her, exuding an air of opulence.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Since Li Cheng left, Xun Rou had also begun to keep to herself, rarely seeing even He Niangzi.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"Yun Hui, please take Xun Gu Niang her monthly allowance. This pair of earrings is a gift from me. Also, autumn is approaching. The seasons in Xuzhou are distinct, and the seamstresses will soon be making clothes. They’ll be looking for her in the next few days,\" Huiyin said. She wouldn’t write to ask Li Cheng about what happened that day. Xun Rou certainly wouldn’t tell her, so she had Yun Hui try her luck. After all, Yun Hui’s expression had been different the last time she mentioned Xun Rou.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Yun Hui followed Huiyin’s instructions without hesitation and quickly went to see Xun Rou.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">At that moment, Xun Rou was practicing calligraphy. Her handwriting was exquisite, and she could even write with both hands. She recalled that her cousin had once praised her skill.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Looking up, she saw Yun Hui enter and offered a faint smile.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"You’re here. Are you here to watch my downfall? Let me tell you, you won’t get the chance.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Yun Hui placed the tray down formally. \"I’ve come on behalf of the young princess. This is your monthly allowance, and these earrings are a gift from her...\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Xun Rou raised an eyebrow. \"Are you mocking me for having to rely on her for money while living under her roof?\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">\"Miss Xun, you’re misunderstanding me. You are the mistress, and I am just a servant following the young princess’s orders,\" Yun Hui said, her expression unchanged.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Xun Rou smiled and said, \"There's no need to put on an act with me. I'm afraid the only one who doesn't know about your little schemes is my cousin. He is a man of deep feelings and righteousness, treating everyone around him well. But if he were to find out what you've been up to, how would he look at you?\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Yun Hui remained calm, \"This servant does not understand what you mean.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"You know very well.\" Xun Rou wanted to expose her, but thinking that Princess Zheng also disliked her, why should she help reveal her secrets? She sneered coldly and stopped.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">After saying this, Yun Hui prepared to leave, her expression unchanged, but she curved her lips slightly as she walked out.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Soon it was September, and the weather began to turn cool, the climate pleasant. In Ji Province, snow might fall in October, but now it was sunny and bright. The gardeners had started cultivating new flowers, and Huizhao toured the gardens with her maids and servants. As the highest-ranking person in Xu Prefecture, she did not need to go out for social engagements.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">She almost knew all the hundreds of people in the mansion, familiar with their roles, and could assign tasks normally, beginning to manage them.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"Mother Nan, you are my wet nurse; you must not be as you were in the Zheng family. I don't trust the people around here much,\" Huizhao reminded her.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Mother Nan nodded, \"Yes, yes. Mother used to have no guard up, being accustomed to life in the Zheng family. Now, I should try to help the young princess more.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">In fact, with the male head of Huaiyin Mansion away, the management was entirely entrusted to the female head, making Huizhao's life much easier than when she was in the Eastern Palace.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">After the two of them had walked some distance, Mother Nan asked, \"I noticed you seem to have let off Miss Xun? Yesterday, her maid went out, and you allowed it.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"Yes, what's there to talk about with someone who has already lost?\" Huizhao had already guessed most of it.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">If Xun Rou were truly chosen as the secondary consort, the young prince would not have failed to consult her. He might not love her, but he respected her position as the principal wife, at least for now.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Mother Nan, however, said, \"What if she's just pretending? Openly acting carefree, but secretly plotting something else?\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Huizhao laughed, \"What do I have to fear? If she becomes the secondary consort, it would be worse for her than it is now.\" A cousin, a guest, a member of the Xun family, was hard to deal with, but if she really became the secondary consort, she would be under the legitimate control of the princess.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">She was not Zheng Deyin, unable to handle even someone like Xun Rou, whom Li Cheng did not favor.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Huiyin is currently constrained by her position and hasn't fully secured her place yet, so she has to be patient. After all, she faced someone as dangerous as Dong Yuniang in her past life—why would she fear someone like Xun Rou?</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">However, she needs to show Li Cheng that she's being patient. For now, she can't act, and she's also waiting for the right moment to strike.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">\"Mom, just a little longer. Everything will become clear soon enough.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"Wait? Wait for what, exactly?\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Nanny Nan didn’t really understand what was going on. Despite being from Jizhou and having a reputation for being resourceful, she always felt out of her depth in front of the Princess.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Huiyin smiled and shook her head. Then, she sat down to write another letter to Li Cheng, describing the garden’s flower beds. She mentioned the Double Ninth Festival outing and how, thinking of him in Huai and Si, she used chrysanthemums from the garden to bake some flower cakes for him to enjoy. Knowing he didn’t drink alcohol while in the military, she decided not to send any wine.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">When Li Cheng returned to his tent, he found the flower cakes Huiyin had sent. They were translucent, not greasy, and tasted delightfully sweet.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">His life was actually quite fulfilling. As the only son of the King and Queen, he was pampered, especially by them. Yet, for some reason, he had always felt a deep sense of insecurity since childhood, as if everything could be taken away at any moment.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Now, with someone always thinking of him, he felt genuinely happy, even though he didn’t say it aloud. Especially since Princess Zheng knew how to keep things in balance. She only acted playful and affectionate in private, teasing him with shy words, but in public, she was always composed and proper. Her letters didn’t contain love poems, just a few simple words. But the fact that she thought of making flower cakes for him when she saw chrysanthemums showed how much she cared.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">But what could he send back to her?</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">About half a month later, Huiyin received an exquisitely crafted jewelry box inlaid with gold, enamel, and pearls. She was delighted. Like most women, she loved beautiful things, and she hadn’t expected Li Cheng to go to such lengths to send her this gift.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">When Xun Rou came to greet her, she noticed that Huiyin’s dressing table was nearly covered with jewelry, and a maid was holding a hairpin up to her head.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">\"Cousin-in-law, Miss Miao invited me to a poetry gathering today,\" Xun Rou said humbly.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Huiyin smiled and said, \"Go ahead. I’ll have the servants get the carriage ready for you. Just be careful.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Xun Rou nodded. \"Thank you, Cousin-in-law.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">She finished speaking and, supported by Meixiang, went out. Huiyin watched her departing figure and sneered coldly, \"A jumping clown who doesn't know when death approaches.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">The last time Xun Rou had pleaded with Li Cheng, she asked to stay in Huaiyin Mansion to avoid punishment by Grand Dowager Wu upon her return. She planned to go back during the New Year, demonstrating that she had truly done her best. If she couldn't become the secondary consort, it wasn't her fault, and the Grand Dowager wouldn't punish her. After a moment's thought, her cousin agreed. However, how could she really leave? Now, she was still scheming. First, she would occupy Huiyin with external matters, making her a laughingstock, and then step in at a critical moment.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Sure enough, after Xun Rou left this time, Lady Miao came to Huiyin, saying that with refugees running rampant, she wanted to ask how Huaiyin Mansion planned to settle them and whether the local wealthy families should help.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Huiyin smiled and said, \"Isn't this matter still under the jurisdiction of the prefect and county magistrate? Why are they asking us women to handle it?\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Lady Miao often flattered Huiyin and, feeling close to her, sincerely said, \"I'm thinking of your reputation. The Prince of Huaiyin has just arrived in Xuzhou and is in the process of winning people's hearts. If you take the lead, it will be good for both your reputation and the mansion's.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">\"What you said makes sense, but I'm pregnant now and afraid I can't exert myself. How about this: I'll have my cousin, Miss Xun, go on our behalf, so the local wealthy families in Xuzhou can see how capable she is. You don't know this, but the Grand Dowager has entrusted me and the Little Prince to help her find a good husband for Miss Xun.\" Huiyin said with a smile.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Her health was good, and Li Cheng hadn't given her any cold medicine like that villain Li Heng had done. She was already three months pregnant and had stabilized the fetus. Yesterday, she had already sent a letter to Li Cheng, mentioning that she was pregnant and probably couldn't take care of Xun Rou.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Lady Miao quickly congratulated her, \"I didn't expect the young princess to be pregnant. Yes, how could we trouble you? We'll handle it ourselves and consider it good fortune for the future heir.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">\"Alright, then when you succeed, I'll have Miss Xun go on my behalf,\" Huiyin said with a smile.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Lady Miao immediately nodded and thought about what valuable items she should gather to send over, aiming to be the first to offer congratulations at the young princess's door.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Naturally, since this idea came from Xun Rou, she also informed Xun Rou about it.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Xun Rou's heart tightened. \"You mean my cousin-in-law is pregnant?\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Lady Miao smiled, \"Indeed, I think the young princess is very fortunate to conceive just three months after marriage. However, she also has plans for you. She said that when the refugee settlement is successfully handled, she will have you go on her behalf.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Xun Rou broke out in a cold sweat. These days, besides visiting the Miao family, she had been in contact with the old subordinates of Grand Dowager Wu, meticulously planning to incite refugees to cause trouble and destruction on the day the settlement was completed. The money had already been paid. She had been worried that Huiyin wouldn't participate and had deliberately let Lady Miao and others plan first, intending to let Huiyin take the lead.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Now that Huiyin was quietly pregnant and wanted her to go on her behalf, as soon as Lady Miao left, she called Meixiang. \"Take my personal token and stop our people from carrying out the plan.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">If she went, of course, no one should offend her, or all the blame would fall on her.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Meixiang immediately prepared to go out but couldn't even leave the courtyard. She hurried back and said, \"Miss, it's not good. The guards at the gate said the young princess ordered them not to let anyone out, fearing that villains might cause trouble because she is pregnant.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Xun Rou almost fainted, realizing that Huiyin was indeed more clever than she had thought.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\"></p>\n</div>"
  }
]