[
  {
    "number": 31,
    "title": "Chapter 31",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 31</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Two Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">During the beginning of autumn, the mornings and evenings carried a cool, refreshing breeze. Looking out, several large and small boats were docked by the shore, arranged like a dense chessboard, orderly and distinct. The adults wore expressions of parting sorrow, but for a baby just over three months old, it was the first outing, and he smiled silently in his swaddling clothes.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">As Huiyin helped Li Cheng adjust his collar to hide the hickey, she glanced at Yin Liyi in the distance and whispered, \"Then I'll leave with Jing'er first. You take care of yourself. Now that the Crown Prince has injured Lord Xie with a poisoned arrow, if he really can't hold on, you might have to lead the troops there. Make sure to wear your armor properly.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Li Cheng's eyes followed her, filled with reluctance.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"Go back,\" Huiyin said, waving at him with the baby in her arms.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">In the distance, Yin Liyi was also preparing to board the ship. It was said that she had insisted on going to the frontline to care for the wounded, but Li Cheng, fearing the loss of Qingzhou and the potential impact on Xuzhou, had her return to Jianye with Huiyin.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Knowing she couldn't go to Qingzhou, Yin Liyi looked disappointed.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Xue Huanhuan advised, \"After you return to Jianye, at least take care of your daughter first. Once Lord Xie recovers, won't there be opportunities for you to reunite?\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Reluctantly, Yin Liyi boarded the same ship back with Huiyin.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">This trip to Jianye saw almost all of Huiyin's dowry packed, except for the heavier items. There were also many assets she and Li Cheng had saved, which Li Cheng had her bring back. It took three boats just for these items, not including the additional boat for their daily living.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">The best and largest cabin was, of course, occupied by Huiyin and her child. As a result, Yin Liyi's cabin was exposed to the afternoon sun.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Less than an hour into the journey, with the sun out, Yin Liyi found it unbearable. Her maid, Qiao Zhen, remarked, \"This is too much sun. I wonder how the mansion arranged this. Should I speak to the young princess about this? It's quite unreasonable.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"Don't bother. It's too much trouble to switch cabins. Didn't you hear what they said earlier? They claimed the western cabin was larger and we had more people, so it's best to stay here. What can I say?\" Yin Liyi felt she wanted to befriend Li Cheng's wife. Even if they couldn't be close friends, there was no need for petty tricks, yet Princess Zheng seemed to be playing these small games. In Li Cheng's presence, she acted as if she had done everything possible for Yin Liyi, only to target her once on board.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">In reality, Huiyin didn't have these thoughts. As the Princess of Huaiyin, she naturally deserved the best cabin. It was her rightful place. Yin Liyi was just being brought back as a convenience. Even if her elder sister was Consort Yin Liyi, so what? Returning to Jianye, if she showed weakness, she could be manipulated by the Grand Dowager Wei, the Grand Dowager Wu, or even Princess Wei.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Without firmness, how could one truly show kindness?</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Moreover, she wasn't targeting Yin Liyi; she was just handling things officially.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Is being polite now considered targeting?</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Nanny Nan relayed what the servants stationed in the west had said to Huiyin, who frowned and remarked, \"I thought she would ride to Qingzhou or find someone to take her there, but no, she's quietly returning to Jianye. What's her problem with me? If she's unhappy, why did she board my ship?\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"I said the same. I didn't realize that Yun Hui had been given to Li Cheng by Prince Wu, intended to be his concubine. Once I found out, I kept an eye on Yun Hui and discovered many issues.\" Nanny Nan had been cautious about Yun Hui ever since.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Huiyin gestured for her to stop. \"Let's not be paranoid. I've left my two dowry servants to manage the household and Fugui to guard the home. What could they possibly do?\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Nanny Nan smiled. \"If it's just about power struggles, it's minor. But if it's about the little prince...\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"If he can be so easily taken away, then he's not worth my true affection,\" Huiyin said philosophically.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Romantic relationships form only a small part of one's life, like a small flame. People live with other emotions, and even without emotions, there's still oneself.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Nanny Nan felt relieved, seeing that Huiyin had everything under control.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">On the ship, Huiyin had more time to spend with Jing'er. However, many of her northern attendants were seasick and nauseous, some for the first time. Upon learning this, Yin Liyi had her maid, Qiao Zhen, prepare an acidic fish dish to help alleviate the nausea, which helped many feel better.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Huiyin had someone invite Yin Liyi over to thank her. \"I'm truly grateful. Many of us northerners are prone to seasickness, and I didn't know what to do.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"It's nothing. No need to mention it,\" Yin Liyi said with a smile.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">\"We can't just overlook it. Many would have stood by and done nothing. You're a kind-hearted person, as everyone knows,\" Huiyin said.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Yin Liyi didn't like Huiyin, not because Huiyin had done anything to her, but because they didn't get along personality-wise. She saw herself as someone who stood up for others, passionate and righteous, while Huiyin was calculating and shrewd.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"I won't accept the candied fruits and dried nuts Huiyin gave me,\" Yin Liyi firmly refused. \"I already have some with me.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">\"Then I won't insist, so you won't feel pressured to finish them,\" Huiyin said.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">After Yin Liyi left, Huiyin asked Nanny Nan to inform the kitchen to prepare more of Yin Liyi's favorite dishes as a way to return the favor.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">From that day on, Yin Liyi received an extra bowl of tonic soup each day—sometimes stewed chicken with fish maw, other times ice sugar bird's nest porridge, or even old hen ginseng soup. Unable to consume these tonics herself, she let her attendants have them instead.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"Are you worried about Master Xie? In my opinion, he's been through many battles and will surely be okay,\" Qiaozhen said.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"How can he be okay after being hit by a poisoned arrow?\" Yin Liyi was very upset.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">But Qiaozhen replied, \"Madam, don't worry. With the help of the Little Prince, it will be like adding wings to a tiger. The Little Prince promised to help Master Xie.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Yin Liyi pressed her lips together. \"It was easier to talk about this before. I know the Little Prince well—his words may be sharp, but he is very loyal. But now, he lets Princess Zheng drive away so many of the old servants from the mansion, even He Guanshi, who used to cook delicious food for us, and Zhong Guanshi, who had a loud voice but a good heart. Do you really think he hasn't changed?\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"Indeed, why does the Little Prince listen to Princess Zheng so much?\" Qiaozhen couldn't understand.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Yin Liyi shook her head. \"Perhaps it's because of the Zheng family's influence. If the Little Prince offends Princess Zheng and Jizhou joins the war, the consequences could be serious.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">After a journey of just two or three days, they arrived in Jianye. Surprisingly, no one came to receive them at the dock. Huiyin already expected this. She called for the steward and said, \"Go to Grand Dowager Wu's place to pay our respects. If she is not available, find the mansion's steward to help us transport our things.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Yin Liyi couldn't wait. She had only seven or eight boxes, which her servants could carry off the ship.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Huiyin didn't try to keep her. \"We have a lot of things, so I'll wait for our people to arrive before leaving. In these turbulent times, I won't keep you here. We'll talk next time.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Don't worry about me. I'm very familiar with Jianye,\" Yin Liyi said hurriedly before leaving.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Jianye, another new place. Watching Yin Liyi's departing figure, Huiyin suddenly thought of something. Currently, Yin Liyi is still like this because Xie Jiuyi was only wounded by a poisoned arrow. But what if Xie Jiuyi didn't make it? Though it's not right to think this way about someone, if that happens, what will become of Yin Liyi?</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">The steward hadn't returned even after half an hour, and Nanny Nan became anxious. \"This is too much. They asked us to come, but now no one is here to receive us. This is bullying.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Huiyin smiled. \"It's fine. Tell the boatmen that if no one comes to receive us, we'll turn the ship back. I understand that Grand Dowager Wu probably can't arrange for us properly. I get it.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">You can't worry about everything. Originally, she never wanted to leave Li Cheng, and now it feels even more important.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Before the news could spread for more than forty-five minutes, someone finally came. It was Nanny Fan, who had been sent by the mansion. Nanny Fan quickly greeted them and explained that Grand Dowager Wu was listening to a play at Wei Imperial Consort's place today.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">The lives of the grand dowagers consisted of listening to plays, playing cards, eating, and drinking. After the death of the Prince of Wu, these expenses were covered by Li Cheng. These elders were very cautious with their money and rarely spent it.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Huiyin smiled. \"I was afraid of disturbing the grand dowagers. You don't know how much our Little Prince can't bear to part with the heir. I had no choice.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Nanny Fan thought that if they had brought Princess Zheng to Jianye earlier, things might have been different. Now that she had given birth to a son and established herself, she had the confidence to challenge others.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">The alleys in Jianye were numerous, unlike the wide roads in the north where horses were commonly used. Here, mules were the majority, and even the horses used were mostly slow ones. Huiyin said to Nanny Nan, \"Arrange the ceremonial procession, but not the full set. Half will do.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Nanny Nan went to carry out her orders. Huiyin then said to Nanny Fan, \"Nanny, later you'll ride with me in the carriage, and tell me about the local customs and culture of Jianye.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">\"Yes,\" Nanny Fan thought that this young princess certainly had quite the grandeur, enough to drive Xun Rou away.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">As someone who worked under Grand Dowager Wu, Nanny Fan was quite wary of Princess Zheng. To her surprise, as soon as she got on the carriage, instead of the usual dignified presence, Princess Zheng graciously gave her a pair of embroidered pouches.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">\"Nanny Fan, I'm rewarding you with this. It must have been hard helping to take care of the grand dowager all these years. I'm not sure what to give you, so these pouches contain gold and silver ingots,\" Huiyin said with a smile as she handed them to her.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Nanny Fan was even more afraid that this was some scheme by Huiyin. She quickly said, \"Young Princess, one should not accept rewards without merit. If the grand dowager finds out that I accepted money from you, it won't be good. Serving you is my duty as a servant.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Huiyin smiled. \"There's no need to be so formal. It's been over a year since I last rewarded you during my wedding. A lot has changed in this past year. Our mansion now has a young heir, but I've never dealt with the grand dowager before. I'll need your guidance, Nanny.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">If it were any other young daughter-in-law trying to curry favor like this, Nanny Fan wouldn't think much of it. Even if she took the money without doing anything, no one would blame her. But Princess Zheng's money wasn't easy to take! Just the fact that she tolerated corrupt servants initially and then eliminated them all showed her methods.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Furthermore, she has the young prince in her care, and look how fair and chubby the young prince is.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">However, Grand Dowager Wu is different. Her son has passed away, and her grandson and great-grandson may not necessarily listen to her.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Nanny Fan pretended to decline a few times but eventually accepted, saying, \"This old servant is filled with guilt.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">\"Don't mention these past matters anymore. Back then, you and I were just in different positions, but from now on, you can completely adapt to the situation, which is only natural for people.\" Huiyin said with a smile.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Nanny Fan feared that Huiyin was setting a trap, but hearing her tone now, she felt that Huiyin truly understood human nature. People, by nature, tend to be opportunistic. It's just that some say once unfaithful, forever untrustworthy, but Princess Zheng's stance was: \"If it's beneficial for me, I don't mind you siding with me, and if I fall out of favor, I won't blame you for siding with someone else.\" This showed her pragmatism and flexibility.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">\"This servant understands.\" Nanny Fan said.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Huiyin then looked ahead and saw that the child in the wet nurse's arms had shifted, so the nurse adjusted her position and handed the child to another wet nurse. Huiyin then said to Nanny Fan, \"As for me, it's fine, but these wet nurses need to feed the children, so there are dietary restrictions. I will have to trouble you with that.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">This matter was too small for Nanny Fan, and she immediately agreed.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">After that, Huiyin closed her eyes to rest and said nothing.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">The more Nanny Fan observed Huiyin, the more she felt that Huiyin was unfathomable, and she didn’t dare to speak too much. She occasionally thought about how although Grand Dowager Wu was still hale, she was already in her sixties. Even if she lived another ten or twenty years, her ability to manage affairs would decline with age. So when the young princess extended an olive branch, she was tempted, but she couldn’t show it yet.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Although the young princess spoke of adapting to the situation, if one changed too quickly, people would look down on you.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">If Xuzhou was a strategically important location for military forces, then Jianye was undoubtedly the most prosperous place in the world. Huiyin could hear the lively bustle of the city, a testament to its vibrant atmosphere. No wonder even Zheng Wuheng was captivated when he came to Jianye.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">In fact, the fiefdom of the Prince of Wu was also a good place, not inferior to Jianye. However, when the Prince of Wu was alive, he was weak, and the relationship between the Prince of Wu and the Prince of Wei was good. The Prince of Wu entrusted his estate to the Prince of Wei. Naturally, he had to, as the Prince of Wei was his recognized uncle, and maintaining harmony was important.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">On a daily basis, Grand Dowager Wu always kept company with Wei Imperial Consort, living in Zhaoming Palace, which was the former palace of the King of Yue from the previous dynasty and later became the Prince of Wei’s mansion.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Of course, the Prince of Wei also granted the Huaiyin Mansion to Li Cheng, but they had to go and pay their respects to the Prince of Wei and the imperial consorts before returning to their own mansion.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">The Prince of Wei’s mansion, though not necessarily a place of flourishing flowers, was towering and solemn.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">They got off the ceremonial carriage at the entrance and switched to sedan chairs to be carried inside. Upon reaching the second gate, they saw a group of servant women dressed in silk and satin approaching, all smiling and saying, \"The two imperial consorts and the princess have been waiting for you. They have been eagerly anticipating your arrival.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Huiyin smiled and said, \"I apologize for not coming sooner.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Walking through the passage, when they reached the third vermilion gate on the east side, Huiyin looked up and saw the plaque read \"Zhaoming Palace.\" She guessed this was where Wei Imperial Consort lived.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Two female officials came out to welcome Huiyin. They were dressed differently from the other palace maids. The maids usually wore side locks or hanging buns with green or red beizi, while the female officials were dressed like officials, in round-neck robes with black-winged hats. Huiyin had heard from Yin Liyi and Xue Huanhuan that they were both former female officials of Wei Imperial Consort.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">These women were likely from families of minor officials, though they were certainly not ordinary.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Huiyin nodded at the two female officials, her hands folded in front of her, her eyes straight ahead, with a faint smile on her lips as she followed them inside. After passing through the vermilion gate and two ceremonial gates, they saw a plaque that read \"Cining Ankang\" with powerful brushstrokes, which she suspected might be Li Cheng’s handwriting.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">It was said that five years ago, Li Cheng had helped manage the Prince of Wei’s mansion and did a good job, so it wouldn’t be surprising if the calligraphy was his.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">This was a place Li Cheng had been very familiar with, and the people living here were almost all Li Cheng’s family. The more familiar they were with Li Cheng and the better their impression of him, the more critical they would be of her.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Human relationships are often delicate and complex, just like her sister-in-law Xin Shi, who was both clever and adaptable, even she faced some initial criticism from her mother-in-law.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">After crossing the threshold and passing through the pearl curtains, she could see the women inside adorned with jewels and jade. A young female voice came from inside, \"Let the Princess of Huaiyin come in.\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">The maids standing on both sides immediately lifted the curtains, hooking them on silver hooks shaped like cranes, revealing the people behind them to Huiyin.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Sitting on the throne was a woman in her mid-forties who smiled at her. She wore a purple gauze robe, and one could imagine how beautiful she must have been in her youth.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">This was Wei Imperial Consort. Huiyin recognized everyone present. Although Grand Dowager Wu was over sixty, thin, and had large eyes that showed she took good care of herself, the deep vertical lines on her forehead revealed her bad temper.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">There was also the Princess of Wei, Huo Shi, the secondary consort of the Prince of Wei, Lady Yin, and the mother of the Princess of Wei, Grand Dowager Huo, among others.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">It's quite strange that Yin Liyi is quite beautiful, with an especially good figure, yet Yin secondary consort is quite ordinary. Although she had some beauty, she couldn’t compare to Yin Liyi at all. On the contrary, Wei Imperial Consort Huo was quite lovely and charming, her beauty radiating.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Just as Huiyin was evaluating them, they were also sizing her up. They saw that this woman from the Zheng family was tall, taller by a full head than the women of Jianye and Wu. She had a well-proportioned figure, her skin was smooth and lustrous, her beauty as bright as a peach blossom, and her demeanor proper.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Wei Imperial Consort said to Huiyin, “My old sister has been waiting for you for a long time. We know you’ve had a hard journey, and we hope you won’t blame us.”</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">“Imperial Consort, you’re being too polite. As soon as our prince received the letters from you and Grand Dowager Wu, he told me how heartbroken he was that he couldn’t serve by your knees. He sent me to come and serve you with Jing’er as soon as possible. Jing’er is three months old now and has been well on the journey,” Huiyin said with a smile and a bow.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">These were her elders, and she spoke with great propriety and humility, not showing any impatience.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Grand Dowager Wu was someone who wasn’t very likable in the palace when she was young. In fact, her appearance was quite good among the crowd, but she wasn’t favored. She only gave birth to the Prince of Wu and was promoted from Talent to Consort, but she remained a Consort and never advanced further.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">As soon as she saw Jing’er, she wouldn’t let go, leaving the wet nurses feeling awkward.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">However, Huiyin was afraid when she saw Grand Dowager Wu’s long nails. The women in the palace had a habit of growing their nails. On the one hand, it indicated long, elegant fingers, and on the other hand, it showed that the person was accustomed to a life of leisure.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Those nails were so long they could easily scratch the baby’s face, and any mother would be anxious.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">“This child is so cute, just like our Cheng’er was when he was young,” Grand Dowager Wu said, not letting go of her great-grandson.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Wei Imperial Consort smiled and said, “Sister, it’s better to leave the child to the wet nurse. The powder and rouge here are too strong for little children.”</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Wei Imperial Consort seemed to be helping Huiyin, who looked at her gratefully but didn’t really agree in her heart. If it weren’t for Wei Imperial Consort, she wouldn’t have had to return at all. The habits she had developed in the palace from her previous life made her distrust everyone’s words.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Obviously, Grand Dowager Wu was very reluctant, but Huiyin smiled and said, “Grandmother, your granddaughter-in-law will live in Jianye in the future and accompany you. You’ll be able to see the child every day.”</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Hearing this, Grand Dowager Wu lifted her eyelids slightly. Before she saw Jing’er, she was just angry at Zheng. Although she had never met her, she had heard about how Zheng had beaten her old servant to death and driven away her niece, all things that trampled on her dignity. She could only share these things with Wei Imperial Consort and asked her for help, hoping that bringing her great-grandson back would put Zheng under her control.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">In front of so many people, Grand Dowager Wu couldn’t just snatch her great-grandson away and could only smile faintly and say, “It’s good to hear that you have this intention.”</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Huiyin offered a small smile and could sense that the smile didn’t reach the older woman’s eyes.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Afterward, both Wei Imperial Consort and Grand Dowager Wu asked about Li Cheng’s situation, showing considerable concern. Huo, the Princess of Wei, explained from the side, “Li Cheng’s wife, both Imperial Consorts have watched Li Cheng grow up, so they care about him very much.”</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Huiyin smiled and said, “As the saying goes, a mother worries about her son for ninety-nine years out of a hundred. Isn’t that the truth? Our Little Prince usually follows orders to train troops in Huai and Si. He rarely comes back, and even when he does, he doesn’t stay long at home. Actually, I remember that the Little Prince brought my brother to pay respects to both Imperial Consorts and Uncle Wei Wang just a few months ago, didn’t he?”</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">It was as if they hadn’t seen each other for ten or eight years when it had only been a few months.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Grand Dowager Wu’s eyes suddenly became sharp. She felt that Huiyin’s personality wasn’t good and that she seemed a little disobedient.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">People in the deep palace, whether favored or not, lived very repressed lives, which made them suddenly become harsh and very sensitive. Just as Grand Dowager Wu heard this, she couldn’t help but say, “The weather is starting to turn cold. Have you prepared clothes and quilts for Xuzhou? Our Little Prince is usually quite picky about food, and when he came back last time, I saw that he had lost weight. I wonder how that happened?”</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Is that all she can throw at me?</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Huiyin smiled charmingly, “Our Little Prince dislikes extravagance and prefers simpler fare. I noticed that he is a bit picky, so I often cook for him. Whenever he comes back, I cook for him. This time when he came back, what he regretted most was not being able to eat my cooking. But I told him, what does it matter? The most important thing is to show filial respect here.”</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Grand Dowager Wu had intended to say that she hadn’t taken good care of Li Cheng, but now she seemed like the one who wasn’t considerate of her grandson. How dare she speak to me this way?</p><p id=\"paragraph-114\" data-paragraph-id=\"114\"></p>\n</div>"
  },
  {
    "number": 32,
    "title": "Chapter 32",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 32</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎First Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">It was Wei Imperial Consort who stepped in to smooth things over: \"The County Princess has only been married to the Little Prince for a year, and they are already as close as two peas in a pod, which shows how harmonious their marriage is.\"</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huiyin feigned shyness and casually lifted her delicate wrist to sip her tea. On her hand, she wore a pair of jadeite bracelets with exceptional clarity. These had been beloved items of the late Princess Zheng, who cherished them so much that she couldn’t bear to have them buried with her, leaving them to be given to the woman Li Cheng loved in the future.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Now, they were conspicuously worn by Huiyin.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">The Grand Dowager Wu didn’t notice, but the Wei Imperial Consort recognized them: \"This bracelet seems familiar, as if your mother-in-law wore it before? I heard it was to be passed down to the daughter-in-law.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Huiyin smiled faintly, as if unaware of the bracelet's value: \"The Little Prince gave it to me.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">The Wei Imperial Consort also felt that Huiyin was a bit arrogant. To be honest, Li Cheng was her junior among juniors, and Huiyin should be more humble and a bit flustered. Yet, she seemed to radiate joy, as if she was the center of everyone’s affection.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">When the situation became tense, the Princess of Wei stepped in and said, \"The play is ready, Your Highness.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Everyone then went to watch the performance.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin quickly walked beside the Grand Dowager Wu. She didn’t personally assist the Grand Dowager but spoke to the palace maids nearby: \"You must take good care of Her Highness.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">In truth, Huiyin had never quite understood the dynamics of royal in-laws. They weren’t like ordinary families. With the constraints of propriety, as long as they maintained appearances, it was sufficient. She wasn’t eyeing the Grand Dowager Wu’s possessions, so why was the Grand Dowager acting so defensive? Look at the Wei Imperial Consort; her handling of matters was much smoother. She even changed her form of address immediately.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"County Princess, since you have come from afar today, you may choose the plays,\" the Princess of Wei said with a smile, as she had someone bring the play list.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"Princess, you’re too kind. I don’t know much about these things and rarely watch plays at home. It’s better if you choose. I’ll be happy with anything,\" Huiyin declined sincerely. She really wasn’t aware of what was currently popular in Jianye.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Seeing that Huiyin’s refusal wasn’t feigned, the Princess of Wei asked the two Grand Dowagers to choose three plays instead.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">The titles of these plays were quite interesting. One was called *Tale of Taihei*, about two monarchs who prevented a disaster through music. Another was *Quarrel with Jin Zhi*, about princesses causing trouble in a school. The last one was *Zhaojun’s Departure to the Frontier*, which was well-known.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">During a break between plays, a beautiful palace maiden in court dress offered various fashionable snacks. Huiyin tried a piece of crispy pastry made of cream and honey, which was sweet with a refreshing honey flavor. It was quite delicious. She also enjoyed the grapes and cherry confiture, which were her favorites.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">The Grand Dowager Wu and the Wei Imperial Consort listened attentively, while the Princess of Wei and Huiyin followed the elders. When Huiyin went to relieve herself, she inquired about the palace maiden from others. A maid said, \"That is Consort Xu, the most beloved concubine of the Prince of Wei.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">It turned out to be the favorite concubine of the Prince of Wei. Huiyin also overheard the maids' titles. The Prince of Wei was called the Great King, while Li Cheng, being a prince of a lower rank, was called the Little King.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Some also said that Consort Xu was the foremost among the Prince’s concubines and had given birth to the second prince. Despite being older than Consort Yin, her status was significantly higher. However, when Huiyin looked at the Prince of Wei’s eldest and second sons, the eldest, though only six or seven years old, was gentle and refined, while the second son seemed a bit naive and mischievous.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">This was completely different from what Li Cheng had told her. Perhaps the situation in the Prince of Wei’s household had changed entirely over the years. The Princess of Wei had given birth to a daughter, and Consort Yin might have been favored at first, but now it was Consort Xu who was more favored.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">After all, Li Cheng had been away from the Prince of Wei for three years.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">The plays continued on stage, and Huiyin, having relieved herself, felt much more relaxed.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">After the performances, everyone returned to their seats for the meal. The top table was for the Grand Dowager Wu and the Wei Imperial Consort. The left table was for the Princess of Wei alone, and the right table was for Huiyin alone. The secondary left table seated the Prince of Wei’s two concubines who had borne sons, Consort Xu and Consort Yin, while the secondary right table seated the Princess of Wei’s eldest daughter and the Prince of Wei’s two sons.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Huiyin could easily see the concubines’ table. Although Consort Yin was not as beautiful as Consort Xu, she had an air of dignity and determination, showing that she was a woman of strong opinions. Consort Xu, on the other hand, appeared graceful and dignified but gave off a unique and delicate air.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">However, for now, none of this had much to do with her. After the meal, she would accompany the Grand Dowager Wu back to the Huaiyin Mansion in Jianye.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">The Grand Dowager Wu had been holding in her frustration all day. She complained to Nanny Fan, \"I’ve never seen a daughter-in-law like her. She acts like she’s royalty herself.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Seeing her mistress complain, Nanny Fan had no choice but to agree: \"After all, she did give birth to the heir. Even in the Prince of Wei’s household, Consort Xu married the Prince of Wei at twenty-five. Compared to Consort Yin, who was younger and a virgin when she married the Prince of Wei, Consort Xu was a remarried woman. Yet both have sons and are established.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Nanny Fan’s point was simple. If in the past their relationship with Li Cheng was poor or they had no children, one might have reason to criticize. But now, one must accept the reality.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">However, the Grand Dowager Wu said, \"In that case, what do you think of me raising Jing'er by my side? She keeps boasting about her good relationship with the Little Prince. I’ll send her back to Xuzhou and keep Jing'er here.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"I’m afraid the young princess won’t agree.\" Nanny Fan felt that Grand Dowager Wu was being delusional. \"If you were a grandmother, it would make more sense. But as a great-grandmother, you’re several generations removed and too old to care for an infant.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Grand Dowager Wu smiled and said, \"Whether she agrees or not, there is no room for her to make decisions on my territory. Everyone in that mansion is my person.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">This was not Xuzhou; this was Jianye.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">It was also said that after the banquet at the Prince of Wei’s mansion, the Princess of Wei dismissed the guests. Yin Lifang, the Second Concubine, took her son, Li Jing, back to her own courtyard. Upon returning, she was informed, \"Lady Yin, Lady Xie came and waited for you for a long time. Seeing that the mansion was about to lock its gates, she left.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"What did she come for?\" Yin Lifang asked, puzzled.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"It seems to be related to Lord Xie’s affairs,\" the maidservant replied uncertainly.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Yin Lifang frowned. \"Lord Xie is fighting on the front lines. What could be so urgent? She must have come for something important. But today, the prince’s mansion is hosting the Princess of Huaiyin, so I couldn’t return. If she is really anxious, she will definitely come again tomorrow.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">The maidservant agreed repeatedly.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Indeed, Yin Liyi wanted to go to the front lines. Since returning to Jianye, she couldn’t bear to stay for a moment and only wished to see how her husband was faring now. If Li Cheng didn’t agree, she couldn’t mention their past connection in front of Princess Zheng. Moreover, Xuzhou also needed to support Qingzhou, and Li Cheng had many things to attend to. She wanted to request her sister to ask Prince Wei to send troops to escort her there.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">But today, it was said that the Prince of Wei’s mansion was hosting the Princess of Huaiyin’s mansion, and her sister had gone there, so she had to leave first.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">She wished she had gone with Princess Zheng.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">\"I really rushed only to miss out,\" Yin Liyi complained.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Madam, perhaps you shouldn’t go. On the front lines, swords and spears have no eyes...\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"The more I think about it, the more frightened I become. If it were just an ordinary injury, why would everyone be so prepared?\" Yin Liyi worried endlessly.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Qiaozhen instead said, \"Madam, your daughter is still at home. You haven’t seen her for a long time. You should take care of her first.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Early autumn, with its changing weather, was when people were most likely to catch a cold. After arriving in Jianye, Huiyin’s first task was to prepare the side room adjacent to her main chamber.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"Jianye feels very humid. Both wet nurses should take care of your health. If you feel any discomfort, be sure to speak up. Rest assured, once you recover, you will still be called to serve the heir,\" Huiyin said. She had been away from her child for a day and checked his body carefully, feeling his face to see if he had a fever and checking if his heartbeat was too fast.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Fearing the child might develop a rash, she changed his clothes and bedding. She always believed that a mother’s attentiveness was her children’s blessing.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">The Huaiyin Mansion in Jianye did not occupy as much space as the one in Xuzhou, and there was no horse racing track, but it was still a princely mansion of the highest standard. Her courtyard had fewer flowers and trees because Jianye’s weather was too humid, and with many trees, there were many insects. However, the front of the courtyard was paved with various rainflower pebbles. She had changed into a pair of soft-soled shoes to walk on them. It was a bit painful, but it felt strangely comfortable afterward.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Nanny Nan and the maids and servants who had followed her were either counting items in the storeroom or making beds. Huiyin had always believed in everyone performing their duties. If you were responsible for certain tasks and didn’t complete them properly, you had to compensate with money. Therefore, the servants didn’t dare to rely on the idea that the law wouldn’t punish everyone; they all had to be diligent and careful.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">This was originally Li Cheng’s courtyard, and some of the furnishings might still belong to the Prince of Wu’s mansion, with \"Wu\" engraved on the bottom. The courtyard was very clean, indicating that there were people specifically assigned to clean and maintain it, showing how much Grand Dowager Wu cared about Li Cheng’s affairs.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">The night passed in a haze.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Grand Dowager Wu, who slept lightly due to her age, got up, draped a vest over her shoulders, and walked to the dressing table. She opened a rosewood box containing a pair of gold-inlaid gem bracelets. The outer surface of the bracelets was decorated with gold filigree wrapped around a vine and grass pattern, and eight gold filigree mounts were embedded with rubies, sapphires, and dongling stones, looking extremely luxurious.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Nanny Fan was holding a lamp beside her. Although she was old and didn’t need to serve in the room, Grand Dowager Wu had questions for her that day, so she was allowed to rest on a couch in the room.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">This was Nanny Fan’s privilege. Originally, she had been sleeping on a mat on the floor in Grand Dowager Wu’s room.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"Dowager, these bracelets are truly precious,\" Nanny Fan agreed.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">A soft glow appeared on Grand Dowager Wu’s face. \"These were specially bestowed by the late emperor when I was carrying my child. At that time, I was honored. The eldest prince was sickly, but my son was born strong and healthy. I almost...\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Realizing she had slipped, she stopped speaking. \"I want to give these bracelets to Princess Zheng.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Nanny Fan widened her eyes. \"Aren’t these too valuable? Don’t you dislike her?\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">\"Wrong. With a child, one has everything. By bestowing these bracelets on her, I won’t cause her trouble and will make her lower her guard. If something happens to Li Cheng on the battlefield, I will have her go and serve him. She won’t be able to travel long distances with the child, so the child will stay with me. With the child here, I will regain my status.\" Grand Dowager Wu was not really foolish.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">The author has something to say:</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">There will be another update around 11 AM tomorrow.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\"></p>\n</div>"
  },
  {
    "number": 33,
    "title": "Chapter 33",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 33</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Second Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The next morning, Huiyin was dressed and ready before dawn broke and went alone to pay her respects to Grand Dowager Wu. She arrived with a long line of servants, disturbing the Grand Dowager Wu, who had just fallen asleep.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">The Grand Dowager Wu had a splitting headache. \"What's happening? It's still dark outside. Why is anyone here so early?\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Nanny Fan hurried out. Though she was elderly and suffering from back pain after a sleepless night, she had no choice but to go out. When she went out, she saw Huiyin smiling.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"Young Princess, the Grand Dowager Wu has a light sleep. It was hard for her to fall asleep. If she’s woken up, she may not be able to fall back asleep,\" said Nanny Fan.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Huiyin smiled. \"Then it's my fault. I was only thinking about the morning and evening greetings but didn't consider grandmother's daily routine. I’ll come later from now on, but could you let me know the best time to visit?\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Nanny Fan was in a dilemma. \"This servant doesn't know either.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">She hadn’t been serving in the room for some time, mostly managing things for the Grand Dowager Wu, offering advice, and keeping her company.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Huiyin looked at Nanny Fan and nodded slightly. \"Then I'll have to trouble you to ask. I like to do things by the book. Otherwise, if I come early every day and Grand Dowager Wu is resting, it wouldn't be good.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Nanny Fan had no choice but to agree.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Huiyin gracefully returned. Once she left, the Grand Dowager Wu was awake and couldn't really go back to sleep, but there wasn't much she could say. After all, she couldn't exempt Huiyin from the greetings. No, that wasn't possible. The morning and evening greetings were the rules for the younger generation.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">But did Huiyin really not understand? Of course, she did.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Because elder Madame Xu had once subjected Madame Ji to similar treatment. Madame Ji had said that when she was pregnant, she had to serve carefully. Even when she was sitting the month after childbirth, someone was sent to bring her son Wuheng to Madame Ji’s side. It wasn’t until elder Madame Xu fell ill that Madame Ji was finally able to regain custody of her son. Therefore, she had a deep dislike for elder Madame Xu.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">To handle someone like Grand Dowager Wu, you had to fight fire with fire.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">After returning from the Dowager's quarters, Huiyin had breakfast and then called over the housekeeper. \"Who is in charge of affairs in Huaiyin Mansion now?\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Soon, several older women came and knelt to pay their respects.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">\"I called you all here not for anything else. The prince asked me to bring the heir back. He is still young, and you all need to be cautious. If I find out that anyone is neglecting their duties, I will not let them off easily,\" Huiyin said. She used to think her tall figure made her stand out, but now, her tall and strong build made the women show fear when she stood up.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">This was Huaiyin Mansion, and she was the Princess of Huaiyin. Eventually, she would take back all the authority here.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">For now, she had to endure a little.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Jing'er woke up and vomited milk today. Huiyin had no mood to deal with the Grand Dowager Wu. If the child's vomiting wasn't carefully managed, it could easily lead to coughing and even lung problems. Children were very fragile.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"Why is he vomiting milk? Did you hold him improperly or feed him too quickly?\" Huiyin asked the two wet nurses.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Nurse Song quickly explained, \"The young prince ate in a hurry on the carriage yesterday, and it was hot...\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Huiyin sighed slightly. \"There's nothing to be done. His great-grandmother insisted on seeing him, and as descendants, we have to oblige. However, the child is too young. You all need to be more attentive. Today, I won't go out. I'll take care of him.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">She then took a cotton cloth to wipe the vomited milk from Jing'er's neck and mouth.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">No matter how good the wet nurses were, if the mistress was inattentive, they might slack off or cause trouble. If the mistress was meticulous and sharp, they wouldn’t dare to misbehave.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">It was like setting up a supervisory censor in the court. Without supervision, officials would be corrupt and act recklessly without anyone knowing.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Currently, the emperor was weak, and Empress He was greedy. These people were only concerned with consolidating power, ignoring the people’s welfare and failing to oversee the officials. No wonder there were uprisings and fragmentation everywhere now.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Nurse Song and Nurse Huang knew this young princess well. She truly understood children and took great care of them. Otherwise, despite the journey, Jing'er remained healthy and strong because of her attentiveness.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">As for the Grand Dowager Wu, she didn’t wake up until noon. After waking up, she heard that the young prince had vomited milk and was uncomfortable from the journey, with Princess Zheng taking care of the child.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"Isn't she putting me in an awkward position?\" Grand Dowager Wu thought to herself. But this thought only lingered for a moment. She still believed that Princess Zheng was making a fuss and didn't know how to take care of the child. Besides, young children were prone to illness and disaster.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Nanny Fan felt a chill in her heart for a moment. When her great-grandchild was unwell, the Empress Dowager actually blamed Princess Zheng. Regardless, Princess Zheng had always been a caring mother. In the past, Grand Dowager Wu at least put on a decent show, but now her thoughts were becoming increasingly narrow. To argue over trivial matters, she had lost her humanity.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">These masters always treated their servants like objects. But after all, everyone had emotions and desires, and were made of flesh and blood.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">After three days of Huiyin's care, Jing'er recovered. Many invitations were sent out, and it was mentioned that members of the Jiang family had sent gifts. Huiyin invited Jiang Bipbo to come and speak with her.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">When they met again, Jiang Bipbo's eyes were noticeably more determined. She smiled, \"I heard that you came to Jianye from Xuzhou. I was thinking of visiting you earlier, but I was afraid you needed time to rest after your journey, so I came a few days later to thank you.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Huiyin said, \"In the future, you don't need to bring gifts. I didn't stop you before because I wanted others to know we had contact. Now, I'll just call for you when I want to talk.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"These are not worth much. Since you acknowledged me and wrote a personal letter to the Prince of Wei, even if Hu Qi was furious, he wouldn't dare to come to your door easily.\" Jiang Bipbo hadn't expected the young princess to have such influence.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Huiyin waved her hand, \"There's no need to mention this. As long as I'm here, I'll definitely protect you.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Seeing Huiyin say this, Jiang Bipbo was deeply moved. The young princess had even given her two brand-new brocade clothes as a gesture of closeness. She wasn't after money; she helped because she wanted to.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Jiang Bipbo felt even closer and began to talk about the various restaurants, bookstores, and cloth shops in Jianye. She also mentioned that a silver coffer owned by her family was destroyed during the war in Qingzhou.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"You always seem to have the latest news,\" Huiyin asked. \"What's really going on in Qingzhou?\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Jiang Bipbo, who might not have shared such secrets with others, first looked around and, after Huiyin dismissed the servants, said, \"It looks like the Prince of Wei is going to lose. The crown prince's forces are fierce, and with Qingzhou being in the north, the major clans are aligning with the capital.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"I understand.\" The situation was the same as in her previous life. After this victory, Li Heng would be even kinder to her. It was also because of the temporary pacification of the Qingzhou rebellion that the Xuzhou battle happened two years later.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">As for Xie Jiuyi, she had no idea what had become of him.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Jiang Bipbo sat for a while longer before taking her leave.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Huiyin flipped through the invitations again, and one of them was for the birthday of the elder lady of the Huo family. She thought about it and decided to consult Grand Dowager Wu.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Grand Dowager Wu was reciting scriptures and, hearing that Huiyin had come, closed the book and came out with the help of a servant.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">\"Your granddaughter-in-law pays her respects to grandmother. Jing'er is much better today, and I trouble you to send inquiries.\" Huiyin bowed and greeted her. She thought about how, during the days when the child was spitting up milk, Grand Dowager Wu had blamed her for not taking care of him, never mind that it was she who had insisted on their return. But Huiyin endured this for now, appearing without resentment.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Grand Dowager Wu smiled, \"It's good that the child is well. You don't know how worried I've been these past few days, fasting and praying. It must have been the Buddha's blessing.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">How ironic. It was because of her meticulous care that the child had recovered, and now it was being credited to her.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">But Huiyin continued to smile, \"It's all thanks to you.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">This made Grand Dowager Wu feel much better. She had a plan in mind and had Nanny Fan bring over a box she had prepared to give to Huiyin.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Huiyin was surprised to see that the bracelets were indeed quite valuable.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"Grandmother, this... is too precious, I cannot accept it.\" Huiyin declined immediately.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Grand Dowager Wu thought that you have to give a little to get a little, and she insisted that Huiyin take them, saying, \"These were bestowed upon me by the late emperor when I was pregnant with your father-in-law. They are tribute from the Annam Kingdom. I give them to you now because you are Cheng'er's wife and the mother of the future heir.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Only then did Huiyin say, \"Then I thank you, grandmother.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">After putting away the gift, she brought up the main topic, \"The Huo family sent me an invitation for the elder lady's birthday. What do you think, grandmother? Should we go?\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Grand Dowager Wu, who had lived in the palace for a long time and rarely socialized, usually only talked with Wei Imperial Consort or played cards and listened to theater. Wei Imperial Consort still had grandchildren to dandle, and since the Prince of Wei was filial, her life was better than Grand Dowager Wu's.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">With her granddaughter-in-law present and the Huo family's invitation, Grand Dowager Wu glanced at Huiyin and said, \"Just send some gifts. There's no need to go in person.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">\"Grandmother, the elder lady of the Huo family is not an outsider. She is the mother of the Prince of Wei's aunt.\" Huiyin reminded her.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Grand Dowager Wu knew very well that back in the day, it was the Prince of Wei and the Prince of Wu who collaborated to occupy the Jiangnan region. After the Prince of Wu passed away, his descendants became vassals like Xie Jiuyi and the others, which was truly a pity.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Coincidentally, since Huiyin was right, Grand Dowager Wu felt increasingly irritable, but she found solace in the thought that it wasn’t she who needed to curry favor with the Huo family. With that, she felt relieved.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">\"Then go ahead.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Seeing that Grand Dowager Wu had no objections, Huiyin felt relieved. Noticing that Grand Dowager Wu did not indicate for her to leave, Huiyin chatted casually and asked, \"I heard from my sworn sister today that Lady Xie intends to go to Qingzhou. In such a war-torn place, she will need the Prince of Wei to send someone to escort her there. I wonder if the Prince of Wei will permit it?\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">When Grand Dowager Wu brought up this matter, she immediately thought of her own strategy and said, \"She means well. Since General Xie is unwell while away, having his wife personally go to care for him will surely speed up his recovery.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">She thought this way because she wanted Huiyin to follow suit. However, Huiyin replied, \"It’s indeed inappropriate. It’s a major taboo for a woman to enter a military camp so casually. General Xie is away, and he must be concerned about his parents and children. The mistress of the household should take care of the family, especially the elders and children, so he can recover faster without distractions. Besides, Lady Xie is not a divine healer. If she goes and is captured to threaten General Xie, it could be disastrous.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Grand Dowager Wu was once again left speechless. She regretted giving such a valuable bracelet. It was her gold-inlaid jewel!</p><p id=\"paragraph-67\" data-paragraph-id=\"67\"></p>\n</div>"
  },
  {
    "number": 34,
    "title": "Chapter 34",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 34</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Two Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Nanny Fan had always assumed that Huiyin was someone who loved to compete for power. However, unexpectedly, after she arrived in Jianye, she had been taking care of her child and rarely went out. The servants all said that the young princess consort had a calm demeanor and conducted herself with propriety. The courtyard was in perfect order. Even now, when she was going to the Huo family, she first sent someone to inquire about the travel arrangements and the gift list sent previously, and so on.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Because Grand Dowager Wu had inexplicably become angry again, she had been saying for the past few days that she would not go out. When Wei Imperial Consort sent someone to invite her over for a visit, she declined, citing poor health.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Nanny Fan brought in a few snacks and saw that Grand Dowager Wu looked gloomy. She forced a smile and said, \"The kitchen has made some new snacks, and I was asked to bring them for you to try.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Grand Dowager Wu said, \"I'm old and don't like eating these anymore. Besides, these tea-serving tasks should be done by the young girls. You don't need to do it yourself.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">But Nanny Fan knew that if she became complacent, she would lose her standing with Grand Dowager Wu. So she smiled and said, \"Serving you is my joy and duty. I wouldn't trust others to do it.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">This response pleased Grand Dowager Wu, who, despite saying she didn't want snacks, took half and put it in her mouth, complaining, \"There's too much sugar frosting, and it's not soft enough. I said last time not to use the osmanthus honey and cassia honey, but they went ahead and used cassia honey again.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Even though she nearly finished the plate, she still found fault and never acknowledged the good.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Nanny Fan said, \"I will reprimand them. This Mrs. Wang, who makes the snacks, is too incompetent.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">After Grand Dowager Wu finished her snacks and went back to her morning prayers, Nanny Fan left and saw Mrs. Wang looking very happy. She stopped her and asked, \"Why are you so cheerful? Did something good happen?\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"The young princess consort praised my snacks and rewarded me with a thousand coins. It's not about the money, but the princess consort is kind, and we suffer less reprimanding because of her.\" What Mrs. Wang meant was that Huiyin heard she had a daughter who couldn't do heavy work due to poor health and couldn't get a position in the mansion. The young princess consort said she needed a third-class maid, which made Mrs. Wang extremely happy.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">But she couldn't tell Nanny Fan this, as secrets are best kept silent.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Nanny Fan saw through the situation and, comparing the actions of Princess Zheng and Grand Dowager Wu, had a clear understanding. Although Grand Dowager Wu was the same as before, there had been no comparisons previously. The mansion only had one mistress, Grand Dowager Wu. But now, with the young princess consort here, it's no surprise she can easily win people over.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Grand Dowager Wu was more astute in her younger days, but now she was old and confused. Previously, there was Xun Rou, who was only in charge of accounts and demanded frightening amounts of silver.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Since they were visiting the Huo family, Huiyin naturally needed to prepare birthday gifts. The chief steward in Jianye was one of Grand Dowager Wu's long-time servants, though not technically a dowry attendant. It was clear without even looking that since Grand Dowager Wu's people had made a fortune in Xuzhou, they wouldn't be honest and upright in Jianye, and the corruption here might be even worse.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">But now wasn't the time to expose them. Everything required the right timing, location, and harmony.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">\"Is this the gift list from before? Why is it so thin?\" Huiyin frowned.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Steward Qian smiled and said, \"Originally, we sent gifts from Jianye to various places, but later the Little Prince said he would send them directly from Xuzhou, so we didn't...\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"I see, but now that I'm here, we'll send them from this side. For the Huo family's old lady's birthday, having only longevity noodles, longevity peaches, and a cane is not enough. Is there any 'Three Friends of Cold' silk in the storeroom? That is royal silk, and it would be very prestigious to use it as a gift.\" Huiyin said.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Steward Qian was in a difficult position and said, \"Young Princess Consort, it's not that I'm making excuses, but Grand Dowager Wu seemed to have given the royal silk to someone.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">This was insincere, as there was quite a lot of royal silk, and it wouldn't be given away casually.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Huiyin had no choice but to say, \"Then take it from my share. We can't appear too shabby. The Huo family is not an ordinary family. If the gifts are too meager, it will be a loss of face for Huaiyin Mansion.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">She asked Nanny Nan to open the western storeroom, where her dowry and the mansion's treasures were kept. They took not only the 'Three Friends of Cold' royal silk but also prepared a pair of green glass vases with purple floral patterns and a sandalwood base with a jasper Buddha's hand. Only then was Huiyin satisfied.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">In any case, in Jiang Bipbo's matter, Huo Qi refrained from causing trouble out of respect for her.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Sending heavier gifts was also about building goodwill. The Huo family wasn't just Huo Qi alone. Moreover, from a business perspective, the items Jiang Bipbo had sent over were already more valuable than these.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Seeing these birthday gifts, Steward Qian couldn't help but nod in approval. This truly showed the grandeur of a prince's mansion. If you have the means to impress, people will be more likely to support you, knowing you have the resources.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">After the birthday gifts were prepared, Huiyin finally breathed a sigh of relief.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Unfortunately, Yin Liyi came to visit. She really had an urgent matter and, upon seeing Huiyin, looked as if she had found a savior. \"Young Princess Consort, I really need to ask a favor of you. You must agree to help me.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">\"What is it? Why are you asking me for help?\" Huiyin was puzzled.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Yin Liyi continued, \"I intend to go to Qingzhou to take care of my husband, but the Prince of Wei said that while it's fine for me to go, the situation ahead is chaotic. If the travel permit is issued for Qingzhou and we are caught halfway, it could cause trouble. Therefore, we plan to take a detour and select Jizhou as our destination instead. Since you are the daughter of the Grand Commander of Jizhou, I have come to seek your help.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">It turned out that this was her plan. Yin Liyi was different from Jiang Bibo. Helping Jiang Bibo meant saving a life, but helping Yin Liyi now might lead to harm, and there could even be repercussions for herself.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"The journey to Qingzhou is long, and I would have difficulty going there myself, so how could I possibly help you? When I first married into the family, our wedding procession was almost ambushed,\" Huiyin declined politely.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Yin Liyi was not willing to give up. \"Little Princess, what I need is a personal letter from you.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"Lady Yin, how could my personal letter compare to one from the Prince of Wei? Even this year, I couldn't send gifts back home because of the war,\" Huiyin shook her head.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Yin Liyi found Huiyin difficult to persuade, while Huiyin thought that Yin Liyi was trying to push the risk onto her. If Yin Liyi used her name to go to Qingzhou and something happened, wouldn't that cause trouble for her?</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Seeing that Huiyin still disagreed, Yin Liyi had no choice but to go and pay her respects to the Grand Dowager Wu. Her request was simple: if the Little Princess couldn't help her, she would ask Li Cheng's men to escort her. The Prince of Wei said he could send someone to escort her, but he couldn't spare many people, and since the front was a military camp, he, as a prince, couldn't break military orders.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Thus, after paying her respects to the Grand Dowager Wu, Yin Liyi left resolutely.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Nanny Nan had never really liked Yin Liyi, and as soon as she left, she said, \"I've always thought she was a troublemaker. She couldn't get the prince's support, so now she's going to ask the Little Prince?\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Huiyin smiled. \"Then let her ask.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"But if something goes wrong on the journey, the Little Prince could be blamed,\" Nanny Nan explained.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Huiyin said coldly, \"That would be his problem. If he can't stay firm in the face of such a small issue, he's bound to stumble at every step in the future. Yin Liyi clearly acts impulsively, without much thought for the consequences. If she sent a skilled physician to the frontlines instead of going herself, it would be much better. Is she a doctor?\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Regardless of Yin Liyi's situation, after Huiyin dressed herself properly, she went to the Huo family to offer birthday congratulations.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">When the elderly Madame Huo heard the birthday gifts being announced, and it came to the Huaiyin Mansion's gift, she couldn't help but say, \"Having a mistress in the household makes a difference.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Madame Huo, the mother of the Princess of Wei, smiled. \"Indeed, the previous gifts were also generous, but not as substantial as they are now.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"We shouldn't criticize the gifts from the princes,\" Madame Huo certainly wouldn't give anyone a reason to gossip.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Madame Huo nodded in agreement, but the joy on their faces was unmistakable. After all, the birthday celebration of the elderly Madame Huo was a great honor, and the Princess of Wei was returning to her natal family to celebrate. This naturally made the Huo family overjoyed.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">As Huiyin approached the Huo family residence, she gently lifted the carriage curtain and saw the colorful pavilions and lanterns at the entrance, which looked extremely grand. The housekeeper, Lady Liu, who accompanied her, said, \"Little Princess, the elderly Madame Huo is usually compassionate and sympathetic. She doesn't usually make such a high-profile display, but because it's her birthday, the celebration is particularly lively. It's said that the Princess of Wei is preparing to visit and offer birthday congratulations.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Huiyin nodded slightly, and when the carriage stopped, the women of the Huo family were already waiting to perform the ceremonial greetings.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"Please rise, there's no need for such grand rituals. Dear elder, last time at Zhaoming Palace, we didn't have much chance to talk. Today, let's spend more time together,\" Huiyin personally helped the elderly Madame Huo to her feet.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">The elderly Madame Huo had found Huiyin to be composed and dignified the last time they met, and today, her words were thoughtful and appropriate. Being experienced, she didn't dare to show any other thoughts and only said, \"As long as the Little Princess doesn't find this old woman too talkative.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Huiyin smiled slightly.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">The rest of the Huo family members found her young but extremely authoritative due to her reserved speech, which made them more respectful and somewhat fearful.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">This was exactly what Huiyin wanted. When she was younger, her personality was lively, and she spoke without reserve. Later, she realized that being too sincere with people allowed them to see through her quickly, and they lost interest in her.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Moreover, when people are too familiar with each other, it becomes difficult to speak freely. With some distance, there are fewer reservations.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">As soon as she settled into her seat, Madame Huo turned to Huiyin and said, \"I heard that Lady Yin came to seek your help? That she needed your assistance to go to Qingzhou?\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">\"Yes, she came to my mansion, but how could I have been of any help?\" Huiyin smiled and shook her head.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Madame Huo and the elderly Madame Huo exchanged a glance, both somewhat surprised. After all, the couple Xie Jiuyi and Princess Zheng were quite close to Li Cheng, and both Xie Jiuyi and Li Cheng were key supporters of the Prince of Wei. It seemed that Princess Zheng and Lady Yin had some discord.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">But the two of them weren't foolish enough to ask directly.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">The elderly Madame Huo then asked the younger sisters of the Princess of Wei to come out and meet the guest. They were girls in their teenage years, and Huiyin took off a white jade bracelet from her own wrist and gave it to the two girls, praising them. \"It's no surprise that you are the sisters of the Princess of Wei. Your bearing and demeanor are truly exceptional.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">The two ladies of the Huo family stood with graceful smiles and elegant demeanor.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">\"I wonder if the two ladies have been betrothed?\" Huiyin asked.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Elderly Madame Huo smiled. \"Not yet, they are still quite young.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Huiyin said, \"They are both fine young women, and with your esteemed status, they will surely find suitable matches.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Everyone exchanged pleasantries, and the return of the Princess of Wei was mentioned. Everyone stood up again to welcome her. Once seated, the Princess of Wei and Huiyin took their places at the eastern and western tables, followed by the marquises, and then Elderly Madame Huo and the others.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">The Huo family's banquet was exceptionally well-prepared, with dishes that were refreshing and not at all greasy, compared to usual banquets.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Huiyin had come today to assess the Huo family's stance on her decision to protect Jiang Bipbo. The women in the inner chambers typically followed the men's lead. Now that the Princess of Wei had returned, she would wait and see.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">After the banquet, Second Madam Huo offered opera scripts for the Princess of Wei and Huiyin to choose from. As they watched the opera, the Princess of Wei said to Huiyin, \"Is everything settled for you? When you have time, come to our mansion to pay respects to our Empress Dowager. She often thinks of Elderly Madame Wu and your family.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Huiyin offered some polite remarks.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Then the Princess of Wei asked, \"Have you ever visited Jianye, young princess?\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">\"I haven't actually. When I came here, my child fell ill, and I had to take care of them at home. I didn't have the leisure to tour around. I wonder, where do you usually spend your leisure time, Lady Wang?\" Huiyin gently blew on her tea foam.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">The Princess of Wei smiled. \"With our status, we don't often go out. Before, we used to play in Cheng Garden, which is vast with a horse racing track and a garden. That garden took ten years to build and was exquisitely beautiful. Later, I heard it was bought by a salt merchant with the surname Jiang, and we stopped going.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">A salt merchant with the surname Jiang? Huiyin knew exactly what this meant. She put down her teacup and said, \"When I was in Xuzhou, I met a young lady with the surname Jiang. We got along very well and became sworn sisters. I wonder if we are talking about the same family?\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">\"I wouldn't know about that,\" the Princess of Wei said, keeping her distance. She didn't want to offend Li Cheng and Princess Zheng. Li Cheng, known for his bravery and reliability, and Princess Zheng, the daughter of the Marquis of Zhaojie and the Grand Commander, both held very high status.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Huiyin instantly understood the Princess of Wei's implication: our Huo family is letting this go out of respect for you, but don't push it too far in the future.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Outsiders, unaware of the subtle dynamics, would think the two were getting along very well.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">The Princess of Wei had matters to discuss with her family as well, so after the opera, Huiyin took her leave, and they saw off their guests before closing the door to talk privately.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">\"The prince intends to make the son of Consort Xu the official heir, but Consort Yin's son is the eldest. If it were up to me, I would favor Consort Yin's son, but the prince may not agree,\" the Princess of Wei said.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Elderly Madame Huo remained silent at first, while Madame Huo, somewhat anxious, said, \"Then, my lady, you must not let that Xu woman take advantage of the situation. Consort Yin is close to our family and has always followed your lead, despite once being favored.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Elderly Madame Huo looked at the Princess of Wei. \"The young princes are still very young. Why the rush? If you were to have a child, what would their status matter?\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">\"Your comforting words ease my heart, grandmother. A few days ago, when the Princess of Huaiyin first married into the family and gave birth to a son with great fanfare, it kept me awake at night. The prince married me when he was fifteen, just three years older than the Prince of Huaiyin. In our eleven years of marriage, we have only two sons and one daughter. It is my fault.\" The Princess of Wei wiped her tears with a handkerchief.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">The Huo family quickly reassured the Princess of Wei, who then added, \"In the future, please advise your second brother to be more restrained and serve the prince faithfully.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">This was a subtle reminder to the Huo family. In front of outsiders, she had to maintain the dignity of her natal family, but she also needed to caution them.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">It was also known that after learning the Huo family's stance, Huiyin felt more at ease.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">**</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Meanwhile, Yin Liyi secretly took a small boat to Xuzhou and, three days later, arrived at Huaiyin Mansion. Li Cheng, of course, had not yet gone to Qingzhou. As Huiyin had said, most of his soldiers were in Xuzhou. If they were lost, he would have no troops left.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">At that moment, he was informed that Yin Liyi had arrived. Li Cheng frowned, \"What does she want?\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Wasn't she supposed to be in Xuzhou with Huiyin?</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">\"Lady Xie said she has a letter from the Prince of Wei.\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">\"Then let her in.\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Yin Liyi, seeing that Huiyin refused to help her, decided to come directly to Xuzhou. It was her sister, Yin Lifang, who came up with the idea to obtain a letter from the Prince of Wei, knowing that Li Cheng could not disobey the prince's orders.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">\"Here, I’ll make the necessary arrangements for you,\" Li Cheng said as Yin Liyi handed him the letter without a word.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Raising an eyebrow, Li Cheng remarked, \"I didn’t expect the Prince of Wei to write a letter himself. For you to get the Prince of Wei to write for you, you’ve certainly come a long way.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">\"Cheng Brother, are you mocking me?\" Yin Liyi felt attacked once again.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Li Cheng shook his head. \"Originally, I definitely wouldn’t want you to go to Qingzhou. Given the ongoing conflict, no one can predict what will happen. But since you insist and have the backing of the Prince of Wei, I’ll arrange for someone to assist you.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Yin Liyi was somewhat surprised by how readily Li Cheng agreed. She had considered mentioning that Huiyin refused to help but, for some reason, she kept quiet. She had a vague feeling that if she revealed Princess Zheng’s refusal, Li Cheng might hesitate as well. After a moment’s thought, she hesitated but then said, \"Actually, I didn’t expect the Prince of Wei to help me either. It was my sister who advised me.\"</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">\"Your elder sister,\" Li Cheng said, lowering his gaze.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Yin Liyi smiled. \"Yes, my sister is smarter than me. I originally wanted to come directly, but my sister told me you’re someone who strictly follows official procedures. Without the Prince of Wei’s order, you definitely wouldn’t arrange it for me. My mind isn’t as quick as my sister’s. When I was a female official, she was already smarter and more meticulous than me.\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">\"Alright, go back to your residence. I’ll arrange everything today, and you can set off again tomorrow,\" Li Cheng, known for his efficiency in handling matters, said.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">It was already dusk when Yin Liyi arrived, and it would be night by the time she returned to the mansion. She would leave for Qingzhou early the next morning, which seemed too soon.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">However, Li Cheng didn’t ask further. He simply called Yuwendang over to make the arrangements. Yuwendang remarked, \"I heard that General Xie is about to return. Why is Lady Xie going?\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">\"The Prince of Wei has agreed, so what can we say? Just arrange it,\" Li Cheng waved his hand.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Yuwendang left to follow his orders.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Afterward, Li Cheng went to the study, where his advisor Jian Tan was waiting. Li Cheng asked, \"The Crown Prince has won a great victory. Mr. Jian advised me to wait and not send troops, but what if the Prince of Wei orders me to dispatch troops?\"</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Jian Tan smiled. \"Then you can make excuses, saying there’s insufficient food supply. There was a famine this year, after all. That’s a ready-made reason.\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">\"You’re right, but the Lü and He families have always been at odds. Even if we attack from Xuzhou, we might not necessarily lose.\" Li Cheng believed that one should strike when the opportunity arises. Although Li Heng had won a great victory, conflicts between the Lü and He families were inevitable in the long run.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Jian Tan said, \"To my knowledge, the Crown Princess in the Eastern Palace is expecting a child. Think about it. If the Crown Princess gives birth to a son, won’t the Lü family support their own grandson? Would there still be a need for the Crown Prince? Without the Crown Prince to rely on, how could the He family maintain their influence? In this case, you should wait patiently.\"</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Li Cheng nodded. \"Alright, for now, I’ll focus on training the navy and, in the future, the infantry.\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Jian Tan smiled. \"A fine ambition, Little Prince.\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">...</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Leaving the study, Li Cheng returned to his room. It was usually the liveliest place, with Huiyin and Jing’er around, but now he was alone.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">For some reason, he felt restless and decided to take a walk outside.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">He happened to run into Yun Hui, who had dressed up intentionally that day. Previously, she had dressed like a widow, but now she wore a delicate flower and had lightly colored her lips.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Noticing Li Cheng looking at her, Yun Hui blushed slightly, feeling both shy and embarrassed. \"I just went out...\"</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">Li Cheng was reminded of his time during a military campaign when he was chased and sought refuge in a nunnery. He was sixteen then and learned, for the first time, that nuns also engaged in less reputable business, entertaining male guests at night after their daytime religious duties. He didn’t want to think of Yun Hui in that light, but her new appearance and recent behavior suggested she had certain desires and didn’t want to leave the mansion. So, he tactfully said, \"Yun Hui, you don’t have to observe widowhood. You’re still young.\"</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Yun Hui was delighted, thinking that Li Cheng had finally noticed her. With Princess Zheng gone, she saw a great opportunity. Lately, she had started dressing up, not because she intended to mourn her late fiancé forever, but because she didn’t want to leave the mansion. Blushing, she said, \"What you said is true, Little Prince. My mother also told me that I don’t have to cling to this. Her greatest hope is to see me marry into a good family.\"</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">\"I feel the same. You’re still young; why waste your youth?\" Li Cheng smiled.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">Yun Hui pointed to her forehead. \"Years ago, when you were mischievous and insisted on playing on the rockery, you were afraid to stand on top. I injured my forehead saving you, and the scar never healed. I did everything with all my heart,\" she said, hoping to convey her feelings and give Li Cheng a reason to take her in. Once it was settled, even if Princess Zheng returned, it would be too late to change things.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">Li Cheng remembered that Yun Hui had been assigned as his head maid because of that incident. Granny Chao had been managing the household for many years, and according to Huiyin, Granny Chao’s private savings were even richer than some local landlords. Seeing Yun Hui bring up the past, Li Cheng didn’t hold it against her. \"Yun Hui, you did indeed put in a lot of effort. So, if you get married, I’ll give you a generous dowry. Don’t worry. If the family is of high status, I can help arrange the match; if it’s lower, I can ensure a promising future for them.\"</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">As soon as he finished speaking, Yun Hui’s face turned pale, and she looked as if she might collapse at any moment.</p><p id=\"paragraph-120\" data-paragraph-id=\"120\"></p><p id=\"paragraph-121\" data-paragraph-id=\"121\"></p><p id=\"paragraph-122\" data-paragraph-id=\"122\"></p>\n</div>"
  },
  {
    "number": 35,
    "title": "Chapter 35",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 35</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">A new first-class maid named Shunfang had been promoted in Grand Dowager Wu's courtyard. Huiyin had heard plenty of rumors about Shunfang, who was bought from outside. Those who came in with her were only assigned to serve inside the chambers, but Shunfang had already become a first-class maid. Everyone was speculating about her connections.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">In Huiyin's opinion, Shunfang's embroidery skills were not better than the others and could only be considered passable. Her seniority was only slightly higher than the granddaughter of Nanny Fan, yet it was she who got the promotion. This was a clear indication that the Huaiyin Mansion only employed those with strong connections, all vying to show whose backing was the strongest.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">\"Young Princess, the Dowager said that from now on, when you go to pay your respects, bring the heir along as well,\" Nanny Fan came to relay the message.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin smiled and said, \"Alright, I understand.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Nanny Fan didn't expect Huiyin to agree so readily. She had thought Huiyin would refuse. Huiyin had one of her maids give Nanny Fan a reward and also kept her for a cup of tea, even giving her a new set of cosmetic boxes.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"I'll have someone deliver it to your quarters later. I heard that your eldest granddaughter is about to marry, so consider this my gift for her wedding,\" Huiyin said with a smile.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Nanny Fan thanked her repeatedly, \"Thank you, Young Princess, for remembering.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">\"Yes, you may go now. I'm afraid if you stay too long, the Grand Dowager might blame you,\" Huiyin said considerately.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Nanny Fan had never revealed any secrets to Huiyin, but she always received rewards, and she knew that the Young Princess could handle many things on her own and didn't need her to do much. However, the more this happened, the more Nanny Fan felt obliged to repay her kindness. She needed to find an opportunity to return the favor.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">It wasn't that Nanny Fan was particularly good or conscientious. Being the head maidservant by Grand Dowager Wu's side required more than just a conscience; she had even stepped on others and framed people before. But she was pragmatic.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">It was clear who the future of the mansion belonged to. When the mistress took the initiative to extend an olive branch to her, if she didn't accept it, once Grand Dowager Wu passed away, she would become useless. If she could help the Young Princess even a little, she would still have a place in the mansion.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Once Nanny Fan left, Nanny Nan was anxious. \"My lady, are you really going to bring the heir to pay respects? The weather is getting colder, and young children are most susceptible to wind.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Huiyin smiled, \"Nanny Nan, what are you suggesting? Of course, I wouldn't do that. I said I understand, but I didn't say I would definitely bring the child over. It's ridiculous. If she wants to make things difficult for me, it's just the old saying about a great-grandmother-in-law testing her granddaughter-in-law. Even if I have a thousand grievances, outsiders would think I should endure it. But as an elder, tormenting a little baby? I would never agree to that. If she dares to say that the child should be brought to her while asleep, I'll immediately send a letter to Li Cheng.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"Young Princess, how dare you call the little prince by his name?\" Nanny Nan was startled.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Huiyin snorted coldly.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Grand Dowager Wu, of course, wanted to see her grandson more often. As for wind and rain or the early hour, these were not considerations for her.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">When she saw Huiyin come alone, she was somewhat angry. \"Why didn't you bring Jing'er over? Didn't I tell you to bring him here?\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Huiyin replied calmly, \"Grandmother, you know that Jing'er is only three months old and too young to be exposed to the wind. He hasn't woken up yet. I thought you would be considerate, so I didn't bring him over.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">\"You...\" Grand Dowager Wu realized she had been outwitted by Huiyin.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"You have disobeyed your elder several times. Kneel down.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Huiyin looked at her in disbelief. When Grand Dowager Wu pointed at her, Huiyin, who had only thought the old lady was muddle-headed and had ignored the matter of Xun Rou, realized how muddle-headed the old lady was to demand that she kneel, disregarding all propriety.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">But she wouldn't confront her directly. Otherwise, being in the right would turn into being in the wrong.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">So, Huiyin said, confused, \"Grandmother, what do you mean? Just because you want to see the child, should I disregard the fact that he is only a hundred days old and that the journey would be too taxing? Now, because I'm afraid the child might catch a cold, you want to humiliate me?\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Nanny Fan was afraid things would escalate and quickly stepped in to mediate. \"Dowager, your health is not good. Let me help you inside to rest.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">\"No, make her kneel before me. Have you ever seen a granddaughter-in-law argue with her mother-in-law?\" Grand Dowager Wu had never been challenged before.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Huiyin thought that if she knelt today, she would write her name backward in the future. She cried out, \"Heaven help me, Grandmother is trying to ruin me!\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">She rushed toward a pillar as if to bash into it, but the servants held her back. She still struggled to crash into the pillar and fainted. Before losing consciousness, she signaled to Qiu Feng.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Why was Huiyin looking at Qiu Feng? It was because Qiu Feng had been known for her dramatic wailing in the past. </p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Qiu Feng’s voice, always sharp and resonant, broke into a fresh wave of sobs: \"My lady! You traveled all the way from Jizhou to marry into this family, and after nearly dying to give birth to the heir, they now want to force you to your death! Heaven, have mercy on our young princess! Young Prince, please come back and look after our princess!\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Nanny Nan, meanwhile, was organizing the sedan chairs with the others.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Elderly Dowager Wu was both frightened and furious. She felt that Huiyin had disobeyed her too many times, which made her lose face. She wanted to teach this daughter-in-law a lesson. If Huiyin were to kneel down, whether she was in the wrong or not would no longer matter; kneeling itself would be her punishment.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Unexpectedly, Princess Zheng was so fierce that she not only resisted but also screamed loudly. Elderly Dowager Wu, both anxious and angry, said to Nanny Fan, \"Stop that girl from wailing. What nonsense is she saying? Go and slap her mouth.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Nanny Fan, however, found herself at a loss. \"You made this mess,\" she thought, \"and now you expect me to clean it up by offending others?\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Although most of the people in the mansion were Elderly Dowager Wu’s, some still quietly criticized Huiyin behind her back. However, Huiyin wasn’t someone to be trifled with. She had her own plans and wouldn’t tolerate humiliation. So, she feigned illness and discreetly spread the word, ensuring everyone knew what was happening without directly confronting Elderly Dowager Wu.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">She even stayed in bed and refused to get up.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Word of the incident quickly reached the Prince of Wei’s Mansion. Wei Imperial Consort then invited Elderly Dowager Wu for a private discussion. Although there were many issues in Wei Imperial Consort’s own household—rivalries between wives and concubines, the Prince of Wei’s favoritism for Consort Xu, and the heir not yet being decided—she was clever enough not to mention these troubles to Elderly Dowager Wu. Elderly Dowager Wu, however, always felt the need to take the upper hand in front of others, so she said to Wei Imperial Consort, \"My daughter-in-law is so disrespectful. Sister, I truly envy you for having such sensible and obedient daughters-in-law. Mine, on the other hand, is always threatening to die. She disobeys me, yet it’s somehow my fault.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"Dear sister, don’t be angry. If you don’t mind, I can help talk to her,\" Wei Imperial Consort comforted Elderly Dowager Wu, seeing her distress.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Elderly Dowager Wu said, \"If I don’t speak out, who knows what rumors will spread outside.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">As the two imperial consorts talked, it was time for lunch. Princess Wei arrived with Yin Lifang to attend to them. Yin Lifang had crafted a pair of knee pads for each of them. Made from soft white fox fur, they were both warm and smooth, fitting snugly around the knees. For Wei Imperial Consort, who was still relatively young, the pads featured a vibrant red ‘longevity’ character embroidered at the bottom, surrounded by blooming peonies. For Elderly Dowager Wu, the design was more traditional, with a Ruyi longevity pattern and embroidered pine and cypress, symbolizing long life and prosperity.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"These embroideries are truly exquisite,\" Elderly Dowager Wu said enviously.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Why were other people’s daughters-in-law so wonderful? Her fate was truly bitter.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Yin Lifang, however, didn’t care much. For her, these embroideries were just a way to pass the time. She even thought Elderly Dowager Wu was quite unreasonable. Huiyin, having the Prince of Wei’s only son, was now being forced to kneel or even die. While people wouldn’t say anything out of respect for Elderly Dowager Wu’s age and status, who wasn’t secretly gossiping about it?</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">In fact, what Elderly Dowager Wu considered public condemnation of Huiyin was of no concern to Huiyin herself. After the incident, she continued her daily greetings as if nothing had happened, but Elderly Dowager Wu didn’t dare ask her to bring the child over again. Later, Huiyin was also invited to the Prince of Wei’s Mansion to appreciate chrysanthemums.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Seeing Huiyin and Elderly Dowager Wu standing apart, Wei Imperial Consort said to Huiyin, \"You should help your great-grandmother a little.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Huiyin smiled politely but deliberately, replying to Wei Imperial Consort, \"Thanks to you, we are able to appreciate such beautiful chrysanthemums after returning from Xuzhou.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Wei Imperial Consort, hearing this, pretended not to hear and decided to ignore it, but she couldn’t help but feel that Princess Zheng’s temper was somewhat rebellious. Huiyin had done it intentionally because, in her eyes, Elderly Dowager Wu was a foolish person who spoke nonsense, while Wei Imperial Consort often stirred up trouble. If it weren’t for Wei Imperial Consort’s letter, she wouldn’t have come to Jianye with her child. This person had a Buddha-like face but a venomous heart, so it was better to keep a respectful distance.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Even if she explained the situation clearly, Elderly Dowager Wu wouldn’t listen to her.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Although Elderly Dowager Wu claimed to be devoted to Buddhism, she loved talking with Wei Imperial Consort. She often visited, and Huiyin eventually stopped pretending, not going to the Prince of Wei’s Mansion for almost half a month.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">However, after Huiyin’s outburst, Elderly Dowager Wu didn’t dare push too far, only making snide remarks occasionally.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Like now, when Huiyin came to pay her respects, Elderly Dowager Wu held up a headband and said, \"Look at this. It was given to me by Consort Yin. They are truly filial.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"Yes, in the Prince of Wei’s Mansion, the mother-in-law is kind, and the daughters-in-law are obedient. They are especially loving to their grandchildren. The last time Elderly Madame Huo celebrated her birthday, Wei Imperial Consort didn’t allow the Princess to bring the eldest princess back to her natal family, afraid she might catch a cold. But in our mansion, with you in charge, we just need to be filial to you,\" Huiyin said with a smile.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Elderly Dowager Wu understood the underlying meaning in Huiyin’s words: as an elder, if you don’t set an example of respect, how can you expect the younger generation to honor you with filial piety?</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Elderly Dowager Wu, however, seethed with frustration over Huiyin’s defiance. She had letter after letter sent to Li Cheng in Xuzhou, urging him to come to Jianye and discipline Huiyin.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">However, Huiyin never wrote a single letter to Li Cheng. The only letter she wrote was to her parents, to be delivered via Jiang Bipbo’s trade caravan in Jizhou.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">She knew that any letter to her parents would first be reviewed by Li Cheng. This wasn’t because Li Cheng was nosy, but because their marriage was a strategic alliance. Any leaked information could have serious consequences for both Xuzhou and Jiangnan. If she wrote directly to Li Cheng, both her and Elderly Dowager Wu’s letters would end up being a he-said-she-said situation, and given Elderly Dowager Wu’s seniority, Li Cheng might side with her and fault Huiyin for not being more accommodating.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">She wrote to her in-laws, sharing these matters to build a good reputation for herself.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">As expected, Li Cheng had someone intercept Huiyin's letter and read it first. The letter began with greetings to her in-laws in Jizhou, followed by a litany of grievances. She mentioned that the child had started vomiting milk soon after arriving in Jianye and that Grand Dowager Wu had not visited them even once. To avoid gossip, Grand Dowager Wu gave her a pair of bracelets. Huiyin also wrote that the Grand Dowager wanted to take the child away and had asked her to go for morning greetings on a windy autumn day. Huiyin refused to go because the wind was too strong, which angered the Grand Dowager. The latter then forced her to kneel and kowtow in front of all the servants, humiliating her. In her distress, Huiyin considered killing herself by running into a pillar but decided against it at the last moment, thinking that she couldn't die in vain since heaven had given her life. Instead, she frightened Grand Dowager Wu a little.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Reading this, Li Cheng smiled. This was the Huiyin he knew, someone who wouldn't let others trample over her. He continued reading as Huiyin mentioned that she had few friends in Jianye and that most of the household staff were Grand Dowager Wu's people, who often bullied her. She concluded by saying that she longed to return to Jizhou and that her complaints were not to be taken too seriously by Lady Zheng.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">For a moment, Li Cheng felt like a terrible person. His wife and child were suffering in the inner household. Grand Dowager Wu's letters only complained about Huiyin's lack of respect but never provided specific instances of disrespect.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Poor Huiyin! He needed to rescue his wife and child as soon as possible.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Grand Dowager Wu knew nothing of Huiyin's plans. Meanwhile, in Jianye, Yin Liying had brought Lord Xie back, whose poison injuries had greatly improved. The Prince of Wei did not blame him for losing the battle but was upset that Qingzhou had been taken again, with the loss of soldiers and resources. For now, Xie Jiuyi was no longer under consideration.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Huiyin also prepared lavish gifts for her visit to the Xie family. When she went, she happened to meet Yin Lifang, and the three women started chatting.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Interestingly, Yin Lifang and Yin Liying, despite being sisters, didn't look very similar and had completely different personalities. Huiyin had first interacted with Yin Liying, who was extremely beautiful but acted rashly, often without thinking things through and not always following proper etiquette. Yin Lifang, on the other hand, was much smarter and more composed. Huiyin had met Consort Xu a few times and found her too pretentious.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Yin Lifang initiated the conversation, \"How is the young prince? Our Jing'er has been asking to see your heir ever since he saw him.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"He's doing well now, but I've been smelling something like burning charcoal lately. I wonder if any of you have noticed it,\" Huiyin casually mentioned. She knew the reason—because of the exhaustion from caring for the child, she was starting to imagine smells due to fatigue.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Yin Lifang could relate. \"I went through something similar when I was pregnant with my son. I felt unwell for about a month and kept smelling burnt grass. Once I relaxed a bit, it got better.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Yin Lifang wasn't seductive or showy like Yin Liying, who always flaunted her relationship with Li Cheng. Yin Lifang spoke appropriately and could make people feel fond of her with just a few words.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Huiyin smiled and nodded in agreement.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Yin Liying also mentioned that she had ridden to Qingzhou but had to turn back before reaching it because Lord Xie had already headed to Jianye. Fortunately, the couple reunited in time.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">After some conversation, Huiyin prepared to leave, and so did Yin Lifang.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">\"I have to rush back because my child is too young. You can stay longer and catch up with Lady Xie if you'd like,\" Huiyin suggested, seeming to get along well with Yin Lifang.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Yin Lifang honestly replied, \"I have to go back early because the Dowager is attending a theater performance, and the Princess needs me there.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">With that, Huiyin didn't say more.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">After they left, Yin Liying said to her maid, Qiaozhen, \"Did you notice that my sister gets along quite well with Princess Zheng? I feel like Princess Zheng can be quite cold and distant, and we don't always see eye to eye.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"Well, Miss Yin has always been like that,\" Qiaozhen replied cautiously. At first, everyone seemed to like her because she was pretty, carefree, and enthusiastic, but in the end, they all ended up preferring her older sister.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Yin Liying didn't get angry. She rested her head on her hand and looked at Qiaozhen. \"I was worried before, but now I'm not worried about anything.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Qiaozhen advised, \"You should take care of yourself. Last time, you had a miscarriage and didn't properly recover before running off again. Your health...\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">\"Alright, alright. I'll listen to you, okay?\" Yin Liying also felt that her health wasn't as good as before.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Another person in confinement was Lü Xiao. She had been pregnant but miscarried after a fall. Lü Xiao was devastated and stayed in bed, constantly feeling chilled, even wearing socks. Grape brought her a cup of hot tea. \"Crown Princess, please drink some hot tea. The imperial doctor said that your pregnancy was unstable from the beginning. With the Crown Prince's favor, you'll definitely have another child.\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">The Crown Prince was indeed very good to her, even neglecting his previous consort, Zheng Liangdi.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Just as she thought about it, she was told that Zheng Liangdi had arrived. Grape, feeling annoyed, said, \"You're in recovery. What does she want?\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">\"Don't say that. When she was favored, she never reduced her interactions with me,\" Lü Xiao replied, not wanting to offend Zheng Deyin.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">When Zheng Deyin entered and saw Lü Xiao's pale face and colorless lips, she felt a pang of guilt. Li Heng had told her that he had courted the Lü family for the great cause and that Lü Xiao's miscarriage had been influenced by them. The Crown Prince wanted the child to be born to someone else, rather than Lü Xiao, for the good of the realm.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\"></p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">\"So, De Yin said quite a bit here: 'I am merely managing the Eastern Palace on your behalf for a few days. Once you have recovered, I will return the authority to you.'</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Lu Xiao gave a weak smile. 'Zheng Liangdi, you’ve always been so good at managing the household. I’m not cut out for it. You should keep handling it.'</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">De Yin felt guilty again and thought, 'In the future, once I have a child, I will certainly treat you well.'</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">This time, without the Zheng family, the Eastern Palace was still the rightful ruler, reclaiming Qingzhou as in her past life. This showed that history remained unchanged. Li Cheng would eventually die. In this life, she also planned to bring Huiyin back from the south of the Yangtze as a way to make amends.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">**</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">After jumping rope yesterday, her back and waist were aching today. Huiyin held her waist and went back to lie on the bed, picking up a book to read. Today, Grand Dowager Wu went to visit Wei Imperial Consort to chat about trivial matters. This gave her some leisure. Otherwise, the daily morning and evening greetings were exhausting. She was actually a lazy person and especially disliked serving others.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Moreover, if her letter were to be seen by Li Cheng, he would immediately come to fetch her back. There was no need for her to deal with this old woman.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Of course, Grand Dowager Wu went to chat with Wei Imperial Consort again, using the same old tricks. Wei Imperial Consort was also lonely. The troublesome matters in the Prince of Wei’s Mansion were nothing compared to the amusement of hearing about other families' gossip.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Furthermore, she could see that Princess Zheng was strong-willed and unyielding, unlike Grand Dowager Wu, who was easily swayed.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">They spent the morning chatting, and at lunchtime, they heard that Li Cheng had come from Xuzhou, just after meeting with the Prince of Wei to report on military matters concerning Qing and Xuzhou. Wei Imperial Consort was delighted. 'It seems your grandson has come to support you.'</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Grand Dowager Wu remained calm. 'What support? My grandson is filial and has surely come to visit me.'</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">The two of them were quite excited to finally see Li Cheng.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Naturally, Li Cheng would not create trouble in the Prince of Wei’s Mansion. He first pretended to be casual and paid his respects. 'Greetings to Grandmother and Wei Imperial Consort.'</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">'What brings you here from Xuzhou?' Wei Imperial Consort feigned asking.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Li Cheng replied, 'The court has withdrawn troops from Qingzhou. There are some military matters concerning Qing and Xuzhou that I need to report to Uncle Wei Wang.'</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Wei Imperial Consort laughed. 'We don’t understand outside matters. Since you’re here, join us for lunch. We haven’t seen you in a long time.'</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">'Yes,' Li Cheng obliged, and accompanied them for the meal, even telling a few jokes, which made both imperial consorts laugh heartily.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">This made Grand Dowager Wu even more convinced that her grandson was supporting her. She thought it would be best to take in more concubines and keep Princess Zheng confined to the cold, remote northern rooms, never to be favored. That would be her punishment for opposing her.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">The more Grand Dowager Wu thought about it, the happier she became, and her expression revealed some of her thoughts.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Li Cheng glanced over and felt deeply troubled. Seeing his grandmother so happy, he knew she likely took pleasure in tormenting Huiyin. In Jianye, the people in the Prince of Wei’s Mansion must be siding with Grand Dowager Wu. Even the usually amiable Wei Imperial Consort would stand with Grand Dowager Wu. No wonder Huiyin felt isolated.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Huiyin was really too pitiful. Fortunately, he had come. Thinking of this, Li Cheng took a fierce bite out of the skewered lamb.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Seeing Li Cheng’s fierce expression, Grand Dowager Wu even proactively had someone pour wine for her grandson. 'Have some wine. With wine, your courage will grow. Let’s see how long Princess Zheng can hold out.'\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\"></p>\n</div>"
  },
  {
    "number": 36,
    "title": "Chapter 36",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 36</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">After the meal, Li Cheng returned to the mansion with Grand Dowager Wu. They arrived quickly, and Li Cheng hurried forward to support Grand Dowager Wu. However, Grand Dowager Wu and Huiyin had long been at odds, despite maintaining the facade of a harmonious mother-in-law and daughter-in-law relationship in the past. Ever since Grand Dowager Wu had made Huiyin kneel, Huiyin had stopped coming to greet her every morning and evening, only showing up to go through the motions.</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">So, when they returned, Grand Dowager Wu deliberately did not inform Huiyin of their arrival, wanting to show Li Cheng how disobedient she was.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">But she miscalculated. Upon returning, Li Cheng didn’t pay any attention to this and simply said, \"She didn’t come over because she must be taking care of the child. Grandmother, let me see you to your room first, then I’ll go check on them.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Grand Dowager Wu had a lot to say but could only respond with, \"Alright.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">She thought it was best not to go herself, to avoid getting involved in any mess.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Unexpectedly, she was wrong. As soon as Li Cheng returned, he rushed to the main courtyard, taking the steps two at a time. He didn’t understand why, after just over a month of not seeing her, he had been thinking about her day and night. Now, standing in front of her door, he hesitated, feeling nervous about seeing her again.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Huiyin had just gotten up from the bed, having napped after tiring from reading. When she saw someone at the door, she thought she was mistaken.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">\"Prince...\" she said, extremely delighted.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Li Cheng was immediately pleased by her joy, but then Huiyin’s expression changed, and she turned and walked back into the room. Li Cheng quickly followed her, and the servants scattered like startled birds.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">He could tell she was upset and quickly said, \"I’ve been thinking about you. I rushed back as fast as I could.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"Thinking of me? I bet you’re here to scold me. I’ve already heard that the Grand Dowager asked you to come back to scold me. If you lay a finger on me, I swear I’ll go back to Jizhou,\" Huiyin said firmly, sitting on the edge of the bed.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Li Cheng laughed. \"Nonsense, I came back specifically to see you. Also, I’ll be staying in Jianye from now on. Prince of Wei told me that it would be convenient for me to travel between here and Xuzhou.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Hearing this, Huiyin felt troubled. She had only wanted Li Cheng to come back to help deal with Grand Dowager Wu, not to give up his military power.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">So, she said anxiously, \"Is Prince of Wei asking someone else to reap the rewards of your hard work? You’ve worked so hard to get Xuzhou in order, and now you’re just going to hand it over?\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Li Cheng placed his hands on her shoulders, trying to calm her down. \"No, it’s still under my control. It’s quite fast to travel by boat from Jianye to Xuzhou. Don’t worry. It’ll be the same as before. I’ll come back to Jianye whenever I have time.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Only then did Huiyin feel relieved, but she thought that being under Prince of Wei’s watchful eye wasn’t necessarily a good thing. However, saying that would be stirring up trouble, so she just happily said, \"Come on, let’s go see our son.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">\"He can see me anytime. What’s important is you. When I’m not by your side, has anyone been bullying you?\" Li Cheng asked.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Huiyin hesitated for a moment and shook her head. \"No, no one has bullied me. Oh, there’s just one thing. Lady Xie wanted me to give her a letter of introduction to Jizhou, but I didn’t dare take responsibility, so I didn’t give it to her.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"That’s why. If she doesn’t get a letter from Prince of Wei, I won’t send anyone to escort her either. She’s related to Prince of Wei through marriage, and Xie Jiuyi and I are close friends,\" Li Cheng explained with a smile.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Huiyin let out a sigh of relief. \"But I don’t have a good relationship with them. I don’t have many friends here.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">In fact, Huiyin didn’t care much about friends. When dealing with men, she knew one trick that always worked: if he likes you and cares about you, he’ll always have your best interests at heart.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"Aren’t I your friend? Besides, friends are rare and precious. You’re so young and of such high status that most people can’t be your friend. When I’m not here, you’re always so formal and don’t go out much. If you want to host flower or tea parties, I fully support you,\" Li Cheng said with concern.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Huiyin shook her head. \"With Grandmother managing the household, it’s not proper for me to host such events.\"</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Li Cheng took her hand, looking surprised. \"Grandmother is still managing the household? She’s so old; she should be sharing the burden with you.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Huiyin fell silent, and Li Cheng understood. It was Grand Dowager Wu’s issue. As she grew older, her grip on power became tighter. The corruption below was just a reflection of the leadership above. Grand Dowager Wu held onto the household management not just for money but for power, to remain superior.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Li Cheng didn’t agree with this. The Huaiyin Mansion should rightfully be controlled by the Princess of Huaiyin. These so-called dowagers were no longer funded by the court. Their expenses were covered by their own descendants. The reason the income from Xuzhou is low is that more than half of it goes to Jianye. They had to support Grand Dowager Wu and couldn’t be stingy. With the wealth inherited from his father, the Prince of Wu, and his mother from the prestigious Boling Cui family, Li Cheng had more than enough resources. He was still a commandery prince.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">As Huiyin pointed out, if they could cut down on these expenses, they could put the money toward future military needs.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\"></p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Although he is the nephew of the Prince of Wei, in a way, the Prince of Wu ranks second. The Prince of Wei is the youngest son of the late emperor. If the future emperor doesn't succeed or the crown prince can't control the situation, he, as royal blood, might still have a chance.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Before, when he had no son, it was different. Now that he has a wife and child, his thoughts have naturally changed.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Huiyin, having understood Li Cheng's words, knew her husband was a man of his word. With that in mind, she began to unbutton his clothes, \"You rushed over so hurriedly, don't you miss me even a little?\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">…</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">As for Grand Dowager Wu, she had someone wait at Huiyin's place for news. Of course, Nanny Fan wouldn't go. She knew all too well that getting involved in such matters never led to anything good. In the past, she had charged into battles only to end up being blamed. Grand Dowager Wu would just curse and complain, but in the end, there was no real benefit, not even extra rewards for herself.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">This time, Liu Niang was sent to gather information. Liu Niang stood at the door for a long time. Although she couldn't hear what was being said inside, the fact that the servants had brought water in three times was telling enough.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Some servants, quite perceptive of the situation, like Nanny Fan, knew that although they were tied to Grand Dowager Wu, Princess Zheng was the legitimate princess and would eventually take charge of the household. It was better to make a good connection with her. On the other hand, there were servants like Liu Niang, who hoped to stir up discord between Grand Dowager Wu and Huiyin and profit from it.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">So, when she returned to report to Grand Dowager Wu, she painted a vivid picture: \"I saw the Little Prince storm in angrily, and then, for some reason, they started bringing water inside.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Grand Dowager Wu slammed the table, \"Truly, lust clouds judgment.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Nanny Fan lowered her eyes, not wanting to speak, when Liu Niang added, \"The Little Prince's travel gear was almost all brought back by Manager Qiao. It looks like he might be staying for a long time. You can't afford to be careless.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"I understand,\" said Grand Dowager Wu, feeling helpless. She wondered if her letter hadn't reached her grandson. If so, she would have to tell him in person later.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Liu Niang smiled again, \"Actually, if you have no other way, I have another idea.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Grand Dowager Wu looked at her, \"Oh, do tell.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Liu Niang then whispered into Grand Dowager Wu's ear. Nanny Fan didn’t hear what was said, but not hearing it was probably for the best; it meant she wouldn’t have to deal with it.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">After spending the afternoon in playful intimacy, when Huiyin and Li Cheng got up, Li Cheng looked refreshed, while Huiyin's face was flushed. It must be said, Li Cheng was quite impressive in every way.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"It's almost time for dinner with Grand Dowager Wu. I need to attend to her. If you hadn't come today, there would have been a feast to welcome you.\" Huiyin fastened her clothes.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Li Cheng smiled and helped her up, \"Let's go together. Don't worry, with me here, you'll still be in charge of the household.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Huiyin shook her head, \"No, don't offend your grandmother for my sake. It wouldn't be good to be labeled as unfilial.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"It won't happen. She will still need to rely on me in the future. Even now, the reason why the Wei Imperial Consort and others here show her respect is because of me.\" Li Cheng was very clear-headed. He was filial, but not blindly so.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Huiyin then said to Li Cheng, \"These household matters are trivial. I actually have something important to discuss with you. Last time, the gift you sent to Second Imperial Consort Yin was quite generous, right? But when I visited their residence, I found out that the person most favored by the Prince of Wei is actually Second Imperial Consort Xu. The eldest son of Second Imperial Consort Yin hasn't been granted the title of crown prince yet.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Li Cheng paused as he helped her up, \"But the eldest son is still the eldest son.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Huiyin smiled, \"I think if the crown prince isn't decided, people's hearts will be unsettled. My lord, I know you've always been loyal to the Prince of Wei. But with the world in turmoil, it's not just heroes who shape the times; it's also the times that shape heroes. Lü Wei is arrogant and self-centered, seeing no one else. The He family is the same. My father is brave but lacks strategy. The only truly capable person is Wei Duo. My lord, why not rise with the tide?\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"Nonsense, we're not discussing this again,\" Li Cheng's expression changed.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Huiyin thought that any man, especially one who commands troops, like Li Cheng, who is quite strategic and capable, would be tempted, even if he didn't want to admit his desires for now. So, she didn't push further and just smiled, \"Alright, alright, I won't say any more.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">After they went out, they first visited Jing'er. Seeing his chubby little hand, Li Cheng's heart softened even more. Jing'er was awake and a cheerful child. When Li Cheng held his hand, he giggled.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Hearing the child's laughter lifted the adults' spirits.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">When they went to see Grand Dowager Wu, she wouldn't directly criticize Huiyin in front of her. Huiyin also stood up attentively to serve her. As a former Empress Dowager, having to serve this muddled old woman, she was unwilling in her heart, but there was no other way unless she truly took power herself.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">The night passed without incident. The next morning, Grand Dowager Wu didn't expect Li Cheng to come over first.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">The day before, although she saw that Li Cheng and Princess Zheng didn’t exchange many words, the affection between them was clear from their shared tender looks. She had wanted to secretly speak ill of Princess Zheng to Li Cheng, but his decision to stay in Jianye had distracted her.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">\"Greetings, Grandmother,\" Li Cheng smiled.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Grand Dowager Wu looked at him lovingly. \"You've been travel-weary; you should take care of yourself. Why did you come so early this morning?\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Li Cheng replied, \"My wife was supposed to come, but I have something to discuss with you. As I mentioned yesterday, I plan to settle in Jianye from now on, so I intend to host a banquet at the estate for Uncle Wei Wang and others as a way to thank them for taking care of you, Grandmother, all these years.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">\"That is only proper,\" Grand Dowager Wu said with a smile.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Li Cheng continued, \"Although Princess Zheng is young, she has been excellent at managing the household affairs in Xuzhou for me. Yesterday, I saw that you are still in charge of the household. I scolded her for it. You are getting on in years, and she is still young and inexperienced. How can I let you, at your age, continue to manage things for me?\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Grand Dowager Wu stiffened and pointed at Li Cheng. \"You! Are you trying to force me to hand over the household management?\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">In truth, since his parents had passed away, Li Cheng had spent most of his time outside dealing with affairs and had never really interacted much with Grand Dowager Wu. He thought he had been tactful, perhaps even more so than when speaking to his wife. He hadn't expected Grand Dowager Wu's reaction to be so baffling.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">\"Grandmother, what are you saying? Is it you who wants to keep the household management? Then it is my fault.\" Li Cheng thought that even if people had such thoughts in their hearts, they shouldn't say them out loud. After all, even those who are chosen to be emperor go through the ritual of declining the honor three times before accepting.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">But he still knelt down to go through the motions.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Grand Dowager Wu also realized she had overreacted and helped Li Cheng to his feet. \"Of course, I am not clinging to this household management, but your wife is too young. It's hard for her to gain respect. I didn't say this before, but she isn't just disrespectful to me. The issue is that she even quarreled with the Huo family over a merchant's daughter. She has also been disrespectful to Wei Imperial Consort, speaking sharply. In short, as long as she is around, everyone is unhappy. How can I not hold things together?\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Li Cheng, however, thought of his wife. Although she often spoke humbly, her demeanor was far from ordinary. Indeed, she had even encouraged him to seize power. She was no ordinary woman. He had scolded her on the surface, but in his heart, he was in turmoil.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">She was no ordinary woman, but Huiyin was very reasonable. How could she be portrayed as a troublemaker? It's like trying to explain snow to someone who has never seen it.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">So Li Cheng changed his approach. \"Huiyin is, after all, the Princess of Huaiyin. As you said, she doesn't know many people, so she might have social issues. I thought that having you host flower and tea parties at home to broaden her social circle would help.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Grand Dowager Wu hadn't expected her grandson to be so considerate of Princess Zheng. Every word he said seemed to defend her and work in her favor. She wanted to bring up the idea that Nanny Liu had suggested, but she decided to keep quiet until things were more settled.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">She simply said, \"You've just returned, and now you want to host another banquet? I don't understand these things, so I'll leave it to Steward Qian to handle.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Li Cheng returned in defeat and told Huiyin about it. Huiyin consoled him, \"This is only natural. Why do you think people strive to reach the top? It's because they don't want to be controlled by others. If the person in charge is reasonable and broad-minded, it's fine. But if they are mediocre and still like to give orders, who would willingly stay under them?\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">\"You're quite bold to say such things. No matter what, we must respect our grandmother,\" Li Cheng said, lacking conviction.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Huiyin stood up. \"Fine, I won't say anything more.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Before, the two of them would only talk about love, as they were alone in Xuzhou without any conflicts. Now, with his elders and external matters involved, these were crucial points of adjustment for the couple.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Seeing Huiyin like this, Li Cheng thought back to their time in Xuzhou. He remembered how she hadn't gotten upset when he revised the entire gift list, but now her temper seemed a bit sharper, though what she said made sense.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"Don't. If you don't tell me the truth, who will?\" Li Cheng said with a smile.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Huiyin knew he was still young, only in his early twenties, and couldn't yet believe in the dream of uniting the world. Moreover, Li Cheng's execution was strong, indicating he was a pragmatic person. He always did what he could and never reached for things beyond his grasp.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Therefore, Huiyin said, \"Don't try to get the household management for me. If Grandmother doesn't want me to manage it, I won't. I'm serious. As long as we can be together, I'm happy.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">\"No, I said I would help you get it back, and I will. Because I like you, I want to give you all the good things. Liking someone shouldn't mean letting them suffer.\" Li Cheng disagreed with Huiyin.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Liking someone shouldn't mean letting them suffer.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">He suddenly stood up and rushed out. Nanny Nan came in from outside, confused. \"Princess, Little Prince...\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">\"Let him be,\" Huiyin thought. Grand Dowager Wu was not always clear-headed and struggled to distinguish right from wrong or close from distant. Li Cheng had a tendency to be insistent.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Sure enough, soon after, Qiū Fēng ran over. \"Princess, Little Prince has asked Steward Qian to report the accounts, and he has also summoned the four head accountants. It seems he is going to audit the books.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Huiyin tapped the table. \"Here it comes.\" She didn't want to provoke Li Cheng unnecessarily. Grand Dowager Wu thought she could suppress others with her seniority, but she was mistaken. Li Cheng was not someone to be underestimated.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\"></p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">On the other side, Grand Dowager Wu was still doing her morning prayers when several servants rushed in to alert her. She stood up and said, \"What's happening? Is he questioning my trustworthiness?\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">The servants were just kowtowing, which made Grand Dowager Wu so upset that she sent Nanny Fan to relay a message. Nanny Fan was cursing inwardly, \"Why do they only come to me when there’s trouble? Never for anything good!\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">But as a servant, what could she do? She could only go and deliver the message.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Li Cheng, however, smiled and said, \"Grandmother, what are you talking about? I am the Prince of Huaiyin, so of course I will look into the accounts of Huaiyin Mansion. There's no need for you to worry. I'm just here to check on the situation of the mansion. As the saying goes, the man takes care of external affairs while the woman manages internal affairs. How could I not check?\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Nanny Fan had no choice but to return and report Li Cheng's words to Grand Dowager Wu.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Grand Dowager Wu wanted to scold him again, but she found herself helpless. What could she possibly scold Li Cheng for? He was her backbone. If he really wasn't up to par, even the fiefdom of Huaiyin might be lost. Wouldn't she then be living under someone else's roof? Moreover, this mansion indeed belonged to Li Cheng.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Li Cheng was certainly not just eating the rice of idleness. From a young age, he had learned how to manage the Prince of Wu's Mansion alongside the Prince of Wu. Later, when he joined the Prince of Wei, the first task the Prince of Wei assigned him was not to lead troops but to manage the Prince of Wei’s Mansion.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">As he went through these account books, he couldn't help but wonder how confident the steward of Huaiyin Mansion must have been, thinking that no one would check the accounts. The books were a mess, with random scribbles.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">He couldn't help but address Steward Qian, \"My grandmother never hosts any banquets, and we don’t often exchange gifts or formal courtesies. So how is it that the silver I allocated has already shown a deficit? I need you to carefully recalculate the remaining silver.\"</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Steward Qian, being a chief steward, first glanced at Li Cheng before trying to clear his name. \"Little Prince, we didn't embezzle anything. Some of the remaining silver was handed over to the Dowager. This year, the Dowager donated 20,000 taels of silver to the four renowned temples.\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">\"Wait, which four temples did you donate to, and when? I'll send someone to check on horseback right away. You'd better tell me the truth; otherwise, I won't spare you from punishment.\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">\"Yes, it was to Datuo Temple, Puji Temple, Guanghong Temple, and Longkong Temple,\" replied Steward Qian. Although he had indeed embezzled a little here and there, it was only petty cash. He certainly hadn't taken any large sums.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Li Cheng first sent people to investigate, and then he had Steward Qian and several accountants lead him to check the mansion's storerooms. To his surprise, this year, the storeroom for rewards had only about one-third of its contents left.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">\"Tell me, where did all these things go? Don't try to deceive me, or I won't be polite.\"</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Steward Qian had no choice but to kneel and confess the truth. He had embezzled 5,000 taels, and half of the items in the mansion's storeroom had been sold off by him. The other four accountants together had embezzled another 5,000 taels.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">One of them even admitted to falsifying accounts, saying that out of the 5,000 taels donated to Puji Temple, 1,000 taels had been embezzled by him.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">\"Good, good, good. So, you're all a bunch of parasites. That's already 30,000 taels. And what about my rice allocations? When my father, the king, was enfeoffed in the Jiangnan region, he was granted 1,352 qing of reclaimed lakebed land and 10,000 qing of manor land. After my father passed away, 400 qing were allocated to my uncle, the Prince of Wei, and the rest was inherited by me. So why is it that now, there's only old rice left, and the new rice is so scarce? How have you been managing this household for me?\"</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Li Cheng was so enraged that he nearly unsheathed his sword and executed them right there.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Steward Qian was so scared that he soaked his pants in fear and collapsed on the floor. Normally, Li Cheng would have gagged him and taken him away for a beating, but since Grand Dowager Wu had been managing the household for several years, he decided to confront her directly instead. \"Tell me the truth.\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">\"Yes, it was the Dowager who ordered us to sell the items. She kept the old rice for the people in the mansion and reserved the new rice and the japonica rice from the imperial estate for herself. The rest was all sold because the Dowager was afraid it would get infested if left for too long.\" After saying this, Steward Qian lowered his head and remained silent.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Li Cheng sneered, \"Since the Dowager is old, you're all shifting the blame onto her. Fine, say that in front of her. Come, bring the Dowager here.\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">If Grand Dowager Wu didn't care about her dignity, then he wouldn't spare her either.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">The message quickly reached Grand Dowager Wu, who immediately became alarmed. \"How could I possibly confront a servant? Family matters should be handled within the family… He should have beaten Steward Qian to death on the spot.\"</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Nanny Fan also hurriedly asked, \"What should we do, Dowager?\"</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">\"Say that I am unwell and unable to come. In the past, all household matters were entrusted to Steward Qian. I know nothing about anything else.\" After saying this, Grand Dowager Wu feigned weakness, looking like she might collapse at any moment.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Nanny Fan relayed Grand Dowager Wu's words to the messenger Li Cheng had sent. Even the servant couldn't help but show a hint of contempt in their eyes.</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">Within two days, Huaiyin Mansion had replaced all its staff. Li Cheng forced Steward Qian and several accountants to return all the embezzled silver from over the years. Even Grand Dowager Wu pretended that she had been saving the money for Li Cheng. Li Cheng then handed all the money over to Huiyin and put her in charge of the household again.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">Looking at the room full of silver, Huiyin signaled for Li Cheng to calm down. \"I understand now. Money and power go hand in hand with love. Take a seat and relax.\"</p><p id=\"paragraph-118\" data-paragraph-id=\"118\"></p>\n</div>"
  },
  {
    "number": 37,
    "title": "Chapter 37",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 37</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Double Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Li Cheng certainly couldn’t say that the Grand Dowager Wu had mismanaged the household, so outwardly he stated that the household servants of the Huaiyin Mansion had extorted and deceived the Grand Dowager, using these reasons to deal with them all.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Although it’s said that still water runs deep, on the other hand, if greed is not eliminated, it will harm those who are not greedy. These corrupt individuals—which one of them didn’t try to drag others down to shut them up?</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">After cleaning out so many people, Li Cheng had people dispatched from Xuzhou, leaving only a few to guard the mansion there. He had brought almost all the important matters with him this time.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Embarrassed by the massive corruption among her subordinates, the Grand Dowager Wu stayed home to fast and pray instead of going out. Huiyin, on the other hand, helped rebuild a Buddhist hall and converted a quiet residence in the mansion into a family nunnery, inviting several nuns to fill the space and claiming she was discussing Buddhist teachings with the Grand Dowager Wu.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">These expenses, though only around one thousand taels of silver, earned her a good reputation, which was more valuable than the daily ritual of paying respects. After all, real gold and silver were spent, so no one could say anything.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">It was also said that some servants from Xuzhou would come over, including Granny Chao and Yun Hui. However, Huiyin had almost arranged the staff here and didn’t want to employ Granny Chao and Yun Hui anymore, so she apologized to them: \"Yun Hui, we didn’t know you were coming and had already prepared someone for the position. The only place currently lacking a steward is the Snow-Sleeping Nunnery.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Granny Chao spoke up for her daughter: \"Young Princess, this doesn’t seem appropriate.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Huiyin smiled: \"Mother, I’m doing this for your own good. The money steward and the four main accountants were caught embezzling funds, and somehow your name was implicated in the affair. I’m aware you are the wet nurse of the young prince, so I suppressed the matter. The prince’s eyes cannot tolerate sand, so I transferred your elder daughter to a quieter place. When the prince’s anger subsides, I’ll speak on your behalf.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Fearing they wouldn’t believe her, Huiyin said to Nanny Nan: \"Bring over the statements made by the money steward and the private accounts recorded by his nephew for verification.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Granny Chao didn’t know that there had been a major overhaul in Jianye. Huiyin immediately presented the evidence to Yun Hui. It’s okay if you, Granny Chao, are illiterate; Yun Hui can read.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Yun Hui picked up the ledger and examined each entry, along with the fingerprints of the money steward. It stated that one hundred taels of silver were allocated for the young prince’s lamp oil, but less than two taels were actually used, with the remaining ninety-eight taels being offered as a tribute to Granny Chao. This was just one item; several others followed.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">In fact, Yun Hui was well aware that anyone could be found at fault if investigated. They were using her mother and daughter to curry favor with Li Cheng.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Obviously, Yun Hui was more pragmatic than Granny Chao and immediately said: \"We will do as the young princess says.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"It’s not just what I say; I’ve saved your lives,\" Huiyin didn’t mind. She didn’t like factionalism and acknowledged that Yun Hui had certain abilities and was fair and impartial. Therefore, she had given her a chance. However, this person not only met secretly with Yin Liyi outside in Xuzhou, speaking ill of her behind her back, but Huiyin also received a letter from Xuzhou stating that Yun Hui had put on makeup, hoping to seduce the young prince.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">With all these accumulated incidents, if she didn’t address them, would Zheng Huiyin be nothing more than a figurehead?!</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Granny Chao almost fell to the ground, and Huiyin coldly looked at her: \"If you want to cause a scene, go ahead, but don’t disgrace your family.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Previously, no matter how Granny Chao treated Huiyin, she wasn’t afraid because she was the wet nurse. The Grand Dowager and her group were still around, and the princess was just an outsider and a young daughter-in-law. Now, she had been brought down.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">After dealing with Granny Chao and her daughter, Yun Hui, she promoted the son of Nanny Fan to be the second steward. Nanny Fan became even more open and honest with Huiyin.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Even the previously cunning Liu Niang was reported by Nanny Fan, and Huiyin dealt with her directly.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">But she also uncovered from Liu Niang the suggestion made to the Grand Dowager Wu, which was to have Li Cheng marry the younger sister of the wife of the Prince of Wei from the Huo family. This was indeed hard to refuse. Although Li Cheng and the Prince of Wei were of different generations, it didn’t matter to the Huo family. Becoming a secondary consort would still provide status and could enhance the relationship between the Prince of Wei and Li Cheng.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">\"I plan to hold a flower banquet when the first snow falls. If the green plum blossoms bloom, it will add an elegant touch.\" Huiyin decided to suppress these matters for now and actively expand her network in Jianye.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">In the past, whenever she relied on men’s connections or achieved success through them, she always worried that people would question her authenticity. Later, she realized why Li Cheng stood up for her. Besides liking her, he also acknowledged her abilities and talents, which were her own strengths. Moreover, when men rely on others, they can be even more stubborn than women.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">To be honest, there are many people who are not up to their positions, but at least she has proven herself worthy of hers.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Li Cheng had no objections: \"This is naturally very good, and you can arrange all of these.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">\"Well, our Jing’er will soon be six months old, and you’ve been here for two months. I wonder if we’ll be able to spend the New Year in Jianye this year?\" Huiyin asked.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Li Cheng smiled: \"That’s not something I can decide. Anyway, I’ll be at the mansion when I’m free. By the way, the weather is turning cold, and Uncle Prince of Wei is preparing for a hunt. You ladies can also join us for some relaxation.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Huiyin was delighted to hear this, and when she went to pay her respects to the Wei Imperial Consort and the Princess, they also mentioned this matter.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">The Princess of Wei smiled: \"We thought, coming from the north, you must be skilled at horseback riding. We women of Jiangzuo, the eastern region known for its sword dancers, can also show off our skills. We can all have fun together then.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"Although I am in Jizhou, my horse riding skills are mediocre. I still want to ask Aunt Wu, what kind of items should we bring?\" Huiyin felt that ever since the Grand Dowager Wu began to \"devote herself to Buddhism,\" her relationship with the Prince of Wei's mansion had grown closer.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">In the past, they were very familiar with the Grand Dowager Wu. Even now, they praise her in front of me. Do they really not know what kind of person she is? No, it's just plain annoying. Don't think only the old men and women at the village entrance like to stir up trouble and use others to their ends. Underneath all that refinement, the noble royals are no different from anyone else.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Huiyin once had great admiration for the Eastern Palace, but later realized it was nothing special. Once you demystify authority, you begin to judge it objectively.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">The Princess of Wei mentioned many things, and the Grand Dowager Wei asked about the Grand Dowager Wu: \"How has my old sister been these days? I've been wondering why she hasn't come.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"When we hold a banquet at home, we will definitely invite you and Aunt Wu to come over and meet Grand Dowager Wu. She spends her days discussing Buddhism with the nuns at Woxue Nunnery, and even our young prince is rarely seen,\" Huiyin said.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">The Princess of Wei knew she was making things up. The Grand Dowager Wu used to be full of resentment when she was in the palace and couldn't keep her mouth shut. She couldn't go a day without gossiping. The idea that she is now devoted to Buddhist studies is clearly nonsense. But she couldn't expose her; after all, the Grand Dowager Wu was from the Huaiyin Mansion.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">So, the Grand Dowager Wei only said, \"Very good.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">After paying her respects to the Grand Dowager Wei, Huiyin went to visit the Princess of Wei alone. There, the Princess's eldest daughter, Princess Jianjia, was writing nearby. The young princess, though not very old, held herself high due to being the legitimate daughter of the principal wife. This isn't to say she was bad. Huiyin judged a person by their environment. Except for a few individuals who were completely unaffected by their surroundings, most people were shaped by their surroundings.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">This Princess of Wei appeared to be a composed matriarch, but inside, she must be anxious. After all, without a son, the position of heir would fall to someone else, which was why the princess was so sensitive.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">It wasn't that Huiyin loved to judge others, but she believed that knowing your enemies and allies leads to victory. These people could be allies or rivals, so she needed to keep a close eye on them.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"Royal sister-in-law,\" Princess Jianjia came over to greet her.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Huiyin smiled and took her hand, \"I haven't seen you for a few days, and you seem to have grown even more graceful. I heard from your mother that you're now studying the Four Books; it's great that reading really helps you understand things better. By the way, I brought some Yulu Tuan and Touhua Ci from our mansion. You can take a break while writing and have some snacks.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Thank you, Royal sister-in-law,\" the princess replied with a smile.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">The Princess of Wei had her wet nurse take her away to have some snacks and then, appearing to open her heart, said, \"I understand the situation in your mansion. However, since our Dowager and your Dowager are close, I don't feel it's appropriate to say anything.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">This was a gesture of goodwill. If Huiyin were only nineteen years old, she would have been deeply grateful. But now, she only expressed gratitude on the surface, \"I have always known how much you care for me. I have already told our young prince about your kindness. He said that when he was at the Prince of Wei's mansion, everything depended on your care.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"It's nothing special. It's only natural. I can't manage the affairs of the men outside, but we women, especially with our close relationship, mustn't become estranged and become a joke to outsiders. To be honest, I envy you. I have to constantly take medicinal potions,\" the Princess of Wei was actually showing her vulnerability. This method was the best way to shorten the distance between people. When someone usually high and mighty shares their troubles with you, it doesn't feel fake.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Who knows what will happen to the whole of China in the future? But at present, even noble ladies, if they don't have sons, seem to be at a disadvantage.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">There were many things Huiyin could brush off, but not this one. She couldn't help much in this matter, \"Royal Aunt, you are still young.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">The Princess of Wei waved her hand, \"If I were able to have children, I would have by now. Look at how fortunate you are to have given birth as soon as you entered the household.\"</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Huiyin quickly said, \"It's not much fortune. They say life is either a struggle followed by success or a smooth start followed by challenges. Royal Aunt, as a noble princess, you have such a sensible eldest princess. As the saying goes, flowers bloom before bearing fruit. You will definitely have a young prince in the future. Don't worry.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">\"Your words have certainly made me feel much lighter,\" the Princess of Wei said.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">The two chatted for a few more moments until Su Mama, who was by the Princess of Wei's side, came in and said, \"Madam, the wife of Yin Recorder has come to pay her respects.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">The Princess of Wei explained to Huiyin, \"This is the mother of Consort Yin. They live not far from us.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Huiyin thought that since Consort Yin had already given birth to the Prince of Wei's eldest son, why was her father still just a recorder? She voiced this thought.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Su Mama, who was by the Princess of Wei's side, smiled and said, \"What is the young princess saying? Our princess has mentioned this to the prince before, but Consort Yin firmly refused. She said she knew her father's abilities, and if he were given a position too high, it would not be a blessing but a disaster for him. So, the prince only gave some monetary rewards to their family, allowing the Yin family to buy their current residence.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"So that's how it is,\" Huiyin thought. This Consort Yin is quite clear-headed. It seems she is not someone who suffers unnecessarily. It's likely that Yin Recorder truly lacks ability.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">This reminded her of her own experiences. In her previous life, her father was good at military strategy but lacked cunning, often leaving himself isolated without reinforcements. If she hadn't poisoned Li Heng in the end, Wei Duo would have targeted the Zheng family.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Soon, a beautiful woman entered, accompanied by a rather delicate young girl, about thirteen or fourteen years old. The girl was graceful in appearance and manner.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Su Mama was quietly introducing, \"Madam Yin, this is our Huaiyin Princess.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Madam Yin bowed and said, \"I pay my respects to the princess and the young princess.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">\"Please rise quickly, oh, why did you bring your niece along today?\" Princess of Wei was clearly quite familiar with the Yin family.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Madam Yin sighed, \"This child has been in mourning for her mother, who passed away. Her father died early, and her only brother has gone to Donglai. So, we brought her here and now consider her one of our own daughters.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Princess of Wei added that the child's father had once been a companion of Prince Wu, whose daughter had married into Princess Huiyin's family. Princess Huiyin then asked Nanny Nan to reward her with a pair of gold and silver ingots with crabapple blossom designs and said with concern, \"Since you are an old friend, I hope Madam Yin will bring your third daughter to visit our residence soon.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Madam Yin looked up at Princess Huiyin and saw her wearing a peach-yellow satin robe with red and white floral embroidery. Princess Huiyin's appearance was exquisite and charming, and Madam Yin dared not meet her gaze, able only to stammer a reply.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Noticing Madam Yin's awkwardness, Princess of Wei had her leave after she finished paying her respects.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Princess Huiyin continued talking with Madam Yin, while Madam Yin and Yin Lifang happily struck up a conversation. Yin Lifang took her younger cousin's hand and said, \"Since you're now part of our family, I'll treat you as my own sister.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">\"Big Sister,\" Yin Lijun had heard since childhood that she resembled her elder cousin, so she naturally felt affection towards Yin Lifang.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Noticing that her mother had something to say, Yin Lifang sent Yin Lijun off to tour the garden. Afterward, Madam Yin said, \"Just now, I saw the Princess of Huaiyin, and she rewarded Lijun with a pair of ingots.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Yin Lifang paused, \"Mother, let's not bring up the past. The princess now has a husband and child, and their marriage is quite good. It's best to let it go.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"Even so, the position of Princess of Huaiyin could have been yours. It was so close, just one step away. Princess Wu personally promised it, and I was overjoyed back then. But the couple died too early, and you were chosen by Prince Wei,\" Madam Yin said regretfully.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Madam Yin had always believed that Princess Wu favored her second daughter because she was pretty and lively, able to play well with boys, unlike her quiet and reserved elder daughter. Their family held a low-ranking position as recorders, but they relied on the childhood friendships between their children. Even becoming a secondary consort was difficult, yet Princess Wu had promised them the position of primary consort.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Yin Lifang looked around and said, \"Mother, let's not talk about this. If Prince Wei were to hear, what would he think? Besides, we can't mention this in front of Liyi.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Madam Yin nodded, knowing that her elder daughter was always prudent. Mr. Li had previously taken care of the second daughter because of the elder daughter. Unexpectedly, Liyi had misunderstood and, favoring Xie Jiuyi, had distanced herself from Mr. Li.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">After some casual conversation, Yin Lifang brought up matters of the household, \"Prince Wei favors Consort Xu more, and originally, we had no conflicts. But after I gave birth to the eldest son and gained favor in the residence, she began stirring up trouble, to the point where even Princess Wei couldn't tolerate it.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Madam Yin felt deeply pained.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Yin Lifang then mentioned the upcoming hunting event, for which her son would also participate, requiring her to make early preparations. Consort Xu was pressing closely, and if her son were to inherit the position of prince, how could she allow her son to exist?</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">**</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Half a month later, Princess Huiyin joined Li Cheng for the hunting event, leaving Nanny Nan and Fugui, her trusted confidants, behind, as she was most concerned about her son.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">\"Maybe I shouldn't go. The child is too young, and we just reorganized the residence. It wouldn't be good if someone with ill intentions took advantage of the situation.\" Whenever this thought arose, Princess Huiyin wished her natal family were nearby.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Li Cheng, hearing her concern, also felt uneasy but said, \"Don't worry, I will leave people here in the residence.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">But the couple was still worried and, looking at each other, Princess Huiyin said, \"Why don't we bring the child along? It's just an extra carriage, and it's only a day or two away.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Rather than worrying about the child's discomfort during the journey, the couple feared potential harm. If Grand Dowager Wu were more reliable, it would be better, but she was the least dependable. Li Cheng agreed.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">\"Our boy is almost seven months old; it should be fine. He rarely even sneezes.\" Princess Huiyin was reluctant to leave her son, so she took great care in bringing him along.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Li Cheng told her about the participants in the hunting event, \"Mostly local noble families from Jianye. Although their status is not as high as yours, as you know, these families have both wealth and talent, and I need those people.\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Princess Huiyin held his arm and said, \"I understand. You mean for me to control my temper, right? Got it.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">\"No, I mean if someone provokes you, you don't have to be straightforward. You’re a straightforward person.\" Li Cheng knew his wife was a straightforward northern lady, somewhat strong-willed. It was fine at home, but elsewhere, some people might scheme behind the scenes.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">He remembered Yin Liyi had been schemed against, which he had discovered by chance. Those young ladies' methods were no less sophisticated than the boys'.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Princess Huiyin tilted her head and looked at him, \"Thank you, I understand.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Then, she helped him hang a scented sachet, \"Since giving birth to Jing'er and being busy with household matters, I finally made a scented sachet after so long.\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Li Cheng looked at it, seeing the dark blue satin base with exquisite embroidery of rich and noble peonies. The sachet was primarily in blue and green, with jade beads attached to the cord, conveying both wealth and elegance.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">\"This scented sachet is embroidered so beautifully; let me smell what's inside.\" He undid it, put it to his nose, and it was not a pungent refreshing scent nor sandalwood, but a very pleasant fragrance. The sachet contained jasmine, osmanthus, rose, peppermint, and rosemary, creating a refreshing fragrance.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Huiyin explained, \"This kind of fragrant pouch is perfect for use in the carriage. You know how it can start to smell stuffy and unpleasant if you sit inside for too long. So this pouch can dispel the bad odor and stuffiness.\"</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">She was the type to either go all in or not at all, and when she did something, she gave it her full attention. This was especially true for incense making—a skill she knew nothing about initially. But after being mocked at a social event, she began to study it intensely, even learning medicinal cuisine as part of her research into the art of incense.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Upon hearing this, Li Cheng liked it even more. When he saw Huiyin asking someone to bring flour, he asked in surprise, \"Are you planning to make hand-pulled noodles for me? The kind you made for me in Xuzhou?\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Huiyin covered her mouth and laughed. \"What? Do you think I don't value you enough?\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Li Cheng lowered his head and said, \"I just feel like... the love you have for me isn't as much as the love I have for you.\"</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">\"Don't be so calculating. We are a couple; we have a lifetime to love each other. Those who love desperately from the start, I find that rather fake.\"</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">A few words from her cheered Li Cheng up again.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">On the day of the outing, the sky was clear and bright. Jing'er was getting stronger, and Huiyin felt like she could hardly hold him anymore. Fortunately, the road was wide enough. It took them a day's journey to reach the hunting grounds. The men, unable to wait any longer, eagerly rode off into the woods. The women, on the other hand, went to freshen up first and would ride horses later for leisure.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Li Cheng rode the Dawan horse that Huiyin had given him, and it was as if he had divine assistance, charging into the woods early on. Seeing this, Prince Wei shouted, \"Exhilarating!\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Curious about how Li Cheng's hunt would turn out, Huiyin planned to settle the child and take a nap. It had been ages since she last rode for fun.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">After helping Jing'er bathe, the mother and son slept deeply in bed.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">When they woke up and arrived at Princess Wei's door, they learned that something had happened. It was said that Prince Wei's eldest son, Jing'er, was missing. Princess Wei and Consort Yin were anxious. As soon as Yin Liyi saw Huiyin, she asked, \"Young princess, have you seen Jing'er?\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">\"No, how is it that despite so many people around him, he's missing?\" Huiyin wondered if the child had wandered off somewhere while playing.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Consort Yin said, \"He wanted to learn horse riding, but I told him he was too young and wouldn't allow it. So he went to find Master Xie. After that, we couldn't find him...\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">As she spoke, Consort Yin broke down in tears and was ready to rush out to search for him.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Just then, a commotion erupted outside, and before Huiyin could greet them, Consort Yin ran up, crying, \"Prince, Jing'er is missing! What are we going to do?\"</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Prince Wei also hurriedly said, \"Yes, we've already sent servants to search the entire estate, but we couldn't find him.\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">\"Where did the child go missing? Don't worry, I'll send people to search right away,\" said Prince Wei, his heart sinking. Though he favored Consort Xu more, he still cared deeply for Consort Yin and his eldest son.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">As soon as he finished speaking, a servant reported, \"Your Highness, Princess, Consort, the eldest prince has fallen into an old well. It's too deep, about a hundred meters, and it's surrounded by moss. No one dares to go down.\"</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Huiyin feared that if the child had fallen into a moss-covered well, even if they managed to rescue him, he would likely be in grave danger, and the rescuer might risk their life as well. Who would be willing to take that risk?</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Even Prince Wei hesitated. His generals were meant for battle, and besides, he had his beloved son Li Dun. How could he possibly send those skilled generals to risk their lives for a rescue?</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Just as she was thinking this, Li Cheng spoke up, \"Uncle, Aunt, we can't waste any more time. I'll go.\"</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Huiyin quickly looked at her husband, not expecting him to step up at such a moment, and with such urgency.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\"></p><p id=\"paragraph-115\" data-paragraph-id=\"115\"></p>\n</div>"
  },
  {
    "number": 38,
    "title": "Chapter 38",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 38</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Double Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">What was all of this for?</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huiyin was an extremely proud woman. After realizing that Li Heng had given her a sterility potion, she swiftly rebelled. But on the surface, she remained flawless. If she showed emotion toward you, it meant she considered you someone close to her. If she truly wanted to deal with you, you wouldn’t even know how you died.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Li Cheng was anxious to save the child. But instead of looking at her husband like everyone else, Huiyin looked at Yin Liyi. The gratitude in Yin Liyi’s eyes was filled with considerable affection. Honestly, Li Cheng had been very good to her—providing her with status, children, money, and even expressing his affection.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">She had eyes and could see Li Cheng’s infatuation with her.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">After learning who her husband’s heart truly belonged to, how should she react? Should she show cold detachment, explode in anger, make a scene, or choose to be outwardly warm but inwardly cold?</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Huiyin quickly thought of a third path. She couldn’t rely on her family anymore; instead, she needed to build her own power base. If Li Cheng didn’t want to rebel, by the time he was strong with soldiers and horses, and their son had grown up, she and her son would co-rule the world. Li Cheng would have to listen, whether he wanted to or not.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">For now, she couldn’t really get angry and push her husband into someone else’s arms.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Even if she didn’t want Li Cheng anymore, she had to make Li Cheng fall in love with her.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Therefore, when Huiyin heard Li Cheng’s words, she quickly reacted and grabbed Li Cheng’s hand, saying, “You’re too tall and broad-shouldered. We need to see if you can fit down that well first; otherwise, we might waste time rescuing them.”</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">If he were to die, it wouldn’t be now. In her past life, he had lived for several more years, so in this life, she would wait for a more suitable moment.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Li Cheng tightly held Huiyin’s hand and said, “It’s alright. Uncle Wei Wang has been very kind to me. Others have many concerns, so it’s perfect that I go.”</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">“Thank you, Little Prince,” Yin Liyi blurted out before Uncle Wei Wang could respond.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">They all arrived at the well, and Huiyin looked down. It was unfathomably deep. Li Cheng had already started tying a rope around his waist. Before Huiyin could say anything, Yin Liyi, fearing that Huiyin would stop them, quickly pulled her aside and said, “Little princess, let’s wait here. Don’t disturb their rescue efforts.”</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">“Lady Xie, you don’t need to worry about me. I need to be there,” Huiyin pulled her hand away from Yin Liyi and still walked towards the well.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">It was a dark, bottomless well, its narrow walls slick with moss. Li Cheng had a rope tied around his waist, and he was a bit afraid. After all, it was unfathomable, and he didn’t know if Li Jing was still alive. What if someone above had malicious intentions and cut the rope? Wouldn’t he die too?</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">For a moment, he regretted it. Although he was close to Uncle Wei Wang, if he died, wouldn’t all of Xuzhou’s troops and his own forces be absorbed by Wei Wang?</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">But he had to do it.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">“Husband, go down slowly. I’ll watch from here.”</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">When Li Cheng heard Huiyin’s voice, his eyes welled with tears, but he blinked them back, feeling an overwhelming sense of relief. In critical moments, Huiyin was always there.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">“Alright.”</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Huiyin also heard Li Cheng’s voice. After a short while, everyone heard the commotion. Li Cheng carried Li Jing up with one arm, and they were both filthy. Li Jing had choked on water but was only unconscious. Once he was rescued, the doctor began pressing to expel the water.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">When Yin Liyi heard the doctor say that her son was fine, she cried and laughed. It was on this day that she truly confirmed Li Cheng’s feelings. Li Cheng never expressed his affection, but today, in front of everyone, he risked his life to save her son. Coupled with how he had previously cared for Yin Liyi for her sake, Yin Liyi felt warmth in her heart.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Huiyin returned and arranged for hot water for them to bathe. She looked at her son who had just woken up and couldn’t help but think that if women had the same power as men, they wouldn’t have to depend on their families, husbands, or even their sons.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Relying solely on her son wasn’t a viable option. While a mother could wield influence when her son was young, once he grew older, she would be relegated to a position of honorary respect, unable to exert any real power.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">But she couldn’t fight battles, had never learned military strategies, and couldn’t even read geographical maps. She could only rely on others.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Li Cheng took a hot bath, and when he came out, he saw Huiyin staring blankly. He laughed, and said, “What’s wrong? I didn’t even get a scratch.”</p><p id=\"paragraph-28\" data-paragraph-id=\"28\"></p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"I was wondering what you were doing when you went down just now. I understand we should save people, but Prince Wei hadn't given the order yet,\" Huiyin looked at him and said.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">To her surprise, Li Cheng replied, \"I said that for our own good as well. You'll see in the future.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Huiyin was puzzled. \"For our own good? What do you mean?\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">For some reason, Li Cheng seemed very pleased. \"It's a good thing, anyway. Hey, I'm a bit hungry. Let's have the meal prepared.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Huiyin could only agree. She thought that regardless of whether it was for Yin Cifei, this had nothing to do with Yin Cifei anymore. Her priority was to win Li Cheng's heart.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">They had hunted a lot that day, and the table was full of game. Huiyin had grown up eating mountain delicacies, and the cooking skills in Prince Wei’s mansion were excellent, which made her eat several more bowls of rice.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Li Cheng scooped a piece of meat onto her plate. \"You don't know how reassured I felt when I heard you calling me as I went down the well.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"Of course. If you died for someone else, who would I mourn for? Don't do this kind of thing in the future.\" Huiyin said.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Li Cheng held her hand. \"There are too many people here; I can't explain it to you. When we get home, I'll tell you the reason, don't worry.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Huiyin looked up at him and, for some reason, felt that Li Cheng seemed much more relaxed.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">On the other side, Yin Cifei, seeing that her son had fallen asleep with even breathing, couldn't bear to leave and stayed by his bedside. It was her sister, Yin Liyi, who brought her meals.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">\"Sister, you must find out whether this was an accident or someone's foul play.\" Yin Liyi said seriously after putting down the tray.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Yin Cifei nodded. \"I understand this. As you know, our Yin family has little influence. These years, we've relied on my son's status as the eldest son. But now they've started targeting Jing'er. Fortunately, the Prince of Huaiyin saved him today. If it had been any slower, the child might have drowned.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Yin Liyi smiled. \"Sister, it seems the Little Prince has always had feelings for you.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Yin Cifei opened her mouth to scold her sister. \"What nonsense are you talking?\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"I'm not talking nonsense. Don't try to hide it from me; I actually know. Back then, when the Little Prince was managing the Prince of Wei’s mansion, we sisters, along with Xue Huanhuan, worked together. He often put pressure on me, but I really learned a lot from him. So, at first, I shamelessly thought he liked me. But when he entrusted the birthday banquet to you, I realized he favored you.\" Yin Liyi smiled.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">This incident had also brought attention to her sister's intelligence and cleverness. At that time, the Prince Wei’s Consort had been married for three years without giving birth, so her sister was made a concubine.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">She didn't approve of her sister marrying the Prince of Wei. It wasn't that the Prince of Wei was bad; it was just that he liked too many people. Yin Liyi knew her sister didn't love the Prince of Wei either, but when the Prince of Wei wanted to marry her, who would dare to refuse?</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Yin Cifei had been very cautious before, but today, seeing Prince Wei's hesitation and Li Cheng's bravery, old memories resurfaced. Back then, Li Cheng had told her that after this incident, she would stand out, and it would be proper for him to propose marriage.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">But at that time, his mother had just died, and he had to return home. When he came back, everything had changed.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">But for now, the most urgent thing was to find out who had harmed her son.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">The Prince Wei’s Consort was also discussing this with the Prince of Wei. \"The priority is to find the culprit; otherwise, the children in the family will not have peace in the future.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"But Jing'er hasn't woken up yet. The people around him said he ran to the well and disappeared. I've already ordered the wet nurses and servants to be punished. Don't worry, I'll give Jing'er an explanation.\" The Prince of Wei said.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Actually, what the Prince of Wei was most worried about was whether Li Cheng was supporting Yin Cifei. He had originally thought that since Yin Lifang came from a humble background, if she had given birth to a son, it would have been for the Prince Wei’s Consort. But the Prince Wei’s Consort had almost no influence over Li Cheng. He had a clear understanding of the dynamics within his household; Second Consort Xu was completely dependent on him, and the Huo family of the Prince Wei’s Consort was his strongest supporter in the Jiangnan region. Yin Cifei had already aligned herself with the Huo family.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Having the Huo and Xie families wasn't enough; now there was also the Prince of Huaiyin, Li Cheng, helping.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Li Cheng's abilities and talents were outstanding, and he had connections with the Yin family. Was he involved with Yin Lifang?</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">These were the real concerns that troubled him.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">But as he thought about his son being pushed into the well, the Prince Wei’s Consort's accusations all pointed to Second Consort Xu. The Prince of Wei didn't think Second Consort Xu had done it. She didn't have that much influence. He was very clear about that.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">The hunt would continue. The incident of Li Jing falling into the well was treated as a small matter. The next day, everyone, including the Prince Wei’s Consort and Yin Liyi, came except for Yin Cifei.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Today, all the ladies were dressed in riding outfits. Princess Wei glanced at Huiyin and thought that although she had previously found her magnificent and graceful, Huiyin now appeared especially dashing and valiant in her riding clothes. Huiyin had heard that they were going to play polo but hadn’t originally planned to participate. It wasn’t that she didn’t want to join; she just preferred to ride for a while.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Once polo was involved, there would be talk of winning and losing, which would be too exhausting. Since having a child, her energy levels weren’t what they used to be.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">“Aunt—Princess Wei, I’ll get to know them first and ride to relieve my fatigue. My body is not what it used to be,” Huiyin declined politely.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Princess Wei didn’t insist.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Many of the ladies who had come were typical noblewomen from the south. They were generally slender and delicate, giving the impression of being quite small in stature. Huiyin noticed that they seemed to want to talk to her but were a bit shy, so she took the initiative to speak to them.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">She didn’t say much, but after asking their names once, she could accurately remember them the second time. She spoke Mandarin but understood their Wu dialect fluently, with no trouble at all.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">This was something she had learned by asking Li Cheng to teach her. Li Cheng was a man of his word, and Huiyin was very diligent in learning. Though she wasn’t yet at the point of speaking Wu dialect, she could almost fully understand it.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">“Oh, you are General Lu’s wife. Pleased to meet you.”</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">“You are Granddaughter-in-law Gu, granddaughter of Grand Tutor Gu. Truly a distinguished family.”</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Huiyin had now become acquainted with them. She rode her horse at a slow trot and felt refreshed. It had been a long time since she had enjoyed some time alone. Suddenly, she heard Yin Liyi cheering loudly from the side. Dressed in a fiery red riding outfit, Yin Liyi was smiling brightly.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Looking at Yin Liyi, Huiyin thought that people like her, who spoke directly and were somewhat insensitive, actually lived quite well. But what could Li Cheng possibly want to say to her?</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Just as she thought this, Li Cheng rode over, concerned that she might feel isolated. Not wanting her to feel left out, he quickly approached.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">“Why are you here? I just wanted to enjoy the breeze,” Huiyin looked at him. This wasn’t their own mansion, and it would look strange for a couple to be so close in public during the day.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Li Cheng smiled. “I was wondering why you weren’t playing polo with them. If you don’t know how, I can teach you.”</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">“It’s not that. I just want to ride for a bit on my own. Don’t make assumptions. Princess Wei always includes me in everything; it’s not a big deal,” Huiyin shook her head.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">“Alright, I’ll ride with you then,” Li Cheng said, pulling the reins and walking slowly alongside her.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Huiyin was surprised. “Aren’t you supposed to be with Prince Wei today?”</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Li Cheng replied, “They have their hands full today. I can do whatever I want.”</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">After riding a few steps together, unexpectedly, Princess Wei came over to call Huiyin herself. “Niece-in-law, someone was just replaced. Come on over.”</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Huiyin agreed but added, “But I’m not very good at playing…”</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Princess Wei wasn’t concerned. “It’s fine. We just need you to make up the numbers.”</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Li Cheng was worried that Huiyin wouldn’t know how to play and was about to step forward, but Princess Wei intercepted him. “Little Prince, don’t worry. We’re just playing around and won’t take advantage of your wife.”</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Huiyin also nodded at him. She had realized that while Li Cheng might not love her, he was definitely protective of his own. This was why, after his passing in her previous life, it was said that Zheng Deyin still received a regular stipend from him.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">When choosing a husband, don’t just look for someone who treats you well. Look for someone who is fundamentally a good person.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">In fact, Li Cheng was hesitant to watch Huiyin play polo. Seeing her reluctance, he assumed she wasn’t very skilled and decided not to watch. However, bursts of cheers erupted from the field.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Quan, the servant boy next to Li Cheng, said, “My lord, our princess is truly amazing. Just now, her horse’s head collided with someone else’s. I was worried sick.”</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Only then did Li Cheng dare to look towards the polo field. The most eye-catching player was, of course, Yin Liyi, with her bright red clothes and large, sweeping movements. But he also saw a woman in green, swiftly maneuvering on horseback. Her horse was running so fast that she was even able to stand on it, perform a flip, and score another goal.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">To everyone’s surprise, it was Huiyin.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">It seemed her reluctance to join the polo game wasn’t because she couldn’t play, but because she was exceptionally good. Her riding skills were no joke.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Yin Liyi was also taken aback. She had always believed she was the best at polo among the women, but she never expected that someone as calculating as Huiyin could play so well.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Huiyin rarely felt so invigorated. As she came down from the field, she saw Li Cheng and quickened her pace toward him. Yin Liyi watched from the side, thinking that the young prince harbored feelings for her elder sister. On the surface, he seemed close to Princess Zheng, but deep down, his true affection was for Huiyin.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">In fact, Li Cheng was helping Huiyin wipe the sweat from her face. If it had been any other woman, she would have been jealous. Though his wife had complaints in her heart, she still worriedly watched him by the well, not voicing her love but showing it through her actions.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">\"Is my face very red? That's why I don't like intense activities. Every time I move a lot, my face turns red like this,\" Huiyin said, drenched in a fine sheen of sweat, feeling a bit embarrassed as she looked at Li Cheng.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Li Cheng smiled and said, \"You look great. In fact, with this activity, your complexion has improved.\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Huiyin frowned slightly. \"But I've twisted my waist.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">The couple walked away, talking as they went. All of this was observed by the Princess of Wei, who thought that men were all masters of playing their roles. She remembered when she first entered the family, she had only one daughter, Jianjia, for three years. At that time, Yin Lifang was still a lady-in-waiting. Her family background was not prominent, and her appearance was merely elegant, not of breathtaking beauty. She was favored by the Grand Dowager, so the Princess of Wei did her a favor.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Over the years, she thought Yin Lifang's backer was at most the Xie family. Unfortunately, Xie Jiuyi suffered a military defeat. Now, with Li Cheng's favor, if Li Cheng truly loved the Second Consort Yin, there might be room for maneuvering.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Therefore, the Princess of Wei said to the people behind her, \"This time, we must find evidence of who harmed the eldest young master, so we can give the Second Consort Yin an explanation.\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">The specific outcome was that, ten days later, Huiyin heard it was the wet nurse of Li Jing who played ball with him. The ball fell into the well, and Li Jing ran too fast. The wet nurse couldn't catch him, and he jumped into the well. The wet nurse, afraid, pretended not to know anything.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">It was said that the wet nurse had been beaten to death.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Nanny Nan whispered, \"Was this accident definitely orchestrated by the Second Consort Xu?\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">\"Why? Actually, it might not be. It could really be an accident. Without evidence, we can't make wild accusations,\" Huiyin said.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Nanny Nan said, \"I heard that there is a concubine named Mo Ru who is pregnant and is currently by the side of the Prince of Wei. The Second Consort Xu is trapped between two dangerous situations, so she might have acted quickly.\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Huiyin shook her head. \"If she really did it, with her skills, she might end up being hurt by the tiger instead of defeating it.\"</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Her methods were too low. In fact, this also had to do with the Prince of Wei himself. Of course, the Prince of Wei had his own reasons. Whenever someone urged him to establish an heir, he would say that the Princess of Wei was young and that he wanted to wait for the birth of his legitimate son.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">In a moment of thought, they were about to leave. Happily, little Jing'er, the piglet, had no problems at all. Even Jing'er was surprised and asked Huiyin, \"What magical elixir did you eat to have me?\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">\"Don't be silly,\" Huiyin said. She had irregular periods when she was in her maidenhood. Mainly because she was strong-willed and loved to compete, she exhausted herself.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Li Cheng lifted his son high, making Jing'er giggle, and the young father, full of energy, couldn't stop smiling.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Then they heard a young maid outside say, \"Young Prince, Young Princess, the Second Consort Yin is here to express her gratitude with her child.\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Li Cheng immediately looked at Huiyin and said, \"I'll take Jing'er to the back.\"</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Huiyin smiled and said, \"No need. You saved someone, so you deserve their thanks. If you have a reason to tell me, I trust you.\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">There was no need for this secrecy, but Li Cheng got up and left.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Fortunately, the Second Consort Yin didn't show any disappointment when she didn't see Li Cheng. She gently stroked her son's head and said, \"I'm here to express my gratitude. If it weren't for the young prince and you, what would have become of our Jing'er? He almost didn't make it.\"</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">\"The young prince is righteous and always ready to help. Your Yin family has had connections with the Prince of Wei's Mansion in the past. This isn't an outsider. We can only hope that this child will bring about a change in fortune,\" Huiyin said with a warm smile. She wouldn't show any twisted jealousy, which was the lowest form of behavior, making a fool of oneself. If you lost your dignity, people would target you.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">The Second Consort Yin smiled and nodded. \"Yes. Young Princess, I'm not good with words, so I won't say much. This fine ge cloth was sent from Qiongzhou; it's great for making summer clothes for the child. And this white sable fur can be used for hats or coats. As for the tonics, please accept them as well.\"</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">It was evident that even as a secondary consort, her resources were limited. It was said that she still had to support her natal family. Huiyin nodded and said, \"Then I won't be polite and accept them.\"</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">The Second Consort Yin looked very pleased. She knew that Li Cheng had feelings for her and would help her and her son, supporting her rise in status. This was better than anything else. As for Princess Zheng, she hoped that Li Cheng and Princess Zheng would live in harmony. Princess Zheng was the daughter of the Marquis of Zhaojie and the Grand Commander of Jizhou. If provoked, it would mean going against Zheng Fang, which wasn't necessary. Moreover, she also hoped that Li Cheng's daily life would be happy.</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">After staying at the hunting grounds for another day, they returned to the Prince of Wei's Mansion.</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">Naturally, Huiyin was eager to know what Li Cheng wanted to talk to her about, but she couldn't appear too anxious. She had to restrain herself and pay her respects to the Grand Dowager Wu. After her greetings, she was hungry and went to eat, then checked if her son had a fever.</p><p id=\"paragraph-119\" data-paragraph-id=\"119\">When Li Cheng came in at night, she looked at him, and Li Cheng smiled and said, \"Did you wait long? I was worried someone might overhear us. It's actually simple. Before my mother passed away, she asked me to marry her. But at that time, I had just joined the Prince of Wei's uncle, and she was a lady-in-waiting at the Prince of Wei's Mansion. I was also in mourning, so to fulfill this marriage, I needed the approval of the Prince of Wei's uncle and others.\"</p><p id=\"paragraph-120\" data-paragraph-id=\"120\">\"So she was engaged to you...\" Huiyin was surprised.</p><p id=\"paragraph-121\" data-paragraph-id=\"121\">Li Cheng said, \"It was my mother’s dying wish. Let me finish. At that time, I was in charge of the Prince of Wei’s Mansion. She was diligent and hardworking, so I wanted to give her a chance to shine. Unexpectedly, she caught the eye of Wei Imperial Consort, and Uncle Wei Wang also agreed. As a nephew, how could I compete with my uncle? Alas, it was my fault. Even though she was supposed to be the Princess Consort, she ended up as a concubine. I can only try to make amends now. By saving her child this time, I feel I’ve finally repaid my debt to her.\"</p><p id=\"paragraph-122\" data-paragraph-id=\"122\">Huiyin thought that Li Cheng was certainly not someone who could be forced into anything. He likely thought that despite her humble background, Yin Lifang’s virtues and abilities made her worthy of being a Princess Consort. He must have had some feelings for her. Otherwise, Yun Hui was chosen by his father to be a concubine, yet he didn’t follow through with that arrangement.</p><p id=\"paragraph-123\" data-paragraph-id=\"123\">Still, she was grateful that Li Cheng told her the truth and did not hide it from her. Therefore, she said, \"Thank you for being honest with me.\"</p><p id=\"paragraph-124\" data-paragraph-id=\"124\">\"You told me to give you my whole heart and not hide anything from you. Now, I’ve finally settled all my past debts. My heart is now free, and I’m ready to give it all to you. I keep my word,\" Li Cheng said frankly, because he believed that a woman who could still worry about his safety even when feeling jealous was truly worthy of love.</p><p id=\"paragraph-125\" data-paragraph-id=\"125\">Huiyin thought that perhaps Yin Lifang would not see it that way. What if Yin Lifang thinks Li Cheng still has feelings for her, and they end up clashing?</p><p id=\"paragraph-126\" data-paragraph-id=\"126\"></p>\n</div>"
  },
  {
    "number": 39,
    "title": "Chapter 39",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 39</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After returning from the hunting grounds, Li Cheng went back to Xuzhou for an inspection and would return by the Winter Solstice. Huiyin personally went into the kitchen to prepare beef noodles and a sumptuous feast as a farewell gesture for her husband.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">She wasn't the type to throw tantrums. Her son had already been conferred as the heir, and Li Cheng's estate of 200,000 taels was almost entirely managed by her. On usual days, besides her, there was no one else. He made time for her whenever he could. Although she didn't fully believe Li Cheng's reasoning for helping Yin Lifang so much out of guilt, her approach wasn't to be angry or sever ties but to elevate herself.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Thus, she smiled and said, \"I noticed that Jianye is bustling with trade and filled with shops. However, I'm not interested in opening any other kind of shop, nor do I have the talent for it. How about we open a barbecue and noodle shop? These are two things I love to eat, and when I miss home, I can just go there.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Opening a small shop, of course, met with no objection from Li Cheng. He even remarked, \"Isn't this a bit too small-scale?\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"Why would I do that? I know my limits,\" Huiyin replied confidently. She had ideas; she was inspired by the rice shop run by Hu JiaoJiao and realized she could establish a covert communication hub right in the city.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">A small barbecue and noodle shop—who would suspect anything?</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">But with branches in Jianye, Xuzhou, Qingzhou, even Jizhou, and the capital, passing messages would be very convenient.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">She wasn't going to tell Li Cheng about these plans just yet. Li Cheng, on the other hand, had already shared much with her. \"In the future, you'll manage the accounts of our mansion. Don't worry about Grandmother; she's doing well now, chatting with those nuns every day, and someone keeps her company. I'm going to Xuzhou to also check on the situation in Qingzhou. I always feel that the tree desires stillness, but the wind will not cease. You don't know how much Uncle Wei Wang regrets losing Qingzhou.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Territory has to be fought for; no one will simply hand it over. Huiyin understood this principle. She even knew that in her past life, Li Heng went to Xuzhou and fought with Li Cheng's soldiers, resulting in countless casualties. If Li Heng weren't his own brother, he would have been dead by now.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">But Li Cheng had also fought for several years and was shot by an arrow. It was said that he eventually died of poisoning while continuing to head north.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin felt compelled to plan for him now. \"I understand, but you also need to think about yourself. The people from Empress Dowager Guo's family, though mediocre in talent, hold positions like Taiwei or the Three Dukes. You have plenty of soldiers and food, but you're only a Naval Commander. It's not that we're selfish, but people need to think about themselves.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">\"I understand,\" Li Cheng smiled.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Seeing that he didn't seem as repulsed as before, Huiyin felt a little more at ease and said to him, \"Then later, I'll personally see you off.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Li Cheng was eating his noodles and nodded.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Once Li Cheng left, Huiyin began preparing for the noodle shop. The flour had to be brought from the north, and she took it directly from her dowry storage. The shop was opened in a busy market area. It wasn't large, and the name of the shop was very simple—\"Zhang Laosan Noodle Shop.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">The only thing different about this shop was its tables. The front few were small square tables, all second-hand purchases, while the tables at the back were charcoal grills, indicating that this place also served barbecue. The prices were affordable, even the drinks cost only two or three wen a cup, something everyone could afford.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Initially, people were intrigued by the sight of someone making noodles right there at the stove, but after trying it, they found it delicious, and the business gradually became very popular.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Seeing that the business was thriving, and with the first snow having fallen, Huiyin decided to host a \"Plum Blossom Snow Banquet.\" She had attended many flower banquets, poetry gatherings, and elegant assemblies in the capital but had never hosted one herself. In her past life, she had been confined to the small space of the Eastern Palace, and later, as Empress Dowager, she didn't even host her own events.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Now, she used the \"Plum Blossom Snow Banquet\" as a theme to invite guests widely. Guests didn't need to bring gifts; they only had to wear clothes or accessories with plum blossom motifs.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Most people just needed to have invitations sent to them, but Princess Wei had to be visited personally by Huiyin.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Princess Wei was delighted to see Huiyin and, after reading the invitation, said happily, \"Rest assured, I will bring Jianjia with me to support you.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">\"Oh, that's wonderful! I'm still new here and don't know much about these things,\" Huiyin said with a happy face.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Princess Wei then asked, \"Did you only send me an invitation?\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Huiyin thought for a moment and said, \"I came here personally to invite you. Besides that, I've sent invitations to the Huo family, the Lu family, and a few others.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Princess Wei smiled and pointed at Huiyin, \"Didn't you realize you missed someone?\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"Please enlighten me?\" Huiyin genuinely hadn't realized she missed anyone. After returning from the hunting grounds, several ladies had come to visit her, and she had invited people she was familiar with.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Princess Wei said, \"You didn't invite Yin Lifang and Xu Ci-fei?\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Huiyin patted her forehead, \"I thought that since you're the lady of the mansion, informing you would suffice. It's my fault.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Princess Wei was flattered by this compliment, as she indeed remained the undisputed mistress of Prince Wei’s Mansion, and the status of the two secondary consorts could not compare to hers. However, she remarked that Huiyin had not been attentive enough in her duties.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Huiyin obediently admitted her mistake.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Princess Wei was well aware that no matter how magnanimous Lady Zheng appeared, she likely harbored deep jealousy towards Second Consort Yin. What she didn’t know was that Huiyin was thinking about how Li Cheng must have liked Yin Lifang back then as well. Otherwise, why would he have risked his life to save her son before bidding her farewell? The deeper the love, the deeper the guilt, but it wasn’t necessarily an everlasting love. If it had been true love, he surely would have revealed himself by now.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">As Li Cheng himself had said, true love means not letting the other person suffer. At the very least, if Li Cheng had truly cared for her, he wouldn’t have acted so recklessly in front of Prince Wei. If Prince Wei had suspected an affair, Second Consort Yin would have suffered greatly, and Li Cheng wanted to sever ties quickly.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">To those who didn’t understand Li Cheng’s personality, his actions might seem strange. But Huiyin believed she understood him well enough. He was the type to act decisively, with strong execution, never dragging things out.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">After returning from Prince Wei’s Mansion, the annual gifts from Jizhou had arrived. They were brought by Tong Niangzi, a trusted aide of Huiyin’s mother. Tong Niangzi had once led a group of women under Huiyin’s mother, and when Madame Ji remarried, she came along with her husband and son.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">When Huiyin was young, it was Tong Niangzi who taught her how to ride a horse. Now, seeing Tong Niangzi again, she felt very close to her. “Aunt Tong, come in and sit down quickly. I wrote a letter earlier saying there’s no need to send gifts this year,” Huiyin said warmly.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Tong Niangzi smiled. “Madame is very concerned about you, especially after receiving your letter. However, I just heard from Nanny Nan that you were unwell. I believe Madame will be very happy to hear that you're better.”</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">“That was just a passing complaint of mine. Was it a snowstorm when you came?” Huiyin asked, holding her hand.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Tong Niangzi waved her hand. “The snow here isn’t cold at all.”</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Huiyin shook her head. “The cold here is a damp cold. It’s cold both inside and outside, and we can’t even heat the kang. I really wish I could take the Prince back home with me someday and sleep on our family’s warm kang.”</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Tong Niangzi patted Huiyin’s hand. “From what you’ve said, it’s clear that the Prince and you share a very good relationship.” She then asked how Prince Wei treated them.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">“Prince Wei treats us very well, no complaints at all.” Despite feeling that Prince Wei was indecisive about choosing his heir, the civil and military officials in the Jiangnan region were all loyal to him.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Her own husband also had some prestige, but it would be difficult to surpass Prince Wei’s influence in Jiangnan.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Tong Niangzi also brought some news: “A lady-in-waiting from the Eastern Palace is pregnant. Although her background is humble, she is pregnant before our eldest miss. Madame Ji and Master are quite upset.”</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Based on the timing, it should be Dong Yuniang. In her past life, Huiyin had struggled to outmaneuver Dong Yuniang, who was a formidable opponent.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">“This lady-in-waiting was given by Empress He. It’s said that she was very lucky to become pregnant soon after entering the household. Now, the entire Eastern Palace is doting on her pregnancy.” Tong Niangzi sighed.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Huiyin thought that without her, Zheng Deyin and Lu Xiao would likely be unable to contain Dong Yuniang. And now, the only heir Li Heng wanted was from Dong Yuniang’s womb. Her low birth meant she had no backing, and Empress He could strengthen her relationship with Li Heng through this.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">But Huiyin couldn’t reveal what she knew from her previous life. She could only say, “Since she can be pregnant, so can the Crown Princess. Perhaps our eldest miss will also become pregnant soon.”</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">“It’s been a few years since she married, and there’s been no sign of pregnancy. Empress He won’t let the Eastern Palace be idle. Now that Dong has been sent in, who knows how many more will follow.” Tong Niangzi was also tactful in her speech.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Huiyin smiled and shook her head. “This isn’t about luck. No one is born fortunate. It’s all about making things happen.”</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">In her previous life, Zheng Deyin often wrote to say that Li Cheng had someone in his heart. She had spent most of her days alone, almost like a widow, and now Huiyin had her own difficulties. But this wasn’t destiny; it was something to be fought for.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">As Huiyin was preparing for the flower banquet, Tong Niangzi couldn’t stay long. She mentioned that Zheng Wuheng was getting married this year, and Madame Ji had already chosen a girl from a good family. Incidentally, this family was related to their Prince’s Mansion.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">“You know that the famous clan in our Jizhou is the Qinghe Cui clan, whose daughter is the maternal cousin of the young prince. The girls from the Qinghe Cui clan are known for their elegance, dignity, and virtue.” Tong Niangzi praised them endlessly.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Huiyin thought that people like her, who had strong personalities, had to appear more dignified in public. After all, people didn’t like those who were too different, too ambitious, or too eager to express their desires. Even she only revealed a bit of her true self after giving birth to Li Cheng’s child and as their relationship flourished.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">She had a fine banquet prepared and invited Tong Niangzi to drink. They talked a lot about the Zheng family. Tong Niangzi had to leave the next day, saying she couldn’t stay any longer due to pressing matters at home. No matter how much Huiyin insisted, she wouldn’t stay, so Huiyin prepared generous gifts for her to take back.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">After Tong Niangzi left in a hurry, Huiyin felt a deep sense of loneliness. She hadn’t missed home for a long time, having been married for so many years, and returning to her family home felt like being a guest.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">But as the snow gently fell outside, a sudden longing for home washed over her. She wanted to take Li Cheng back to her family home for a visit. Her mother missed her the most and was always concerned about her well-being.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p>\n</div>"
  },
  {
    "number": 40,
    "title": "Chapter 40",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 40</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Double Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Huiyin's first Plum Blossom Snow Banquet was about to begin, and the entire Huaiyin Mansion was adorned with a plum blossom theme. The first guest to arrive was Mrs. Lu, the young wife of the Lu family from Wuxing. Though young, she was held in high esteem among middle-ranking official wives. Yet, at an event in a mansion like this, someone of her status needed to arrive early to pay her respects.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">People often show one face to their superiors and another to their inferiors. Isn’t that just the way things are?</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">She entered through the west corner gate, where a warm sedan chair awaited her. As Mrs. Lu was about to board, she noticed the curtains were adorned with a deep red background and crisscrossing ice patterns, featuring the design of \"happiness on the plum blossom,\" exuding an elegant and noble air.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Once inside the sedan chair, a subtle fragrance surrounded her. Plum blossoms have a very subtle scent that can easily go unnoticed unless you pay close attention. But inside the enclosed space of the chair, the fragrance seemed to gather, creating a mysterious and elusive aroma.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">After disembarking from the chair, a group of servant women greeted her. Though they didn’t wear any plum blossom insignia, their earrings featured various plum blossom designs.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">For instance, Lady Liu, who came to receive her, was in her thirties. Though a servant, she wore unique wax plum and green branch earrings, which gave Mrs. Lu the impression that this was indeed the distinguished Huaiyin Mansion.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Even the spacious corridor where she usually paid her respects had been transformed. In winter, with cold winds on all sides, screens had been used as barriers. These screens were adorned with plum blossom designs, elegant yet not overly intricate.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">As she entered the Cloud Pavilion to admire the plum blossoms, she saw golden silk curtains with a misty haze over the snow. Amid this, sat a person dressed in light green silk double-nest cloud goose palace attire, wearing a gold-threaded silver diadem. She sat gracefully amidst the opulence, looking ethereal.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin, seeing that the first guest was Mrs. Lu, nodded inwardly. In the past, she always hoped to convince everyone in her interactions. If even one person remained unconvinced, she would feel she hadn’t done enough. But now, her approach had changed. She needed to select two people who were more supportive of her, both of whom should have considerable prestige and could help her gather a group of supporters. When their husbands and sons encountered difficulties in their official careers, she could ask Li Cheng to help, thereby securing their loyalty. These merits would ultimately reflect on her.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Mrs. Lu was an ideal candidate for this. But first, she needed to get close to her. Huiyin had noticed during a previous event that Mrs. Lu had been watching her the entire time.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"This humble one, Lu Hongshi, pays my respects to the young princess,\" Mrs. Lu knelt and bowed.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">After she stood up, Huiyin pretended to be puzzled and said, \"Have we met before? I wonder where you are from?\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Mrs. Lu, who had been nervous because these high-ranking figures could be difficult to serve, felt a surge of joy at Huiyin's seemingly confused expression. However, she replied respectfully, \"This humble one grew up in Jianye and has not traveled far.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"Oh, then I must have been mistaken. Please, sit and let's talk,\" Huiyin said lightly.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Mrs. Lu saw this as an opportunity to ingratiate herself. She felt that although the young princess was high above her in status, they shared a lot of common topics. Even after other guests arrived, she believed the young princess would still pay attention to her, which filled Mrs. Lu with a sense of honor.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">More guests arrived, including Lady Gao, who brought three young ladies, and Lady Huo, who came with her daughter-in-law and two daughters.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Lady Huo smiled and observed, \"This place is well-chosen. From here, you can see a view of red plum blossoms. Young princess, your attire today also complements the scene—red plum blossoms and green clothes.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"Madam flatters me. Ladies, please try this tea. It’s brewed with melted snow from the plum blossoms,\" Huiyin said with a smile.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Everyone began to drink the tea. Some were true connoisseurs, while others were less discerning. But those who knew about the elaborate preparation process of the tea would undoubtedly consider it excellent, even if they didn’t fully understand its quality.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Mrs. Lu felt that the young princess regarded her highly, which warmed her heart. Naturally, she praised Huiyin both privately and publicly, saying, \"Young princess, you have arranged this place so beautifully. Look, there are wind lanterns hanging on the plum blossoms over there. It feels like a secluded path that suddenly opens up, allowing us to admire the resilience of the plum blossoms blooming in the cold.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Just as she was speaking, Princess Wei and others arrived. Huiyin stood up to welcome them. Both Yin the secondary consort and Xu the secondary consort had brought gifts. Upon their arrival, Huiyin ordered the banquet to begin.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">The sounds of zithers, flutes, and ancient harps drifted over, not too loud but sufficient to enjoy the music.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">The guests marveled at the chairs and tables, crafted from luxurious golden nanmu wood, which left them all amazed. Yin Liyi quietly said to her sister, \"The Huaiyin Mansion is truly rich and luxurious, much better than your usual expenses, sister.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Yin Lifang shushed her and looked at her sister with affection, \"You, silly girl, you have children of your own now and still speak so freely.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">\"I only tell you, sister. I wouldn’t say this to others. Look, there are so many dishes prepared.\" Yin Liyi was once again drawn to the food. The first cold dishes served included jade goose threads, crystal brawn, and jade dew fragrant diagram—all reportedly delicacies passed down from the palace.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Yin Lifang, on the other hand, sipped her wine and observed Princess Zheng, who sat below Princess Wei. She was surrounded by attendants and looked completely at ease, as if born to such wealth and elegance. Such a life was truly enviable. Her status allowed her to display her wealth with ease, but she also managed the household admirably.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\"></p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">She didn't want to cause any disruption at someone else's residence because of her.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Huiyin was smiling as she toasted Princess Wei. Princess Wei drank a cup of wine and praised Huiyin for doing a great job.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">After the banquet, people were either enjoying the plum blossoms, playing arrow toss, or engaging in board games, drinking tea, and eating snacks. Everyone was content and at ease.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Huiyin had several boxes of palace-made flowers brought in. Originally, she hadn’t planned a poetry gathering, but seeing that many young ladies had come, she had a desk prepared and asked Princess Wei, \"Among these ladies, do you know who is the most skilled in calligraphy and painting?\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Princess Wei mentioned a few names, and Huiyin gladly accepted, saying to them, \"This is a plum blossom banquet, and there will be a prize for the best poem.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"There's no need for you to provide a prize. I have one here,\" Princess Wei said, taking out a white jade plum blossom hairpin.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Huiyin clapped her hands and laughed. \"With such generosity from Aunt Princess, that's even better.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Everyone laughed again. As the hostess, Huiyin proposed a topic and set a rhyme scheme. Eventually, the third young lady from the Huo family was chosen as the top poet, making the banquet a complete success.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">After this plum blossom banquet, Huiyin received many invitations to other banquets. She wanted to write to the Little Prince to ask for advice, because if she asked others, they might not tell the truth. Like Princess Wei, her words sounded grand but were not trustworthy. Li Cheng, however, was a man who took things seriously. Sometimes, even though he was high-ranking, his words were quite reasonable.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">The main issue was that there were many factions here, and offending any of them would be bad. This place was not like Xuzhou, which was Li Cheng's territory.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">The letter she sent reached the Little Prince after three days. He was handling official business and, upon seeing Huiyin's letter, opened it first. Fearing she might be in a hurry, he immediately replied.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">After replying, he re-read Huiyin's letter. She mentioned that her family had sent festival gifts and that she wanted to return home to visit her family. Li Cheng found this somewhat troublesome, as they were supposed to go to Jizhou, and the timing wasn't good. Moreover, his identity was quite sensitive. Prince Wei intended to take Qingzhou, and Li Cheng was the first choice for the task. With his capabilities, both Qing and Xu states would be under his control.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Staying in Jianye would become unsafe. In the past, he had been loyal to Prince Wei, but now, as he grew older, new thoughts began to emerge.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">He wanted to carve out his own path, something he had never even dared to imagine before. Lü Wei, He Jin, and Wei Duo were all of his grandfather's generation. He had only sought a place to settle, but now he felt he might be able to trust himself. Additionally, Jing'er was in good health, and who knows, maybe he could fight like him and inherit a kingdom. Perhaps his son could even unify the world.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Shaking his head, he reminded himself that he was a pragmatic person and shouldn't think too much.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">At noon, he ate the baked buns Huiyin had sent over. The lamb inside was fragrant. Li Cheng wiped his face, thinking, \"I can't be so weak as to miss my wife like this.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Upon receiving the Little Prince's reply, Huiyin looked at the several pages and couldn't help but laugh, \"This is too detailed.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Fugui chimed in, \"That's because the Little Prince values you highly and replied quickly upon seeing your letter.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"I just wish time would pass quickly so he could return,\" Huiyin said, reopening his letter, extracting key figures, comparing it with the invitations, and selecting a few families to maintain good relations with.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Nanny Nan brought a cup of hot tea and placed it in front of Huiyin. \"Young Princess, please have some tea.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">\"Thank you,\" Huiyin said, noticing Nanny Nan's hesitation and smiling, \"If you have something to say, just say it.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Nanny Nan shook her head. \"I always feel that our Little Prince is too loyal to Prince Wei. I see that Prince Wei is an ambitious person. Governor Xie's initial failure means he will likely have to rely on our Little Prince in the future. I'm just afraid that the Little Prince will go to war.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Huiyin was somewhat worried but smiled and said, \"As a soldier, this is how it is. If you don't fight others, they will fight you. Look at my father; every time he goes out, my mother is worried to death. It's a life-and-death situation.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">People often downplay the dangers others face, offering comfort easily, but when it comes to their own loved ones, they feel the weight much more deeply.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">It was also mentioned that while attending these banquets, Huiyin had her subordinates open noodle shops in places like Wuzhong and Kuaiji near Jianye. These shops were nestled in the bustling market, their facades neither too old nor too new, and their prices kept low to attract customers.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">This year, since she was spending the New Year in Jianye, she sent a New Year gift to the newlywed bride, Hu Yan Yan. Her gift was a timely relief, almost saving Hu Yan Yan.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">As she attended more banquets, Huiyin began to realize that this place wasn’t always so obedient to Prince Wei. Although Prince Wei appeared magnanimous, he was actually more intelligent and cunning. He first won over those who surrendered to him and then had them fight among themselves. Eventually, they all surrendered to him.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">He was indeed cunning and capable. Compared to him, Li Cheng seemed more naive and compassionate, a man who was cold on the outside but warm inside. Perhaps it was due to their different upbringings. The Prince of Wu and his wife had only one child, Li Cheng, whom they doted on, raising him to be confident, generous, and responsible. Prince Wei, though young, had experienced much under various powers, making him quite deep.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"Young Princess, both Lady Lu and Lady Gao are coming together,\" someone reported.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Huiyin smiled and said, \"Please invite them in.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">These two were the representatives she chose. As soon as Lady Lu entered, she smiled and said, \"Just now as I came in, I saw the yellow oriole under the corridor of the young princess's residence chirping joyfully. We have a piece of good news to tell you today.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Huiyin had tea prepared for them and asked, \"I wonder what this good news is?\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Lady Gao said, \"Last time you mentioned that the local tea here is excellent. Coincidentally, a tea merchant is looking to sell, so we came to inform you. When he heard that you are the buyer, he said he would just give it to you.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">\"That won't do. I'll send someone to ask if he's genuinely looking to sell. If he is, we'll pay the proper amount of silver for it.\" Huiyin had witnessed too many instances of coercion and bullying by those in power, and she refused to engage in such practices.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">At times, she felt a strange kinship with Li Cheng—both knowing the truth but lacking the heart to act on it.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">After buying the tea plantation, she would still need help to manage it, but that would be a matter for next year. When she visited the Wei Mansion, she heard Princess Wei teasing her, \"I heard you've started a business recently?\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Huiyin smiled and said, \"I mentioned that I found the tea here good, and someone happened to say a tea plantation was for sale. I went to take a look, and it was indeed well-maintained, so I bought it. I hope you won't mock me, Aunt.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Princess Wei said, \"Which of us women doesn't have some private savings? When I got married, it was the same. But since you married far away, you probably hadn't had the chance to set anything up. This is indeed good.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Huiyin nodded and said, \"You are right, Aunt.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">She had come to deliver seasonal gifts. Li Cheng had originally planned to return, but he sent a letter saying he couldn't make it. Huiyin felt a sense of emptiness, but keeping herself busy helped.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">At this time, she heard that Yin Liyi was pregnant. Although she wasn't particularly close to Yin Liyi, Li Cheng had a good relationship with Xie Jiuyi, so she had visited once.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">During this visit, she met Lady Xie. Lady Xie was very kind and treated Yin Liyi like her own daughter. Huiyin thought that it would be wonderful if Lu Xiao could marry into such a family. She hadn't understood why Yin Liyi had married into the Xie family, given the difference in status, but now she knew that the marriage had been arranged by Prince Wei. Consort Yin had asked Princess Wei to help, and Xie Jiuyi genuinely liked Yin Liyi, so they were happily married.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Consort Yin prevented her father from receiving an official post but arranged for her sister to marry the prefect of Bohai, a position of real power. This was indeed clever, though Huiyin suspected it was more about good fortune, which could be the best part of life.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">Zheng Deyin lamented her own lack of luck and fortune. The Crown Prince often visited her, but she hadn't conceived.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Unexpectedly, Lianzhi rushed in, panic-stricken, and said, \"Consort Liangdi, something terrible has happened. Dong Yuniang has been killed... killed by Prime Minister Lü Wei.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Zheng Deyin fell to the ground, shocked.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">In the main hall of the Eastern Palace, Crown Prince Li Heng was pleading, \"Prime Minister, Dong Yuniang's brother absolutely did not mean to offend.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Seeing Li Heng begging desperately, Lü Wei smiled and said, \"Crown Prince, firstly, the Dong family disrespected the Crown Princess. The Crown Princess has no child, yet a child from a concubine was born first. Secondly, the brother attempted to assassinate me. Do you have anything to say in defense?\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Li Heng had never been so humiliated, but he had no choice but to plead. At least for now, he could still go out to fight battles, but in the future, he might not even be allowed to leave and could be imprisoned.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Dong Yuniang had thought that becoming pregnant would elevate her status, but now her life was gone. She begged Li Heng, \"Your Highness, you told me that if I had your child, I should serve the Crown Princess more. I carry your flesh and blood.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Li Heng looked at her, feeling some pity, but still said, \"I can barely protect myself.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Dong Yuniang, whose hopes had soared so high, now closed her eyes and wept uncontrollably as Lü Wei ordered her to be taken away. This was the first time Zheng Deyin had seen someone so lively and even defiant in front of her become bloodied. She fell ill from the shock.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Elder Madame Xu and Madame Ji went to the palace to visit her. Elder Madame Xu had heard the rumors, but the Zheng family was not like the Dong family, which had no foundation or power. Still, she feared that Lü Wei might act recklessly.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">\"Grandmother, it was so terrifying... really terrifying...\" Before, when she was in the Huaiyin Mansion, even though she had been sent to Jianye to be with Grand Dowager Wu, Lady Xun, and others, and lacked her husband's affection, at least there was no threat to her life. Even if Li Cheng died, someone would still take care of her.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">She had once thought marrying Li Cheng was like living in hell, but now, under Li Heng, she faced true turmoil. If only Father could have eliminated Lü Wei.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">\"Grandmother, ask Father to kill Lü—\"</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Before she could finish, Madame Ji slapped her. \"Consort Liangdi, there are many ears here. Prime Minister Lü is a benefactor to our Zheng family. Why say such things?\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Elder Madame Xu looked at her, troubled. \"You are a Liangdi now. The Crown Princess of the Eastern Palace can't even go home, much less you. There are many troubles in the palace now, but you'll be fine. I've asked your father to guarantee it.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\"></p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">\"But I’m really scared...\" She was truly scared.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">She even wondered if the rumors from her previous life, claiming that Dong Yuniang was killed by Huiyin, might also have been orchestrated by Lü Wei. No, that couldn’t be, because if Zheng Huiyin could persuade her father to kill Lü Wei, why couldn’t she do the same? After all, she was also her father’s daughter.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Elder Madame Xu glanced at Madame Ji, who lowered her head. She couldn’t possibly take her in. If she were truly pregnant, Zheng Fang might still have a chance to help her. But now, she had nothing, so how could anyone assist her? Besides, Zheng Deyin was not her own daughter, so why should she say more, as long as it didn’t involve her own family?</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">...</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">After the New Year, spring arrived quickly. The ice on the lake broke, and boats could sail again.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Jing'er would be turning one in two or three months. He was different from other children. He was very strong and had already started eating solid food—rice porridge, fish paste, meat paste, and even fruit puree, which he enjoyed immensely.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">\"Your father probably won’t be able to lift you.\" Huiyin said with a smile.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">She had received a letter from Li Cheng two days ago, saying he was very tired from non-stop training.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Why was he training so intensively day and night? The court had just taken Qingzhou and was in a period of rest and recovery. It was unlikely that war would break out so soon. Why was he working so hard?</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">However, Consort Xu knew first. As the confidante of the Prince of Wei, she often received firsthand information. Even Princess Wei didn’t dare to overly suppress her. For instance, the last incident involving the investigation into Li Jing being thrown into a well eventually fizzled out without any conclusion.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">\"I didn’t expect this Little Prince Jing'er to be such a sentimental person.\" She said with a smile.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Her trusted aide said, \"Didn’t you previously mention that he had connections with Consort Yin, and that you were worried he might support Consort Yin’s son as the heir? Why are you now saying he’s sentimental towards the young princess?\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Consort Xu smiled. \"One thing at a time. Although there seem to be many capable people around the prince, the one he appreciates the most is this nephew of his. Unless absolutely necessary, the prince won’t break with him. But the future is hard to say.\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">The aide was confused. \"What do you mean?\"</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">\"Don’t you know the saying: 'When the hares are dead, the hunting dogs are cooked; when the birds are gone, the bows are put away; when the enemy is defeated, the strategists are discarded'?\" Consort Xu said coldly.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">The aide shuddered upon hearing this.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">As for Huiyin, she had been playing with Jing'er all morning. The child was so energetic that she couldn’t handle it anymore and needed a nap. However, she woke up suddenly, feeling as if someone was kissing her. Startled, she realized it was Li Cheng.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">\"Hey, when did you get back? You didn’t say anything.\" Huiyin said, noticing his dusty and smelly appearance.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Li Cheng smiled. \"Didn’t you say you wanted to return home to visit your family? So, I’ve been training the troops day and night, preparing defenses, and then volunteered to go to the capital to celebrate the emperor’s birthday. That way, I can take you with me, right?\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Touched that he had taken her words to heart, Huiyin sat up and reached for his hand. \"Really?\"</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">\"When have I ever said something fake? Even Uncle Wei agreed!\" Li Cheng said with a smile.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Huiyin knew that Li Cheng didn’t really like her father. As his daughter, she understood Zheng Fang’s character better—someone who betrayed his lord to rise to power and rebelled multiple times. Li Cheng, being upright, definitely disapproved of him. Now, for her sake, he was putting himself in danger. If something happened to him in the capital, how could she face him?</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">\"You fool, forget it. I only mentioned it in passing. I don’t really want to go back. As long as we’re together, that’s all that matters.\" Huiyin said.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Li Cheng quickly added, \"It’s not just for you. I also want to go to the capital to see how things are changing. If I don’t even have the courage for this, how can I lead troops into battle in the future?\"</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">Seeing that Huiyin was still unhappy, he continued, \"I actually didn’t want to go back either. It’s not a wise move right now. But I just thought that if we went back together, you’d be happy.\"</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">\"With such a tender heart, how will you ever become a ruler?\" Huiyin said with a tearful smile. In this aspect, he was much better than Li Heng, who was ruthless.</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">Li Cheng deliberately put on a serious face. \"Enough talk. We have limited time. Let’s pack quickly.\"</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">Huiyin gently said, \"Yes.\"</p><p id=\"paragraph-118\" data-paragraph-id=\"118\"></p>\n</div>"
  }
]