[
  {
    "number": 81,
    "title": "Chapter 81",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 81</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Second Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">After returning home, De Yin lived in a small courtyard with three rooms in front of Elder Madame Xu. The family members were polite to her, but no one actively sought her out for conversation or to form a closer relationship.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">In this family, apart from her grandmother, everyone else was distant toward her.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Her grandmother said that after her mother returned to the Xu family, she no longer wished to come to the capital. De Yin felt truly ashamed. After her experience in the palace, not only was she physically and mentally exhausted and fearful of marriage, but her mother also had to avoid her sharpness.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"Miss, the elder Madame has asked you to come over,\" said a young maid at the door.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">After leaving the palace with nothing, it was clear how greedy Huiyin had been. On the surface, she gave them dowries, but in reality, they weren’t allowed to take their dowries out. As for De Yin herself, her dowry was very generous, but now it was all locked in the palace. But who dared to ask for it back?</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Everyone still had to praise the Emperor and Empress Dowager as wise and enlightened.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Looking at the young maid standing at the door, who had been newly assigned to her, De Yin saw some traces of Lianzhi in the child. Unfortunately, Lianzhi had been beaten to death by that brute Li Heng.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">She came to Elder Madame Xu, where several new bolts of silk were placed on the table. \"Grandmother, have you just made some new clothes? Are you going to make more clothes again?\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Elder Madame Xu smiled, \"The clothes I made before are for everyday wear, but you need a few sets for when you go out.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Go out? De Yin quickly objected, \"Grandmother, let’s not bother. As a widow, I shouldn't go out.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">\"A widow? Why should you mourn for that Crown Prince? You're still young and full of life. In a while, we can discuss finding you a good match—it would be better than anything else. Look at your second sister; she married into a good family and became the mother of a nation.\" Elder Madame Xu was actually very old, and the long journey had been exhausting. If not for De Yin, she wouldn't have held on this long.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">But De Yin was very resistant. In her previous life, she had married the Prince of Huaiyin, who had a beloved and treated her poorly. The Crown Prince, whom she married, tormented her even more. She didn't want to marry any man in the world.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">\"Grandmother, I'll just stay with you. I don't want to marry.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">The short years of marriage had been like hell.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Elder Madame Xu chided her, \"If you don't marry, how can you stay in this family? Your sister-in-law is running the household now, and she’s not exactly easy to deal with. Once I’m gone, how will you manage in this family?\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">\"I only eat a small portion of food. Won’t they still accommodate me?\" De Yin truly didn't want to marry.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Elder Madame Xu shook her head, \"Do you really want to spend your life catering to your sister-in-law or even your nephew? Those days won't be easy either. Marrying someone and having a child will give you everything you need for the rest of your life. By the way, I've found a doctor to check your pulse and regulate your health in a few days.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">De Yin wanted to say something but ultimately didn't. She knew her grandmother was right.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Now in the Zheng family, wasn't she also living under someone else's roof? These good days only lasted as long as her grandmother was alive. Once her grandmother passed away, she would be left without support.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">...</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Unlike De Yin, who could easily be persuaded, Huiyin kept herself busy by inspecting servants and reorganizing palace affairs.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">So much so that when she went to pay her respects to the Empress Dowager, she was almost late.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Although Grand Dowager Wu had been elevated to Empress Dowager, her personality remained stubborn. Now living with the Princess Wei and Yin Lifang, she had started to have some thoughts again.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"You’re working yourself to exhaustion instead of using the help available,\" the Empress Dowager said, nodding toward the Princess Wei.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Her feelings towards the Princess Wei and Yin Lifang were different. The Princess Wei was also a widow without a son. When she lived in the Prince of Wei’s mansion, the Princess Wei had always treated her kindly, so she naturally felt some sympathy.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">But before Huiyin could speak, the Princess Wei immediately said, \"Ancestor, our Empress manages everything so well. There's no one as capable as her.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">The Empress Dowager smiled, \"Empress, your aunt is quite remarkable.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Huiyin gently but firmly pushed back, \"As you say, Your Majesty, how could I dare to trouble my aunt? My aunt is a person who enjoys blessings. The Emperor said that once the palace outside is renovated, he will have the two aunts move out to live, allowing the Prince of Yuzhang to care for them. We can't have you being honored by the Emperor and still have my aunt work for me.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"That's true,\" the Empress Dowager mused, either giving herself an out or finally grasping the situation.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">After finishing her greetings, Huiyin came out and descended the jade steps with Fugui's support. \"I asked about the time when Empress He was still in the palace. These palace servants lacked food and clothing. Apart from those serving at the top, most of them had little money. This time, we'll give everyone double the usual reward and let them enjoy themselves.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Fugui said, \"That's a large expense.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"It has to be spent.\" That’s why Huiyin didn’t let them take anything out of the palace. For the family members of enemy soldiers, giving them dowries and sending them home as free people was already generous. Taking everything from the palace was impossible.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Now that Li Cheng had just ascended the throne, taxes had not yet been collected. Where would the funds for the entire palace come from?</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Within three days, everyone in the palace received double the usual reward. Additionally, the new Empress had the Imperial Wardrobe Department rush to make winter coats for them. Even the frugality measures of Empress He were removed. The palace maids were given an extra meal every five days, with at least two meat dishes.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">The new Empress wielded both discipline and rewards. She strictly punished eunuchs who mistreated the maids or engaged in improper behavior, while generously rewarding those who performed their duties well.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Everyone's lives were noticeably better.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">When Madame Ji brought Cui Yuehua into the palace, they heard Huiyin mention the double rewards that had just been given out. Madame Ji quickly said, \"Do you need more money, Your Highness? I still have some—\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"Mother, what are you talking about? You’ve already given me all your money, and my sister-in-law is right here.\" Huiyin smiled and shook her head.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Cui Yuehua dared not say much and only said, \"Anything that concerns you concerns the Zheng family.\"</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Huiyin looked at her and said, \"You are sensible, but it's really not necessary. It’s better for Wuheng to focus on assisting the Emperor with his duties. By the way, the army will march tomorrow.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">If not for this, the Zheng family would not have submitted a request to enter the palace.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Madame Ji smiled and said, \"Indeed.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Military families yearned for chances to earn glory. In peacetime, however, there were few opportunities for soldiers to advance.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"Since you're here, I have another task for you. These are some suspicious people in the palace. Please help me find out where they originally came from and see if we can keep them under control.\" She then handed a stack of information she had prepared earlier to Madame Ji and Cui Yuehua.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Cui Yuehua immediately felt a surge of enthusiasm and was ready to take action as soon as she left the palace.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">After they left, Nanny Nan remarked, \"When have you ever asked your eldest daughter-in-law to do anything?\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"That was to fool her. You don't know, enemies are often found among peers, and the same goes for sisters-in-law. I discovered their discord in Xuzhou. Whether they are harmonious or not is none of my concern. I only need to use the conflict to get our own things done.\" Huiyin said with a smile.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">The Boling Cui clan and the Qinghe Cui clan weren’t far from each other. Sometimes even official inspectors couldn't find them, but they were easily accessible to local magnates.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\"></p><p id=\"paragraph-51\" data-paragraph-id=\"51\"></p><p id=\"paragraph-52\" data-paragraph-id=\"52\"></p>\n</div>"
  },
  {
    "number": 82,
    "title": "Chapter 82",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 82</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Update◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The next day, Li Cheng set out for battle. Huiyin could not see him off as she used to when they were in the mansion, but in the early morning, she carefully placed the breastplate for him and skillfully helped him put on his armor.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">\"Remember, never chase a cornered enemy. You are the emperor now, and many people will want to bring you down from this position, constantly provoking you,\" Huiyin reminded him as she always did.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Li Cheng smiled and nodded. \"We are always apart more often than together. Who knows when we will meet again? There was a time when we were together every day, and I even knew your clothing size, but now I've forgotten.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Huiyin playfully tapped his forehead. \"Why talk about that? My size changes often, and I have to rely on written records myself.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"The palace affairs and the children are all entrusted to you,\" Li Cheng held Huiyin's hand for a moment and then left with his usual strides.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">After he left, Huiyin felt sad for half an hour, then drafted a new list and sent Qin An to deliver items to Princess Wei. Qin An looked at the list, which mentioned rewarding Princess Wei with three boxes of dried persimmons, four boxes of longan, twenty pounds of lotus root powder, five pounds of cinnamon powder, five pounds of jujubes, eight pounds of dried lychee, three pounds of dried banana, and two gallons of milk sugar from the Western Regions.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">There was also a list for Yin Cifei, but it was reduced by about a third.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Qin An did not dare to comment but thought that the empress seemed to value propriety. Although Yin Cifei had given birth to the Prince of Yuzhang, she was still a secondary consort and should not surpass the primary consort in rewards.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">In addition to those in the palace, there were rewards for people outside the palace. Jiang Bipbo, the wife of Guo Zhao, was nominally her adopted younger sister, and Guo Zhao's son was currently studying in the palace with Jing'er. Yuwendang was a trusted confidant of Li Cheng and needed to be rewarded more. There were also rewards for her various natal families, and everyone was given a share.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Even Xie Er Nainai's sister-in-law, Cao Shi, received some rewards.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Of course, reactions varied. Xin Shi was very pleased to receive her share and, seeing Pei Shuo at home, said, \"The empress is so thoughtful, sending these gifts to us. I'll share some with Sister Dong; she’s pregnant and could really benefit from these.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">In Xin Shi's eyes, Pei Shuo naturally couldn't favor Dong Shi. This kind of behavior didn't need to be learned; he instinctively knew how to handle it. He said, \"You take care of it. She has her own food to eat; just use these yourself.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">\"Duke, don't say that,\" Xin Shi's heart was sweeter than honey after hearing Pei Shuo's words.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Pei Shuo then added, \"There are many former subordinates in the palace now. When you visit, help look after them. Although I'm with the Imperial Guards protecting the capital, I can't oversee the harem.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Xin Shi nodded. \"Rest assured, I will definitely do that.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Afterward, Xin Shi played the good person again, urging him to visit Dong Shi, since Dong Shi couldn't serve him while pregnant. Pei Shuo declined a few times but eventually went to see Dong Yi. Ever since she became pregnant, Dong Yi had been much more relaxed and had something to look forward to.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Seeing Pei Shuo, she approached him like a delicate bird. \"Husband.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">\"Sit, sit. You're with child; why are you still so careless?\" Pei Shuo gently guided her to sit and asked, \"How are you feeling today? Is the nausea better?\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Dong Yi quickly replied, \"The nausea is much better. Don't worry.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Not wanting to burden Pei Shuo, she added, \"The eldest daughter-in-law has someone who makes pickled plums. It's helped me a lot, thanks to her.\"</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Pei Shuo knew that Dong Shi's nature was gentle and that she would endure any grievances silently, afraid of causing him worry. He couldn't favor her too much, or there would be conflicts among his wives, which would be more disadvantageous for her.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">But as long as he visited frequently, no one would dare to bother her.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">\"That's good. With General Jian in charge of the capital, everything runs smoothly, but once the emperor leaves, many undesirable elements will start to appear. I have to be out every day but will try to visit you when I can. If you need anything, have my attendant find me,\" Pei Shuo said with a smile.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Dong Yi nodded. \"Don't worry, I haven't been going out much lately, and nothing's wrong.\"</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">After having a child, Dong Yi grew even more devoted to Pei Shuo, recognizing his ambitions. She brought out ten boxes of pearls to give to the empress.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">\"No need. The empress doesn't lack these. Hold onto them; they’ll come in handy later,\" Pei Shuo said, knowing her good intentions. He had used her money when they were in Xuzhou, but now that he was a duke, it wasn't necessary anymore.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Dong Yi smiled sweetly. \"Then I'll use one box to make a hat for Xianjie.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Pei Shuo said, \"No rush. When the child has a joyous occasion in the future, you can use it then.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Seeing that everything the man did was for her benefit, and now that he had achieved success, Aunt Dong had no complaints.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Equally content was Jiang Bipbo, who, after marrying Guo Zhao, successfully gave birth to a daughter. Now that Guo Zhao was away at war, she managed the household affairs in the capital. Upon receiving the imperial rewards, she first had them inspected.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Opening the boxes and seeing the items inside, she couldn't help but say to Steward Lin, \"The Empress has been considerate of me year after year. Everything I have now is given by the Empress. Many generals who came from Xuzhou wish to marry noble ladies from the capital, but with the Empress protecting me, I certainly have nothing to worry about.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Steward Lin replied, \"Yes, the Emperor values our family greatly, even conferring the title of Marquis. This is no ordinary grace. I heard that Xie Qian of the Xie family dislikes his wife and wants to marry a royal consort, but the Emperor is about to personally lead a campaign, so Xie Qian cannot make a move for now.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">\"The more so, being an orphan, my only backing is the Empress. Usually, when I send things over, she returns them. It's quite a dilemma.\" Thinking this, she discussed it with her stewardess, and they planned to use the Empress's reputation to do charity work in the city, helping the Empress gain more reputation.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Jiang Bipbo acted immediately, while Cao Ping's sister had other thoughts.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">With Li Cheng's ascension to the throne, the Cao family, Jiang family, and Hu family were chosen as imperial merchants. Now the Xie family also had official duties. Although Xie Jiuyi, though somewhat frivolous, had become newly powerful because of Xie Qian.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Unlike Jiang Bipbo, she wasn't worried that Xie Jiuyi would divorce her, especially since the Cao family was now an imperial merchant family.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Being able to enter the palace with her sister-in-law was the Empress's grace, and she planned to send a generous gift for the Empress's birthday. One should pay respects to the true deity.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Regarding Xie Jiuyi and his wife, some said they were dead, others said they had disappeared. With their enemies gone, her heart felt unburdened, and now that her life was good, she didn't hate as much as before.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">What made her even happier was that after consuming the southern dates bestowed by the Empress, she was diagnosed with a joyous pulse the next day. This was another joy.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">As always, some are happy while others are sad.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">The Zheng family, as a ducal mansion, also received many rewards. Ji Shi had these sent directly to Cui Yuehua, who was now the head lady and in charge of distribution.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Cui Yuehua first sent a portion to Elder Madame Xu and Madame Ji, and after some thought, also packed some for De Yin, who specially came to express her gratitude.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"You are too kind, Madam,\" Cui Yuehua gestured for her to sit down.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">De Yin smiled, \"It's hard for you to always think of me. My sister-in-law has been very considerate since I returned.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"Madam is too kind. This is what we should do,\" Cui Yuehua smiled and had tea served.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">She sympathized with this elder Madame but knew everyone had to manage their own affairs. Madame Ji had heard that De Yin's private funds were substantial, and with such a dowry, she wouldn't have to worry about remarrying, as her natal family would support her.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">De Yin, feeling a bit ingratiating towards Cui Yuehua since she would need her natal family's help, spoke carefully. Cui Yuehua wasn't particularly polite to her either.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">\"Actually, these are all graces from the Empress. I'm just helping to distribute them.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Whenever Huiyin was mentioned, De Yin's eyes would dim slightly. \"Yes, we should thank the Empress.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Cui Yuehua didn't know about the underlying tensions between them and only knew they were not from the same mother. She thought their relationship was like hers with Madam Zhang—perhaps not very close in their years in the inner chambers, but ultimately sisters and family.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">So, Cui Yuehua smiled, \"With the Empress around, everything in our family is good.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Mentioning Huiyin to De Yin, the latter then suggested visiting Elder Madame Xu, leaving Cui Yuehua wanting more. After she left, Cui Yuehua picked up the list Huiyin had given her and began to thoroughly investigate these people. This was the first task the Empress had assigned her, and if not done well, her sister-in-law would take over everything in the future.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">When De Yin arrived at Elder Madame Xu's place, Elder Madame Xu waved her over, \"Where did you come from?\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"I came from my sister-in-law's place. She sent me some things, and I went to thank her,\" De Yin smiled.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Elder Madame Xu sneered, \"It's not anything special. The dates aren't as good as what we have, and the lotus root powder isn't as good as mine. Don't mention her. We won't have much to do with her in the future. She even took your dowry, not a good person. The doctor will be here soon, specially coming to check on your health.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Being of advanced age, Elder Madame Xu didn't need to avoid taboo topics anymore and asked, \"Doctor Shen, is there anything amiss?\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"To be honest, your young lady has an extremely cold constitution and frequently eats cold and raw foods. May I ask if her menstrual cycle is frequently irregular and delayed?\" Doctor Shen asked.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Elder Madame Xu nodded. \"Yes, she has been married for several years without having any children, and things haven't been going smoothly. I wonder what the situation is?\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Doctor Shen said, \"She likely consumed many cold-natured foods and will probably find it very difficult to conceive again.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Behind the curtain, De Yin felt disbelief and growing anxiety. \"Doctor, I consistently drink nourishing soups and top-tier fertility medicines. How could I have consumed cold-natured foods? Even in winter, I avoid lukewarm water and only drink hot water to prevent catching a chill.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">\"What kind of tonic soup did you take? Do you remember the ingredients?\" Doctor Shen inquired.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">De Yin recalled that in the beginning, she and Li Heng were very much in love. After each intimate encounter, Li Heng would have someone prepare a bowl of fertility medicine, saying it was custom-made at the palace and that she was the only one who received it. Later, when Yunzhi became the crown prince's consort, she supposedly never drank it again, and De Yin always believed that the crown prince had once loved her.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">\"I... I don’t know what kind of tonic it was.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Doctor Shen sighed. \"If you start treatment now, you might recover within three to five years. Otherwise, if your blood becomes stagnant, you may never be able to conceive.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">De Yin nearly collapsed to the floor. She had never expected her condition to be so severe. Before marriage, her vitality was strong, and her health was even better than Huiyin’s.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">It was Crown Prince Li Heng. The medicine he provided was the issue.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Happy November 1st! Wishing everyone a peaceful and joyful month ahead.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">This is the update for today; I’ll try to post three more chapters tomorrow if possible.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\"></p><p id=\"paragraph-72\" data-paragraph-id=\"72\"></p>\n</div>"
  },
  {
    "number": 83,
    "title": "Chapter 83",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 83</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Two Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Outside the palace, Jiang Bibo had been conducting charitable activities in the capital for a month under the name of Huiyin. She distributed porridge, medicine, offered free medical consultations, and provided clothes, creating quite a stir.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Inside the palace, however, it was not so peaceful. There was a difference in the gifts given to Princess Wei and Consort Yin, but this was not Huiyin’s deliberate act of discrimination. It was purely a matter of protocol, as there is a clear distinction between the status of a wife and that of a concubine.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Normally, when gifts are sent, no one would inquire about the specifics, but the Empress Dowager was a talkative one. Upon hearing that Huiyin had sent gifts, she asked Princess Wei and Consort Yin, \"I wonder what gifts the Empress has sent?\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">To demonstrate the goodwill of the Empress, Princess Wei listed out the quantities, which made Consort Yin feel deeply uneasy. She thought that, in the past, it might have been acceptable. When she was in the Prince of Wei’s Mansion, her status was indeed lower than the Prince’s. But now that the Prince was dead and her own son, Prince Yuzhang, was in charge, the Empress’s actions were hard to say without a hint of personal grudge.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">However, Consort Yin was not someone who wore her heart on her sleeve like her sister. She was just waiting to leave the palace. Once out, it would be clear who was truly in charge, and there was no need to say more for now. She could endure a little discomfort for the time being.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">When she saw Princess Jianjia again, Consort Yin maintained her respectful demeanor, just as she had in the Prince’s Mansion.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">This instead made Princess Jianjia confused, and she went to her mother, saying, \"Consort Yin is just as she was in the Prince’s Mansion. Although I resented them for abandoning us, I heard that they were also in ragged clothes and would have ended up like us if not for meeting my father’s former subordinates.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">As a young lady, she had complained before but had since lived a good life, and many of the past grievances had faded. Moreover, she knew that Prince Yuzhang was Consort Yin’s biological son, and they would inevitably have to deal with each other when living in the Prince’s mansion.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Princess Wei, however, was not as easily convinced. She had been the Princess of Wei for many years and knew that there were things better left unsaid in the palace. With so many ears around, you never knew who was listening and whose people they were. Causing unnecessary trouble was not wise. Therefore, she first took her daughter into the inner chamber and whispered, \"I’ve told you before, you must have a defensive heart and not trust others too much.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Hearing this, Princess Jianjia grew cautious and guarded. She was still young and could not hide her emotions well. Even if she tried, it would show. Yin Lifang observed the shift in Princess Jianjia’s expression and silently reflected on how tolerant she had been of this mother-daughter duo.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Meanwhile, while these undercurrents were flowing, Huiyin was on her period, experiencing weakness in her limbs, a sore back, and a festering forehead wound, which made sleep nearly impossible. She lay on the bed reading to rest.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Currently, the attendants were all young palace maids, and Fugui, as the head maid, was responsible for handling more important matters for Huiyin.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Huiyin was engrossed in a copy of the \"Compendium of Natural History.\" After finishing it, she turned over, feeling her eyes sore. She got up to change her menstrual cloth, feeling aches in her waist as she walked, and knocked on her waist while saying to Nanny Nan, \"Those few days when it just came, I was so busy that I neglected my body. Just as I started to feel a bit better, my body began to ache again.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Nanny Nan gently pounded Huiyin’s shoulders with a small wooden mallet, visibly distressed by her fatigue. \"Your Majesty, you have too many things to handle and have been working non-stop, which is why you are so exhausted. You were already tired from giving birth to the Crown Prince. You can’t seem to rest.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">\"It was also due to that time when I rode a horse and strained myself. I haven’t ridden for a long time, and when I did, my body became uncomfortable. I lay down for a few days, and it seemed to get better, but after sitting in a carriage for a long time on the way to the capital and enduring it, I only realized how bad it had become when I finally relaxed. Speaking of which, the Emperor is even more exhausted than I am. He is only a few years older than me and has endured countless visible and invisible injuries from years of military life.\" As Huiyin spoke about her husband, she became increasingly worried.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Nanny Nan comforted her, \"Please don’t worry, Your Majesty. The Emperor is still young and will be fine.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Huiyin knew that Nanny Nan could not offer profound advice, and hearing her comfort, she smiled, \"Mother, you have accompanied me so far to Xuzhou and now into the palace. When the world is at peace, I will reward you with a home where you can live out your days comfortably.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Everyone has desires. Even one’s own parents might be snobbish, let alone those who are not related by blood. If someone follows you loyally, it is their kindness, and that loyalty must be repaid.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">As a wet nurse, Nanny Nan did not feel the expected joy but shook her head, \"As long as I can stay by your side, it is better than anything. You were a girl I watched grow up, and now you are the Empress. I may not be capable, but being able to accompany you and chat is enough.\" In fact, Nanny Nan knew very well that Huiyin was a person of loyalty and righteousness, and the more she knew, the less she wanted to leave.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Not for any other reason, but look at Dong Shun. It was said that she regretted it to the core. Not everyone could handle such a drastic change. Even the Crown Prince had to respect them when they were by the Empress’s side, but outside, they were people without a master. After some time, who would still care about you?</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Nanny Nan understood this better than anyone.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Nanny Nan understood, and so did Huiyin. Freedom was important, but not everyone had the talent to survive outside. Even those with education, connections, and some savings might not lead comfortable lives. When people were unhappy, they loved to reminisce about the past.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">The mistress and servant shared some private words, and Huiyin’s mood improved a little. She even ate an extra bowl of pureed soup at noon, something she had never liked before.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">After the meal, Jing'er and Zhan'er came to pay their respects. Jing'er, though young, perhaps because he had been made Crown Prince, seemed much more composed. The few steps he took after the greeting appeared effortless, while Zhan'er followed his brother, as usual, hiding behind him and suddenly popping out to startle her.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">\"Come here, both of you.\" Huiyin pulled her sons to her side, looking at them carefully, feeling love for them no matter how she looked.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Jing'er, like a little adult, touched Huiyin’s forehead, \"Mother, your forehead is not warm, so you should be fine.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Huiyin chuckled, knowing her son was concerned about her, which made her feel very comfortable, but she still explained, \"Mother is just a little uncomfortable from sitting in the carriage all the way here. I’ll be fine after a few days of rest, so don’t worry.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">With her sons around, Huiyin's mood lifted significantly.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">The next day, she again permitted Madame Ji to enter the palace to visit her. When the mother and daughter met, Madame Ji relayed everything that had happened outside: \"Your sister-in-law went to Qinghe County yesterday to check things out for you, Your Highness.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Huiyin blew on the tea foam but then remembered her monthly period. She put down the cup and smiled, \"If I didn’t trust her, why would I give her these tasks? Keeping her busy also prevents her from thinking about other things.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">\"Are you hinting at something?\" Madame Ji felt that her daughter's words had a hidden meaning.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Huiyin shook her head, \"I won’t say more, but are things peaceful outside in the capital?\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">\"Yes, very peaceful. The wife of the Marquis of Wuning has been making charitable donations on your behalf. Now, people outside are saying you're like a bodhisattva. As for me, I stay at home most of the time, and when I do go out, no one shows any disrespect.\" Despite this, Madame Ji felt that those who smiled the most might harbor the most sinister intentions.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Thinking of Crown Prince Li Heng, Madame Ji said to Huiyin, \"You probably don't know this, but De Yin can't conceive in the palace because she has been drinking cold potions. It’s rumored that the fertility medicines she took after sex were tampered with—maybe even by the Crown Prince.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Huiyin remained calm, \"Why would the Crown Prince mess with her like that?\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Madame Ji speculated, \"Maybe he doesn’t want her to have a child because he’s afraid your father could use it to manipulate the court.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">But as soon as she said it, she realized the inconsistency, \"Then why does Weili Di have a child?\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"We don’t know about that, but it’s a relief that the former Crown Prince is gone. It’s quite satisfying.\" Huiyin took a cherry preserve from the side and ate it.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">In truth, Huiyin understood the situation well. Initially, there was a power struggle between the Lü and Zheng families. The Crown Prince managed to deceive them for so long because neither Lü Xiaoxiao nor Zheng Deyin could uncover the truth. Weili Di, being clever, refused to drink the fertility medicines. If she had a child, the Crown Prince wouldn't dare to act recklessly.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">But Huiyin couldn’t say anything, since it would sound like superstition.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Let her live as she chooses. If she’s worried about making the same mistakes again, she can stay single. Who would refuse her food?\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Madame Ji thought that Huiyin hadn't suffered much from her sisters-in-law. If they had bullied her, she would have retaliated. However, it was difficult for De Yin, who had no real connections. Thus, she said, \"She’s different from you.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"She was the one who hurried to set up the Crown Prince’s marriage and, together with Grandmother, tried to stop me from marrying the Prince of Huaiyin. They just didn't succeed. I appear tolerant towards her, but I simply can't be bothered. She hasn't committed any grave crimes, so I’ll spare her life. However, mother, don't take her situation too much to heart. If our prince hadn't ascended the throne, would your position as Madame Zheng still be secure?\" She was worried that her mother might be too sincere and take De Yin's matters too seriously.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Just give her food and make sure her allowance is sufficient. There’s no need to micromanage her. Once she prospers, she'll naturally become closer to her mother. These thoughts were indeed selfish, but Huiyin wouldn’t deny her true feelings. Xu Shi was never at peace, always causing trouble at home.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Recalling when Zheng Fang informed Li Cheng about Yin Lifang's situation, intending to preempt any threats, the intentions of Elder Madame Xu and Xu Shi were not so simple. Xin Shi mentioned that the two were plotting to have Yin Lifang seize Huiyin's favor.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Even though Huiyin wasn’t threatened by Yin Lifang, others didn’t know that. As a beneficiary, how dare Yin Lifang play such tricks? Huiyin couldn’t tolerate it.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Madame Ji suddenly realized, \"Yes, she may seem pitiful, but isn't this the consequence of what she sought?\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Seeing that her mother had listened, Huiyin smiled, \"You've finally come into the palace. Today, the Imperial Kitchen presented some fine dishes. Let's enjoy them together.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Madame Ji was delighted, \"I wonder what they've prepared? We eat more outside than in the palace.\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"Out of the many dishes, only a few are to my liking. Some dishes are elaborately carved but tasteless.\" Huiyin could only whisper, as these were the palace rules that had to be followed.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">As expected, during the meal, Madame Ji noticed the table was filled with dishes, but with dozens of people watching, taking an extra bite would mean the dish would be taken away. It was quite a torment.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">After the meal, Madame Ji asked, \"Do you always have to deal with meals like this, Your Highness?\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Huiyin smiled, \"Not always. It just happened that you visited today. I have a private kitchen here with my own chefs. But I can’t always use the private kitchen and leave the main kitchen idle.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Madame Ji thought it made sense. She couldn’t stay in the palace for long. After the meal, knowing that Huiyin was still menstruating, she advised her to rest more and left the palace. Instead of going home, she headed to her eldest son's house.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">At that time, Pei Shuo had just returned from the palace and was having a meal with Xin Shi. The two shared a few drinks.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Xin Shi pointed to the lychee-flavored pork kidneys on the table and said, \"My lord, you should try more of this. The kidneys are thinly sliced and flavorful.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Xin Shi was known for her fondness of drinking, and usually Pei Shuo would share a few cups of wine with her. Noticing her face flush red after just a few sips, he chuckled and said, \"I'll stop here. Look at you, your face is red again.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">As Xin Shi was about to respond, an announcement came that Lady Ji had arrived. The couple quickly rinsed their mouths and went out to greet her.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">As soon as Pei Shuo saw Lady Ji, he went forward to support her. \"Dear mother, why did you come here today? Your son was just enjoying some wine with your daughter-in-law. I'll ask her to call for more dishes from the kitchen.\" He then urged Xin Shi to go and arrange for more dishes. Xin Shi hurriedly pretended to leave.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">However, Lady Ji told them not to bother. \"I just came from the palace where I accompanied the Empress Dowager for a meal. I left the palace and came to see you all.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Knowing that if she didn’t eat, neither would they, and they'd simply keep her company, Lady Ji reluctantly drank a cup of wine and dined with them.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">After the three were seated, Lady Ji said, \"I've noticed that the Empress Dowager's health has not been good lately. Many of the eunuchs and maids around her are from the previous dynasty. I don't know if she can sleep well. I'm so worried that I can't sleep either.\"</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Enemies are either right under our noses or a thousand miles away. The imperial concubines from the previous dynasty could be dismissed, but the eunuchs and maids from that time were too numerous to avoid completely. If even one of them had bad intentions, it could cause trouble for the Empress Dowager.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">With her younger son away on a campaign with the Emperor, she could only talk to her elder son about these matters.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Pei Shuo pondered for a moment and said, \"Don't worry, I'm often in the Emperor's presence and will protect the Empress Dowager and the Crown Prince. As for those people you mentioned, some of them cannot even get close to her. The Empress Dowager also brought trusted staff from the Huaiyin Mansion. The cooks in the small kitchen and those serving her are all trusted people.\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"With your reassurance, I feel much better. The Empress Dowager gave me some fur coats today, which I planned to give to your wife,\" Lady Ji said, shifting to family matters after hearing her son's reassurance.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Xin Shi felt delighted hearing this. Even though she came from a respectable family, wearing the bestowed garments was still an honor.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">Moreover, the larger the household, the more careful the mistress had to be, despite the grand appearance.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">The three of them, in the end, did not mention Dong Shi. Pei Shuo would not bring up a concubine in front of his mother, and Xin Shi certainly wouldn't either. As for Lady Ji, she wouldn't ask about a concubine in front of her daughter-in-law.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">However, after seeing Lady Ji off, Pei Shuo went to see Dong Shi. Dong Shi had someone wring a towel for him to wipe his face and specially made a hangover soup, bustling around. Seeing her busy while pregnant, Pei Shuo said, \"You're still working despite being pregnant. You should rest.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">\"I'm always cooped up in the room with nothing to do. What's there to be busy about? It's you who's busy. They're all saying at Madam's place that you're occupied outside now,\" Dong Shi said with a smile.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Pei Shuo shook his head. \"These are important matters. Some people always want to cause trouble. I need to secure the capital region tightly; otherwise, if someone were to offend the Empress Dowager, it would be bad.\"</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Dong Shi found herself unable to contribute to such discussions.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Meanwhile, Cui Yuehua had gone to her family home seeking assistance. She returned to find her usually kind father had just recovered from a serious illness. Her mother, Lady Cui, said, \"Your father was so angry that he fell ill. He asked your brother to return from the Weis, but he refused and even wrote a letter saying that the Saint has been mistreating our Cui family and suggested we go to join Wei Duo.\"</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">\"Father, mother, Wei Duo is nominally the Prime Minister of the Da Ye dynasty, but in truth, he’s a traitor to Da Ye. Although he has shown appreciation for my brother, my brother should abandon the dark and join the light. The Emperor is your nephew—how could he possibly mistreat you? It's just because of my brother that the Emperor is having trouble granting titles to our family,\" Cui Yuehua was very anxious.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Cui Xun pressed a towel to his forehead and sighed, \"We are who we are, and your brother is his own person. The Emperor has been too hard on our family.\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">\"If the Emperor grants titles to us, and your brother sees that the Emperor treats our Cui family well, how could he not return?\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Cui Xun was still angry and felt humiliated.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Cui Yuehua knew her family had many complaints, but since she had married into the Zheng family, whether titles were granted was out of her control. However, she couldn't say that and instead said, \"The Emperor is away on a campaign, and many things are on hold. I heard that even the Xun family wouldn't have been granted titles so quickly if the Empress Dowager hadn't intervened several times with the Emperor.\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Lady Cui looked at her husband and then said to her daughter, \"Your father is the Emperor's uncle; the Xuns are one layer removed. Also, the Zheng family is our in-laws. Didn't they help us? Your father didn't go to Xuzhou back then, but wasn't it because he was old? He sent your second brother to help instead.\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Even Cui Yuehua couldn't bear to listen to this. \"Mother, the Zheng family used the Jizhou land to pledge allegiance. My brother went there after the Prince of Huaiyin had pacified Jizhou. He didn't pass the imperial examinations and was arranged to be an official. Even if the Emperor is upset, do you think you can argue with him? Even my father-in-law kowtows smoothly in front of the Emperor and never assumes superiority.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">The situation became awkward, but Lady Cui helped ease the tension and deliberately changed the subject by asking Cui Yuehua what she had been doing recently and why she had come home.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Cui Yuehua then spoke seriously. \"Recently, the Empress Dowager has just entered the palace, and the people around her are unfamiliar. She specifically sent me to investigate. I thought since you are familiar here, if you could help, it would be even better. When the Empress Dowager speaks for our family, it will be more effective than ten words from others.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">In reality, Cui Yuehua was unsure about this. She was afraid her father might still be angry. The elder Lady Xu in their family was such a person; if it weren't for her status as an elder, she wouldn't have liked the elder Lady.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">To her surprise, Cui Xun stood up and declared earnestly, \"Let me take care of this. I’ll work with you to thoroughly investigate their backgrounds. I’ll get started immediately.\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">\"Now that you've just recovered from a serious illness, you need to stay active; otherwise, you'll end up getting sick again from being too sedentary.\" Cui Xun’s title had been stripped away, and now he was doing even worse than the Xun family. How could this be tolerated?</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Seeing her father agree, Cui Yuehuan was pleased.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Unbeknownst to them, a conspiracy was brewing. At the same time, Wei Duo was listening to Cui Dalang saying, \"A message just came in from my father's side. It turns out that they are helping Li Cheng's wife, Princess Zheng, investigate the backgrounds of these people in the palace. This actually makes things easier for us.\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Wei Duo had, of course, also looked into Li Cheng. He was known for being ruthless and crafty in battle, but there was one redeeming quality—he was deeply devoted to his wife, Princess Zheng. She was rumored to be a stunning beauty, the most beautiful woman in Jizhou. Countless men had fallen at her feet, yet this Princess Zheng had the unique ability to keep Li Cheng under her control.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Wei Duo, who never hesitated to do whatever it took to achieve his ends, was already plotting his next move. If anything happened to Princess Zheng, and their two sons were captured, Li Cheng would have no choice but to surrender.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">\"Excellent, excellent, excellent! Changqing, this information couldn’t have come at a better time,\" Wei Duo said with a grin.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Smiling, Cui Dalang replied, \"Our family’s spies have already copied this list. The Prime Minister can decide how to proceed from here.\"</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Cui Dalang was being careful to avoid any mistakes that Wei Duo might hold against him. Wei Duo appreciated his prudence and was intent on making arrangements. Wei Duo’s success over the years came from his talent for gathering intelligence. He had once dismantled all of Xie Jiuyi's network, and back in the day, he had even managed to burn all of Li Cheng's supplies. Now, it was time to put those skills to use again.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Several days later,</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">In Linde Hall, Huiyin, impressed that Cui Yuehuan had completed the task in just a month, praised her, \"I didn’t expect you to be so efficient, Sister-in-law.\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">\"I’m not much. My family helped me with the investigation. You can rest assured, Your Highness,\" Cui Yuehuan quickly gave credit to the Cui family for their assistance.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Huiyin, catching the subtle hint, replied, \"Thank your family as well. I’ll mention this to the Emperor. By the way, I’ve set aside some white silk for you to make jackets. Please visit the palace often to keep me company. Thank you for all your hard work on this.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Delighted, Cui Yuehuan bowed to express her gratitude.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Author’s Note:</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">I broke my promise today, but I'm posting a double update. My health hasn’t been great lately, so here’s a small gift for everyone.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\"></p>\n</div>"
  },
  {
    "number": 84,
    "title": "Chapter 84",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 84</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Two Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">\"Empress, the emperor has sent several boxes of autumn plums. They appear undamaged, so I brought them all over,\" Chief Steward Qin An announced from outside.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Huiyin opened the boxes and had a dish washed for tasting. The plums were a deep purple with a red tint, both sour and sweet—just the right flavor. After her menstruation passed, she felt revitalized, her skin had improved, and she was in an excellent mood, especially with the food specially sent by Li Cheng.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Seeing Ling Lu bring tea over, Huiyin quickly said, \"I just ate plums and can't drink hot tea yet, or my stomach will hurt. You can take it and drink it yourself. Also, please keep this box of plums for me.\"</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Ling Lu smiled and replied, \"Yes, His Majesty is truly good to you, remembering how much you love plums. We didn't even know.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">\"I love eating these, but I love them too much, which is why my stomach hurts easily. Usually, I just don't have them delivered. I didn't expect the emperor to remember. I vaguely recall these are from Lingnan. It would be laborious and costly to continue doing this. I'll write a letter to him, asking him not to worry about me in the future.\" Huiyin shook her head.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Ling Lu said, \"If it were any other monarch, I wouldn't dare to guarantee, but our emperor truly cares for his people and would never cause laborious and costly actions.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">The plums were a small matter. As winter approached, the palace began preparing winter clothes. Huiyin instructed the wardrobe department to make clothes for the palace residents first, including the Empress Dowager, Princess Wei, Yin Cifei, Princess Jianjia, Prince Yuzhang, and others. Clothes were also made for Jing'er and Zhan'er, and even Guo Xing, who lived in the palace.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">At the same time, Huiyin sent some warm clothing to the imperial mausoleum, saying, \"They guard the mausoleum and can't leave. It's hard work.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Previously, Cui Yuehuan thought Huiyin wanted to let the people at the mausoleum fend for themselves. Unexpectedly, she sent cotton clothes and quilts, and Madame Ji remarked at home, \"I must say, the Empress is indeed too kind.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Elder Madame Xu, sitting above, uncharacteristically agreed, \"If you don't remove the roots, they'll just grow back when spring comes. Those people are descendants of the disgraced crown prince, causing misery. Given her young age, Madam should also advise her.\"</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Referring to the Empress as \"she\" was something only Elder Madame Xu would dare to do.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Madame Ji, who used to endure silently, now felt the need to speak, \"Madam Xu, please be careful with your words. The Empress is wise and compassionate, far beyond our ability to judge.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">Elder Madame Xu almost blurted out that she was the elder but remembered that Huiyin was the Empress. Her face flushed with embarrassment. Sitting nearby, De Yin, aware that her grandmother was standing up for her, felt a mix of resentment towards the palace people, especially since Li Heng had drugged her.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Thus, she helped smooth things over, \"Madam, this is the tea I brewed myself. Please try it.\"</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Madame Ji graciously accepted the gesture, praising De Yin, \"Your tea-brewing skills are excellent.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">De Yin humbly replied, aware that her poor health required constant medical attention, which Madame Ji diligently arranged. She no longer harbored the same hostility towards others; at least Madame Ji didn't deliberately withhold anything from her. Living under someone else's roof, enduring some grievances was inevitable.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Madame Xin chimed in, \"I remember the eldest young miss used to have a maid who was exceptionally skilled at brewing tea, capable of thirty-six tea arts.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">That was Yunzhi, but she betrayed her. De Yin didn't want to mention her anymore.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Imperial Mausoleum</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Yunzhi emptied the chamber pot early in the morning and hurried back to her room to dress her daughter and lift her clothes for her son to nurse. After finishing these tasks, she broke out in a sweat.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">When she left the palace, she had some silver for rewards. Princess Wei forbade them to take anything, but money talks, and she used these funds to get extra food for her daughter and some rice paste. For herself, she was content with cornmeal porridge, a small dish of pickles, and a palm-sized bun.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">However, winter was approaching, and the quilts were too thin, the jackets mere lined clothes, offering no warmth.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">If her lady could send some, it would be wonderful. As the elder sister of Princess Wei, she should be treated kindly. Initially, she did betray her lady, but she never harmed her and even actively helped her during difficult times.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">She was disappointed; instead, it was Princess Wei who sent the cotton clothes, delivered by her own brother.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">When Huiyin asked Pei Shuo to deliver the clothes, she gave him a task: observe how the Wei family woman lived. If she treated these as treasures, it indicated she wasn't adapting and had no support. If she appeared indifferent, even disdainful, and had better items in her room, it suggested she had secret support.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Wei Liangdi, having borne the emperor's first son, was not someone Wei Duo would abandon entirely. It wasn't that Wei Duo loved and valued his daughter and grandson so much, but in his current situation, claiming the title of emperor meant facing greater opposition. Thus, under the guise of Li's descendants, Wei Liangdi's son was under strict surveillance.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Yunzhi was delighted to receive the quilts and even more so when she saw the cotton clothes. Though the fabric was indigo linen, which was relatively expensive, the cotton clothes were still very good. Holding her daughter's hand, she said joyfully, \"This is wonderful. We can get through this winter comfortably.\"</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Upon seeing this, Wei Liangdi, who was standing nearby, had a look of mockery in her eyes.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">The distributor of the cotton clothes called out, \"Wei, come and get yours.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Wei Liangdi, who was once the daughter of a chancellor like Wei Duo and the top figure under the Eastern Palace, was being treated this way. Furious, she grabbed the cotton clothes and mattress, and upon entering her room, threw them on the floor and stomped on them, saying, \"One day, when my son becomes emperor, I'll make you all cry.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">……</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Pei Shuo couldn't help but admire his sister. Instead of immediately checking the people on the list, she took a different approach and sent him to investigate Wei Liangdi first. It turned out to be a fruitful decision.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">He pretended to return with his team but doubled back to observe the surroundings.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">As for Huiyin, after receiving the list, she couldn't fully trust it. As she had done this time, Huiyin asked them to verify two points: first, whether their backgrounds matched what they claimed, and second, whether their families had recently become wealthy.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">However, these points could also be falsified, so she only used them as a reference and didn't fully trust them.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"The Empress Dowager has submitted a request to enter again,\" said Nanny Nan.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">This Madam Ma was Xun Rou. After returning to the capital, Xun Rou's father thought she wasn't capable and wanted to marry her off as a second wife because her dowry wasn't much. However, her father passed away that year, and Xun Rou requested to observe three years of mourning. Later, when news came that the Prince of Huaiyin had annexed Qingzhou and Yanzhou, Xun Rou used this to prevent her stepmother from marrying her off easily, eventually choosing a promising young man, Ma Sichu, who was the military registrar of Linzhou at the time.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">In fact, Xun Rou's life wasn't too bad. Huiyin had only made her taste the bitter fruit of her own design, but these rumors hadn't reached her hometown. She was being sent back to her family for marriage due to her age.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Since Li Cheng ascended the throne, Xun Rou had repeatedly requested to enter the palace to visit the Empress Dowager. However, since Huiyin was managing the palace affairs, she had the authority to decide who could visit and who couldn't.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">The Empress Dowager was someone who was often confused, and Xun Rou was full of schemes. Putting these two together wouldn't lead to anything good.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">\"Ignore the request; there's no need to respond,\" said Huiyin.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">The Empress Dowager was getting old, like Elder Madame Xu, not in power but with a high status. Knowing they were old, people couldn't do much about them.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Hearing Huiyin's response, Nanny Nan also breathed a sigh of relief. \"It should be like this. Xun Rou isn't a good person; she has many tricks and schemes up her sleeve.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Huiyin smiled. \"I'm not stupid. Why would I let her come? She's just the wife of a military registrar; what qualifications does she have to request an audience?\" Oh, by the way, I saw that the prince's clothes were made very well yesterday. Please take four strings of cash to reward the clothes officer of the Imperial Clothes Bureau for their excellent work.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Nanny Nan left to carry out the order. This Clothes Officer Zhong was said to have a sister who recently bought a three-courtyard house and whose son had married with a generous dowry, raising suspicions within the Cui family.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">Moreover, Clothes Officer Zhong had originally been under Empress He, which was already problematic. After being warned last time, the Imperial Clothes Bureau had been very diligent in their work.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">However, Huiyin didn't directly deal with Clothes Officer Zhong. Instead, she publicly rewarded her to see how the person behind her would react.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">If Clothes Officer Zhong wasn't a spy, and someone aware of the list knew it contained Clothes Officer Zhong, would they send an anonymous tip? If something happened to Clothes Officer Zhong or if she was reported and exposed, the spy might take Clothes Officer Zhong's position.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Upon receiving the reward from Huiyin, Clothes Officer Zhong was delighted, not because of the money itself, but because it represented the Empress's trust in her.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">At her age, never having married and working hard to reach the position of Clothes Officer, it was hard to leave the palace where she was still respectfully called Lady Superintendent. Now trusted by the new Empress, Zhong used the reward money to buy wine and food for the Imperial Clothes Bureau staff.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"Today, the Empress rewarded me. While it’s credited to me, it couldn’t have happened without everyone’s help.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Having a meal with Clothes Officer Zhong were two Clothing Officers, two Garment Officers, and four Ladies, all from the Clothes Department. Currently, the Imperial Clothes Bureau had four departments, and Clothes Officer Zhong had temporarily managed the bureau, with the deepest seniority, making her a likely candidate for the next Lady Superintendent.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">However, the decision rested with the Empress, so she personally oversaw the clothing production.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">\"It's all thanks to Clothes Officer Zhong's efforts; we just did some minor work.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Everyone laughed.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Another Garment Officer sitting nearby said, \"I heard that the Head of the Ornament Department also intends to become the Lady Superintendent. The Empress was very pleased with a bath fragrance formula she presented the other day.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Clothes Officer Zhong glanced at Cai Zhangyi and thought to herself that she had been the one to recruit Cai Zhangyi, who was still quite junior in rank. However, it was always Cai Zhangyi who paid attention to details for her, acting as a sort of confidante. This was in contrast to the two lower-ranking officials beneath her, who were eyeing her position with envy.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Unbeknownst to her, Cai Zhangyi was a hidden spy planted by the Weis. Before Wei Liangdi entered the palace, the palace was recruiting female officials, and Cai Zhangyi had joined at that time. Yet, she remained just a Zhangyi and had not even been promoted to the rank of official. Clothes Officer Zhong was a very meticulous and hands-on person, managing the Bureau of Clothing tightly, which made it difficult for anyone to take action under her watch.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">In recent days, there was news that the Empress had begun to suspect Clothes Officer Zhong. With a little push, if Zhong were to leave, the two incoming officials would not be as meticulous and would be more eager for quick success, making things easier to manage.</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Children's skin is delicate. If they wear clothes soaked in poison, they would die without a clear cause, unlike in the kitchen where food is tested for toxins. Clothes are never tested in the same way.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Cai Zhangyi secretly stirred up trouble, hoping for a conflict to arise between Clothes Officer Zhong and another official.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">After three days, Pei Shuo asked for an audience. Huiyin met her brother in a side hall and had her trusted aides guard the door.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">\"Brother, how did it go?\" Huiyin asked.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Pei Shuo replied, \"Your Majesty is exactly right. That woman from the Wei family appeared no different from other women on the surface, but she had warm quilts and carefully prepared food. I feared I might misjudge if she had used money, so I had someone search her room when she was unaware. No silver was found, and the fur came from places like Jinzhou. At night, an old woman delivering night soil often sneaked in to deliver food. I followed her for two days, only to find out she was disguised. She has been captured.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">\"Good. We should have a clearer picture soon. If we can find their base, there might be other uses for it,\" Huiyin said.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Pei Shuo then asked, \"Should this matter be reported to His Majesty?\"</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">Huiyin shook her head, \"No need to trouble His Majesty yet. He is occupied with war and might get distracted.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">The siblings chatted casually for a few more sentences before dismissing.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Huiyin then went to pay her respects to Empress Dowager. She specially brought some milk cakes and said, \"Your Majesty, I tasted these milk cakes in the kitchen, and they were soft and flavorful. I offer them to the Ancestor.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">At her age, Empress Dowager preferred easily digestible food. Seeing the box open to reveal the white and tender pastries, she couldn’t help but ask, \"Are there any for the Crown Prince and the Second Prince? They enjoy these kinds of snacks.\"</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">\"Rest assured, they each have some. Your Majesty, how has your health been lately? The weather is getting colder, and you must take good care of yourself,\" Huiyin said with a smile.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Empress Dowager nodded.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">After some polite exchanges, Huiyin excused herself. After she left, Empress Dowager muttered, \"The Zheng family often visits her, but few from our Xun family enter the palace, and when they do, they just follow the crowd.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Nanny Fan had long been Huiyin's ally. She thought to herself that since Xun Rou had done those things on her orders, Huiyin was now eyeing her again. And Marchioness Xun, who were both grandchildren of Empress Dowager, what feelings did they truly have for the Grand Empress Dowager?</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">But she couldn’t say that. Nanny Fan said, \"Your Majesty, I heard that every time someone visits the Empress, rewards are given. Even the Empress privately complains that the storeroom items are insufficient. Since you are now a Marquise, if the Xun family comes to the palace asking for rewards or official positions, it would be difficult for you to grant their requests. Even if you do, it’s better to wait until the Emperor returns to have a say.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Empress Dowager's attention was oddly drawn to something else, \"Are you saying the Empress is also short of money?\"</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Nanny Fan nodded, \"Exactly. The Emperor is fighting wars outside and needs money. The internal treasury has been exhausted. Now, with many people in the palace needing their allowances and external meritorious officials requiring rewards, even Princess Wei living here needs help building a house. In winter, the entire palace makes winter clothes. To show the new court's benevolence, I heard the Empress said her relatives wouldn’t enter the palace for some time.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Empress Dowager's private treasury was quite abundant, so it was fine to reward her natal family, but if the Empress was short of money and she herself gave lavish rewards to her natal family, what if the Empress asked her for money? What would she do then?</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">With that thought, Empress Dowager decided to hold off.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">**</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Late at night, Huiyin looked at the list: Clothes Officer Zhong, Jiang Siyishi, Peng Neishi of the Gongde Hall, and the palace maid from the flower room in Linde Hall. The first four had suddenly become wealthy, while the last one's background was completely off.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">\"Fugui, the maid named Rou'er from the flower room is already twenty years old, right?\" Huiyin asked.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Fugui confirmed, \"Yes, she is twenty this year.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">\"How is her work?\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">\"She is quite meticulous, appears gentle and quiet, doesn’t talk much, and is liked by everyone.\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">\"Tomorrow, find an opportunity to search her room. If you find any heavy gold or medicine packets, take her into custody immediately,\" Huiyin ordered.</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">She needed to act on the most obvious person on the list first, making them believe she trusted Cui Yuehua’s list. Naturally, the so-called evidence would be delivered to her, and everyone on the chain of connections would be implicated.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">Fugui moved swiftly. She first had Rou'er deliver some flower pots to Elder Madame Xu, then searched her own quarters thoroughly but found nothing out of the ordinary. She had Lingjiu restore everything to its original state and erased the footprints, leaving her to stand guard.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">When Rou'er returned after delivering the flowers, she was covered in mud and needed to change clothes. Lingjiu, hiding on the rafters, watched as she stripped off her outer garments and changed. Lingjiu waited until Rou'er left and inspected her again but found nothing.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Lingjiu reported back to Huiyin: \"Your Majesty, there was nothing unusual. There was nothing on her.\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">\"Was she wearing any jewelry on her head or body?\" Huiyin narrowed her eyes.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Lingjiu thought for a moment. \"Yes, a thin silver hairpin with amber at the tip.\"</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">\"Take the hairpin apart and see if there's anything inside,\" Huiyin ordered.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Lingjiu nodded. Within a day, she returned to report: \"Your Majesty, you were right. The hairpin contained a powder made from withered vines. The imperial doctors said that if placed on flowers, it could cause adults to vomit uncontrollably and might be fatal to children. No wonder we noticed you, who love flowers, haven’t been sending or receiving any recently.\"</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Huiyin sighed. \"It's impossible to guard against everything. I'm not omnipotent. Fortunately, this Rou'er wasn't too vicious. She can't be kept around. Her crimes should be made public, and the Palace Affairs Bureau should interrogate her. Ideally, she'll reveal her accomplices. If she doesn't confess, ensure she doesn’t die too soon. After her death, announce that she killed herself before we could extract a full confession.\"</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Once the order was given, the Palace Affairs Bureau moved swiftly. Despite Rou'er's seemingly gentle name, she was tough and refused to talk. It wasn't until Huiyin gave a specific command that she broke, revealing that Xiao Neishi from the laundry bureau, who was often bullied, had been relaying messages for her.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Xiao Neishi and Rou'er were both executed on the spot for plotting against the imperial heirs and being spies for the Weis. Their heads were displayed for three days.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">The incident shocked everyone. When Cui Yuehuan saw the heads hanging on the city wall, she flinched.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">\"This should serve as a deterrent.\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Even Yin Lifang and Princess Wei, hearing of the event, visited Huiyin's palace. They comforted her but were also somewhat frightened. Yin Lifang wasn't surprised. Her sister had once mentioned how ruthless Princess Zheng could be toward her rivals. Now, facing someone who truly intended harm against the crown prince, she would be even less merciful.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">As for Xun Rou, she had planned to use her improved circumstances to visit Elder Madame Xu and seek revenge. But seeing the heads on display made her faint, her heart pounding uncontrollably.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">\"Better to stay home quietly,\" she thought.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Elder Madame Xu also fell silent. Huiyin generally disliked violent people, but Li Heng and Huiyin were known to be ruthless. It was no wonder that in a previous life, Li Heng and Huiyin were a couple, and in this life, Li Cheng and Huiyin were as well.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">...</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Cai Dianyi, observing secretly, saw how the empress dealt with the palace maid who plotted against the crown prince. Emboldened, she began using her connections. She wrote an anonymous letter and, late at night, slipped it under the door of the Linde Palace. She also placed a packet of poison under Clothes Officer Zhong's bedding.</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">She believed that even if the empress investigated, she wouldn't trace it back to her. After all, she had nothing on her at the moment.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">That night, she thought to herself that if this succeeded, the Weis would certainly reward her and her family. Her father, in his fifties and long disheartened in his career, would have a brighter future with the Weis' support.</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Unexpectedly, the next morning, Zhong stood at her door. Zhong looked at her coldly. \"I didn't expect you to be an eye of the Weis and try to frame me.\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Cai Dianyi, not fully dressed, was confused. \"Clothes Officer, what are you saying?\"</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Wasn't the empress supposed to come for her? After all, Rou'er was executed based solely on the poison.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">Zhong said, \"The Clothes Office has someone like you attempting to frame me. Your accomplice has already been caught. Empress Huiyin said your family has been detained by General Pei. The old woman, Qiao, you were in contact with, has also been captured. If you cooperate, the empress might allow you to see your father. If not, your fate will be the same as Rou'er’s.\"</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">Cai Dianyi, being of a higher rank than Rou'er, led to the discovery and elimination of ten hidden Weis agents.</p><p id=\"paragraph-116\" data-paragraph-id=\"116\">...</p><p id=\"paragraph-117\" data-paragraph-id=\"117\">Later, Madame Ji entered the palace and asked, \"I didn't expect Clothes Officer Zhong to be innocent. How did you know there was a problem with Cai Dianyi?\"</p><p id=\"paragraph-118\" data-paragraph-id=\"118\">Huiyin smiled. \"It was a case of mistaken identity. The emperor had warned me, but I already knew how to handle it. It’s absurd how Wei Duo has suffered such a loss!\"</p><p id=\"paragraph-119\" data-paragraph-id=\"119\"></p>\n</div>"
  },
  {
    "number": 85,
    "title": "Chapter 85",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 85</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Chapter◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">In the morning, after organizing some palace affairs, Huiyin felt exhausted and in pain. She truly couldn't compare to some women who had exceptionally good health. The last time a lady visited the palace, she mentioned how her energy levels actually improved after giving birth. Even now, at over sixty years of age, she remained radiant and more vigorous than younger people.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">However, Huiyin could not manage such feats. She definitely needed some rest. Around noon, feeling too lazy to have a proper meal, she had a few light snacks. It wasn't until after she woke up from her nap that she felt more comfortable.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">The people serving her had also grown accustomed to this routine. Almost everyone would take a nap at noon. Nanny Nan brought over some needlework, Ling Lu prepared tea for everyone, and Huiyin read a book by the side.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">After finishing the book, it suddenly occurred to her, \"It seems my eldest brother has had another son.\"</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Fugui smiled. \"You have so much on your mind, my lady. Just yesterday, you sent me to the Pei family to check on things.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">\"I forgot because things have been so busy lately,\" Huiyin said.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Currently, her elder brother had two sons and a daughter. As for the boys, it was fine, but Huiyin had been thinking about arranging a marriage for Xianjie. She intended to marry Xianjie to Guo Zhao's eldest son, Guo Xing. This would be a union of old and new court officials.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Besides, Xianjie was sensible, and Guo Xing was a very prudent child. Their marriage might not be filled with passionate love, but it would be stable and good, which was better than many others.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">However, it wasn't just about what she thought was good. She also had to consider whether her brother and sister-in-law agreed.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Marriage was about creating harmony between two families, not creating enmity.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">It was also said that after giving birth to her son, Dong Shi needed more care due to postpartum bleeding, but her brows and eyes had relaxed. Although she had been married several times, she finally wed into the Pei family. Her husband was handsome, of high rank, and powerful, and she had even borne him a son. For her, life had reached a state of perfection.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Thus, she had someone donate five hundred taels to a temple as a charitable donation.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">She wasn’t asking for anything else; she just wanted her future to be peaceful, which was more important than anything.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Pei Shuo understood Dong Shi's actions well. When he had needed financial and human resources the most, Dong Shi had helped him without hesitation, which was a great favor to him. All she needed was a place to stay, which he could easily provide.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">This time, because Pei Shuo was the queen's brother and a General of the Flying Cavalry, a position much higher than the Jizhou Colonel, his home was bustling with activity. Seeing this, Xin Shi couldn't help but feel sour.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">However, the relationship between a husband and wife largely depended on the power behind them. The Xin family, which had some reputation in Jizhou, was now insignificant in the newly established dynasty. So, although Xin Shi was sharp-tongued and had some difficult days, she eventually let it go.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Moreover, from her cold observation, Dong Shi was a gentle and obedient person. She even pushed Pei Shuo to visit Huiyin. Whether she was hiding malice or deliberately flattering, it was hard to say. But if she resorted to harsh measures against Dong Shi now, she might be seen as jealous. If Pei Shuo disliked her because of that, her life would become difficult.</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">This was why, despite her sour feelings, she still made sure the third-day ceremony for Dong Shi's son, Jian Ge, was grand, treating him as if he were her own son.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">When Madame Ji saw this scene, she spoke to her son Pei Shuo about his wife. \"Your wife is virtuous. You should treat her kindly.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"Don't worry, mother. I will never mistreat Xin Shi,\" Pei Shuo replied. Xin Shi was his first wife, the mother of his children. How could he mistreat her?</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Madame Ji smiled. \"That's good, that's good.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">After finishing this topic, the mother and son moved on to discuss the completion of the Yuzhang Prince's Mansion. Pei Shuo's other task of staying in the capital was to monitor the Yuzhang Prince's Mansion.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Zheng Fang entered from outside and joined the conversation. \"The Yuzhang Prince is finished. The group from the Wei King's territory, now leaderless, has split. Some have joined Wei Duo, and most have joined the emperor. The emperor is currently fighting Wei Duo on the frontlines. As the emperor of the Da Ye dynasty, many secretly side with him. But what does the Prince of Yuzhang have? He is merely a teenager, unskilled in archery and horsemanship, and barely literate. Even if he's a bit clever, can he really turn the world upside down? To play the part of a pig to catch the tiger, you still need to be a tiger.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">\"Father, I understand what you mean, but my sister has told me to pay close attention. I dare not neglect it.\" After witnessing his sister's handling of spies and how much weight her words carried, Pei Shuo's heart naturally leaned towards his sister.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Zheng Fang wasn't as open with his stepson as he was with Zheng Wuheng. He only sighed softly. \"The emperor is not here right now, so it's natural that your sister is concerned. But if she becomes too concerned, the emperor might not like it.\"</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">He still held traditional male views. Pei Shuo wasn't without worry either, but after thinking about it, he smiled. \"You don't know. The emperor hastily named the crown prince to secure my sister's position. Perhaps he needs her to be stronger to help protect the imperial throne for the crown prince.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Zheng Fang's mind immediately wandered. Yes, all his talk was based on the assumption that the emperor would return. But if the emperor didn't come back, with Huiyin's abilities and talent, she could indeed take charge. As the grandfather of the crown prince, he would certainly be heavily relied upon.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">\"Cough, cough, Father, what are you thinking about?\" Pei Shuo poured wine for Zheng Fang.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Zheng Fang raised his cup and took a few small sips. \"No, not really. Just that you have so much on your plate, it must be exhausting.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Pei Shuo smiled. \"Why speak such words? Assigning tasks to me shows you trust me.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">For Pei Shuo, this was actually a good thing. While fighting wars outside could lead to merits, with Yuwendang around, no one could surpass his achievements. Being able to help his sister in the capital and earn some favor with his nephew was more valuable than anything else. People feared being idle; a day or two of leisure was fine, but over time, one would fall behind.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Meanwhile, when it was mentioned that Yuzhang Prince's Mansion had been completed, Huiyin went to the Empress Dowager's palace and spoke to Princess Wei and Yin Lifang. \"I plan to select an auspicious date for you to move in.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Princess Wei was delighted. \"We must thank the Emperor and Empress for their care.\" Yin Lifang also added a few words.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Huiyin was pleased to see this, as she knew that while Princess Wei and Yin Lifang could maintain a temporary calm in the Empress Dowager's presence, it would be difficult once they left the palace.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Therefore, Huiyin wouldn't let them off so easily but pretended to be troubled. \"However, I must first complain to both of you. With the new dynasty just starting and the Emperor away at war, the allowances might be limited. Please bear with us.\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">With the war outside, even the palace had to live frugally, let alone those outside the palace. Given the current situation, it was already good for the Yuzhang Prince to be accommodated.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Moreover, when under a low eave, one has to bow their head. This principle left Princess Wei and Yin Lifang without a rebuttal.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">They would move to Yuzhang Prince's Mansion on a certain auspicious day after the Beginning of Spring.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Huiyin's maternal family, the Zheng family, along with the Pei family, Yuwendang's family, and the Guo family, specially came to congratulate them on their new home. Cui Yuehua, returning with Madame Ji, remarked, \"Looking from the outside, Yuzhang Prince's Mansion seems quite grand, but inside it feels too delicate and not spacious enough.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Madame Ji smiled. \"There aren’t many spacious places available for him. This mansion is beautifully built and suits him well. Compared to those sent to the imperial mausoleum, they are already in a good position.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Cui Yuehua nodded. \"You're right.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Madame Ji smiled again. \"With both the official mother and birth mother of the Yuzhang Prince living together, there could be trouble ahead.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"In the palace, they seem to be doing well,\" said Cui Yuehua.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">\"That’s because they’re under the Empress Dowager’s protection. The Empress Dowager isn’t someone who can quell troubles, but the Empress is different. If they keep causing trouble, they might never get out of the palace,\" said Madame Ji, feeling proud of her daughter.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Cui Yuehua remembered the list she had submitted last time, where only one person was problematic, and the rest were fine. She went to the palace to apologize, but instead of blaming her, the Empress praised her for her efforts.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">This experience made Cui Yuehua more composed, realizing there were always others more capable. She understood that work couldn't be done hastily and had since become more convinced of Huiyin's capabilities.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">As for Yin Lifang and the others moving in for the first time, it was up to them to decide the arrangements, not the palace. In fact, their statuses were now quite equal. Although Princess Wei was the official wife, she wasn't the birth mother of the Yuzhang Prince. This was the Yuzhang Prince's mansion.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Naturally, Princess Wei wanted to live in the best courtyard, and Yin Lifang was willing to do so too. However, she wasn't Yin Liyi, who could endure much, so in front of the Yuzhang Prince, she said, \"Jing’er, let's give the best courtyard to Princess Wei.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"Mother...\" The Yuzhang Prince was naturally closer to his birth mother, and Princess Wei's kindness was only because she didn't have a son of her own.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">Yin Lifang gently shook her head and said to Princess Wei, \"Princess, you should live in the upper courtyard.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Appearing deeply wronged, Jianjia couldn't help but defend her mother. \"My mother is the official wife and should live in the upper courtyard.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Upon hearing this, Princess Wei immediately sensed trouble. Though inwardly pleased, Yin Lifang humbly agreed, \"Yes, yes, we will follow the arrangements of the Princess and the Lady.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">The young Yuzhang Prince didn't grasp the complexities and resented that despite his status, his mother had to yield. Princess Wei tried to mediate but to no avail. The Yuzhang Prince and Yin Lifang had already developed a deep resentment towards her.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">However, Princess Wei had her own considerations. Her daughter wasn't married yet, and she needed this status. Otherwise, if Yin Lifang truly became the mistress, it would be awkward for her to appear in public. Therefore, she couldn't back down.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">On the very first day, reports of the disputes in Yuzhang Prince's Mansion were sent to Huiyin, who smiled. \"Let them fight with each other. It's better than them uniting against others, which wouldn't be a good thing.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">Fugui said, \"Yes, neither of them is good. Before, Princess Wei even tried to marry off her sister to our Emperor, ignoring proper decorum. As for Second Consort Yin, she’s always scheming. Despite her small stature, she’s quite cunning.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">\"Although the Yuzhang Prince is still a child, he is the lord of a mansion. How he handles disputes within the mansion will be a true test of his wisdom. If there’s disharmony in the Yuzhang Prince’s Mansion, it’ll be bad for them but great for us. Since the Princess Wei has taken the main courtyard, in the future, when we send gifts, we’ll give the same to both Yin Lifang and the Princess Wei, treating them as equals.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">\"Didn’t the Wei Imperial Consort, the Prince of Wei’s mother, constantly stir up trouble with the Grand Dowager Wu? Once she left the Prince of Wei’s Mansion, the Grand Dowager Wu didn’t dare to cause trouble anymore, which shows where the problem lies. Huiyin isn’t someone who forgets past wounds just because they’ve healed.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">\"When it comes to retaliation, she doesn’t hold back.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">However, as she stood up and walked to the window, seeing the pink buds on the peach tree outside, she murmured, \"You’ve been gone for half a year now… why haven’t you come back yet…?\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Li Cheng was battling fiercely on the front lines. He knew Wei Duo would be tough, but he didn’t expect him to be this difficult to handle. The reason he had been able to defeat Wei Duo before was purely because Wei Duo didn’t understand his tactics. Now, however, Wei Duo seemed to know his moves all too well, which was no surprise since some of Wei Duo’s subordinates had previously served under Li Cheng.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">These men had fought alongside Li Cheng before, so they were familiar with his tactics and knew his personality well.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Li Cheng’s personality was very straightforward, unlike Huiyin’s. Huiyin could tolerate people she disliked and would wait for years to strike back with a well-thought-out plan. But Li Cheng was very particular. When he first saw the gift list Huiyin drafted, he found it inappropriate and revised everything. Fortunately, Huiyin didn’t mind at all.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Now, Wei Duo was deliberately targeting this trait of his, making him win unhappily and lose unwillingly.</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Zheng Wuheng, being the youngest, didn’t dare to offer suggestions. Yuwendang, on the other hand, was eager to win this battle in one go, because if they retreated, Wei Duo would advance.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">They had to endure the hardship and find another solution.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">\"Your Majesty, there is a letter from the Empress.\" A guard reported from outside.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">When Li Cheng was toiling on the frontlines, his greatest comfort was reading the letters from Huiyin. However, Huiyin was very considerate and would only write once in a long while. Previously, there were spies from Wei Duo among his men, and it was only after great effort that they were rooted out. At that time, he couldn’t even send letters back for fear of interception.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Now that these people had been dealt with, he could finally send letters openly.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">The letter began by saying that she didn’t intend to disturb him, but she missed him terribly since he had been away for so long. She also mentioned that she had caught many of Wei Duo’s spies in the capital.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Reading this, Li Cheng grinned. Huiyin was truly clever.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">She also wrote that the peach buds had appeared by the window, but she didn’t know if the flowers would bloom by the time she could see him...</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Li Cheng was also in pain, longing to return to his wife. The couple had been spending little time together for many years. Luckily, at the end of the letter, Huiyin reminded him that tough times call for patience and calm.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">She had even tucked an old silk handkerchief into the letter—something Li Cheng knew she often used. At that moment, Li Cheng blushed.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">His anxious heart was soothed considerably. The next day, he personally rewarded the army and discussed with Guo Zhao, Yuwendang, and Zheng Wuheng in the tent. It was clear to all of them that Li Cheng seemed much more spirited.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">\"They either ambush our granary or try to bribe our people. There are a few useful men when fighting, but that’s because they know my tactics. This time, I need to devise a strategy that he cannot predict, with people he cannot foresee.\" After saying this, Li Cheng looked at Zheng Wuheng.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Although Zheng Wuheng had some experience, he was still like a new recruit among them. Seeing everyone’s eyes on him, he hurriedly replied, \"Your Majesty, I don’t have any other ideas right now.\"</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Li Cheng smiled and said, \"Just speak your mind. Even if you’re wrong, I won’t blame you.\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Encouraged by his brother-in-law, Zheng Wuheng spoke up, \"I believe that old traitor Wei Duo loves land battles and prefers cunning tactics. If we don’t react to his moves and remain unmoved, what can he do to us?\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">\"What you said makes sense. But if we stay still, he’ll attack. We can’t retreat; instead, we need to raise the stakes.\" Li Cheng also came up with a good plan.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Both sides wanted to lure the enemy in, but it wasn’t going to be easy.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Wei Duo was currently trying to recruit Zhao Hong, but Zhao Hong wanted to surrender to Li Cheng. Li Cheng had initially planned to accept him but then thought of a better strategy.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">However, Yuwendang said, \"Won’t this be easy to turn a ruse into reality?\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">\"This is exactly a test. If Zhao Hong and Wei Duo join forces, we’ll let them win two battles and allow them to come from Pingshan. Then, we’ll flank them from behind.\" Li Cheng quickly devised a strategy.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">It was a risky move, but they had no other choice.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">After formulating the strategy, Li Cheng led his soldiers in daily training, working very hard. The grain supplies from several regions arrived in a timely manner. Zheng Wuheng trained alongside his brother-in-law without complaint. In this regard, the two brothers, Zheng Wuheng and Pei Shuo, were alike. Unlike Zheng Fang, who was indecisive and often changed his mind, the brothers were loyal and steadfast.\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">With the frontline so tense, the palace regained its calm after Princess Wei and Yin Lifang left.</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">However, Huiyin still couldn't fully relax, knowing that some of Wei Duo's spies remained undetected. What disappointed her most was that Yuwendang's daughter was to marry Guo Zhao's son. The two fathers had arranged the marriage on the battlefield.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">Since Guo Xing was now engaged, he could no longer stay in the palace. Huiyin prepared many gifts for him to take back to his mansion. Jiang Bipbo had already prepared the mansion, eagerly awaiting Guo Xing's return. Every arrangement and decoration was personally overseen by her to ensure her stepson would be content.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">When she married, Guo Xing was only seven and had been raised in the Huaiyin Mansion by the Empress. Now, five or six years had passed, and the child had grown into a young man. He even had a marriage proposal and would wed in two or three years. He had been granted the title of heir, so he could no longer be treated as an ordinary child.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Before returning to the mansion, Guo Xing had confided in the Crown Prince about getting along with his stepmother.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">The Crown Prince, sounding like a small adult, reassured him, \"What are you afraid of? I've heard my mother mention her. She's very capable and can manage several businesses on her own. Even if she were to make things difficult, I'm still here. And my mother will stand up for you. Don't be afraid.\"</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Bringing her thoughts back, Jiang Bipbo was already quite excited but managed to hold herself back. \"Good child, I've prepared a courtyard for you. If there's anything you don't like, just say so. Come, Shi Jie, come and greet your brother.\"</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Guo Shi, Guo Zhao's beloved daughter, was cherished like a precious gem. Despite her young age, she was sensible and well-mannered. She quickly came forward to greet her brother.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Guo Xing breathed a sigh of relief.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Unknown to him, Xin Shi was quite pleased with the marriage between the Guo and Yuwendang families. Although the Empress had previously hinted at it, Xin Shi believed her daughter could also be a Crown Princess. However, this was just a thought in her heart.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">After a few cups of wine, she revealed some of her intentions to Pei Shuo. \"I really didn't expect the Yuwendang and Guo families to form a marriage alliance so quickly. I also thought highly of Guo Xing when we were in Xuzhou.\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Pei Shuo took a sip of wine. \"The Guo family is newly ennobled, and Guo Xing, as the heir and the Crown Prince's study companion, has a promising future. What a pity.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">\"Actually, there's no need to feel sorry. Our daughter's good days might still be ahead,\" Xin Shi said with a smile.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Pei Shuo was puzzled. \"What do you mean? Are you eyeing a young man with a higher official rank and better prospects for our Xianjie?\"</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Xin Shi smiled but said nothing.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Pei Shuo thought for a moment. \"The son of Yuwendang doesn't seem to be like his father. The grandson of Prime Minister Jian could be a match, and the Xun family wants to marry into our family, but they seem like mediocre and clingy people.\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">\"You can aim a bit higher,\" Xin Shi suggested.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">She thought her husband would guess, but instead, Pei Shuo said, \"The Prince of Yuzhang? No, no, while the Prince of Yuzhang is a commandery prince, his family is complicated. These royal families will not have real power in the future. If our daughter were to marry into such a family, the rules would be strict, and it wouldn't be practical.\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Xin Shi shook her head and wrote two characters on the table with wine. Pei Shuo quickly wiped it off, feeling his heart race. \"Are you crazy? The Empress has no such intention.\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">\"What if I'm just daydreaming? Our Xianjie is not lacking in any way. She's also the niece of the Empress, who adores her. The Empress loves our Xianjie so much.\" Xin Shi didn't think it was impossible.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Pei Shuo, however, said, \"You're being blinded by all this splendor. If the frontline battle is victorious and His Majesty returns triumphant, the entire Da Ye dynasty will undergo a major reshuffle. If our daughter were to become the Crown Princess, how could the old ministers who followed the Emperor be content? Do you think it's a coincidence that the Guo family suddenly formed a marriage alliance with Yuwendang's family now? It's clear the Guo family wants to nip the possibility of Yuwendang's daughter becoming the Crown Princess in the bud.\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Hearing this, Xin Shi understood. \"Are you saying the Guo family intends to marry their daughter to the Crown Prince?\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Pei Shuo nodded. \"I'm afraid that's exactly their plan. Lady Guo is the sworn sister of the Empress, and Guo Zhao, a man from a humble background, has risen to become a count. They are making careful plans step by step! So I say you're being blinded.\"</p><p id=\"paragraph-113\" data-paragraph-id=\"113\"></p><p id=\"paragraph-114\" data-paragraph-id=\"114\"></p>\n</div>"
  },
  {
    "number": 86,
    "title": "Chapter 86",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 86</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Chapter◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">As evening approached and the rosy clouds faded, darkness settled in. Huiyin had always disliked the deepening twilight. She always felt that everything became frightening at night, and her sensitivity would peak. In the past, she rarely thought of Li Cheng, but now she found herself thinking of him more often.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">At least when he was by her side, he was like a guardian, keeping her free from any tension.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">To outsiders, she seemed invincible and strategically flawless, but beneath that tough exterior, she was someone who feared the night. She didn’t dare reveal this weakness, afraid of being controlled by those around her.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">That night, she tossed and turned, unable to sleep, and the next morning, she couldn’t get up, so she stayed in bed a little longer.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">When she rose, she applied a lot of powder under her eyes. It was her birthday, and with the ongoing war at the frontlines, she didn’t want to hold a grand celebration. She only invited the descendants of meritorious officials to the palace to strengthen ties, hosted a few banquets, and bestowed gifts as a gesture of favor.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">“Your Highness, didn’t you sleep well last night?” asked Lingju.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Huiyin smiled. “Before bed, I read a fascinating book that kept me awake, thinking about the story. Do I look worn out?”</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">“Your face used to be as smooth as a peeled egg, like white jade, but now you have dark circles under your eyes,” Lingju replied truthfully, knowing Huiyin preferred honesty.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Huiyin nodded. “I thought so too, but there’s no help for it. I’ve always been a light sleeper.”</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Alone in the vast palace, she had to protect her son and maintain control, all while keeping her vulnerabilities hidden.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">After dressing properly and looking at her dignified appearance, Huiyin rose, satisfied, though she felt a bit shaky from staying up too late. She could barely hold herself up.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">In fact, the noblewomen faced even greater challenges. They had to rise before dawn, dress in grand attire, avoid eating foods with strong smells, and wait in their carriages for the palace gates to open. Once the gates opened, they entered in an orderly manner, holding their breath and not speaking casually. Once they reached Linde Hall, they had to kneel and bow in greeting. It was indeed not easy.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">The older women had to be helped up, and even the younger ones, burdened with heavy attire, had to bow again to wish her a happy birthday. Even Madame Ji had to kneel.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Seated above, Huiyin said to everyone, “Today is my birthday, and it’s truly an honor for you all to come.”</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">“Your Highness, it’s our honor to enter the palace and celebrate your birthday. It’s a privilege for us,” said Cui Yuehuan, the wife of the Empress’s brother and the princess of the ducal palace, who was the first to speak, which was most appropriate.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Huiyin smiled slightly, and the palace maidens brought tea. She then said, “This is a new tea. I found it a bit bitter at first, but then it had a sweet aftertaste. It’s different from the fresh, tender early spring tea we had before.”</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Jiang Bibo, whose family used to be in the tea business, chimed in, “Your Highness’s tea is excellent. I didn’t find it bitter. Instead, it had a very fragrant smell, not the grassy scent of tea but a kind of roasted and aromatic flavor.”</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">“You certainly know your tea. This one was roasted, making it particularly fragrant and flavorful,” Huiyin said, sipping lightly. She actually didn’t dare to drink much, afraid it would keep her awake.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Jiang Bibo quickly said she didn’t dare to claim such expertise.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Huiyin then asked about Madame Yu and Jiang Bibo, “Have your families completed the formal engagement process yet?”</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Madame Yu rarely took her daughter out, so Huiyin had only seen the child when she was very young. Now, both families were important ministers, so she felt she had to ask.</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">Jiang Bibo smiled. “We’ve just matched the eight characters, and everything is good.”</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">“That’s wonderful. When they marry, I’ll make sure to give them a generous gift,” Huiyin said with a smile.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">As for Madame Ji, since she often entered the palace, it wasn’t appropriate to say too much in front of others, so she just asked, “How are the Crown Prince and the Second Prince?”</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Huiyin replied, “Today is my birthday, and they are resting for half a day. They will come to pay their respects in the afternoon.”</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Jing’er, though young, had many people who wanted to climb the social ladder through him. She couldn’t let Jing’er casually meet people. Young children rarely had the ability to distinguish good from bad. No matter how mature they appeared, they could easily fall into the trap of thinking that indulgence equals love and strictness means cruelty. Not to mention outsiders, even those around him, if any wet nurse was too overbearing, Huiyin would send them away.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">So, she deliberately kept these people at a distance.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">When Li Cheng returned and her son could take part in governing, at least he wouldn’t be led astray.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Having said that, she waved to Xianjie, \"Come sit beside me.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">She didn’t have a daughter of her own; Xianjie was her brother's child. Although she wouldn’t dare say she treated Xianjie as her own, she hoped this child would be happier than both her and De Yin in the future. They were both products of political marriages, and their happiness largely depended on their husbands. Xianjie's situation was much better than theirs had been at her age.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Seeing how Princess Huiyin favored Xianjie, Jiang Bipbo lamented that her husband had already arranged an engagement with Yuwendang's daughter. Xianjie, being the niece of the Empress, was young but strikingly beautiful, far prettier than Yuwendang Chonghua. Yuwendang was handsome and talented, and his wife, Yuwendang's mother, was petite and charming, but their daughter, Chonghua, had sallow skin and was somewhat overweight.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Of course, marriage was about uniting two families, and Jiang Bipbo would never express such thoughts outwardly. However, men with beautiful wives often sought affairs elsewhere, let alone when the wife was just average-looking.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">It wasn’t that Jiang Bipbo looked down on them; she simply observed that her stepson was quite arrogant and had been brought up in the Empress's court, giving him refined tastes. Given his tastes, he should marry someone who was both talented and beautiful, but this engagement seemed rather hasty.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">But Jiang Bipbo knew her place well enough not to say anything she shouldn’t. After all, she was just a stepmother, and her role was to execute, not to question.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Xin Shi, seeing the Empress dote on her daughter, was pleased but added, \"If Madame Huiyin loves her, she also thinks of Madame. This is a pair of pouches she made at home to celebrate your birthday.\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">A palace maid quickly brought them over. Upon seeing the soft green satin pouches embroidered with pink peaches, Huiyin commented, \"Xianjie can already make pouches—that's really impressive!\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Xianjie, a bit shy, said, \"I am unworthy of your praise, Madame.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">\"Nanny Nan, I remember we have a few gilded fans. Bring them over for Xianjie to play with,\" Huiyin said lovingly.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Watching this, Cui Yuehua wished she had a daughter of her own. She had no objections to Xianjie; after all, she was the only girl in their family, and everyone adored her.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Then Huiyin asked the other family members how they were doing in the capital and whether they were adapting well. She also bestowed rare and valuable gifts such as precious prayer beads, tribute silks, and rare incense that could not be obtained outside. She even had the Shengping Bureau prepare two short plays for entertainment. After the performance, they had a meal before she dismissed them.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">While the other noble ladies left, Ji Shi, Xin Shi, and Cui Yuehua stayed behind for further conversation.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">During such moments, Ji Shi and Cui Yuehua often engaged in subtle competition, sharing what they knew from the streets. Cui Yuehua, feeling she hadn’t performed well last time, had gathered a lot of information this time: \"I heard that the Yuwendang girl is quite obese and sallow, so the Yuwendang family rarely lets her appear in public. This engagement with the Guo family aims to leverage the friendship between the two families' elders to secure the marriage before any social interactions expose the truth.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">This was the downside of blind marriages, where families only considered status or relied on mutual connections, without regard for whether the couple was truly compatible.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"As they say, beauty is in the eye of the beholder. As long as the girl's personality is good, that's enough,\" Huiyin said.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Hearing Cui Yuehua's account of Yuwendang Chonghua, Huiyin thought of something else: \"I heard that Princess Jianjia of the Yuzhang Kingdom is also looking for a son-in-law. They have only recently arrived in the capital and don’t know many people. I believe they plan to host a flower banquet. In my opinion, they are trying to find a good match through the banquet.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">This was only natural. Huiyin understood that the Princess Wei and her household certainly had money, but it wasn’t an unlimited amount. It was likely reserved for Jianjia's dowry.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">However, whom Jianjia chose to marry was not her concern.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">King Wei was dead, and many of his former subordinates had sided with Wei Duo. The rest had either joined Li Cheng or dispersed like birds and beasts. Unless the Yuzhang King was exceptionally talented, he wouldn’t make much of an impact.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">\"If she wants to look for a match, let her. I believe the Yuzhang King is also of marriageable age, so their mansion will soon be bustling with activity.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">These matters were of little importance to her, and she discreetly stifled a yawn. Seeing this, Ji Shi asked, \"Is Madame tired?\"</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">\"I caught a cold yesterday and didn’t sleep well last night,\" Huiyin waved her hand.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Upon seeing this, Ji Shi and the others knew not to linger and left. Since Huiyin did not ask Xianjie to stay, Xin Shi took her daughter home, feeling a bit regretful.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Once they left, Huiyin returned to her bedroom, removed her hair ornaments, washed her face, and hurried to bed.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">Fugui tucked Huiyin into bed, then she and Nanny Nan did some needlework nearby. Fugui said, \"Madame is truly hardworking; there isn’t a single day when she can relax.\"</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">\"Indeed,\" Nanny Nan agreed with concern. \"Last year, when Madame had her monthly troubles, there were many spies and traitors. She still had to go out at night to check on the Crown Prince and the Second Prince, which led to discomfort below. Being alone, she has to be both father and mother to them, which is truly not easy. Outsiders know nothing; they only see her as being deeply favored, but they only see the glamorous side. Who knows the inner struggles?\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\"></p><p id=\"paragraph-58\" data-paragraph-id=\"58\"></p><p id=\"paragraph-59\" data-paragraph-id=\"59\"></p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Princess Wei was deeply concerned about her daughter Jianjia's marriage, especially since younger girls like Guo Xing were getting engaged, while Jianjia still had no husband.</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Jianjia had grown up, and Princess Wei discussed the matter with her. \"Don't be shy; this is your lifelong affair. This time, it's up to us, not like in the past when your father was in charge.\"</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Mentioning Prince Wei, Jianjia said, \"If Father were still alive, why would we need to live under someone else's roof and put up with others' attitudes?\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">\"Even if your father were alive, he might not have done any better than your cousin. We would still have had to endure that Xu witch. Let's not talk about her; her death was quite gruesome. I never liked Xu Cifei. The two of them colluded with Wei Duo, leading to the downfall of Wei territory. Otherwise, how could we have ended up like this?\" Princess Wei disliked Xu Cifei, and this shared resentment was mutual.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Jianjia also recalled the past. Her mother was always drinking those medicinal concoctions, hoping to have another son. They had to curry favor with Yin Cifei and treat Li Jing well, all to ensure future support.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Alas, everything had come to nothing. Life had changed drastically in just a few short years, as if in a dream.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Princess Wei didn't know many people, so she sent invitations to those she did know, preparing food and wine. Although Yin Lifang was temporarily living under someone else's roof, she refused to be seen as inferior.</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Qiaozhen advised, \"If you don't go out, people will think you're inferior. Why not sit with her on equal footing? Even in the palace, the Empress bestows gifts equally to both of you.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">\"Yes, I am the birth mother of the Prince of Yu Zhang. If I claim to be ill, it would only show weakness. In the palace, I've seen how Princess Zheng is full of vigor, and no one dares to underestimate her. Who would dare to deceive her?\" Yin Lifang had been cautious due to her status, but now, because of the same status, why should she cower? Without her son, there would be no mansion, and where would that Huo family show off their power?</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Not to mention the flower banquet where Princess Wei and Yin Cifei were at odds. As for Jianjia among the new elite, she wasn't as sought-after as the younger Xianjie. Those in the know were clear that when the Emperor established his own household, there had been some dissatisfaction from Prince Wei's side, so these people were holding back.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">However, there were some large families in the capital who didn't know these details, and two of them had sent matchmakers to propose marriage.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">This was far from what Princess Wei had imagined. Instead of a flood of proposals, there were merely two, and she wasn't very satisfied with either. Yin Lifang also sighed, \"Sister, Jianjia's age can't be delayed any longer. Even if we settle on a marriage this year, preparations will take two years.\"</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">The adults' matters were kept from the children. Even though Yin Lifang showed her grievances in front of her son, she never directly spoke ill of Princess Wei.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">\"Yes, marriage preparations take several years,\" Princess Wei calculated, counting on her fingers.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Soon after, Princess Wei also enlisted the help of Madame Sun, who was the wife of an old minister from Wei territory and had a good relationship with Princess Wei. When Princess Wei asked for her assistance, Madame Sun thought of someone. \"If we're talking about family background, there is indeed someone. I heard that the Emperor's cousin, Cui Erlang, recently lost his wife. The Cui family is a prominent clan, and he is a handsome and distinguished man.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Princess Wei directly went to the palace to request Huiyin's help for this match, knowing that it couldn't be done privately, or it would raise suspicions of collusion.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Sure enough, Huiyin smiled and said, \"Cui Erlang lost his wife, but how could he match a princess? I believe we should find someone of appropriate age and appearance.\"</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">\"Does the Empress have a candidate? We are like headless flies, widows without occupation, knowing nothing,\" Princess Wei hoped Huiyin could arrange an excellent match.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Huiyin smiled faintly, \"I've been in the palace for so long; I don't know many people.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Although Princess Wei was somewhat disappointed, she didn't lose heart after leaving the palace and actually found a match. It wasn't someone else, but the son of Xun Rou's stepmother. Both sides were relatives and hit it off immediately.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">Princess Wei and Jianjia were very happy. The two of them sat together by the candlelight, eating hot pot with great enthusiasm, looking forward to the day Jianjia would marry. The Xun family was royalty, and as long as the Emperor was there, their daughter would be safe. The young man was good at painting, had a proper appearance, and was a good match.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Such a warm scene was something Yin Liyi couldn't enjoy. She also had a son and a daughter, but Madame Xie's attitude towards her had changed drastically, cursing her as a reincarnated disaster star. Xie Jiuyi, who should have been on her side, was unusually silent, leaving Yin Liyi to suffer in silence these days.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Today, Xie Jiuyi had gone out, and her two children were eating with her. Her daughter was fine, but her son hadn't even finished his meal before shouting that he wanted to go to his grandmother's.</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">\"Son, you haven't finished your meal yet? Grandmother is old and can't tolerate much noise. It's better to stay here with me,\" Yin Liyi said.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">For nearly two years, she had been with her children, rarely leaving the estate. Xie Jiuyi seldom allowed them to leave, so she knew nothing of the outside world, let alone her sister and nephews.</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">But she avoided bringing it up again. This was a knot in her and Xie Jiuyi's hearts. Mentioning it would only lead to mutual pain and suffering.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">When Xie Jiuyi returned today, he wasn't in his usual bitter state. He even volunteered, \"I found out where your sister is.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">\"Really? Where?\" Yin Liyi immediately sat up in bed.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">Xie Jiuyi rarely smiled, \"Your nephew has been enfeoffed in the capital, and it's likely your sister is living there too.\"</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Yin Liyi was delighted. She didn't want to speculate, but what if her sister hadn't been living well? Would Xie Jiuyi still be indifferent towards her?</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">You can't dwell too much on these things. Back then, when he married me, it looked like he was just marrying the daughter of a minor official, but could it also have been because of my sister?</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">**</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">In the blink of an eye, it was the end of another year. Huiyin was organizing the palace staff to clean the palace. Recently, some of the palace maids had been dismissed, and a new batch of young maids had been recruited from Jizhou, Qingzhou, and Xizhou.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">A new group of people had taken their place. Huiyin looked at her copper mirror and seemed to have aged another year.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">She used to hate those women who complained about being trapped in their homes, but now she was starting to show some of those tendencies. It was truly a regret to urge her husband to seek honors. But thankfully, the tough battle against Wei Duo was finally over, and she would soon be able to see her husband.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">They hadn’t seen each other in two years. She wondered if he had become rough? Also, could he have fallen in love with someone else on the frontlines? If he fell in love with someone else, should she do the same?</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">However, she didn’t seem to have much interest in men.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Lost in her thoughts, she glanced up and saw another person in the mirror. Startled, Huiyin stood up, “You, how did you suddenly appear behind me? Is this a hallucination?”</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">Li Cheng had been longing for Huiyin all the way, so he decided to return early with his men, wanting to surprise her. He didn’t ask anyone to announce him but was pinched by his wife as soon as he arrived. He deliberately grimaced, completely disregarding his image, just happy, and hugged his wife tightly.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">“It’s not a hallucination, it’s really me who has returned. I didn’t stop riding to see you sooner,” Li Cheng felt her warmth and heartbeat and didn’t want to let go.</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Originally, Huiyin wanted to say something sentimental, but seeing his well-shaved face and neatly combed hair, she smiled, “You didn’t ride straight through. You must’ve stopped to clean up along the way.”</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Li Cheng’s ears turned slightly red, “That’s because you said I smelled like a horse after riding, and wouldn’t let me touch you.”</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">“I was just looking out for my own health. You don’t know how often I couldn’t sleep when you weren’t by my side. Really...” Huiyin coquettishly told him.</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Li Cheng simply scooped her up in his arms and carried her to the bed.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Two hours later, they emerged. Li Cheng felt like all his bones and muscles had been cleared. Huiyin muttered, “I thought you would bring a younger sister back for me?”</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">“In all honesty, was what I just did not enough? I’ve been holding back for two years. At this intensity, are you trying to wrong me?” Li Cheng felt wronged.</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">Just now, Huiyin had complained that he had become darker and even suggested he had an affair outside, which was completely wronging him.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">From riding and fighting in wars, calluses had formed on his legs.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Huiyin smiled and waved her hands, “Alright, alright, alright. Our conversation is too embarrassing to be heard. Tell me, how did you win? You have no idea how worried I was. Wei Duo, that old villain, had endless tricks up his sleeve.”</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">In her previous life, when she was the Empress Dowager, her father was initially unafraid of fighting Wei Duo but later became somewhat fearful.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Li Cheng smiled as he walked, “Thanks to my older cousin. He sent word that there was a major spy close to me. So, I couldn’t write letters and specially sent plums to you. You did your part well.”</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">“Oh, it was him,” Huiyin suddenly understood why Li Cheng didn’t write letters but sent plums instead.</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Li Cheng smiled, “Yeah, I also deliberately designed for Zhao Hong to actively surrender to Wei Duo. To gain trust, I relied on this cousin. If I had initially conferred a title to the Cui family, they might not have fought so hard. This cousin might not have been helping me, but seeing my growing momentum, he switched sides. In the end, Wei Duo was killed by me, and Zhao Hong has surrendered to the court.”</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">Most of the territory of the Da Ye dynasty had been captured. Huiyin also sighed, “These things were hard for us to imagine before, but now they have been achieved.”</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">Li Cheng added, “I also want to thank your breastplate. I originally thought it was a bit cumbersome. Who wears two breastplates? But on that day, Wei Duo faked his death, and his heart was on the right side. He wanted to shoot me off my horse, but because of the breastplate, it saved my life.”</p><p id=\"paragraph-115\" data-paragraph-id=\"115\"></p>\n</div>"
  },
  {
    "number": 87,
    "title": "Chapter 87",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 87</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Double Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The couple went to pay their respects to the Empress Dowager, who was previously known as Empress Dowager Xun—a normal title. Some even called Huiyin 'Empress Zheng' behind her back, but she didn’t mind.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">However, Huiyin believed that the Empress Dowager was of a higher status, and she respected her deeply.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">At the entrance, Li Cheng adjusted his clothes. This set of clothing was made for him by Huiyin, and it fit perfectly. The couple still lacked the awareness of being emperor and empress. They didn’t sleep in separate palaces and lived just as they had in the mansion.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">\"Your subject comes to pay respects to grandmother,\" Li Cheng bowed.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">The Empress Dowager quickly asked him to rise, her expression excited. \"You didn’t inform me in advance of your return from war. I would have had my kitchen prepare a feast to welcome you.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">Li Cheng sat down with a smile, and Huiyin also sat beside him. He said, \"After paying my respects, I will need to convene with the Chancellor and the Three Departments to discuss official matters. I’m afraid I won’t have time to dine with you, grandmother.\"</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">He didn’t suggest Huiyin stay either, knowing full well that while his grandmother should be respected from a distance, getting too close might lead to boundary issues. It would result in endless and bothersome requests. Keeping a polite distance was best.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">As for his wife, her emotions were more stable than his, and she was the person he loved. The couple shared an unspoken understanding, always wanting more time together and more sleep.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Soon, Li Cheng excused himself. The Empress Dowager said with dissatisfaction, \"As one gets old, one becomes less favored. See, they don’t even want to listen to me.\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Nanny Fan thought to herself, you’ve done nothing, your family has been given high official positions and is supported by the world, and you still expect the emperor to entertain you? You can’t have all the good things in the world.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">The Zheng family had fully surrendered, and the Cui family hadn’t even been granted a title due to lack of merit.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">But on the surface, Nanny Fan said, \"Both inside and outside the palace, everyone relies on our emperor. You are still the one whom the emperor personally comes to pay respects to. Who else in the world has this honor?\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">The Empress Dowager thought, while no one else has this treatment, Princess Zheng certainly does. Her grandson was a complete henpecked husband. She silently cursed him for being unfilial but dared not express her true feelings.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">Although Li Cheng claimed he was meeting with external court officials, he still escorted Huiyin back to the palace. He didn’t care if others said he doted on his wife. With such a wonderful wife, why play balance games? Otherwise, he might end up playing himself to death.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Managing a fiefdom was easy, being a regional lord was already complicated, but governing a country was like cooking a small fish. Anyone could offer opinions, but when it came to actual execution, especially for someone like Li Cheng who preferred fast execution, wishing to complete next year’s tasks this year. Reviewing the reports from Chancellor Jian Qin, he skimmed through them quickly and asked detailed questions, writing swiftly with each document.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Jian Qin, no longer young, couldn’t sit for long. After two hours, Li Cheng noticed the late hour and laughed. \"Today is my first day back, yet I’ve troubled the chancellor.\"</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Jian Qin quickly said, \"It is my duty, Your Majesty.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">After speaking, Jian Qin left swiftly. Li Cheng then said to the eunuch, \"Go invite the Empress here.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">He still had to look at some reports and wasn’t ready to stop, but Huiyin understood. In fact, she was making soup—a green bean and lotus seed pork rib broth.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">Green beans cleared heat from the body, and lotus seeds helped calm the mind and spirit. After a long journey, Huiyin needed something to soothe her mind and body for a good night’s sleep. A good sleep was more important than anything.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">When Huiyin arrived, she smiled and performed a respectful bow. \"Your Majesty, I come to pay my respects.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">\"No need for such formalities between us. Come here quickly,\" Li Cheng was delighted, as this was the life he had longed for, with his wife and children by his side, ruling the world.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Huiyin said, \"Your Majesty should have this here, lest the soup spill on the reports. You can also take a short walk and stretch a bit.\"</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">To his delight, it was a refreshing green bean and lotus seed soup. The green and white colors were very calming, and he couldn’t help but sip a few mouthfuls. Huiyin also brought out two types of snacks, one was red date glutinous rice cake, and the other was osmanthus milk cake.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">The glutinous rice cake was Li Cheng’s favorite, easy to digest.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">After finishing, Li Cheng wanted more, but Huiyin said with a smile, \"You must not eat too much. Eating too much will make it hard to sleep.\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">\"You always mention rest. When I’m not around, do you always sleep poorly?\" Li Cheng looked at his wife with concern.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">Huiyin nodded without hesitation. \"Yes, I’m always afraid, but I don’t know what I’m afraid of. Afraid someone might break in through the window and take me away. But when you’re back, I’m not afraid even walking in the dark.\"</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Li Cheng thought it was a good idea to have Huiyin come over tonight.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">No matter how they spent their sweet time together, Cui Dalang had also returned with Li Cheng. In his younger years, he was proficient in divination and very skilled at reading faces. It was because he saw that Wei Duo had the aura of an emperor that he pledged himself to him. However, his cousin Li Cheng, who was originally destined for a short life, now had an overwhelming dragon aura.</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">Therefore, he secretly discussed this with his father, Cui Xun, saying, \"Originally, I pledged myself to Wei Duo, but after seeing the current emperor on the battlefield, his fate seemed to have completely changed, as if he had undergone a fate-altering transformation. Truly strange and wondrous.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Cui Xun was naturally aware of his eldest son's abilities and had never considered pledging to his nephew from the beginning. Even after his nephew ascended to become the emperor and he felt some panic in his heart, he still did not fully commit himself.</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">He was not only Li Cheng's uncle but also the head of the entire Cui family, so he had to prioritize the well-being of the Cui family as a whole.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">After listening to his son, he stroked his beard and said, \"Since ancient times, virtuous people have had the protection of heaven. I see that the change in the emperor's face might be due to his smooth fate. You timely changed course and helped the emperor achieve great merits, allowing our family to maintain wealth and honor.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">Cui Dalang, who was clear and elegant in appearance, tapped the table and said, \"I wonder if there's a divine being helping the emperor? Otherwise, how could a premature death fate be turned around?\"</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">\"I have been in Hebei for a long time, so I am not very clear about the affairs in the capital. However, your sister married into the Zheng family, and she once mentioned that the emperor has many extraordinary people under him and often recruits talented individuals,\" Cui Xun said.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Cui Dalang laughed heartily and said, \"No rush, we will know everything once we go to the capital.\"</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">After Li Cheng returned, he was busy with official duties day and night for three days. Huiyin was intimate with him only on the first day, and for the next two days, she restrained herself, hoping he would rest more.</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Knowing he loved the soups she made, Huiyin kept the kitchen busy. Today, she was boiling Snow Pear and Pig Lung Soup, which was good for moisturizing and protecting the lungs. After all, during the war, Li Cheng didn't know how much dust he had inhaled, and he had endured the cold without any help, so he needed to take care of himself.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">But generally, if Li Cheng did not summon her, she would not go forward, as he often summoned ministers during the day.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"You two keep an eye on the fire, I'll go take a look,\" Huiyin said, leaving two people behind, fearing someone might take the opportunity to poison the food.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">She yawned a few times, feeling sleepy again. Ever since Li Cheng returned, her complexion had improved significantly, and she no longer felt any aches or pains.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Soon after, she fell asleep.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">Nanny Nan covered her mouth and laughed, then went out to tell Fugui, \"Our lady looks so well; maybe in a few months, we'll have another little prince.\"</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Unexpectedly, not long after Huiyin fell asleep, Li Cheng came over. He had taken a break to stroll around. In the past, when he was always outside for war, he longed to be home. But after sitting at home for a few days, initially overwhelmed by accumulated tasks, his energy and clear thoughts allowed him to sort things out. With most things in order, he decided to visit Linde Hall to see his wife.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">He didn't expect to see her sleeping like a scene from a painting. He motioned for the attendants to leave and couldn't resist kissing her lips. When Huiyin, feeling dazed, opened her eyes and saw it was him, she relaxed her body.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"You should calm down. These past few days, you've been thinking too much. Now that you're in good health, don't rely on it and overdo things,\" Huiyin pushed him gently.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Li Cheng groaned, \"Oh, I just missed you so much.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">Huiyin gently scraped his nose and said, \"I know you missed me, but let's wait until nighttime. Why don't you lie down for a bit and rest properly? These days, I can see how tired you are from the veins on your temples.\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"Are you saying tonight?\" He immediately flipped over and lay beside her. Even though it was cramped on the small bed, he didn't mind at all.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">The couple, despite not seeing each other for two years, felt no unfamiliarity, thanks to Li Cheng’s warmth.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">Huiyin felt hot and crowded, so she got up to do some embroidery. But in her heart, she wasn't really focused, so she leaned over and whispered a few words in his ear, making Li Cheng hold her hand and not let go.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">After a month, the army returned together, and Li Cheng began to reward merits. He bestowed two estates upon Yuwendang, awarded Guo Zhao 2,000 stones, and conferred the title of Count on Xie Qian, inheritable for three generations, and the same on Pei Shuo. He also granted the title of Duke to his uncle's family, the Cui family, and awarded Cui Dalang 2,000 stones.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">The ministers hailed the emperor's great grace. Li Cheng changed the original enfeoffment system to a prefecture-county system and planned to hold another imperial examination to recruit scholars.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">This had proven very useful during his time in Xuzhou. The best way to attract scholars was through the imperial examination.</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Although Jing'er was not yet of age to participate in government affairs, Li Cheng was very concerned about his studies and often kept him by his side. He was pleasantly surprised to find that his son's academic and martial skills had not declined.</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"It seems that even when I wasn't by your side, you studied and practiced martial arts well.\"</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Jing'er respectfully said, \"Mother constantly urged me, and even when I felt lazy, she always reminded me.\" Despite his young age, he knew his father valued his mother, and they were a united team.</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Indeed, hearing it was Mother's advice, Li Cheng was very pleased: \"With your mother here, your father has nothing to worry about. I was concerned you might be naughty, but it seems everything is fine now.\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">\"Thank you for your praise, Father,\" Jing'er said with a smile.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Li Cheng then said, \"Now, study diligently under your master.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">\"I understand,\" Jing'er replied.</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Currently, the relationship between father and son is like this; there is rarely the kind of warmth seen between mother and child. The emperor’s role naturally brings a sense of authority and pressure, as almost everyone wishes to curry favor with him, given that his words hold the power of life and death.</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">The emperor’s role in the country is like that of the head of a household. For instance, Guo Xing has been gloomy since meeting the Yuwen family's daughter.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">Even when Guo Zhao called him over and teasingly asked, \"Have you met the Yuwen family's daughter?\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">Guo Xing's response was straightforward: \"The Yuwen girl has inner beauty.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Inner beauty means her outward appearance doesn't fully reflect her inner virtues. Guo Zhao, having spent much time with Yuwendang, admired him greatly and knew that the emperor trusted Yuwendang more than him.</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">Yuwendang came from a prominent family and had many accomplishments, so marrying into the Yuwen family would be better than with anyone else.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">So, when Guo Zhao asked Jiang Bipbo about it that evening, she didn’t hide her opinion. Indeed, her stepson was exceptional and quite handsome, but it would be unrealistic to end the engagement just because of that. She added, \"The Yuwen girl is well-mannered and very virtuous.\"</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">\"Xing'er is still young and only values appearances. I believe inner beauty in a woman is more important,\" Guo Zhao said, considering himself to come from a humble background. He had been valued for his martial skills by the Wu Prince and later became a low-ranking guard for the prince. Although he had been promoted, his roots couldn't compare to the Yuwen family, so for his son's marriage, he had to choose someone from a prominent family.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Jiang Bipbo, being an obedient person, rarely interfered, especially in her stepson's marriage. She simply said, \"It's up to you to decide, sir.\"</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">As his second wife, Guo Zhao was very satisfied with Jiang Bipbo. She was intelligent and beautiful, and she handled her duties as the main wife well.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Hearing her approval, Guo Zhao said, \"You are the god-sister of the Empress. When you have time, you should visit the palace more often. I'm at the frontline, and I know the Empress has considerable influence over the Emperor. Otherwise, Pei Shuo wouldn't have been granted the title of Count, and Zheng Wuheng wouldn't have been brought along on the battlefield.\"</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">Both were the Empress's brothers. If the Emperor didn't value the Empress, how could such arrangements be made?</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Jiang Bipbo detected some dissatisfaction in his words but didn't defend the Zheng family. Although she called Madame Ji her god-mother outwardly, she knew she was part of the Guo family now.</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">So, she simply agreed to her husband's instructions.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">Guo Zhao smiled again, \"You understand well. Shi Jie, bring her out so I can see her. I miss her a lot.\"</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Shi Jie came quickly, and Guo Zhao took out a large night pearl from his chest, which even Jiang Bipbo, coming from a wealthy merchant family and having seen many fine things, found astonishing.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">\"Put this on the canopy. It will emit a faint light at night. It's a pearl from the Eastern Sea; take it for play,\" Guo Zhao said casually.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">Shi Jie looked at her mother, and Jiang Bipbo said, \"Sir, this night pearl is too precious. If it gets lost, what will happen to such a young girl?\"</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Guo Zhao shook his head, \"As the saying goes, spare no expense on daughters but raise sons frugally. Sons should not be spoiled, but daughters must not be wronged. Give her whatever good things she needs. I even plan to hire some well-mannered stewards for her. Since you have a good relationship with the Empress, perhaps you can see if there are any people she has let go who can teach her proper manners.\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Jiang Bipbo knew her husband had always been good to their daughter, but to this extent, it seemed a bit strange.</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">Although she usually didn't contradict Guo Zhao, she now asked, \"Sir, why are you doing this? Our Shi Jie is still very young.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Guo Zhao didn't want to reveal his plans, but he understood that as a couple, if he didn't explain clearly, his wife might act improperly in the future.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">He said, \"Shi Jie's age is similar to the second prince's. Given our status, as a count’s daughter, it wouldn’t be impossible for her to become a prince’s consort.\"</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Realizing this, Jiang Bipbo's handkerchief slipped and fell to the ground. She looked at her daughter and couldn't help but say, \"Even though I have a good relationship with the Empress and she likes Shi Jie, pushing too hard for this would make us look bad. The Empress’s personality is such that she dislikes it when people have ulterior motives. If she senses that, it would be worse.\"</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">\"Yes, yes, you have a good plan. I'm only thinking of our family's benefit. Shi Jie is of noble fate, and if we marry her off poorly, it would be a disservice to her. I don't dare to aim for the Crown Princess position, but is it wrong to aim for the second prince's wife?\" Guo Zhao said with a smile.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\">Jiang Bipbo had already made up her mind and said with a smile, \"Sir, you truly care for Shi Jie. I'm relieved for the rest of my life.\"</p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Guo Zhao's voice took on a suggestive tone: \"We can just have another son with Shi Jie.\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">While Guo Zhao's family was openly preparing to compete for the title of crown prince's consort, Pei Shuo was celebrating his newly awarded earldom. Xin Shi and her family members came to congratulate him, and everyone was very happy. So much so that Xin Shi even arranged a marriage for Dong Shi's one-year-old daughter and directly proposed a match for Dong Shi's son.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">At night, Pei Shuo asked, \"Why didn't you consult me before arranging the marriage?\"</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">In Pei Shuo's view, the Xin family was no longer a match for the Pei family. After all, even his illegitimate son was a young master of the Earl's residence.</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Xin Shi smiled. \"I was thinking that Dong Shi and I are like sisters. If her son married my niece, wouldn't that be a way to strengthen family ties? Back then, my brother and you talked about becoming in-laws over drinks. It's just that Brother's age wasn't suitable, and now there's a young boy available. If you don't agree, we can just forget about it. It's not a big deal, and my brother won't hold it against you.\"</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">\"Forget it, forget it. If we make it too formal, people might think that because I've been granted a title, I'm looking down on others. Let's just leave it at that. Your brother is also a scholar, and he should take advantage of this opportunity. The emperor is going to hold a special imperial examination, so let him come and take the exam.\" Pei Shuo said.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">Xin Shi felt slightly relieved upon hearing that Pei Shuo didn't object.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Meanwhile, Dong Shi didn't react much. Her status was low, and although Pei Shuo treated her with respect, her prime years were behind her. Pei Shuo would eventually have younger women. If she quarreled with the main wife over this matter, what good would it bring her?</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">It was better to pretend to be oblivious. After all, her son was the son of an earl and wouldn't be neglected.</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">She didn't show any dissatisfaction, and those around her didn't mention any unnecessary things. Even the servants thought highly of her. Madame Ji commented to Zheng Fang, \"Xin Shi is quite shrewd. She managed to arrange a marriage with the good family of the Earl's residence.\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">Zheng Fang sneered. \"If it were me, I wouldn't have agreed. She's just saving face for herself.\"</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">\"You can't say that. After all, Shuo'er had a good relationship with the Xin family in the past.\" Madame Ji couldn't help but defend her son, as there were few people in the world as whimsical as Zheng Fang.</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Zheng Fang, however, said, \"The Xin family might have been good in the past, but things have changed drastically now. How can we expect everything to be the same as before? Xin Shi seemed like a decent person in the past, but who would have thought she had so many calculations in her heart, all for her son's status. She’s worried Pei Shuo will favor Dong Shi's son over hers, so she’s taking preemptive action.\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">Madame Ji understood this reasoning well. The women in the inner quarters could see through such matters with just a glance.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Of course, Madame Ji went to the palace to tell Huiyin about this, not without some complaints. \"I really didn't expect her to make such a move. I was happy about your brother's earldom title.\"</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">As a younger sister, Huiyin naturally wanted to stand by her brother, but she said, \"She shouldn’t have made such a decision without consulting him, but since my brother agreed, there’s no point in arguing.\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">\"I can't let this go.\" Madame Ji had always treated her daughter-in-law well, but this time she felt that Xin Shi had gone too far.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">Huiyin said, \"You have to turn a blind eye and a deaf ear to keep the peace. If I say too much, it might disrupt my brother's household. Now that my brother has become an earl, just like the Cui family, who are the emperor's maternal relatives. They're going to enter the palace for a banquet tomorrow, hosted by the emperor himself, and I'll be attending too.\"</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Hearing Huiyin mention the Cui family, Madame Ji smiled. \"My sister-in-law has been holding her head high lately. Her family has finally come into its own.\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">\"They are the emperor's maternal relatives; how could they be neglected?\" As Huiyin spoke, it was announced that Lady Guo had sent her calling card.</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Madame Ji asked, \"Is it from the Guo Earl's residence?\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Huiyin smiled slightly. \"Indeed.\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">Many had their eyes on the sons of an Earl's household, especially her two sons. The Empress Dowager's family was interested, and so was the Guo family, along with many others. They just didn't dare to be too bold in front of her.</p><p id=\"paragraph-113\" data-paragraph-id=\"113\">The next day, Cui Xun brought his two sons and family members into the palace. Li Cheng and Huiyin sat in the upper seats together. Cui Dalian greeted his father and paid his respects. Over these days, he had met Yuwendang, Guo Zhao, Jian Qin, and even Pei Shuo and Xie Qian, and none of them showed any signs of abnormality.</p><p id=\"paragraph-114\" data-paragraph-id=\"114\">But today, seeing the Empress’s regal presence, with a phoenix-like aura radiating from her, it was clear she was a powerful and fated figure.</p><p id=\"paragraph-115\" data-paragraph-id=\"115\">It was she who had changed Li Cheng's fate. It was she!</p><p id=\"paragraph-116\" data-paragraph-id=\"116\"></p>\n</div>"
  },
  {
    "number": 88,
    "title": "Chapter 88",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 88</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Combined Two Chapters◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Cui Xun had two sons, Cui Dalian and Cui Erlang, both born to his legitimate wife, Li Shi. Cui Erlang had handled affairs in Taicang for a few years and was considered diligent. Cui Dalian had also contributed significantly during Li Cheng's attack on Wei Duo, serving as a reliable internal informant.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">But did Li Cheng truly trust them? No, he did not.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">At least for now, there was a need for harmony on the surface. Out of respect for his mother, he would reward her natal family. Otherwise, it would be unreasonable not to reward the Cui family while posthumously honoring his own father and mother.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">In such occasions, no one dared to drink themselves into a stupor. After a few bites of food and some conversation, the men went to the front hall for reports, while the women followed Huiyin to Linde Hall. Madam Cui had been to the palace before, but she came and left in a hurry, fearing any mistakes in her etiquette.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">At present, as a public lady, although she couldn't stay and admire Linde Hall, she could leisurely observe the surroundings. Despite the newly established dynasty, Linde Hall was extraordinarily magnificent, truly resplendent and luxurious, with expensive calligraphy and antique furnishings that were dazzling yet not overwhelming.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">The palace maids quickly served tea. Madam Cui took a sip; it was premium tribute-grade tea with a pure flavor.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">She heard the Empress above inquire, \"Is this the young lady from your second cousin's family? She is indeed quite lovely.\"</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Madam Cui responded attentively, \"Yes, she is Erlang's daughter, ten years old this year. Her mother passed away last year, so she has been raised by me.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">\"At ten years old, she's not small. Although she lost her mother, with your guidance, it's no wonder her manners are exemplary,\" Huiyin remarked.</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">When unsure of what to talk about, people generally start with children.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Madam Cui was pleased and somewhat regretful upon hearing these words, \"Your Highness doesn't know, many families abandon the eldest daughter of a widower. I am getting old and don't know how many more days I can care for her. If her father remarries and someone takes care of her, that would be the best.\"</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Madam Cui, the wife of Cui Dalian, also picked up on the subtle hints, \"We met the wife of Eunuch Guo some days ago. It was said that the marriage was arranged by you, truly a harmonious family that is enviable.\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">The implication was also to request a marriage bestowal. Huiyin thought that if De Yin wasn't an adversary and had maintained a good sisterly relationship, it would have been ideal to have De Yin marry into the Cui family under her control.</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">A widower and a widow, neither looked down on the other, and both families were of comparable status and related.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">However, in her previous life, Huiyin had taken great care of De Yin, but upon her rebirth, the first thing De Yin did was to snatch the bride. De Yin's attempt to block her path was overly excessive.</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Apart from De Yin, Huiyin didn't know much about others, as she had been alone in the palace for several years, which was very different from Xuzhou. In Xuzhou, she had to manage relationships and handle various matters to build connections. But as Empress, she could not form factions.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Her actions and conduct had to appear impartial and neutral, which suited Huiyin's preference. She didn't like meddling in other people's affairs. Each family has its own path, so why should she meddle?</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Therefore, Huiyin merely smiled, \"Each person's marriage is predestined. Now you say this, but by the next time you come to the palace, you might bring a new second wife.\"</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Everyone laughed, and then Madam Cui expressed concern for the Crown Prince and the Second Prince, \"We have always been concerned about the two princes.\"</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"They still have school. The Emperor is very strict about their education. Except for a few major days of the year and their birthdays, they are not allowed to rest,\" Huiyin replied.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Madam Cui felt awkward, \"That's too strict.\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">This time, Madam Cui noticed that the Empress was different from before. Many years ago, the Empress had returned to her natal home for a visit and stayed at their mansion. At that time, though she had a bit of an edge, her demeanor was still pleasant. Now, she fully carried herself as the Empress, speaking bluntly, which made Madam Cui uncomfortable.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Huiyin, however, thought, I am an Empress with genuine authority, not one constrained by others. If I have to watch others' faces while speaking, then why don't you take the Empress's position?</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Huiyin's attitude was the same towards her uncle and two cousins. It wasn't that she acted superior; her position naturally demanded respect. Without the young master Cui, she would still have succeeded, though with more difficulty, and gradually won people's hearts, which was her own ability.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Thus, their interactions were those of sovereign and subject.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">The Cui family was a prestigious family. During the previous emperor's reign, prominent families became influential. Later, as the previous emperor's health weakened, warlords in various regions took control. Any large family with some strength seemed to hold themselves high. However, Li Cheng disliked using such people. They had indeed been influential, relying on patronage and recommendations to sustain vast networks, making it hard for the Emperor’s edicts to be enforced.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Now, civil officials were selected through the imperial examinations, all of them the Emperor's protégés, and military officers through martial examinations. Additionally, Li Cheng valued capable officials, showing greater favor to those with strong administrative abilities.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Just because you come from a privileged background doesn't guarantee you a high-ranking position. Those days are over.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Cui Erlang had been stationed in Taicang for three years, and Li Cheng said, \"You are now part of the nobility. If you truly want to get things done, wait for the Ministry of Personnel's selection. As long as your performance is outstanding, you’ll be rewarded accordingly.\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"Thank you, Your Majesty. Cui Erlang was well aware of Li Cheng’s methods.\"</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Li Cheng smiled and said, \"You are not an outsider; you are my relative. Therefore, you need to be even more diligent and not rely on your status to get things done.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Cui Erlang quickly replied that he didn't dare to be otherwise.</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">After this incident, members of the Cui family began to act more modestly. Cui Xun organized for members of the Cui clan who met the requirements to take the imperial examinations in order to produce more talents.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">This time, representatives from the Cui, Xin, and Xie families joined candidates from all over the country in taking the exams. Academies were also being established. This was also Li Cheng's intention, to make the people focus on education so that military power could be completely controlled by him. Even though he was the emperor, each noble still maintained their own private armies. If this continued, these people could rebel against him if they were dissatisfied.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">It was also mentioned that Cui Xun had a nephew who was thirty years old and passed the examination this year. Cui Erlang also participated in this imperial examination but again ranked poorly. However, he was not discouraged and planned to try again in three years.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">Pleased with the selection of talented scholars, Li Cheng returned to share the news with Huiyin.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Huiyin, however, was concerned for him. \"The world has just found peace; you should take some time to rest too. I only worry about your health. A person's energy is limited; even the Son of Heaven is human. I know you might get upset when I say this, but I need to say it. Our relationship is different from others. Those who say nice things are not genuinely concerned about you.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">\"I know, I know. Your character, how would I not know? I have been well taken care of by you.\" Li Cheng had no reservations.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">Huiyin smiled and said, \"As long as you understand what I mean, it's fine. By the way, it seems I am pregnant.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">\"Really?\" Li Cheng almost jumped up.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Huiyin quickly said, \"Behave more steadily; you are the Son of Heaven now.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Li Cheng used his large hand to protect Huiyin's belly and sat down, touching his forehead. \"After all that horseback riding, you managed to get pregnant so quickly! Do you hope for a boy or a girl?\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">\"I'm fine with either. A boy or a girl, both are good.\" Huiyin stroked her belly without much feeling.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">She already had two sons, and her health hadn’t been great even before marriage. Giving birth was not extremely difficult for her, but it was still taxing on her body. Now that she had just recovered and was pregnant again, she was actually quite apprehensive and not as overjoyed as others might be.</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Seeing this, Li Cheng understood that during the two years he was away, Huiyin's health had not been good. She often had trouble sleeping and eating. Now that she was pregnant again, she must be very worried.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">\"Huiyin, don't always take care of me. You need to take care of yourself now. How about bringing your mother into the palace to keep you company? That way, I'll be at ease.\" Li Cheng whispered to her while hugging her.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Huiyin said, \"My mother can stay in the palace for a few days, but she has her own children and grandchildren. I can't disrupt her family reunions.\"</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">In Li Cheng's opinion, there was really no one like Huiyin who understood things so clearly. She never overstepped and was very self-restrained. She might occasionally slack off on small matters, like sleeping in, but she never wavered on significant issues.</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">Even with her own mother, she was very clear. Madame Ji had been living in the palace for a long time, which wasn’t ideal.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">But the more so, the more Li Cheng cherished her. \"My parents passed away early, and I've always envied others. If you could reunite with your mother, I would be happy to see that.\"</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">\"If you say so, you're making my heart ache. I'll do as you say. When my mother comes, let's have a big family meal with our two sons, and we'll have a lively time.\"</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">The couple cared for each other deeply. However, when the news of Huiyin's pregnancy reached the Zheng family, they were overjoyed. But just then, the emperor summoned Madame Ji to the palace again. As Madame Ji was packing, she said to Cui Yuehuan, \"I'll leave everything at home to you.\"</p><p id=\"paragraph-55\" data-paragraph-id=\"55\">\"Madam, don't worry. Everything at home is in order. Leave it to me.\" Cui Yuehuan said.</p><p id=\"paragraph-56\" data-paragraph-id=\"56\">Madame Ji and Zheng Fang were an old couple. She nagged, \"You're not young anymore. Don't always have alcohol in your hand and a smoking pipe by your side. If you continue like this, how can you expect to live long? When I was at home, you didn't like to hear my nagging. Now you're going to have another grandchild. In the future, this grandchild will rely on you as their grandfather.\"</p><p id=\"paragraph-57\" data-paragraph-id=\"57\">Like all men who feared their wives' nagging, Zheng Fang impatiently said, \"You're going to the palace, so go. Why do you keep nagging? A person's lifespan is determined by the heavens. My father rarely drank alcohol and ate little meat, always maintaining his health, but he passed away early. My grandfather had no taboos at all and lived to a ripe old age.\"</p><p id=\"paragraph-58\" data-paragraph-id=\"58\">\"These are all fallacies. I'm too lazy to argue with you. I'll tell the Empress to let her scold you.\" Madame Ji didn't argue with him but said with a smile.</p><p id=\"paragraph-59\" data-paragraph-id=\"59\">Zheng Fang remembered how his daughter used to lecture him with big principles, and quickly said, \"Please don't talk nonsense. The Empress has finally conceived; you should say things she likes to hear.\"</p><p id=\"paragraph-60\" data-paragraph-id=\"60\">Madame Ji pointed at him and said, \"Old fool, are you scared now?\"</p><p id=\"paragraph-61\" data-paragraph-id=\"61\">Zheng Fang still wanted to argue, but he didn’t mind. In recent years, as he had grown older, he always felt like his life was like a dream. When he was the Grand Commander of Jizhou, he often found the days difficult to bear. Now that life had become easier, the days flew by. Sometimes he felt as if he was still in Xuzhou, only to realize he was in the capital.</p><p id=\"paragraph-62\" data-paragraph-id=\"62\">Seeing Madame Ji still nagging, he couldn’t help but say, \"Don’t treat the palace like it’s your own home. Now that the Empress is pregnant, many people will want to take advantage of the situation. You shouldn’t get involved. The Empress has her own thoughts.\"</p><p id=\"paragraph-63\" data-paragraph-id=\"63\">Madame Ji was stunned. \"You’re overthinking.\"</p><p id=\"paragraph-64\" data-paragraph-id=\"64\">Zheng Fang yawned. \"Consider it my nonsense.\"</p><p id=\"paragraph-65\" data-paragraph-id=\"65\">Madame Ji continued packing to enter the palace. Before she left, news came from Xuzhou about the death of Madame Xu, who had been wearing red clothes.</p><p id=\"paragraph-66\" data-paragraph-id=\"66\">This signified deep resentment, and De Yin felt a chill of fear upon hearing it. Elder Madame Xu sobbed, \"Your mother led a hard life, working for others in vain.\"</p><p id=\"paragraph-67\" data-paragraph-id=\"67\">De Yin, who had been sitting below and had been feeling much better lately, still found it hard to breathe upon hearing the news of Madame Xu's passing. She even found it hard to believe. \"Why? Why did this happen? Grandmother, tell me this isn’t true.\"</p><p id=\"paragraph-68\" data-paragraph-id=\"68\">Elder Madame Xu called over the person who had been serving Madame Xu. Knowing how close Elder Madame Xu had been to Madame Xu, the servant revealed everything: \"Ever since we returned to the capital, our mistress had been feeling depressed. There were people bullying her at the nunnery, and she believed someone had instructed them. She often muttered curses under her breath. Later, Qiuyan, who was serving her, eloped with someone, which upset her again. Recently, she had been having nightmares, saying we had let a wolf into the house. A few days ago, she asked me to find some red cloth for her. That’s what she… wore to hang herself...\"</p><p id=\"paragraph-69\" data-paragraph-id=\"69\">\"It’s all my fault for being unfilial.\" Tears fell uncontrollably from De Yin’s eyes.</p><p id=\"paragraph-70\" data-paragraph-id=\"70\">If only she had been as honored as Huiyin, her mother would have been granted a first-class title and lived as gloriously as Madame Ji, treating the palace as her own home.</p><p id=\"paragraph-71\" data-paragraph-id=\"71\">It was all her fault for being incapable. If she had been more capable, her mother wouldn’t have taken her own life.</p><p id=\"paragraph-72\" data-paragraph-id=\"72\">Elder Madame Xu had no mood to care about De Yin, as she was grieving herself. Cui Yuehua had gone to the main room several times, making sure nothing happened to the elder Madame. She was also frustrated with Madame Xu for causing trouble.</p><p id=\"paragraph-73\" data-paragraph-id=\"73\">When she had been released, it was actually an opportunity given to her, but she still conspired with Elder Madame Xu. Thinking she was still the head of the household, she failed to see the situation clearly. The fact that she was still alive was due to seeking refuge with Madame Ji’s daughter. Even so, she was allowed to stay in the nunnery.</p><p id=\"paragraph-74\" data-paragraph-id=\"74\">Like Madame Dong, who was also sensible. Her son had been recklessly betrothed by Madame Xin to her own family. From her perspective, she had been both angry and wronged. Ever since she entered the household, although she had been favored, she had never refused Madame Xin anything. Yet Madame Xin played such tricks, thinking she was clever.</p><p id=\"paragraph-75\" data-paragraph-id=\"75\">What she didn’t realize was that this only made public opinion and Pei Shuo more sympathetic to Madame Dong. Even Madame Ji had personally sent tonic to Madame Dong last time, without any regard for Madame Xin.</p><p id=\"paragraph-76\" data-paragraph-id=\"76\">Internal matters should remain internal. If Madame Dong offended you, the elders would handle it. But using Pei Shuo’s son as a pawn, how could he not be furious?</p><p id=\"paragraph-77\" data-paragraph-id=\"77\">Similarly, Madame Xu had already been cast aside. Her daughter wasn’t as capable as others. She could have requested to leave and remarried. If not, she could have stayed quietly and waited for De Yin to come out, and they could have lived together.</p><p id=\"paragraph-78\" data-paragraph-id=\"78\">The situation had changed, and one must understand the new reality.</p><p id=\"paragraph-79\" data-paragraph-id=\"79\">Over the years, Cui Yuehua had matured and was no longer the easily angered girl. She had become more experienced in dealing with various matters.</p><p id=\"paragraph-80\" data-paragraph-id=\"80\">When Zheng Wuheng returned, she had just come back from the main room and informed him about this.</p><p id=\"paragraph-81\" data-paragraph-id=\"81\">\"What she did is indeed quite eerie. No one in our family wanted her dead,\" Zheng Wuheng said, puzzled.</p><p id=\"paragraph-82\" data-paragraph-id=\"82\">Cui Yuehua replied, \"The Xu family saw Madame Yin and her son as valuable assets. Later, they caused the disturbance with the old followers of the Prince of Wei and were made an example of. The Emperor didn’t blame her. We kept her alive for her own good. Besides, there’s a saying: 'Winners and losers are part of the game.'\"</p><p id=\"paragraph-83\" data-paragraph-id=\"83\">Zheng Wuheng looked at her. \"I didn’t expect you to have grown so much these days. You’re becoming more like my sister.\"</p><p id=\"paragraph-84\" data-paragraph-id=\"84\">\"How dare I compare myself to the Empress?\" Cui Yuehua shook her head. \"These are just my humble opinions.\"</p><p id=\"paragraph-85\" data-paragraph-id=\"85\">Zheng Wuheng looked up at the sky. He remembered his mother mentioning that De Yin was pitiful, and she wanted to arrange a good marriage for her. But his sister advised their mother not to bother. They were already in an adversarial position. No matter how good your intentions were, the other side would see them as bad. If Madame Ji had lost the struggle back then, she might have been the one suffering and unable to find peace.</p><p id=\"paragraph-86\" data-paragraph-id=\"86\">Thinking about it, Zheng Wuheng shuddered.</p><p id=\"paragraph-87\" data-paragraph-id=\"87\">Inside the palace, it was warm and inviting. On the first day Madame Ji entered the palace, Li Cheng had come over to accompany her. The table was filled with food. Jing’er and Zhan’er were surrounding Madame Ji, while Huiyin and her husband sat opposite her. Madame Ji couldn’t help but wipe her tears.</p><p id=\"paragraph-88\" data-paragraph-id=\"88\">\"Mother, why are you crying on such a good day?\" Huiyin smiled.</p><p id=\"paragraph-89\" data-paragraph-id=\"89\"></p><p id=\"paragraph-90\" data-paragraph-id=\"90\">Madame Ji sighed, \"I was just thinking how heartwarming it is to see our whole family gathered here like this. I'm moved just being here with you all.\"</p><p id=\"paragraph-91\" data-paragraph-id=\"91\">It’s hard enough for a daughter to be alone in the palace, surrounded by strangers, having to protect two sons and maintain the home front without letting anyone see any flaws.</p><p id=\"paragraph-92\" data-paragraph-id=\"92\">These words made Huiyin's eyes sting, but Li Cheng actually cried. He’s rarely home and has been apart from his wife for long periods, which always made him feel very sorry for her.</p><p id=\"paragraph-93\" data-paragraph-id=\"93\">Huiyin, who was usually quick to cry, hadn’t expected her husband to actually break down like this. She laughed awkwardly, \"My mother is old and naturally prefers gatherings over partings. But now that we are together, those past separations were for the sake of our long-lasting togetherness now, which is a very good thing. Why are you reacting this way?\"</p><p id=\"paragraph-94\" data-paragraph-id=\"94\">Li Cheng realized he’d lost control and quickly wiped his tears with a handkerchief. Madame Ji, watching from the side, found it rather curious how the emperor resembled a pampered young lady, while her daughter seemed more like the head of the household.</p><p id=\"paragraph-95\" data-paragraph-id=\"95\">Luckily, her daughter seemed deeply attached to the emperor, who looked both handsome and imposing.</p><p id=\"paragraph-96\" data-paragraph-id=\"96\">\"Mother, this is a new dish prepared by a chef recommended by someone from the emperor's side. We all think it's wonderful. Please try it,\" Huiyin said, motioning for Jing'er to serve Madame Ji.</p><p id=\"paragraph-97\" data-paragraph-id=\"97\">Madame Ji was very pleased, and although she didn’t dare fully accept it, she felt happy in her heart.</p><p id=\"paragraph-98\" data-paragraph-id=\"98\">After the banquet dispersed, and the princes went to study while the emperor attended to his duties, Huiyin took Madame Ji's arm and walked in, still as lively as she was in childhood. \"Mother, why don’t you sleep with me tonight? The emperor will definitely stay in the Duanning Hall and won’t come over.\"</p><p id=\"paragraph-99\" data-paragraph-id=\"99\">Madame Ji patted her daughter, \"You're pregnant, so it’s not safe for us to sleep together. We don’t want any complications.\"</p><p id=\"paragraph-100\" data-paragraph-id=\"100\">\"Mother, what are you saying? Do you think we don’t know better?\" Huiyin regretted letting it slip.</p><p id=\"paragraph-101\" data-paragraph-id=\"101\">Madame Ji patted her hand, and they sat down in the room together. In a low voice, she said, \"Men don’t always consider these things. Sometimes, when they’re in the mood, they might even insist on intimacy during menstruation, and women have to please them and endure.\"</p><p id=\"paragraph-102\" data-paragraph-id=\"102\">Huiyin was shocked, \"Is there really such a thing? If it were me, I couldn’t do that. It would wreck my health.\"</p><p id=\"paragraph-103\" data-paragraph-id=\"103\">\"My child, you are married well. The emperor is more considerate than ordinary men. Others don’t have this blessing, not even me,\" Madame Ji said, reminiscing about her former husband, Pei Ye. When things were good between them, he was truly wonderful, and she was willing to do anything for him because of that.</p><p id=\"paragraph-104\" data-paragraph-id=\"104\">Unfortunately, the couple could never go back, and their love, too intense, ended in a decisive and earth-shaking separation.</p><p id=\"paragraph-105\" data-paragraph-id=\"105\">Feeling comforted by her daughter’s words, Madame Ji relaxed considerably. \"Every time I talk to you, my mood improves greatly. If I talk to your father, he always makes me angry.\"</p><p id=\"paragraph-106\" data-paragraph-id=\"106\">\"Father is by nature unrestrained. That kind of attitude probably helps him live longer. What’s wrong with that?\" Huiyin laughed.</p><p id=\"paragraph-107\" data-paragraph-id=\"107\">The mother and daughter, after chatting, felt sleepy. Huiyin rested on the bed, while Madame Ji reclined on a daybed.</p><p id=\"paragraph-108\" data-paragraph-id=\"108\">Later that night, the Empress Dowager summoned Madame Ji for a conversation. When Madame Ji returned, she mentioned that the Empress Dowager had bestowed many gifts upon her. Madame Ji said, \"The Empress Dowager has never been this generous with her rewards before. I wonder why?\"</p><p id=\"paragraph-109\" data-paragraph-id=\"109\">Huiyin laughed, \"Mother, she's usually like a pixiu, not very generous even to me and the emperor. At most, she gives gifts to the Xun family during festivals. She’s always trying to support her natal family. Although Princess Jianjia is betrothed to the Xun family, the Yuzhang King is not significant, and the Xun family is probably not very satisfied.\"</p><p id=\"paragraph-110\" data-paragraph-id=\"110\">Madame Ji truly didn’t understand, \"The Xun family was only granted nobility due to the Empress Dowager’s influence, and they’re nowhere near as prominent as we are. They are marrying a princess, and they are still not satisfied? What more could they want?\"</p><p id=\"paragraph-111\" data-paragraph-id=\"111\">Huiyin said, \"I heard there's a girl in the Xun family around Jing'er's age. It's naturally for this reason.\"</p><p id=\"paragraph-112\" data-paragraph-id=\"112\">It’s hard to fathom why they are in such a hurry when Jing'er is still so young...</p><p id=\"paragraph-113\" data-paragraph-id=\"113\"></p><p id=\"paragraph-114\" data-paragraph-id=\"114\"></p>\n</div>"
  },
  {
    "number": 89,
    "title": "Chapter 89",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 89</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎Another Confrontation◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">Madame Ji stayed in the palace for a month and then returned home. Huiyin prepared sixty-six pieces of top-grade palace silk, twenty-four pairs of gold and silver ingots, ten bottles of rosewater from the Kingdom of Dashi, various jewels and jade artifacts, and six newly published books, all of which were sent home with Madame Ji.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">However, Madame Ji was unaware of the situation with Madame Xu and happily distributed the items, saying to Cui Yuehuan, \"This rosewater is not from our country but from abroad. It is much more precious than what is sold in our markets. You young ones should take these and use them.\"</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">Cui Yuehuan noticed that the most valuable items bestowed by the Empress were the jewels and jade artifacts, all crafted within the palace. She was secretly amazed; although she had seen many fine things, such exquisite palace-made jewelry was rarely encountered. When she was in Xuzhou, she had heard that the Empress was very fond of beautiful items and that her jewelry was always of the finest quality.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Madame Ji only gave her one box, with another box intended for Madame Xu.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Fearing that her mother-in-law would be implicated, Cui Yuehuan revealed the truth: \"When the master heard about this, he arranged a Water and Land Ceremony to pray for the souls of the departed. Madame Xu took De Yin to Miaoyun Nunnery and just returned.\"</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">It can be imagined that both Madame Xu and De Yin were angry, and while they might not vent their frustrations on Zheng Wuheng, they might take it out on Madame Ji. Even if they said nothing openly, who knew what revenge they might seek later?</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Madame Ji had initially been very happy. Her daughter was pregnant, and the Emperor, as her son-in-law, not only refrained from philandering but was also wholeheartedly trying to please her daughter. How could she not be overjoyed for her daughter? It is often said that sharing hardships is easy for lovers, but sharing wealth and success is difficult.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">Unexpectedly, Madame Xu brought such misfortune. Sitting down with her hands on the table, Madame Ji was comforted by Cui Yuehuan patting her back, though she stopped her, saying, \"I'm not afraid of her cursing me. What I fear is that she might secretly curse Her Majesty. If anything happens to the Empress, our entire family might suffer.\"</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Cui Yuehuan hadn't considered this and, being young and unaware of the dangers, broke out in a cold sweat after hearing her mother-in-law's words: \"Madam, what should we do?\"</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">\"There's no need to be afraid for now. Go fetch Madam Song and tell her I need to speak with her.\" Madame Ji thought to herself that she really shouldn't pity De Yin. She was clear about whom Madame Xu, dressed in red, was cursing.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Cui Yuehuan knew that Madame Ji usually didn't associate with such Taoist practitioners. It was the Empress who forbade it, saying that such things could easily lead to witchcraft accusations or unsettle the household with supernatural disturbances.</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Leaving the main room, she first spoke to Zheng Wuheng: \"The Empress made it very clear to us last time. But my mother-in-law is worried and wants to fight fire with fire. But this...\"</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">\"Good, good, good. It's timely that you told me about this.\"</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">\"I used to think you never cared about household matters, but I didn't expect you to pay attention.\" Cui Yuehuan knew her husband; though young, he rarely managed internal affairs, only occasionally commenting when something significant happened.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Zheng Wuheng said, \"Mother is afraid that Madame Xu might seek the child of my elder sister, so she's confused by concern and wants to use those Taoist and Buddhist practitioners. But if they engage in illegal activities and are later framed, it won't be good. Last time I visited my sister in the palace, she told me so.\"</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">Previously, Zheng Wuheng wouldn't have thought this was a big issue. Elderly women often engaged in such practices, even Madame Xu, who disliked someone and would resort to curses or use these methods to maintain favor. As the youngest in the family, he never paid much attention to the household matters his sister discussed with him at home. But as he grew older and listened to his sister's teachings in the palace, he found them to be wise words.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Zheng Wuheng conveyed to Madame Ji: \"When she was alive, she couldn't even compete with you, let alone now that she's dead. Take us, for example; we've been cursed countless times on the battlefield, but a defeated enemy remains defeated.\"</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">Madame Ji might not always listen to her daughter-in-law, but she would listen to her son.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Such was the mother-in-law and daughter-in-law relationship. Madame Ji was already a rare and good mother-in-law. Openly, she always sided with her daughter-in-law and never made her stand on ceremony. But in her heart, she only considered her son as her own.</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">\"Your words show that you've matured. Let's leave it at that,\" said Madame Ji.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Zheng Wuheng said, \"Should we tell my sister about this—\"</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">\"Absolutely not! Your sister is pregnant; how can she hear such things? You're talking nonsense. It's as if your mind is clouded by fat,\" scolded Madame Ji.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Of course, Zheng Wuheng knew that his mother wouldn't tell his sister. His sister used to get angry at home, and even his mother was somewhat afraid of her. He said this to draw Madame Ji's attention.</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">On the matter of Madame Xu, his mother was particularly sensitive. The internal household disputes had been ongoing, with Madame Xu and De Yin still at home, making her uneasy. After all, there's a saying that it's impossible to guard against thieves every day.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">When his sister was still at home, she was involved in almost all family matters. She made quick decisions and was a natural leader.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Seeing that his mother's tone had softened, he smiled and said, \"I was reckless. What would I do without my mother?\"</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">\"I don't need to worry about your elder brother; he's a reliable person. You've grown up under me and your sister, only becoming sensible after marriage and not very familiar with household matters. Now that you've grown up, I feel much more relieved,\" Madame Ji said with great relief.</p><p id=\"paragraph-29\" data-paragraph-id=\"29\"></p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Leaving aside Madame Ji's situation at home, it was said that Huiyin's reaction to her third pregnancy was more severe than her previous two. She hadn't experienced morning sickness when she should have, but now, around the four-month mark when most women feel more stable, she started feeling unwell. For some reason, everything tasted like fish to her.</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">The small kitchen sent over a bowl of sweet soup, but she could only drink half before losing her appetite. Li Cheng paced anxiously beside her, asking, \"What are we going to do? You can't keep skipping meals. If this continues, how will your body hold up?\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"It's alright, don't get so worked up. The imperial physician said if I take the fetal-protecting medicine on time, three doses will help me recover. I may be feeling a bit uncomfortable now, but when I feel better later, I'll eat more. Just trust me,\" Huiyin said, shaking her head.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">Li Cheng replied, \"Last time you were pregnant with Zhan'er, you loved eating green plums. Why aren't you eating them this time?\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Huiyin covered her mouth and smiled. \"Each pregnancy is unique. Maybe this time it's a little princess. Wouldn't you love that? So don't worry so much.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Li Cheng sat down and sighed deeply. \"If only I could stop worrying. These days, you're often unable to eat or sleep well. I'm thinking of bringing your mother into the palace again to take care of you for a few days. It's always better to have your own mother by your side.\"</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">\"Please don't. Last time she stayed here for a month, she wasn't comfortable at all. The palace rules are strict, and though we're used to them, they made her feel constrained. It's not ideal. Besides, as the Empress, I need to set an example. Didn't you notice that when my mother was here for a month, the Empress Dowager called her relatives over for a chat? Moreover, with my condition, it's better for me to rest quietly.\" Huiyin understood these matters well. They were already not the type to blindly follow filial piety, but with the Empress Dowager's status, the higher you are, the more people watch your every move.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">Li Cheng leaned back and shook his head with a smile. \"Before I became emperor, I thought it would be the most glorious thing ever. Who knew that the higher we go, the more constrained we become?\"</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">\"You're speaking without experiencing the hardship. At least now, no one can threaten us anymore,\" Huiyin often used \"we\" to express closeness and a sense of shared power.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Li Cheng felt that Huiyin was always thinking of him. The Xun family wasn't much, but if the Zheng and Xun families started seeking favors, everyone would begin scheming and neglect their duties. He held Huiyin's hand and said, \"I only wish for your well-being. I don't care about others. I took this position to protect our family.\"</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">Huiyin smiled and gently rubbed her belly. For now, she wouldn't worry about others. Her health was the top priority. Once she recovered, she wouldn't be lenient with the Xun family.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">That month, the Empress Dowager's palace was filled with more laughter and joy. New clothes were being made, and new jewelry was being crafted. The Empress Dowager favored eight-year-old Xun Jiying more than she had Xun Rou before.</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">One day, when Li Cheng visited, the Empress Dowager hinted at rewarding Xun Jiying, but Li Cheng declined. \"Now that the new dynasty has been established, I've already granted many favors out of respect for the Empress Dowager. As the saying goes, one should not receive rewards without merit. Now that there are rewards, one should focus on fulfilling their duties instead of seeking benefits from the imperial court.\"</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">This was actually quite considerate of him. The Xun family had been relatively well-behaved, but the Empress Dowager often misjudged her position. Seeing that Huiyin had been unwell lately and the palace was less strict, many people came to flatter her. Since Li Cheng often came to pay his respects, the Empress Dowager spoke without thinking.</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">Seeing that he disagreed, although she lost face, she wasn't upset. \"It's not related to them. I just thought that this girl, despite her young age, has a lot of filial piety, and our royal family shouldn't mistreat her, which is why I said that. If the emperor disagrees, then so be it.\"</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">This wasn't the same grandson who was once just a prince. Back then, even she had to flatter Wei Imperial Consort, and although she treated her grandson well, her reliance was on the King of Wei. Now, she completely relied on her grandson, so her tone had softened considerably.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">However, Li Cheng was someone who didn't yield to pressure and loved to argue. Usually, when Huiyin was around, she could temporarily suppress his sharpness. Now, seeing that the Empress Dowager seemed to be making a big deal out of nothing, he couldn't help but argue again. \"It's not that I disagree, but there are no rules that allow this. Even the daughter of a princess needs a significant favor to be granted the title of duchess. How can a marquis's daughter expect a reward without merit? It doesn't make sense emotionally, and it's even less appropriate according to etiquette.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">He went on to list the rules and regulations regarding enfeoffment, which startled nanny Fan. Why was the emperor discussing such complex matters with the Empress Dowager? With her limited literacy, it was like talking to a brick wall.</p><p id=\"paragraph-48\" data-paragraph-id=\"48\"></p>\n</div>"
  },
  {
    "number": 90,
    "title": "Chapter 90",
    "content": "<div class=\"resize-font chapter-formatting chapter-font-color chapter-font-family\" data-fictioneer-chapter-target=\"contentWrapper\" data-action=\"mousedown->fictioneer-chapter#fastClick\"><p id=\"paragraph-0\" data-paragraph-id=\"0\">Chapter 90</p><p id=\"paragraph-1\" data-paragraph-id=\"1\">◎This person really won her heart◎</p><p id=\"paragraph-2\" data-paragraph-id=\"2\">The Empress Dowager certainly didn't get what she wanted; not only was her great-niece’s title not bestowed, but the Xun family’s younger daughter was also sent out of the palace. Li Cheng wasn’t one to show any special favor; he treated his maternal uncle’s family the same as anyone else. These people usually treated him coldly, but now that he had gained power, they were all clamoring for benefits.</p><p id=\"paragraph-3\" data-paragraph-id=\"3\">Not to mention that he still remembered how, when the Empress Dowager was an Imperial Consort, she had spent his money freely. Yet now, in the palace, he hasn't seen her reward the Crown Prince or the Second Prince.</p><p id=\"paragraph-4\" data-paragraph-id=\"4\">It’s said that the Son of Heaven owns the world, but just because he’s rich doesn’t mean you can take advantage of him all the time. Huiyin understood this principle well. Li Cheng was a man of excellent character. There was an innate sense of justice in him. The reason Huiyin got along so well with him was because he had respected her as his legitimate wife from the very beginning.</p><p id=\"paragraph-5\" data-paragraph-id=\"5\">Xun Rou had been rebuffed by Huiyin before, and after witnessing her methods once more, she kept her distance. Upon hearing that her niece had been sent home from the palace, her fear deepened.</p><p id=\"paragraph-6\" data-paragraph-id=\"6\">Over the past month, Huiyin’s condition had improved significantly. She was more spirited and had resumed managing the palace affairs. In the middle of this, Jiang Bipbo had specifically requested an audience and came to the palace to visit Huiyin, bringing along a top-quality thousand-year-old ginseng as a gift.</p><p id=\"paragraph-7\" data-paragraph-id=\"7\">“This is just a minor pregnancy-related ailment. There’s no need for such a strong tonic as ginseng. You should keep it for yourself,” Huiyin said.</p><p id=\"paragraph-8\" data-paragraph-id=\"8\">Seeing that the Empress didn’t value the ginseng, Jiang Bipbo realized her influence was fading. In the past, she had wielded significant influence. At that time, when the Prince of Huaiyin had risen in arms and needed money, the mansion had looked grand but was empty inside. So, whenever she needed something done, as long as she provided the funds, Madame Zheng would get things done.</p><p id=\"paragraph-9\" data-paragraph-id=\"9\">But now, with the emperor’s ascension, taxes from all regions were centralized under the capital. As the first lady of the harem, the Empress had countless treasures at her disposal. Therefore, even such high-quality ginseng meant nothing to her.</p><p id=\"paragraph-10\" data-paragraph-id=\"10\">Jiang Bipbo was a shrewd woman, born into a merchant family, and more perceptive than most men. So, she smiled and said, “Your Majesty is joking. This ginseng was specially dug in Liaodong by people I hired to offer to you. Please fulfill my wish, Your Highness. If I take the ginseng back, the Earl will blame me.”</p><p id=\"paragraph-11\" data-paragraph-id=\"11\">Huiyin understood her underlying meaning; she was implying that it was Guo Zhao who made her do these things, and she couldn’t refuse.</p><p id=\"paragraph-12\" data-paragraph-id=\"12\">Huiyin also gave her two trays of assorted delicacies, saying, “Take these for the children to enjoy.”</p><p id=\"paragraph-13\" data-paragraph-id=\"13\">Jiang Bipbo immediately took her leave, not daring to linger.</p><p id=\"paragraph-14\" data-paragraph-id=\"14\">However, she was good at handling relationships. She specially sent a box of purple ginseng from the carriage to the Zheng family. Upon seeing the gifts brought by Jiang Bipbo, Madame Ji hurriedly declined, “You always bring such things whenever you visit. It’s really unnecessary.”</p><p id=\"paragraph-15\" data-paragraph-id=\"15\">This adopted daughter was worth it, especially now that Jiang Bipbo was a Countess and still maintained the same relationship with their family as before, never putting on airs.</p><p id=\"paragraph-16\" data-paragraph-id=\"16\">Jiang Bipbo said, “If not for the Empress and your family’s support back then, I wouldn’t be here today.”</p><p id=\"paragraph-17\" data-paragraph-id=\"17\">“Don’t say such things. It’s clearly your own great fortune. Come, enter the house and have a cup of tea,” Madame Ji invited her in.</p><p id=\"paragraph-18\" data-paragraph-id=\"18\">Jiang Bipbo quickly said, “Next time, I will definitely visit. I just returned from the palace and have matters to attend to at home.”</p><p id=\"paragraph-19\" data-paragraph-id=\"19\">With that, Madame Ji didn’t insist on keeping her. After seeing off Jiang Bipbo, she was just about to be visited by her eldest daughter-in-law, Xin Shi, who had come with Dong Shi to pay their respects. Today was the first day of the month, a day Madame Ji had designated for paying respects.</p><p id=\"paragraph-20\" data-paragraph-id=\"20\">Xin Shi, after becoming the primary wife, felt a lingering sense of guilt, but as the original wife of Pei Shuo and the mother of his eldest son and daughter, even if they were angry, they wouldn’t divorce her. So, she humbled herself, waiting for Madame Ji’s anger to subside. Who would dare say anything then?</p><p id=\"paragraph-21\" data-paragraph-id=\"21\">“Is there a guest here, Madam?” Xin Shi asked.</p><p id=\"paragraph-22\" data-paragraph-id=\"22\">Madame Ji said, “It was Madam Guo who came. She’s quite good. Even though she’s a Countess, she rarely puts on airs.”</p><p id=\"paragraph-23\" data-paragraph-id=\"23\">“You are a Duchess and the mother of the Empress. Who would dare put on airs in front of you?” Xin Shi replied, knowing that Madame Ji was giving her a subtle reminder, but she pretended not to understand.</p><p id=\"paragraph-24\" data-paragraph-id=\"24\">Madame Ji smiled and said, “Although I am a Duchess, there are countless nobles in the capital. We need to be cautious in our family. There are many examples where one misstep leads to a complete downfall.”</p><p id=\"paragraph-25\" data-paragraph-id=\"25\">Sitting below, Dong Shi was confused and didn’t understand the hidden meanings in their conversation.</p><p id=\"paragraph-26\" data-paragraph-id=\"26\">Obviously, Madame Ji had other intentions. After a few reminders to Xin Shi, she let her leave. Xin Shi had already taken charge of the household. With her son as the heir and her daughter favored by the Empress, her status was unmatched. Her humility was just for show. After leaving the Zheng family, she straightened her clothes and, with her head held high, climbed into the carriage with Dong Shi’s assistance.</p><p id=\"paragraph-27\" data-paragraph-id=\"27\">Once the carriage started moving, Xin Shi realized what she had forgotten—Cui Yuehua. She hadn’t seen her sister-in-law all day.</p><p id=\"paragraph-28\" data-paragraph-id=\"28\">Cui Yuehua had just returned from the temple and immediately went to Madame Ji’s room. “Madam, I’ve had another round of prayers done and fetched three copies of scriptures offered at the Buddha’s altar.”</p><p id=\"paragraph-29\" data-paragraph-id=\"29\">“Hmm, you’ve worked hard. Actually, if she curses me, I’m not afraid. But if something happens to the Empress, it would truly be my unpardonable fault,” Madame Ji said, worried about her daughter’s pregnancy.</p><p id=\"paragraph-30\" data-paragraph-id=\"30\">Cui Yuehua sighed and said, \"Please don't worry. Her Majesty is a person of good fortune and will surely be fine.\"</p><p id=\"paragraph-31\" data-paragraph-id=\"31\">Madame Ji was only concerned about her daughter and paid no attention to other matters. Zheng Fang, being an older person, still spoke to Madame Ji, saying, \"I can't figure out what you're so worried about in such a mysterious way. She's already dead; what more can she do?\"</p><p id=\"paragraph-32\" data-paragraph-id=\"32\">\"You're not worried, but I am,\" Madame Ji replied, still troubled.</p><p id=\"paragraph-33\" data-paragraph-id=\"33\">In fact, Zheng Fang wasn't completely heartless and still felt some fear. \"Elder Madame Xu has always been a bit eerie, speaking and acting in a sinister manner. And now, at the end, she pulls something like this.\"</p><p id=\"paragraph-34\" data-paragraph-id=\"34\">Originally, Madame Ji had been hesitant, but after hearing Zheng Fang's words, she suddenly felt an immense courage. \"What are you afraid of? No wonder you've been away from home so much lately. With me here, there's no need to worry. Her Majesty is destined by heaven and will surely be fine, and so will our family.\"</p><p id=\"paragraph-35\" data-paragraph-id=\"35\">Upon seeing Madame Ji like this, Zheng Fang finally relaxed.</p><p id=\"paragraph-36\" data-paragraph-id=\"36\">In truth, what Madame Ji feared most was that Elder Madame Xu and De Yin might be secretly causing trouble, so she had asked Cui Yuehua to keep an eye on them these days. Luckily, the two were only consumed by their grief; otherwise, she would have to take preemptive action.</p><p id=\"paragraph-37\" data-paragraph-id=\"37\">De Yin, of course, had no intention of doing anything to Zheng Fang and Madame Ji. After her sorrow, she became more concerned about her own health. If her condition remained untreated, even if she remarried, she would not find happiness. A woman who cannot have children won't be respected by her husband. Her younger sister had gained exclusive favor because she could bear children. Now, if she had another son, that would make three imperial princes.</p><p id=\"paragraph-38\" data-paragraph-id=\"38\">A queen who could give birth to three healthy princes would secure her position, even if only one was useful.</p><p id=\"paragraph-39\" data-paragraph-id=\"39\">Back then, if Madame Ji had not given birth to a son, she would not have been able to stand her ground in the family. Her own mother had suffered because she did not bear a son. Everything would have to wait until she recovered her health. As for Elder Madame Xu, she genuinely harbored hatred for Madame Ji, but taking action was not easy. Moreover, if Madame Ji were gone, the empress in the palace would not be easy to deceive. If she knew it was her doing, would she still be able to live?</p><p id=\"paragraph-40\" data-paragraph-id=\"40\">These matters were only heard by Madame Ji after Huiyin had given birth to a princess.</p><p id=\"paragraph-41\" data-paragraph-id=\"41\">By then, Huiyin had completed her confinement. Upon hearing Madame Ji's words, she merely said, \"If cursing someone could change anything, there are plenty who wish me ill.\"</p><p id=\"paragraph-42\" data-paragraph-id=\"42\">Take the Empress Dowager, for example. There were those who wished to use such methods to curse her, but she was not afraid. Those who engage in such acts only reveal their own desperate frustration.</p><p id=\"paragraph-43\" data-paragraph-id=\"43\">Madame Ji opened her mouth but hesitated, \"I do not have Her Majesty's strong will and almost ruined things. Fortunately, your brother advised me.\"</p><p id=\"paragraph-44\" data-paragraph-id=\"44\">\"My brother has grown up and now cares about family matters. It warms my heart to hear this,\" Huiyin, who had given birth to a daughter, felt reassured. Though she had suffered somewhat during the pregnancy, her body recovered quickly after the child was born. Her husband and sons were particularly fond of this girl.</p><p id=\"paragraph-45\" data-paragraph-id=\"45\">But Huiyin was not as steadfast as she appeared. In truth, she was also vulnerable, but her vulnerability lessened when Li Cheng was by her side.</p><p id=\"paragraph-46\" data-paragraph-id=\"46\">Seeing Huiyin's excellent complexion, Madame Ji clasped her hands together and said, \"Her Majesty, I only wish for your well-being.\"</p><p id=\"paragraph-47\" data-paragraph-id=\"47\">Huiyin, of course, understood that Madame Ji's heart was filled with sincere loyalty and simply smiled. \"I am well in every way, so please rest assured. Currently, His Majesty is busy with state affairs, but after court, he comes to see the princess every day. We are together as a family daily. I am truly well now.\"</p><p id=\"paragraph-48\" data-paragraph-id=\"48\">In truth, she had been very afraid before. Afraid of growing old and losing her charm, afraid that her sons would fight for the throne when they grew up, or worried about many things. But after the birth of her daughter, she began to see many things more clearly.</p><p id=\"paragraph-49\" data-paragraph-id=\"49\">Though one should not be without long-term worries, one must also live in the present. If one only anticipates the worst, it would betray Li Cheng's sincere heart towards her.</p><p id=\"paragraph-50\" data-paragraph-id=\"50\">After completing her confinement, Li Cheng had a sericulture altar rebuilt for Huiyin. Huiyin, for the first time since the emperor's personal rule began three years ago, personally participated in the sericulture ceremony. She felt it was too grand. \"Our treasury has only recently become a bit more plentiful. Is it appropriate to hold such a large sericulture ceremony for me?\"</p><p id=\"paragraph-51\" data-paragraph-id=\"51\">\"What is inappropriate? Almost all of your dowry has been used to fill the gaps. In the past, we only took a small amount from the internal treasury to maintain appearances and ensure loyalty. Now, after two years of war and your childbirth, I cannot allow you to be a nominal empress,\" Li Cheng truly believed that Huiyin possessed wisdom. She was not an ordinary woman, and it would be a great pity to let such a woman be buried in the harem, only to become a footnote in history as Princess Zheng.</p><p id=\"paragraph-52\" data-paragraph-id=\"52\">However, his wife had never received education like a man, so she appeared somewhat naive. But she did have the means to handle matters.</p><p id=\"paragraph-53\" data-paragraph-id=\"53\">He had been fighting on the battlefield since before he was twenty and was now in his thirties, appearing strong and vigorous. However, thinking about possible future recurrences of old injuries and the young age of the crown prince, who could not yet control the elder statesmen, the only one with both prestige and status was his wife.</p><p id=\"paragraph-54\" data-paragraph-id=\"54\">Huiyin looked up at him and felt that he had truly won her heart. Previously, she had thought Li Cheng was just speaking, considering the strict rules of propriety and how rare it was for women to be involved in politics. But now, she believed that what he said was true.</p><p id=\"paragraph-55\" data-paragraph-id=\"55\"></p>\n</div>"
  }
]