[
  {
    "title": "The Consequences of Saving the Wrong Antagonist",
    "storyId": "2749",
    "novelUrl": "https://www.asianovel.net/story/2749/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2023/09/8623s-9c39c194066242d79e16bc7f4b75f173.jpg",
    "author": "凤羽涅",
    "synopsis": "Professor System has issued a mission: to rescue the gentle, kind and tragic protagonist shou of the novel “The Exceptional Furnace”.Song ‘Scholar-Tyrant’ Qingshi: “Don’t worry, Professor! I can definitely ensure the patient’s recovery!”In the Immortal Realm:Song Qingshi praised from the bottom of his heart: “My patient is the kindest and most beautiful little angel in the world.”Yue Wuhuan quietly washed the blood from his…",
    "genres": [
      "BL",
      "Drama",
      "Mature",
      "Psychological",
      "Tragedy",
      "Xianxia",
      "Yaoi"
    ],
    "chaptersCount": 119,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "A Bystander, But Pregnant with the Evil God’s Child",
    "storyId": "3335",
    "novelUrl": "https://www.asianovel.net/story/3335/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/05/authorimagespace-11-143x200.jpg",
    "author": "南辿星",
    "synopsis": "One-sentence Summary: Can a male mother also become the object of everyone’s obsession?",
    "genres": [
      "BL",
      "Horror",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 103,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Black Moonlight Only Wants Power",
    "storyId": "3234",
    "novelUrl": "https://www.asianovel.net/story/3234/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/20240821213431_200_280-143x200.jpg",
    "author": "元余",
    "synopsis": "One-line Synopsis: After being jilted three times, the black moonlight strikes back. Theme: Life is in your own hands.",
    "genres": [
      "Drama",
      "Historical",
      "Romance"
    ],
    "chaptersCount": 135,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Great Witch Doctor Livestreams His Consultations!",
    "storyId": "3222",
    "novelUrl": "https://www.asianovel.net/story/3222/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/authorimagespace-2-143x200.jpg",
    "author": "暮雨听眠",
    "synopsis": "Wu Heng, the most powerful witch doctor of ancient times, wakes up to find himself transmigrated into the body of the grandson of an elderly traditional Chinese medicine practitioner.Recalling how his father, who worked as a butler for a wealthy family, was kicked out by a ruthless CEO after indulging in too much gossip, ultimately leading to a destitute death, Wu Heng decides to…",
    "genres": [
      "BL",
      "Comedy",
      "Romance",
      "Slice of Life",
      "Supernatural",
      "Yaoi"
    ],
    "chaptersCount": 105,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Years After Substituting the Marriage",
    "storyId": "3232",
    "novelUrl": "https://www.asianovel.net/story/3232/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/20250102141122_200_280-150x200.jpg",
    "author": "宁夙",
    "synopsis": "Jiang Wanrou took her sister’s place to marry Lu Feng, the eldest son of the Duke’s mansion who was unable to walk. Because the marriage was not very honorable, she was cautious every day. She served her elders and managed the household, keeping the Duke’s mansion in perfect order. Even her moody husband, for the sake of their child, gave her the respect she…",
    "genres": [
      "Historical",
      "Romance"
    ],
    "chaptersCount": 117,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "My Boyfriend Is the Heartthrob, and I’m Just a Passerby",
    "storyId": "3228",
    "novelUrl": "https://www.asianovel.net/story/3228/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/My-Boyfriend-is-the-Heartthrob-and-Im-Just-a-Passerby-147x200.jpg",
    "author": "橘子珩",
    "synopsis": "After gaining awareness, Ye Jishu realizes he is just a passerby in a harem novel where the protagonist shou is a magnet for obsessive lovers. This novel has Gong 1, Gong 2, Gong 3… and the list goes on, each of them seemingly infected with madness, falling deeply and uncontrollably in love with the protagonist shou. Constantly showing concern, forcing possession, secretly stalking… Every…",
    "genres": [
      "Fantasy",
      "Horror",
      "Romance",
      "Supernatural",
      "Yaoi"
    ],
    "chaptersCount": 50,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "I Only Want Your Hugs",
    "storyId": "3164",
    "novelUrl": "https://www.asianovel.net/story/3164/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/I-Only-Want-Your-Hugs-143x200.jpg",
    "author": "仿生咩咩刀",
    "synopsis": "Because of touch starvation, Bai Chen had been single since birth. He was even rumored to be pretending to be noble and was actually a sea king who was a master at fishing. On the second day after he was blacklisted across the internet, the imperial crown prince, Xie Yilin, came to him and asked him to agree to a fake marriage. Facing the…",
    "genres": [
      "Romance",
      "Shounen Ai",
      "Yaoi"
    ],
    "chaptersCount": 64,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "How Miserable Can a Straight Man Be When Transported to an ABO World",
    "storyId": "3221",
    "novelUrl": "https://www.asianovel.net/story/3221/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/20250114175327_200_280-143x200.jpg",
    "author": "斩长鲸",
    "synopsis": "How miserable can a straight man be when transported to an ABO world? Especially when he becomes the adoptive older brother of the protagonist—a harem-filled, R18+ game’s most popular character! Yiye (despairing): So, what’s my mission? System (serious): Please protect the protagonist’s chastity. Yiye: … As the “green leaf” tasked with protecting the “flower,” Yiye is forced to enroll in the Empire’s top military…",
    "genres": [
      "Fantasy",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 167,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Stabilizing Madness",
    "storyId": "2831",
    "novelUrl": "https://www.asianovel.net/story/2831/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2023/11/20231117060446-b58643f6be95436a90b16df18b447ebf.jpeg",
    "author": "有狐千岁",
    "synopsis": "Xu Qingran, originally an antagonist in an apocalyptic novel, finds himself pulled into a different interstellar world by a system after his death. In this new world, he is unloved by his biological father and stepmother, and his innocent stepbrother interferes with his relationships. He suffers abuse from a scoundrel lover, enduring a tumultuous journey before ultimately achieving a grand happy ending. The system…",
    "genres": [
      "Action",
      "BL",
      "Fantasy",
      "Mature",
      "Post-Editing",
      "Romance",
      "Sci-fi",
      "Shounen Ai",
      "Supernatural",
      "Yaoi"
    ],
    "chaptersCount": 113,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "After the Hated Character Awakens, He Cremate Everyone",
    "storyId": "3157",
    "novelUrl": "https://www.asianovel.net/story/3157/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/After-the-Hated-Character-Awakens-He-Cremate-Everyone-143x200.jpg",
    "author": "风华如故",
    "synopsis": "Su Xingyao was born with good looks and treated people sincerely, yet he was never liked by others. After suffering hardships and eventually being taken back by his biological family, his parents showed him a cold face, caring only for their adopted son. His fiancé gave all their resources to the adopted son, allowing people within their circle to bully and smear Su Xingyao…",
    "genres": [
      "BL",
      "Drama",
      "Fantasy",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 97,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Noble Lady Crosses into the Seventies and Pretends to Be Poor",
    "storyId": "3147",
    "novelUrl": "https://www.asianovel.net/story/3147/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/20241221224849_200_280-150x200.jpg",
    "author": "半两青墨",
    "synopsis": "The Great Liang Dynasty has truly cooled down. Rebel troops are at the city gates, about to break through. Prince Shen Shaoyuan and his daughter huddle in the treasure vault, trembling as they prepare for death alongside their country. However, the rebels never breach the vault, and the distant sounds of battle gradually fade into silence. Finally, the father and daughter muster the courage…",
    "genres": [
      "Drama",
      "Slice of Life"
    ],
    "chaptersCount": 172,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Transmigrating into the Stepmother of the Empire’s Overlord",
    "storyId": "3145",
    "novelUrl": "https://www.asianovel.net/story/3145/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/81fcb4b1651f3a52bac2163be4f26dcatplv-resize_225_0-150x200.jpg",
    "author": "梅川裤子",
    "synopsis": "Shen ZhiXue transmigrated into an ABO novel and became the stepmother of the villain. In the original story, this evil stepmother not only mistreated the young villain, denying him food, but even tried to sell him off. She frequently mocked her legitimate husband for being a useless disabled person and used his money to keep countless lovers outside. The villain grew to hate this…",
    "genres": [
      "Mature",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 179,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "After the Villain Heard the Housekeeper’s Voice",
    "storyId": "3144",
    "novelUrl": "https://www.asianovel.net/story/3144/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/企业微信20241225-222808@2x-143x200.png",
    "author": "西兰树",
    "synopsis": "Jing Yi was a penniless nobody, struggling to make ends meet. After an unexpected accident, he was transmigrated into a series of tragic romance novels, becoming the head butler in a wealthy family. A job with room and board included. Thinking he could finally live a good life, Jing Yi soon discovers that the young masters of the family are all extreme romantics. They…",
    "genres": [
      "Comedy",
      "Drama",
      "Romance",
      "Supernatural",
      "Yaoi"
    ],
    "chaptersCount": 88,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "When a Socially Anxious Person Becomes a Fake Young Master of a Rich Family",
    "storyId": "3142",
    "novelUrl": "https://www.asianovel.net/story/3142/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/20240904104639_200_280-143x200.jpg",
    "author": "醒灯",
    "synopsis": "Outwardly cold but inwardly soft-hearted beauty with social anxiety (receptive) x possessive and obsessive tyrannical dog-like aggressive (dominant) Cen Wu accidentally transmigrates into a power-up fantasy novel, becoming the fake young master, a cannon fodder character who occupies a place that doesn’t belong to him. The cannon fodder, knowing he is a fake, behaves arrogantly and spoiled, fighting with his CEO brother over the…",
    "genres": [
      "Drama",
      "Psychological",
      "Romance",
      "School Life",
      "Yaoi"
    ],
    "chaptersCount": 88,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Post-Apocalyptic Drifting Island Survival",
    "storyId": "3125",
    "novelUrl": "https://www.asianovel.net/story/3125/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/20241027101958_200_280-124x200.jpg",
    "author": "南绫",
    "synopsis": "Storms, tsunamis, hurricanes, thunderstorms, hail, mutated aquatic creatures… The world has become turbulent and unstable. Cities are submerged by floods, water tornadoes ravage rivers, marauders invade neighborhoods, mysterious creatures appear in small towns, and villages are engulfed in blizzards and forced to flee… Shu Fu wakes up from a dream and suddenly realizes she doesn’t belong to this world. It is known that most…",
    "genres": [
      "Adventure",
      "Fantasy",
      "Romance"
    ],
    "chaptersCount": 185,
    "isCompleted": true,
    "isPremium": false
  }
]