[
  {
    "title": "The Happy Life of a Poker-Faced Zombie King",
    "storyId": "3540",
    "novelUrl": "https://www.asianovel.net/story/3540/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/11/20210120201753_200_280-143x200.jpg",
    "author": "木采",
    "synopsis": "Ye Wei’an is a beautiful zombie king. Intelligent from the very beginning, he knows that humans will ultimately defeat the zombie virus. So, he builds a nest for himself deep in the mountains, far from the storms of the outside world, spending his days collecting only beautiful crystals. When humanity finally triumphs, he calmly watches himself melt away. Unexpectedly, one day, he transmigrates into…",
    "genres": [
      "BL",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 61,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Apocalypse Coding for Myself",
    "storyId": "3523",
    "novelUrl": "https://www.asianovel.net/story/3523/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/10/authorimagespace-1-143x200.jpg",
    "author": "马户子君",
    "synopsis": "—A hilarious, sweet, and satisfying romp— Qi He, a game tester for twelve years, was a professional at exploiting bugs and pulling off outrageous moves. After dying suddenly from overwork, he transmigrated into an apocalyptic world. On his first day, he bound with a system and was informed that he was a cannon fodder character in this world. He had to play his role…",
    "genres": [
      "BL",
      "Fantasy",
      "Yaoi"
    ],
    "chaptersCount": 58,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Cultivating Killer Plants [Post-Apocalyptic]",
    "storyId": "3472",
    "novelUrl": "https://www.asianovel.net/story/3472/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/09/20250913165347_300_420-150x200.jpg",
    "author": "唧唧喵",
    "synopsis": "When the apocalypse arrived, Cheng Zhiyu, who hadn’t awakened any supernatural abilities, bound a system with its own space. Under the system’s guidance, he began planting within the space—except… why were the things he grew becoming more and more unusual? One day, Cheng Zhiyu arrived at a large base. The people there, upon learning he had wood-type abilities, couldn’t help but look down on…",
    "genres": [
      "BL",
      "Fantasy",
      "Yaoi"
    ],
    "chaptersCount": 98,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Consequences of Saving the Wrong Antagonist",
    "storyId": "2749",
    "novelUrl": "https://www.asianovel.net/story/2749/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2023/09/8623s-9c39c194066242d79e16bc7f4b75f173.jpg",
    "author": "凤羽涅",
    "synopsis": "Professor System has issued a mission: to rescue the gentle, kind and tragic protagonist shou of the novel “The Exceptional Furnace”.Song ‘Scholar-Tyrant’ Qingshi: “Don’t worry, Professor! I can definitely ensure the patient’s recovery!”In the Immortal Realm:Song Qingshi praised from the bottom of his heart: “My patient is the kindest and most beautiful little angel in the world.”Yue Wuhuan quietly washed the blood from his…",
    "genres": [
      "BL",
      "Drama",
      "Mature",
      "Psychological",
      "Tragedy",
      "Xianxia",
      "Yaoi"
    ],
    "chaptersCount": 119,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "A Bystander, But Pregnant with the Evil God’s Child",
    "storyId": "3335",
    "novelUrl": "https://www.asianovel.net/story/3335/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/05/authorimagespace-11-143x200.jpg",
    "author": "南辿星",
    "synopsis": "One-sentence Summary: Can a male mother also become the object of everyone’s obsession?",
    "genres": [
      "BL",
      "Horror",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 103,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Black Moonlight Only Wants Power",
    "storyId": "3234",
    "novelUrl": "https://www.asianovel.net/story/3234/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/20240821213431_200_280-143x200.jpg",
    "author": "元余",
    "synopsis": "One-line Synopsis: After being jilted three times, the black moonlight strikes back. Theme: Life is in your own hands.",
    "genres": [
      "Drama",
      "Historical",
      "Romance"
    ],
    "chaptersCount": 135,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Great Witch Doctor Livestreams His Consultations!",
    "storyId": "3222",
    "novelUrl": "https://www.asianovel.net/story/3222/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/authorimagespace-2-143x200.jpg",
    "author": "暮雨听眠",
    "synopsis": "Wu Heng, the most powerful witch doctor of ancient times, wakes up to find himself transmigrated into the body of the grandson of an elderly traditional Chinese medicine practitioner.Recalling how his father, who worked as a butler for a wealthy family, was kicked out by a ruthless CEO after indulging in too much gossip, ultimately leading to a destitute death, Wu Heng decides to…",
    "genres": [
      "BL",
      "Comedy",
      "Romance",
      "Slice of Life",
      "Supernatural",
      "Yaoi"
    ],
    "chaptersCount": 105,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Years After Substituting the Marriage",
    "storyId": "3232",
    "novelUrl": "https://www.asianovel.net/story/3232/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/20250102141122_200_280-150x200.jpg",
    "author": "宁夙",
    "synopsis": "Jiang Wanrou took her sister’s place to marry Lu Feng, the eldest son of the Duke’s mansion who was unable to walk. Because the marriage was not very honorable, she was cautious every day. She served her elders and managed the household, keeping the Duke’s mansion in perfect order. Even her moody husband, for the sake of their child, gave her the respect she…",
    "genres": [
      "Historical",
      "Romance"
    ],
    "chaptersCount": 117,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Quick Transmigrated:The Woman Disguised herself as a Man and took the Man’s Place",
    "storyId": "3225",
    "novelUrl": "https://www.asianovel.net/story/3225/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/Quick-TransmigratedThe-Woman-Disguised-herself-as-a-Man-and-took-the-Mans-Place-143x200.jpg",
    "author": "三两秋",
    "synopsis": "Once she traveled through time, Su Yu became a prince who successfully seized the throne of Great Qi Dynasty but disguised as a man – The head of a noble family who looked down on the world. The gentle and elegant young imperial teacher Tuo Luo, the unruly, brave and resourceful undefeated general, the world’s richest man who was rich enough to make a…",
    "genres": [
      "Historical",
      "Romance",
      "Slice of Life"
    ],
    "chaptersCount": 202,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "My Boyfriend Is the Heartthrob, and I’m Just a Passerby",
    "storyId": "3228",
    "novelUrl": "https://www.asianovel.net/story/3228/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/My-Boyfriend-is-the-Heartthrob-and-Im-Just-a-Passerby-147x200.jpg",
    "author": "橘子珩",
    "synopsis": "After gaining awareness, Ye Jishu realizes he is just a passerby in a harem novel where the protagonist shou is a magnet for obsessive lovers. This novel has Gong 1, Gong 2, Gong 3… and the list goes on, each of them seemingly infected with madness, falling deeply and uncontrollably in love with the protagonist shou. Constantly showing concern, forcing possession, secretly stalking… Every…",
    "genres": [
      "Fantasy",
      "Horror",
      "Romance",
      "Supernatural",
      "Yaoi"
    ],
    "chaptersCount": 50,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "I Only Want Your Hugs",
    "storyId": "3164",
    "novelUrl": "https://www.asianovel.net/story/3164/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/I-Only-Want-Your-Hugs-143x200.jpg",
    "author": "仿生咩咩刀",
    "synopsis": "Because of touch starvation, Bai Chen had been single since birth. He was even rumored to be pretending to be noble and was actually a sea king who was a master at fishing. On the second day after he was blacklisted across the internet, the imperial crown prince, Xie Yilin, came to him and asked him to agree to a fake marriage. Facing the…",
    "genres": [
      "Romance",
      "Shounen Ai",
      "Yaoi"
    ],
    "chaptersCount": 64,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "How Miserable Can a Straight Man Be When Transported to an ABO World",
    "storyId": "3221",
    "novelUrl": "https://www.asianovel.net/story/3221/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/20250114175327_200_280-143x200.jpg",
    "author": "斩长鲸",
    "synopsis": "How miserable can a straight man be when transported to an ABO world? Especially when he becomes the adoptive older brother of the protagonist—a harem-filled, R18+ game’s most popular character! Yiye (despairing): So, what’s my mission? System (serious): Please protect the protagonist’s chastity. Yiye: … As the “green leaf” tasked with protecting the “flower,” Yiye is forced to enroll in the Empire’s top military…",
    "genres": [
      "Fantasy",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 167,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Stabilizing Madness",
    "storyId": "2831",
    "novelUrl": "https://www.asianovel.net/story/2831/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2023/11/20231117060446-b58643f6be95436a90b16df18b447ebf.jpeg",
    "author": "有狐千岁",
    "synopsis": "Xu Qingran, originally an antagonist in an apocalyptic novel, finds himself pulled into a different interstellar world by a system after his death. In this new world, he is unloved by his biological father and stepmother, and his innocent stepbrother interferes with his relationships. He suffers abuse from a scoundrel lover, enduring a tumultuous journey before ultimately achieving a grand happy ending. The system…",
    "genres": [
      "Action",
      "BL",
      "Fantasy",
      "Mature",
      "Post-Editing",
      "Romance",
      "Sci-fi",
      "Shounen Ai",
      "Supernatural",
      "Yaoi"
    ],
    "chaptersCount": 113,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "80’s Military Marriage: After Transmigrating, I Became the White Moonlight of the Courtyard",
    "storyId": "3163",
    "novelUrl": "https://www.asianovel.net/story/3163/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/s-Military-Marriage-After-Transmigrating-I-Became-the-White-Moonlight-of-the-Courtyard-150x200.png",
    "author": "一盞紅爐",
    "synopsis": "A genius girl from a family of medical professionals, due to an accident, transmigrated into a period novel and became the vicious female supporting character. Ye Xiaoxiao was the fake daughter of the Hao family. Growing up in the courtyard of the capital, she was the white moonlight of the young people in the courtyard. Until the age of seventeen, the real daughter returned,…",
    "genres": [
      "Drama",
      "Romance",
      "Slice of Life"
    ],
    "chaptersCount": 491,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "After the Hated Character Awakens, He Cremate Everyone",
    "storyId": "3157",
    "novelUrl": "https://www.asianovel.net/story/3157/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/After-the-Hated-Character-Awakens-He-Cremate-Everyone-143x200.jpg",
    "author": "风华如故",
    "synopsis": "Su Xingyao was born with good looks and treated people sincerely, yet he was never liked by others. After suffering hardships and eventually being taken back by his biological family, his parents showed him a cold face, caring only for their adopted son. His fiancé gave all their resources to the adopted son, allowing people within their circle to bully and smear Su Xingyao…",
    "genres": [
      "BL",
      "Drama",
      "Fantasy",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 97,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Little Taoist",
    "storyId": "3156",
    "novelUrl": "https://www.asianovel.net/story/3156/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/20240723011512_200_280-143x200.jpg",
    "author": "婻书",
    "synopsis": "On the first day of high school military training, Ji Nanxing, who had been battling a fierce ghost for seven days and nights, collapsed from exhaustion into the arms of the school bully, Xiao Ye. Xiao Ye, holding the other’s slender waist, thought to himself, “This guy is so thin.” Later, this person became his deskmate. Seeing his pale and fragile-looking deskmate, who seemed…",
    "genres": [
      "Romance",
      "Supernatural",
      "Yaoi"
    ],
    "chaptersCount": 409,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Glorious Marriage",
    "storyId": "3155",
    "novelUrl": "https://www.asianovel.net/story/3155/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/20240815071456_200_280-143x200.jpg",
    "author": "希昀",
    "synopsis": "One-sentence summary: Marriage before love, mutual pursuit Theme: Only effort will not be in vain",
    "genres": [
      "Drama",
      "Historical",
      "Romance"
    ],
    "chaptersCount": 98,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Qing Dynasty Consort Who Only Wants to Be a Salted Fish",
    "storyId": "3154",
    "novelUrl": "https://www.asianovel.net/story/3154/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/novelimage-20-143x200.png",
    "author": "姣姣月明",
    "synopsis": "Su Yi was once a free-spirited cultivator who failed her tribulation and, through a stroke of fate, was transported into a Qing Dynasty novel. She became a cannon fodder female character who was treated as nothing more than a baby-making machine by her sister. The sister was the protagonist of this Qing Dynasty novel and, with the mindset of keeping the child while discarding…",
    "genres": [
      "Historical",
      "Romance"
    ],
    "chaptersCount": 347,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Marriage by Imperial Decree",
    "storyId": "3152",
    "novelUrl": "https://www.asianovel.net/story/3152/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/20241209195224_200_280-143x200.jpg",
    "author": "其君折枝",
    "synopsis": "Xu Duan Yi is elegant and virtuous, born into a prestigious family. In the capital, countless noble young men wished to marry her. Xie Qing Ya, on the other hand, is a libertine and unrestrained. Though he is stunningly handsome, his family has fallen from grace, and he is seen as a good-for-nothing. No one expected that these two would end up together. When…",
    "genres": [
      "Historical",
      "Romance"
    ],
    "chaptersCount": 128,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Overachieving Little Husband of the Top Scholar’s Family",
    "storyId": "3151",
    "novelUrl": "https://www.asianovel.net/story/3151/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/novelimage-19-143x200.png",
    "author": "云依石",
    "synopsis": "“Life Section’s Top Overachiever” Qiu Huanian transmigrated into an ancient era as a young “ge’er” (a term for a male in a specific societal role). Unloved by his father and stepmother, during a famine, he was traded for two pecks of sorghum to the Du family in the neighboring village as a child bridegroom. When he woke up, all that was left in the…",
    "genres": [
      "Historical",
      "Yaoi"
    ],
    "chaptersCount": 247,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "My Mom is a Amnesiac Heiress",
    "storyId": "3150",
    "novelUrl": "https://www.asianovel.net/story/3150/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/authorimagespace-143x200.jpg",
    "author": "溯时",
    "synopsis": "Ji Ning is the female lead in the melodramatic story “I Lost My Memory After Running Away with a Child.” After giving birth to Zhu Zhu, she suffers a severe car accident and loses all her memories. Her daughter is also kidnapped and goes missing. Three years pass by. The Ji family exhausts all their resources and finally finds their long-lost little miss. The…",
    "genres": [
      "Drama",
      "Romance"
    ],
    "chaptersCount": 81,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Sickly Sister-in-Law in a Stepmother Novel",
    "storyId": "3149",
    "novelUrl": "https://www.asianovel.net/story/3149/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/p2oe50e12692c53ee24ffdba20b823f6a38tplv-resize_225_0-150x200.png",
    "author": "苓菱子",
    "synopsis": "Lin Qing had a terrifying dream. In it, she was the sickly sister-in-law whose marriage had been stolen by her niece, born the same year as her. The niece, fearing that Lin Qing might try to take back the marriage, paraded the stolen husband in front of her every day to flaunt her victory. Eventually, “she” was so angered that she was literally driven…",
    "genres": [
      "Drama",
      "Romance",
      "Slice of Life"
    ],
    "chaptersCount": 616,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Group Disbanded, and I Skyrocketed to Fame!",
    "storyId": "3148",
    "novelUrl": "https://www.asianovel.net/story/3148/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2025/01/20240807133056_200_280-143x200.jpg",
    "author": "远上天山",
    "synopsis": "Waking up from a nap, actor Lu Xu found himself transmigrated into a member of the popular idol boy group, Verse. The good news: He had a handsome face. The bad news: Verse had just disbanded. Not only was Lu Xu the least popular member, but he was also the only one kicked out of the company. Verse fans preferred to support the remaining…",
    "genres": [
      "Drama",
      "Romance"
    ],
    "chaptersCount": 244,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Noble Lady Crosses into the Seventies and Pretends to Be Poor",
    "storyId": "3147",
    "novelUrl": "https://www.asianovel.net/story/3147/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/20241221224849_200_280-150x200.jpg",
    "author": "半两青墨",
    "synopsis": "The Great Liang Dynasty has truly cooled down. Rebel troops are at the city gates, about to break through. Prince Shen Shaoyuan and his daughter huddle in the treasure vault, trembling as they prepare for death alongside their country. However, the rebels never breach the vault, and the distant sounds of battle gradually fade into silence. Finally, the father and daughter muster the courage…",
    "genres": [
      "Drama",
      "Slice of Life"
    ],
    "chaptersCount": 172,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Transmigrating into the Stepmother of the Empire’s Overlord",
    "storyId": "3145",
    "novelUrl": "https://www.asianovel.net/story/3145/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/81fcb4b1651f3a52bac2163be4f26dcatplv-resize_225_0-150x200.jpg",
    "author": "梅川裤子",
    "synopsis": "Shen ZhiXue transmigrated into an ABO novel and became the stepmother of the villain. In the original story, this evil stepmother not only mistreated the young villain, denying him food, but even tried to sell him off. She frequently mocked her legitimate husband for being a useless disabled person and used his money to keep countless lovers outside. The villain grew to hate this…",
    "genres": [
      "Mature",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 179,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "After the Villain Heard the Housekeeper’s Voice",
    "storyId": "3144",
    "novelUrl": "https://www.asianovel.net/story/3144/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/企业微信20241225-222808@2x-143x200.png",
    "author": "西兰树",
    "synopsis": "Jing Yi was a penniless nobody, struggling to make ends meet. After an unexpected accident, he was transmigrated into a series of tragic romance novels, becoming the head butler in a wealthy family. A job with room and board included. Thinking he could finally live a good life, Jing Yi soon discovers that the young masters of the family are all extreme romantics. They…",
    "genres": [
      "Comedy",
      "Drama",
      "Romance",
      "Supernatural",
      "Yaoi"
    ],
    "chaptersCount": 88,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "When a Socially Anxious Person Becomes a Fake Young Master of a Rich Family",
    "storyId": "3142",
    "novelUrl": "https://www.asianovel.net/story/3142/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/20240904104639_200_280-143x200.jpg",
    "author": "醒灯",
    "synopsis": "Outwardly cold but inwardly soft-hearted beauty with social anxiety (receptive) x possessive and obsessive tyrannical dog-like aggressive (dominant) Cen Wu accidentally transmigrates into a power-up fantasy novel, becoming the fake young master, a cannon fodder character who occupies a place that doesn’t belong to him. The cannon fodder, knowing he is a fake, behaves arrogantly and spoiled, fighting with his CEO brother over the…",
    "genres": [
      "Drama",
      "Psychological",
      "Romance",
      "School Life",
      "Yaoi"
    ],
    "chaptersCount": 88,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Fake Missy Becomes the Darling of the Farming World, While the Marquis Family Regrets to the Core",
    "storyId": "3141",
    "novelUrl": "https://www.asianovel.net/story/3141/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/202409021014022208_sa-150x200.jpg",
    "author": "福暖四时",
    "synopsis": "The moment Lu Mingzhao opened her eyes, she found herself transmigrated into the world of an alternate historical romance novel, where she was the fake missy of the Marquis family who had taken the place of the rightful one. Once her true identity was revealed, the fake missy refused to accept her fate and didn’t want to give up her marriage contract. After much…",
    "genres": [
      "Drama",
      "Historical",
      "Romance"
    ],
    "chaptersCount": 343,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "I Am the Richest Man’s Dear Aunt [Era Story]",
    "storyId": "3139",
    "novelUrl": "https://www.asianovel.net/story/3139/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/novelimage-5-143x200.png",
    "author": "唯一",
    "synopsis": "By a stroke of fate, I traveled back to the early 1950s and became a young miss who was abandoned by her irresponsible father. The only family I have is a nephew who was adopted. For the sake of our future, Lu Mingzhu and her nephew move to Hong Kong to settle down. Just as she plans to return to her old profession to…",
    "genres": [
      "Drama",
      "Romance"
    ],
    "chaptersCount": 382,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Always the Sucker in Every Isekai",
    "storyId": "3138",
    "novelUrl": "https://www.asianovel.net/story/3138/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/8d9ea8be3d94531a02d542c7d8373ea7-143x200.jpeg",
    "author": "清水叶子",
    "synopsis": "World Three has concluded, with updates of 9k+ words every night at midnight. “You will possess beauty that everyone admires, a wealthy family background, and open-minded parents.” “Even if you don’t study much, your grades will still be at the top; even if you casually throw some money to test the waters, you’ll earn a fortune; and even if you’re arrogant and domineering, countless…",
    "genres": [
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 227,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Concubine Raiders",
    "storyId": "3136",
    "novelUrl": "https://www.asianovel.net/story/3136/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/Concubine-Raiders_1608075156-150x200.jpeg",
    "author": "吱吱1",
    "synopsis": "In the Ming Dynasty, the distinguished Luo family suffers a downfall and wanted to solve the crisis through a marriage arrangement. The intelligent and introverted the 11th Lady was chosen, and she rose from a lowly concubine’s child to become the much-coveted madame of the Yong Ping Duke Manor. Facing the complicated web of the relationship as well as the distrust of her own…",
    "genres": [
      "Drama",
      "Historical",
      "Romance"
    ],
    "chaptersCount": 748,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Who Would Be Cannon Fodder After Awakening",
    "storyId": "3133",
    "novelUrl": "https://www.asianovel.net/story/3133/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/novelimage-4-143x200.png",
    "author": "八爷党",
    "synopsis": "Ye Mingzhao has awakened. He has learned that he is the villainous fake son in a novel about a true and false heir. Adopted by a wealthy family since childhood, he becomes dissatisfied when the true heir returns to the family. He resorts to framing and slandering the true heir, stirring up conflicts, and ultimately succeeds in causing the true heir’s death. The true…",
    "genres": [
      "Slice of Life",
      "Yaoi"
    ],
    "chaptersCount": 104,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Sky Island [Apocalypse]",
    "storyId": "3132",
    "novelUrl": "https://www.asianovel.net/story/3132/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/20240501114227_200_280-143x200.jpg",
    "author": "灰谷",
    "synopsis": "“Hell is other people.” Zhou Yun, having returned from a reset after the apocalypse, Chose to distance himself from the crowd, guarding a lonely tower. But this time, he hopes to keep Guan Yuanfeng by his side. The desire to become strong begins with the desire to protect someone. On my isolated island in the sea of clouds, I hold a corner, with stars…",
    "genres": [
      "BL",
      "Fantasy",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 182,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Reluctant Tycoon Stepdad Who Suddenly Soared in Popularity",
    "storyId": "3034",
    "novelUrl": "https://www.asianovel.net/story/3034/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/08/20240623173904_300_420-143x200.jpg",
    "author": "唐酒月",
    "synopsis": "A cute and heartwarming story!",
    "genres": [
      "BL",
      "Comedy",
      "Drama",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 122,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Daily Slacker Life of the Chief Wife of the Prime Minister’s Mansion",
    "storyId": "3129",
    "novelUrl": "https://www.asianovel.net/story/3129/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/2817510s-150x200.jpg",
    "author": "越长风",
    "synopsis": "Marriage first, love later + Sweet and indulgent + Exciting and satisfying story + Both leads are pure",
    "genres": [
      "Historical",
      "Romance"
    ],
    "chaptersCount": 184,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Transmigrating into the Mom of the Most Spoiled Child in a Retro Novel",
    "storyId": "3126",
    "novelUrl": "https://www.asianovel.net/story/3126/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/p2oe65d497d7ae60180cf1e196f3c7bb568tplv-resize_225_0-150x200.jpeg",
    "author": "黎家七七",
    "synopsis": "Su Taotao, after transmigrating into a novel set in the 1970s, faces two choices: Su Taotao chooses the incredibly cute human cub! As she raises the cub, she realizes that the adorably innocent little one seems to have somewhat extraordinary intelligence. Later, the fair-skinned, beautiful, long-legged Su Taotao appears in the base’s family courtyard, holding her delicate and lovely little cub. How could it…",
    "genres": [
      "Drama",
      "Romance"
    ],
    "chaptersCount": 532,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Post-Apocalyptic Drifting Island Survival",
    "storyId": "3125",
    "novelUrl": "https://www.asianovel.net/story/3125/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/12/20241027101958_200_280-124x200.jpg",
    "author": "南绫",
    "synopsis": "Storms, tsunamis, hurricanes, thunderstorms, hail, mutated aquatic creatures… The world has become turbulent and unstable. Cities are submerged by floods, water tornadoes ravage rivers, marauders invade neighborhoods, mysterious creatures appear in small towns, and villages are engulfed in blizzards and forced to flee… Shu Fu wakes up from a dream and suddenly realizes she doesn’t belong to this world. It is known that most…",
    "genres": [
      "Adventure",
      "Fantasy",
      "Romance"
    ],
    "chaptersCount": 185,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "A Salted Fish with a Rebellious Spirit",
    "storyId": "3122",
    "novelUrl": "https://www.asianovel.net/story/3122/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/11/20241118091445_200_280-143x200.jpg",
    "author": "一世华裳",
    "synopsis": "Xing Shi unexpectedly transmigrated to a magical world, where life became extremely miserable. But luck was on his side. One day, he opened his eyes to find himself back in a normal human society. Tearfully, he decided to enjoy life to the fullest. However, just then, a voice echoed in his mind. [System 99, successfully bound to host.] Fu Xiu Ning suddenly gained the ability…",
    "genres": [
      "Action",
      "Adventure",
      "Drama",
      "Fantasy",
      "Yaoi"
    ],
    "chaptersCount": 82,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Rebirth of a Majestic Empress",
    "storyId": "3121",
    "novelUrl": "https://www.asianovel.net/story/3121/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/11/20240819220136_200_280-143x200.jpg",
    "author": "春未绿",
    "synopsis": "Zheng Huiyin and her elder sister Zheng Deyin are both reborn. In their previous life, Zheng Huiyin married the puppet crown prince as his concubine, while her sister Zheng Deyin married a powerful prince as his legitimate wife. Everyone praised her sister for making a great match—or so it seemed. Who would have thought that Zheng Huiyin would not only make the crown prince…",
    "genres": [
      "Drama",
      "Historical",
      "Romance"
    ],
    "chaptersCount": 100,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Wealthy Mother-in-Law Doesn’t Stir Up Trouble, and the Novel’s Ending is Blissfully Perfect",
    "storyId": "3119",
    "novelUrl": "https://www.asianovel.net/story/3119/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/11/p2o9768bd75c993f16b75aafe5702b5fcfdtplv-resize_225_0-150x200.jpg",
    "author": "墨墨不知道",
    "synopsis": "[Transmigration + Wish-Fulfillment + Wealthy Family + Humiliation of Scum + Sweet Pampering + Dual Purity]",
    "genres": [
      "Drama",
      "Romance",
      "Slice of Life"
    ],
    "chaptersCount": 182,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Sick Beauty Just Wants to Quietly Stay Alive",
    "storyId": "3118",
    "novelUrl": "https://www.asianovel.net/story/3118/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/11/20230424185640_200_280-143x200.jpg",
    "author": "旭小岩",
    "synopsis": "Shen Yan, the eldest son of the Shen family, is cold and aloof, exuding a noble aura. However, there is a striking red mole between his brows, giving him a look that is both sensual and pure. In his previous life, he died from the torment of illness. When he woke up again, he realized he had been transported into the body of an…",
    "genres": [
      "Drama",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 97,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The First Spirit Rune Master",
    "storyId": "3117",
    "novelUrl": "https://www.asianovel.net/story/3117/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/11/novelimage-2-143x200.png",
    "author": "吱吱复吱吱",
    "synopsis": "A forbidden spell magician transmigrated into the useless fifth prince, Cang Cheng, of the Cang Lan Star Domain. Barely an adult, he was appointed as the planetary governor of the border planet, Luori Star. This was no different from being exiled to the border. “Will this fifth prince die on the border planet?” “For a useless prince like him, I’d be grateful if he…",
    "genres": [
      "Fantasy",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 106,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Interstellar Top Tier Alpha",
    "storyId": "3115",
    "novelUrl": "https://www.asianovel.net/story/3115/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/11/20241028160342_300_420-143x200.jpg",
    "author": "紫舞玥鸢",
    "synopsis": "Short Description: The top general of the empire is carrying his cub. Theme: Love is about mutual achievement.",
    "genres": [
      "BL",
      "Fantasy",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 72,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Splendor and Wealth of the Grand Dame",
    "storyId": "3113",
    "novelUrl": "https://www.asianovel.net/story/3113/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/11/novelimage-1-143x200.png",
    "author": "莫非小妖",
    "synopsis": "Short Summary: Rise in seniority, gain wealth, and lose the husband. Theme: Harmony in the family brings prosperity to all endeavors.",
    "genres": [
      "Drama",
      "Historical"
    ],
    "chaptersCount": 153,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Female Supporting Character in a Retro Novel Misidentified the Male Lead",
    "storyId": "3110",
    "novelUrl": "https://www.asianovel.net/story/3110/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/11/20240718110539_200_280-143x200.jpg",
    "author": "柠檬九",
    "synopsis": "Lin Qiao has transmigrated into a retro novel that she only heard about from her friend, not even remembering the name of the male lead. As a cannon fodder female supporting character in the book, her marriage to the male lead was never one of equals. He married her simply to return to a local business, trading marital freedom for career freedom. Once the…",
    "genres": [
      "Drama",
      "Romance"
    ],
    "chaptersCount": 83,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Charming Medical Fragrance of the 70s",
    "storyId": "3109",
    "novelUrl": "https://www.asianovel.net/story/3109/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/11/e3f2f943795409b476a4cee40fe10060-143x200.jpg",
    "author": "饭在锅里",
    "synopsis": "Brief Introduction: Wood-elemental supernatural ability reincarnated into a sickly body in the 70s. Theme: Seize the day and enjoy life while you can.",
    "genres": [
      "Drama",
      "Romance"
    ],
    "chaptersCount": 198,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Daily Life of Cultivating the Fields: Second Miss Gu’s Journey of Banishment",
    "storyId": "3107",
    "novelUrl": "https://www.asianovel.net/story/3107/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/11/novelimage-17-143x200.png",
    "author": "湘也",
    "synopsis": "One-line Synopsis: The solitary life of farming Theme: Pursuing a beautiful life",
    "genres": [
      "Historical",
      "Romance",
      "Slice of Life",
      "Supernatural"
    ],
    "chaptersCount": 142,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Real Young Master Never Returns to the Aristocratic Family",
    "storyId": "3102",
    "novelUrl": "https://www.asianovel.net/story/3102/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/10/20240306144811_200_280-143x200.jpg",
    "author": "旧闲书",
    "synopsis": "Shi Ling has transmigrated into a book—specifically, into a novel about a pampered fake young master and the real young master. In this story, the fake young master, who was raised in an aristocratic family, is the center of everyone’s affection. The real young master, the original owner of Shi Ling’s new body, is merely a country bumpkin from a small town, whose sole…",
    "genres": [
      "Romance",
      "School Life",
      "Yaoi"
    ],
    "chaptersCount": 88,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Her Enduring Favor",
    "storyId": "3101",
    "novelUrl": "https://www.asianovel.net/story/3101/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/10/novelimage-16-143x200.png",
    "author": "茸兔",
    "synopsis": "In the fourth year of Chengzuo, a nationwide grand election was held. Jiang Xueyi, the second legitimate daughter of the Minister of Punishments, a prestigious third-rank official, was ceremoniously welcomed into the palace. It was widely known both in and out of the court that the Minister of Punishments was impartial and just, a veritable “Iron-faced Judge of Hell.” Yet, who would have thought…",
    "genres": [
      "Drama",
      "Historical",
      "Romance"
    ],
    "chaptersCount": 201,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Tyrant Panics After Hearing the Little Princess’s Heart Voice",
    "storyId": "3095",
    "novelUrl": "https://www.asianovel.net/story/3095/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/10/p2o0f3be5c07f65682afd8932a281cc55cetplv-resize_225_0-150x200.jpg",
    "author": "研究仲裁",
    "synopsis": "Mind Reading + Family Favorite + Fictional World + System + Sweet Romance + Adorable Kids + Cannon Fodder Reversal + Book Penetration",
    "genres": [
      "Historical",
      "Romance"
    ],
    "chaptersCount": 528,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "After Entering the Book, I Brought the Kids to Find Their Father Who Died Early",
    "storyId": "3093",
    "novelUrl": "https://www.asianovel.net/story/3093/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/10/p2oe3df059ae2c79ed6519688e03eaee553tplv-resize_225_0-150x200.png",
    "author": "燕三月",
    "synopsis": "Commander, Your Wife Has Come with the Children: Su Zhaozhao stays up all night reading a period novel and wakes up to find herself transported into the world of the book, becoming the early-dead ex-wife of the male protagonist who was not even named in the story. He thought she was gone, and she thought he was dead. The ex-wife struggled to survive with…",
    "genres": [
      "Drama",
      "Romance"
    ],
    "chaptersCount": 270,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Butcher’s Mighty Wife of the Chief Minister",
    "storyId": "3092",
    "novelUrl": "https://www.asianovel.net/story/3092/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/10/20240311200211_200_280-142x200.jpg",
    "author": "风过水无痕",
    "synopsis": "One-Sentence Summary: The domineering butcher’s daughter and her doting minister husband. Theme: Using her unique skills, she strives to build a prosperous life.",
    "genres": [
      "Comedy",
      "Drama",
      "Historical",
      "Martial Arts",
      "Romance"
    ],
    "chaptersCount": 182,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Stop the Villain from Destroying the World, Who Has Time for Love",
    "storyId": "3089",
    "novelUrl": "https://www.asianovel.net/story/3089/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/10/233986-150x200.jpg",
    "author": "棠棠",
    "synopsis": "Song Chuyi binds to a system designed to save villains, who all have various reasons for wanting to destroy the world. His mission is to prevent these apocalypses, so the naturally outgoing and sociable Song Chuyi drags the villains along on his adventures. A gloomy tycoon suffering from insomnia, after being dragged into seven days and nights of play, says, “As long as you…",
    "genres": [
      "Drama",
      "Romance",
      "Slice of Life",
      "Yaoi"
    ],
    "chaptersCount": 509,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Sweet! The Villain Is So Flirtatious? Specifically Pinching The Male Lead’s Slim Waist",
    "storyId": "3078",
    "novelUrl": "https://www.asianovel.net/story/3078/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/09/Sweet-The-Villain-Is-So-Flirtatious-Specifically-Pinching-The-Male-Leads-Slim-Waist-150x200.jpg",
    "author": "全麥面包",
    "synopsis": "“Damn, I’m most annoyed by pretentious male leads. If they can still force a happy ending, I’ll livestream myself eating X while doing a handstand!” Embracing the situation, Jian Li begins to implement his detailed dog transformation plan. He joins an adventure survival reality show, determined to change the original character’s image of a male version of Lin Daiyu, with an abnormal aesthetic of…",
    "genres": [
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 139,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "After Hearing Her Daughter’s Heartfelt Words, a Socially Anxious Mom Picks up a Knife and Fights Fearlessly",
    "storyId": "3077",
    "novelUrl": "https://www.asianovel.net/story/3077/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/09/p2od4e1e49f21267befd31d28487cdd19b2tplv-resize_225_0-150x200.jpg",
    "author": "秋叶青",
    "synopsis": "After a difficult childbirth, Fan Qingyi gains the ability to read minds. She discovers that her entire family is cannon fodder in a period novel. The female lead steals her golden finger, removes the kidney of her youngest daughter, pushes her eldest daughter into the water, and runs over her second daughter with a car! She then has Fan Qingyi thrown into a mental…",
    "genres": [
      "Drama",
      "Romance",
      "Slice of Life"
    ],
    "chaptersCount": 452,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Selling Delicacies at a Stall in Ancient Times",
    "storyId": "3076",
    "novelUrl": "https://www.asianovel.net/story/3076/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/09/3a98702993b70d37-143x200.jpg",
    "author": "梨庐浅",
    "synopsis": "One-sentence Summary: Starting with selling small river fish at a stall Theme: Striving for self-improvement and living each day to the fullest",
    "genres": [
      "Drama",
      "Historical",
      "Romance"
    ],
    "chaptersCount": 200,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Husband, Let Me Feel Your Abs",
    "storyId": "3075",
    "novelUrl": "https://www.asianovel.net/story/3075/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/09/novelimage-14-143x200.png",
    "author": "9981z",
    "synopsis": "Focuses on daily life and domestic matters, with minimal conflict from relatives; mainly about the couple working together.",
    "genres": [
      "Drama",
      "Historical",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 151,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Rebirth into a Novel: Even Minor Characters Need to Study",
    "storyId": "3063",
    "novelUrl": "https://www.asianovel.net/story/3063/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/09/20240906195600_200_280-140x200.jpg",
    "author": "仙元",
    "synopsis": "Xu Zeping was originally a delivery man in the twenty-first century, struggling with poverty and the consequences of limited education. He could only engage in manual labor due to his circumstances. During one routine delivery, he encountered a three-year-old child crossing the road and, being kind-hearted, he reached out to help. However, he was struck by a drunk driver’s truck. When he opened his…",
    "genres": [
      "Drama",
      "Historical",
      "Romance",
      "Yaoi"
    ],
    "chaptersCount": 318,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Rebirth of the Real Young Master: Starting a Healthy Lifestyle",
    "storyId": "3059",
    "novelUrl": "https://www.asianovel.net/story/3059/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/09/novelimage-10-143x200.png",
    "author": "听原",
    "synopsis": "One-sentence Summary: The real cannot be imitated. Theme: A Zen attitude towards life, rejecting internal burnout.",
    "genres": [
      "BL",
      "Drama",
      "School Life",
      "Tragedy",
      "Yaoi"
    ],
    "chaptersCount": 97,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "A Guide to Incubating Eggs in the Stars",
    "storyId": "3058",
    "novelUrl": "https://www.asianovel.net/story/3058/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/09/novelimage-9-143x200.png",
    "author": "司宵乐",
    "synopsis": "One-Sentence Summary: I became famous across the stars through egg incubation. Theme: Strive to break through adversity.",
    "genres": [
      "Mecha",
      "Romance",
      "Sci-fi",
      "Tragedy",
      "Yaoi"
    ],
    "chaptersCount": 277,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Daily Life of the Main Lady",
    "storyId": "3057",
    "novelUrl": "https://www.asianovel.net/story/3057/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/09/p2o49ba522db0710d01ad32b1b8bb55998dtplv-resize_225_0-150x200.png",
    "author": "周大白",
    "synopsis": "[This is a story about an ancient version of a Marquis House CEO.]",
    "genres": [
      "Drama",
      "Historical",
      "Romance"
    ],
    "chaptersCount": 499,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Rebirth in the Post-Apocalyptic World with a Child",
    "storyId": "3054",
    "novelUrl": "https://www.asianovel.net/story/3054/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/09/novelimage-8-143x200.png",
    "author": "舞竹",
    "synopsis": "One Sentence Summary: “The world has entered a state of war!”",
    "genres": [
      "Action",
      "Adventure",
      "Horror",
      "Sci-fi",
      "Yaoi"
    ],
    "chaptersCount": 89,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Ashes of Beauty Reborn",
    "storyId": "3043",
    "novelUrl": "https://www.asianovel.net/story/3043/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/08/20231107183411_200_280-142x200.jpg",
    "author": "甘洄",
    "synopsis": "An obsessively doting CEO top × Stunningly beautiful, scheming seme bottom",
    "genres": [
      "Drama",
      "Psychological",
      "Romance",
      "Slice of Life",
      "Yaoi"
    ],
    "chaptersCount": 147,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Farewell to the Golden Branch",
    "storyId": "3037",
    "novelUrl": "https://www.asianovel.net/story/3037/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/08/180-4-150x200.jpg",
    "author": "冬天的柳叶",
    "synopsis": "Xin You was born with heterochromatic eyes. Occasionally, she can see the misfortunes that will happen to others. This is her trouble as well as her confidence. Suddenly, the onlookers in the capital city find that the cousin living under the care of the vice-minister’s mansion has become tough!",
    "genres": [
      "Drama",
      "Historical",
      "Mystery",
      "Romance"
    ],
    "chaptersCount": 436,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "I’m a Family Doctor in a Domineering Boss Novel",
    "storyId": "3036",
    "novelUrl": "https://www.asianovel.net/story/3036/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/08/Im-a-Family-Doctor-in-a-Domineering-Boss-Novel-143x200.jpeg",
    "author": "策马听风",
    "synopsis": "In every domineering boss novel, besides a butler who would say, “It’s been a long time since I’ve seen the young master so happy,” a family doctor is also essential. I am such a family doctor, helping the domineering bosses to solve all sorts of difficult problems. I have four employers —— Employer No. 1 is the domineering boss of the troubled family, and…",
    "genres": [
      "Comedy",
      "Fantasy",
      "Shounen Ai",
      "Yaoi"
    ],
    "chaptersCount": 92,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "After being exiled, I became a Han merchant in Dunhuang",
    "storyId": "3032",
    "novelUrl": "https://www.asianovel.net/story/3032/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/08/20240609182234_200_280-141x200.jpg",
    "author": "绿豆红汤",
    "synopsis": "One-sentence summary: Also got a man Theme: Cultivate silently and wait for the flowers to bloom",
    "genres": [
      "Adventure",
      "Drama",
      "Historical",
      "Romance"
    ],
    "chaptersCount": 363,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Cannon Fodder Sister-in-Law from a Lucky Era Novel is Reborn",
    "storyId": "3020",
    "novelUrl": "https://www.asianovel.net/story/3020/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/08/p2o2a4b59fb3d7d593c12f072b099a1b27dtplv-resize_225_0-150x200.jpg",
    "author": "乔喵喵",
    "synopsis": "[Time-Travel + Rebirth and Revenge + Sweet Love + Cool Story + Building a Fortune + Daily Life]",
    "genres": [
      "Drama",
      "Romance",
      "Slice of Life"
    ],
    "chaptersCount": 487,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "A Sheet of Paper Worth a Thousand Gold",
    "storyId": "3002",
    "novelUrl": "https://www.asianovel.net/story/3002/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/07/180-3-150x200.jpg",
    "author": "董无渊",
    "synopsis": "Green bricks and green tiles, on the roadside the flowers bloom and their fragrance stains the clothes; Vermilion gates and purple palaces, with fair hands picking the stars and making a rainbow as a dress.",
    "genres": [
      "Drama",
      "Historical",
      "Romance"
    ],
    "chaptersCount": 392,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "After Being Tortured to Death, the True Eldest Daughter Returns at Max Level and Unleashes Havoc",
    "storyId": "2970",
    "novelUrl": "https://www.asianovel.net/story/2970/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2024/05/11499s-150x200.jpg",
    "author": "榛苓兮",
    "synopsis": "She was the true eldest daughter, yet under the suppression of that fake noble lady—a true green tea—she was despised by her entire family, mistaken for a concubine’s child, and ultimately fell victim to the green tea’s schemes, beaten to death by her husband’s family. On the day she returned to the Zheng household, the imposter who had stolen her identity falsely claimed, “In…",
    "genres": [
      "Historical",
      "Romance"
    ],
    "chaptersCount": 582,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "Qiang Jin Jiu",
    "storyId": "1907",
    "novelUrl": "https://www.asianovel.net/story/1907/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2022/09/2022092312-55e880cc501b451dbb4e17ed84af0bb1.jpg",
    "author": "Admin",
    "synopsis": "The six prefectures of Zhongbo were offered to foreign enemies on a silver platter, and Shen Zechuan was taken into custody in the capital, reduced to a drowning dog* loathed and condemned by all. Xiao Chiye followed the scent of the furor and made his way over. But instead of setting others on him, he kicked Shen Zechuan with his very own leg, rendering…",
    "genres": [
      "Action",
      "BL",
      "Drama",
      "Historical",
      "Mature",
      "Mystery",
      "Romance",
      "Tragedy"
    ],
    "chaptersCount": 303,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Socially Anxious Little Zombie Forced Outdoors",
    "storyId": "2812",
    "novelUrl": "https://www.asianovel.net/story/2812/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2023/11/20231010012243-ed7fb8408f5f4891ae2ef2c88d92ddab.jpeg",
    "author": "浪里淘浪",
    "synopsis": "Lin An, plagued by severe social anxiety and obsessive cleanliness, rarely ventured outside, preferring to spend his days indoors, shopping via his smartphone and ordering takeout. As the apocalypse descended, his frail body inevitably succumbed to the virus, transforming him into a zombie. First Attempt: The irrational, starving zombie Lin An, driven by a bloodthirsty frenzy, screeched as he opened the door. Outside, the…",
    "genres": [
      "Adventure",
      "BL",
      "Drama",
      "Fantasy",
      "Post-Editing",
      "Shounen Ai",
      "Supernatural",
      "Yaoi"
    ],
    "chaptersCount": 100,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "The Guide Who Maxed Out His Combat Skills",
    "storyId": "2804",
    "novelUrl": "https://www.asianovel.net/story/2804/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2023/11/abfa789677740b4b413afc89b8076cf3-98286261b8b948eea52b69ed37eea4f3.jpeg",
    "author": "揽疏狂",
    "synopsis": "The young master of the Lin family, upon reaching eighteen, underwent the Sentinel pairing process, only to find his compatibility with all the Empire’s Sentinels at zero. Moreover, he was diagnosed with a deficiency in spiritual power. As a Guide without spiritual power, he became infamous across the galaxy overnight, a laughingstock of colossal proportions. The Lin family paid a hefty sum to the…",
    "genres": [
      "Action",
      "BL",
      "Drama",
      "Fantasy",
      "Mecha",
      "Post-Editing",
      "Romance",
      "Sci-fi",
      "Shounen Ai",
      "Supernatural"
    ],
    "chaptersCount": 104,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "A Certain Someone",
    "storyId": "1899",
    "novelUrl": "https://www.asianovel.net/story/1899/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2022/09/20210708025741_200_280-143x200.jpg",
    "author": "木苏里",
    "synopsis": "Sheng Wang moved into his ancestral home at White Horse Lane, along with the woman that his father was presently seeing. His dad pointed at that woman’s son and said to him: Call him ge (older brother). Unyielding, amenable to coaxing but not coercion cold generator Gong x Regards himself as something precious lazy young master Shou Sheng Wang: I’m super straight Jiang Tian:…",
    "genres": [
      "BL",
      "School Life"
    ],
    "chaptersCount": 113,
    "isCompleted": true,
    "isPremium": false
  },
  {
    "title": "After Being Betrayed, The Immortal Master Ran Away With The Demon Venerable",
    "storyId": "1866",
    "novelUrl": "https://www.asianovel.net/story/1866/",
    "coverUrl": "https://www.asianovel.net/wp-content/uploads/2022/09/test1-c01737f905c446a0872cfe94dea37ea6.jpg",
    "author": "何所往",
    "synopsis": "As Mingguang Sect’s esteemed Immortal Master, Yi Ning had never experienced much heartbreak and suffering. He had always expected his life to be smooth-sailing, and was only waiting to ascend before marrying his disciple with whom he shared mutual affection. However, he had never expected that on a rainy night, his disciple brought back a childhood friend. They were close and intimate, to the…",
    "genres": [
      "Adventure",
      "BL",
      "Historical",
      "Romance",
      "Xianxia",
      "Xuanhuan",
      "Yaoi"
    ],
    "chaptersCount": 102,
    "isCompleted": true,
    "isPremium": false
  }
]